{
    "name": "Tumauini",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tumauini"
        ],
        [
            "19 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°16′N 121°48′E﻿ / ﻿17.27°N 121.8°E﻿ / 17.27; 121.8"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Isabela, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Tumauini\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesTumauiniMunicipalityMunicipality of TumauiniFaçade of St. Mathias Parish Church"
        ],
        [
            "FlagSealMap of Isabela with Tumauini highlightedOpenStreetMapTumauiniLocation within the PhilippinesCoordinates: 17°16′N 121°48′E﻿ / ﻿17.27°N 121.8°E﻿ / 17.27; 121.8CountryPhilippinesRegionCagayan ValleyProvinceIsabelaDistrict"
        ],
        [
            "1st districtFounded1751Barangays46"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorVenus T. Bautista • Vice MayorChristopher B. Uy • RepresentativeAntonio T. Albano • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Sharina Lu T. BautistaRoberto R. GuiyabLluigi Anthonel L. GardonRomeo B. UgaddanMarvin Francis M. de AlbanRogelio C. Dammog Jr.Ferdinand N. TaccadRostum B. Binalay"
        ],
        [
            " • Electorate47,850 voters (2022)Area • Revenue₱ 299.5 million (2020) • Assets₱ 720.5 million (2020) • Expenditure₱ 293.7 million (2020) • Liabilities₱ 274.5 million (2020)Service provider • ElectricityIsabela 2 Electric Cooperative (ISELCO 2)Time zoneUTC+8 (PST)ZIP code3325PSGC023137000IDD : area code +63 (0)78Native languagesIbanag Ilocano TagalogWebsitewww.tumauini-isabela.gov.ph"
        ],
        [
            "Tumauini, officially the Municipality of Tumauini (Ibanag: Ili nat Tumauini; Ilocano: Ili ti Tumauini; Tagalog: Bayan ng Tumauini), is a 1st class municipality in the province of Isabela, Philippines.",
            "According to the 2020 census, it has a population of 70,743 people."
        ],
        [
            "Etymology"
        ],
        [
            "The name of Tumauini originated from the name of the big trees found in the Poblacion called \"Mauini\".",
            "It is said that when some Spaniards wanted to know the name of the trees, they asked a native saying, \"Como se llama el grande lenia?",
            "Sabes tu?\"",
            "The native not knowing what the Spaniards said, picked the last word he heard and answered \"Tumauini\"."
        ],
        [
            "History"
        ],
        [
            "Tumauini was officially established as a Spanish mission in 1704, with civil administration frequently shifting between the neighboring towns of Cabagan and Ilagan.",
            "It became a formal town on 10 May 1751."
        ],
        [
            "In 1952, the barrios of Barucbuc, Siempre Viva, Bimmonton, Pasurgong, Manga, and Settlement No.",
            "1 were transferred to the newly created town of Mallig."
        ],
        [
            "In 1957, the barrios of San Antonio, San Juan, Ragan Sur, Ragan Norte, Ragan Almacen, San Jose (Bulo), San Patricio, Quibal, San Andres (Lattu), Calinawan Sur, Bayabo, Santor, Santo Rosario, Andarayan, Aneg, San Isidro, Mawi, San Roque, Carmencita, Aga, Villa Pareda, Villaluz, San Pedro, Concepcion, Sammabario and San Nicolas and the sitios of Turod, Paco, Calamagui and Kim-malabasa, were separated from the municipality of Tumauini to form the town of Magsaysay."
        ],
        [
            "Geography"
        ],
        [
            "Tumauini is located in the northern portion of the province of Isabela.",
            "Its land area is 46,730 hectares (115,500 acres) or 5.62% of the total land area of Isabela.",
            "It is bounded on the north by the municipality of Cabagan; on the east by the municipality of Divilacan, on the south by the City of Ilagan, the capital of Isabela; and on the west by the Cagayan River and the municipality of Delfin Albano."
        ],
        [
            "Tumauini is 29 kilometres (18 mi) from Ilagan and 427 kilometres (265 mi) from Manila."
        ],
        [
            "Barangays"
        ],
        [
            "Tumauini has politically subdivided into 46 barangays.",
            "Each barangay consists of puroks while some have sitios."
        ],
        [
            "Four of the barangays compose the center of the town whereas the other 42 are in the outlying areas.",
            "Some of them are even several kilometers away from the center of the municipality.",
            "The most populous are San Pedro, Antagan I, and Lanna."
        ],
        [
            "Annafunan"
        ],
        [
            "Antagan I"
        ],
        [
            "Antagan II"
        ],
        [
            "Arcon"
        ],
        [
            "Balug"
        ],
        [
            "Banig"
        ],
        [
            "Bantug"
        ],
        [
            "Barangay District 1 (Poblacion)"
        ],
        [
            "Barangay District 2 (Poblacion)"
        ],
        [
            "Barangay District 3 (Poblacion)"
        ],
        [
            "Barangay District 4 (Poblacion)"
        ],
        [
            "Bayabo East"
        ],
        [
            "Caligayan"
        ],
        [
            "Camasi"
        ],
        [
            "Carpentero"
        ],
        [
            "Compania"
        ],
        [
            "Cumabao"
        ],
        [
            "Fermeldy (Hacienda San Francisco)"
        ],
        [
            "Fugu Abajo"
        ],
        [
            "Fugu Norte"
        ],
        [
            "Fugu Sur"
        ],
        [
            "Lalauanan"
        ],
        [
            "Lanna"
        ],
        [
            "Lapogan"
        ],
        [
            "Lingaling (Poblacion)"
        ],
        [
            "Liwanag"
        ],
        [
            "Malamag East"
        ],
        [
            "Malamag West"
        ],
        [
            "Maligaya (Poblacion)"
        ],
        [
            "Minanga"
        ],
        [
            "Moldero"
        ],
        [
            "Namnama"
        ],
        [
            "Paragu"
        ],
        [
            "Pilitan"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pedro"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Visitacion (Maggayu)"
        ],
        [
            "Santo Niño"
        ],
        [
            "Sinippil"
        ],
        [
            "Sisim Abajo"
        ],
        [
            "Sisim Alto"
        ],
        [
            "Tunggui"
        ],
        [
            "Ugad"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Tumauini, Isabela"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "35(95)"
        ],
        [
            "34(93)"
        ],
        [
            "33(91)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "28(82)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "19(66)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "20(68)"
        ],
        [
            "22(71)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "31.2(1.23)"
        ],
        [
            "23(0.9)"
        ],
        [
            "27.7(1.09)"
        ],
        [
            "28.1(1.11)"
        ],
        [
            "113.5(4.47)"
        ],
        [
            "141.4(5.57)"
        ],
        [
            "176.4(6.94)"
        ],
        [
            "236.6(9.31)"
        ],
        [
            "224.9(8.85)"
        ],
        [
            "247.7(9.75)"
        ],
        [
            "222.9(8.78)"
        ],
        [
            "178(7.0)"
        ],
        [
            "1,651.4(65)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "14"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "17"
        ],
        [
            "16"
        ],
        [
            "15"
        ],
        [
            "146"
        ],
        [
            "Source: World Weather Online"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TumauiniYearPop.±% p.a.1903 4,890—    1918 7,147+2.56%1939 14,343+3.37%1948 19,190+3.29%1960 16,606−1.20%1970 23,427+3.50%1975 27,669+3.39%1980 31,967+2.93%1990 40,664+2.44%1995 45,551+2.15%2000 50,256+2.13%2007 55,041+1.26%2010 58,463+2.22%2015 67,650+2.82%2020 70,743+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Tumauini was 70,743 people, with a density of 150 inhabitants per square kilometre or 390 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tumauini"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  23.80"
        ],
        [
            "2009  19.76"
        ],
        [
            "2012  20.34"
        ],
        [
            "2015  18.05"
        ],
        [
            "2018  21.15"
        ],
        [
            "2021  16.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Over the past years, the town's economy had dramatically shifted from stagnant to a fast-moving basis.",
            "Aside from agriculture being the main backbone of the town's economy, commerce and trade also became the second economic-based income of the town and its residents with the opening of numerous business establishments, hotels, and financial institutions that generated many opportunities and more employment for its residents."
        ],
        [
            "Retail industry"
        ],
        [
            "In 2015, the retail giant SM Prime established its first Savemore Market branch along the National Highway in the town.",
            "This was closely followed by the opening of the first Puregold Price Club store, a popular retail chain, in the same year.",
            "Two years later, in 2017, the well-known multinational fast-food chain Jollibee opened its first branch in the area, providing residents with a wider variety of dining options."
        ],
        [
            "The opening of Jollibee was just the beginning, as more fast-food chains like McDonald's and Mang Inasal have plans to establish branches in the town's first mall, Xentro Mall."
        ],
        [
            "On June 28, 2021, the municipal government inaugurated the newly built Tumauini Public Market.",
            "The multi-million modern market complex is composed of eight buildings located along National Highway and serves as the major trading hub of the town and nearby municipalities."
        ],
        [
            "Banking and finance services"
        ],
        [
            "Banking institutions like BDO Unibank,"
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "As a municipality in the Province of Isabela, government officials in the provincial level are voted by the electorates of the town.",
            "The provincial government have political jurisdiction over local transactions of the municipal government."
        ],
        [
            "The municipality of Tumauini is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Barangays are also headed by elected officials: Barangay Captain, Barangay Council, whose members are called Barangay Councilors.",
            "The barangays have SK federation which represents the barangay, headed by SK chairperson and whose members are called SK councilors.",
            "All officials are also elected every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Tumauini Municipal Council(2022-2025)"
        ],
        [
            "Position"
        ],
        [
            "Name of official"
        ],
        [
            "District Representative (1st Legislative District, Isabela)"
        ],
        [
            "Rep. Antonio T. Albano"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Venus T. Bautista"
        ],
        [
            "Municipal Vice Mayor"
        ],
        [
            "Christopher B. Uy"
        ],
        [
            "Municipal Councilors"
        ],
        [
            "Sharina Lu B. Medrano"
        ],
        [
            "Roberto R. Guiyab"
        ],
        [
            "Lluigi Anthonel L. Gardon"
        ],
        [
            "Romeo B. Ugaddan"
        ],
        [
            "Marvin Francis De Alban"
        ],
        [
            "Rogelio C. Dammog, Jr."
        ],
        [
            "Ferdinand Taccad"
        ],
        [
            "Rostum B. Binalay"
        ],
        [
            "Congress representation"
        ],
        [
            "Tumauini, belonging to the first legislative district of the province of Isabela, is currently represented by Antonio T. Albano."
        ],
        [
            "Government facilities"
        ],
        [
            "On June 28, 2021, the municipal government inaugurated the new Tumauini Municipal Hall along National Highway in barangay San Pedro.",
            "The newly built multi-million peso structure is designed to accommodate government functions, delivery of basic services for the people and as a facility for various civic and cultural activities."
        ],
        [
            "On May 10, 2023, the municipal government inaugurated the new Tumauini Legislative Building and Tumauini Municipal Police Station.",
            "These newly built modern facilities were erected to accommodate legislative functions for the members and staffs of the municipal council and give a bigger office space for the Philippine National Police to help them perform their duties and responsibilities in maintaining the peace and order within the town’s territorial boundaries."
        ],
        [
            "On February 23, 2024, the newly completed multi-million infrastructure projects in Tumauini were inaugurated.",
            "The government facilities include the P225 million worth Rudy B. Albano Astrodome and the P16 million worth legislative building of the Local Government"
        ],
        [
            "Unit of Tumauini.",
            "The newly built astrodome is the largest of its kind in Cagayan Valley Region with an area of 4,140 square meters with 14 layers of concrete bleachers located beside the municipal hall along Maharlika Highway in barangay San Pedro."
        ],
        [
            "Healthcare"
        ],
        [
            "Tumauini has its own Rural Health Unit (RHU) located in barangay Lingaling that caters mostly to residents from far-flung areas of the town who opt to avail the services provided by the Municipal Health Office (MHO)."
        ],
        [
            "The St. Matthias Medical Center of Isabela, Inc. is a privately-owned Level-II hospital located along Maharlika Highway in barangay Lalauanan.",
            "On March 8, 2024, the hospital officially had its soft launch to cater a wide range of healthcare services which include Ancillary and Diagnostic services, Clinical services and Outpatient services."
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Isabela governs the town's public education system.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "Tumauini has a higher education institution which is accredited and recognized by CHED, HGBaquiran College."
        ],
        [
            "Tourism"
        ],
        [
            "The town's historical landmarks include the Tumauini Church.",
            "Built-in the 1780s by the Dominicans, the church has an unusual cylindrical bell tower made of bricks.",
            "Also in the town is the Camp Samal Resort and Leisure Park, which were known as a semi-Tagaytay because of being high on its location where one can view the entire town in the west, south, and north and the Cordillera Sierra Madre in the east."
        ],
        [
            "San Matias Parish Church"
        ],
        [
            "San Matias Church Interior"
        ],
        [
            "The Parish Church of San Matias was built in the 1780s by the Dominicans.",
            "It is the best-preserved church ensemble in Isabela although its Convento is in ruins.",
            "It has a cylindrical, confectionery-like bell tower (a later addition).",
            "In the Convento vaulted ceiling impressions may still be seen of the mats that were used as forms to mold wet plaster during construction.",
            "A low, undulating brick wall circumscribes the front garden.",
            "San Matias Church Exterior"
        ],
        [
            "The building of the church from light materials by Francisco Nunez O. P. began in 1707 after Tumauini was separated from Cabagan and became a regular parish in 1751.",
            "The Roman Catholic Church was erected by the Dominican in 1753.",
            "They were made of bricks and coral stones with a cylindrical bell tower, the only of its kind in the Philippines which was constructed by Fr.",
            "Domingo Forto in 1793 and completed in 1805, became the capital of Isabela for some time in the 1880s.",
            "The Church was partly damaged during World War II but was repaired to its original form by the parishioners of Tumauini."
        ],
        [
            "The church's architectural design bears traces of Chinese artistry which may confirm the belief that long before the Spaniards came to the Philippines, the Chinese had settled in the coastal towns of Northern Luzon."
        ],
        [
            "By virtue of Presidential Decree # 260, 11 August 1973, as amended by Executive Order No.",
            "357, 14 January 1974, and No.",
            "1505, 11 June 1978, the Church of Tumauini was declared a National Historic Landmark on February 24, 1989."
        ],
        [
            "The Tumauini Church is currently on the tentative list for UNESCO World Heritage Sites under the Baroque Churches of the Philippines (Extension).",
            "A proposal has been suggested by scholars to make a separate UNESCO inclusion for the Old Centre of Tumauini which includes the Tumauini Church.",
            "The same would be done for other churches listed in UNESCO's tentative sites, where each town plaza and surrounding heritage buildings would be added.",
            "No government agency has yet taken action on the proposal."
        ],
        [
            "Camp Samal"
        ],
        [
            "The historic Camp Samal was the site of the National Jamboree in 1977 and is the home of the Boy Scouts of the Philippines.",
            "It is located at the eastern outskirts of the Spanish – built town of Tumauini, on a 23.5 hectares (58 acres) of the elevated mass of rolling hills 500 feet above sea level.",
            "It is endowed with natural springs, evergreen grasses, trees, and shrubs.",
            "It overlooks the Cagayan River, the Pinacanauan River, the town of Tumauini itself, the municipality of Delfin Albano, and the Sierra Mountain ranges."
        ],
        [
            "Its name was derived from the first syllable of the surnames of the spouses, Ricardo C. Sadornas and Purificacion Malana who donated the camp to the Boy Scouts of the Philippines in 1954.",
            "After the holding of the 1977 National Jamboree, the camp was restored under the administration of Mayor Arnold S. Bautista in 2001, who drew out the support of the government and private sectors for its restoration and development.",
            "It is still the favorite destination of the Boy Scouts and Girl Scouts of the Philippines for their annual district and provincial encampments.",
            "It hosted the 5th Northeastern Luzon Regional and Ilocos Region Invitational Jamboree of the Boy Scouts of the Philippines held on November 25 – 30, 2004 with a total of 5,281 participants."
        ],
        [
            "Mangi Festival"
        ],
        [
            "The patronal town fiesta is in honor of St. Mathias and the promotion of Tumauini as a source of corn and its by-products."
        ],
        [
            "One of the legacies of the Spanish colonial era in town is corn (maize).",
            "It was one of the plants that came aboard the galleons and became one of the primary crops of the Philippines.",
            "The late National Artist for Dance, Ramon Obusan traced the origins of a traditional dance inspired by the crop to Tumauini."
        ],
        [
            "Magoli River"
        ],
        [
            "Antagan 1st contains the Magoli River, which provides an ample source of water for irrigation, fields, and households."
        ],
        [
            "One of the features of the river is the Blue Lagoon.",
            "The locals have named two large rocks in the center of the river \"Kambal na Bato\" (twin stones), which are also a tourist attraction because of their unique and unusual appearance."
        ],
        [
            "The river is also a popular spot for swimming, fishing, and boating."
        ],
        [
            "Media"
        ],
        [
            "102.5 MHz DZJD Happy Radio Isabela"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Tumauini |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Salgado, Pedro.",
            "\"Specific Irraya Missions in Northern and Mid Isabela\".",
            "Cagayan Valley and Easter Cordillera: 1581-1898, Volume I. Rex Publishing.",
            "pp.",
            "446–448."
        ],
        [
            "^ \"R.A. No.",
            "678, An Act Creating the Municipality of Mallig in the Province of Isabela\".",
            "LawPH.com.",
            "Retrieved 2011-04-09."
        ],
        [
            "^ \"R.A. No.",
            "2009, An Act Creating the Municipality of Magsaysay in the Province of Isabela\".",
            "LawPH.com.",
            "Retrieved 2011-04-13."
        ],
        [
            "^"
        ],
        [
            "\"Province: Isabela\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Tumauini, Isabela: Average Temperatures and Rainfall\".",
            "World Weather Online.",
            "Retrieved 31 October 2015."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Isabela\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Tumauini LGU Profile\".",
            "CITIES AND MUNICIPALITIES COMPETITIVE INDEX.",
            "cmci.dyi.gov.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Tumauini LGU Profile\".",
            "Official Website of the Province of Isabela.",
            "provinceofisabela.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Savemore Market Tumauini\".",
            "Official Website of SM Markets.",
            "corps.smmarkets.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Xentro Mall Tumauini\".",
            "Official Website of Xentro Malls.",
            "xentromalls.com.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Tumauini LGU inaugurates new town hall, public market\".",
            "Merlito Edale Jr. / Philippine Information Agency.",
            "pia.gov.ph.",
            "7 July 2021.",
            "Retrieved July 7, 2021."
        ],
        [
            "^ \"Tumauini LGU inaugurates new public market\".",
            "Official Facebook Page of Bayan ng Tumauini / Venus T. Bautista.",
            "facebook.com.",
            "Retrieved June 28, 2021."
        ],
        [
            "^ \"BDO Tumauini\".",
            "Official Website of BDO Unibank.",
            "bdo.com.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"DBP eyes P5.55-B net income in 2018\".",
            "Joann Villanueva of PNA.",
            "pna.gov.ph.",
            "Retrieved February 26, 2018."
        ],
        [
            "^ \"Philippine Banking System Distribution of Domestic Deposits\".",
            "PDIC.",
            "pdic.gov.ph.",
            "Retrieved December 31, 2021."
        ],
        [
            "^ \"Tumauini, Isabela Election Results 2022\".",
            "Rappler PH.",
            "ph.rappler.com.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"House of Representatives: 19th Congress\".",
            "Official Website of the House of Representatives PH.",
            "congress.gov.ph.",
            "Retrieved May 15, 2022."
        ],
        [
            "^ \"Bagong Municipal Hall at Public Market ng Tumauini, Isabela, pinasinayanan\".",
            "Brigada News.",
            "brigadanews.ph.",
            "28 June 2021.",
            "Retrieved June 28, 2021."
        ],
        [
            "^ \"Blessing and inauguration of the new Tumauini Municipal Hall\".",
            "Official Facebook Page of Bayan ng Tumauini.",
            "facebook.com.",
            "Retrieved June 28, 2021."
        ],
        [
            "^ \"Blessing and inauguration of the new Tumauini Legislative Building and Tumauini Municipal Police Station\".",
            "Official Facebook Page of Bayan ng Tumauini.",
            "facebook.com.",
            "Retrieved May 10, 2023."
        ],
        [
            "^ \"Senator Lito Lapid leads the blessing and inauguration of Rodolfo B. Albano Astrodome in Tumauini, Isabela\".",
            "Official Facebook Page of Manila Bulletin Publishing Corporation (MB).",
            "facebook.com/mb.com.ph.",
            "Retrieved February 24, 2024."
        ],
        [
            "^ \"Newly-completed infrastructure projects in Tumauini inaugurated\".",
            "Merlito Edale Jr. of the Philippine Information Agency.",
            "pia.gov.ph.",
            "26 February 2024.",
            "Retrieved February 26, 2024."
        ],
        [
            "^ \"Highlights during the inauguration of RBA Astrodome, Barangay Night & Mangi Festival Queen Talent Night Competition in celebration of 2024 Tumauini Town Fiesta Mangi Festival\".",
            "Official Facebook Page of Bayan ng Tumauini.",
            "facebook.com/lgutumauini.",
            "Retrieved March 1, 2024."
        ],
        [
            "^ \"𝐒𝐄𝐍𝐀𝐓𝐎𝐑 𝐋𝐈𝐓𝐎 𝐋𝐀𝐏𝐈𝐃 𝐏𝐈𝐍𝐀𝐍𝐆𝐔𝐍𝐀𝐇𝐀𝐍 𝐀𝐍𝐆 𝐏𝐀𝐆𝐏𝐀𝐏𝐀𝐒𝐈𝐍𝐀𝐘𝐀 𝐒𝐀 𝐏𝐈𝐍𝐀𝐊𝐀𝐌𝐀𝐋𝐀𝐊𝐈𝐍𝐆 𝐀𝐒𝐓𝐑𝐎𝐃𝐎𝐌𝐄 𝐒𝐀 𝐑𝐄𝐇𝐈𝐘𝐎𝐍 𝐃𝐎𝐒\".",
            "Official Facebook Page of CLick Isabela.",
            "facebook.com/CLickisabela.",
            "Retrieved February 23, 2024."
        ],
        [
            "^ \"Rural Health unit ng Tumauini, Isabela, isinara para sa disinfection\".",
            "Radyo Agila / DZEC 1062kHz Manila.",
            "radyoagila.com.",
            "7 April 2021.",
            "Retrieved April 7, 2021."
        ],
        [
            "^ \"Senate Bill No.",
            "2169\" (PDF).",
            "Official Website of the Senate of the Philippines.",
            "legacy.senate.gov.ph.",
            "Retrieved May 11, 2021."
        ],
        [
            "^ \"Tumauini Exec inspects the newly-acquired hearing test machine that will be used for newborn screening at the Tumauini Community Hospital (TCH)\".",
            "Official Facebook Page of the Municipal Government of Tumauini / Bayan ng Tumauini.",
            "facebook.com.",
            "Retrieved April 14, 2023."
        ],
        [
            "^ \"LGU Tumauini establishes animal bite center\".",
            "Merlito Edale Jr. / Philippine Information Agency.",
            "pia.gov.ph.",
            "Retrieved October 7, 2022."
        ],
        [
            "^ \"The St. Matthias Medical Center of Isabela Inc.  located at Brgy.",
            "Lalauanan, Tumauini Isabela is officially OPEN\".",
            "Official Facebook Page of the St. Matthias Medical Center of Isabela, Inc. facebook.com/smmci.",
            "Retrieved March 9, 2024."
        ],
        [
            "^ \"Resolution No.",
            "2021-11-03 Series of 2021\" (PDF).",
            "Official Facebook Page of the Province of Isabela.",
            "provinceofisabela.ph.",
            "Retrieved March 16, 2021."
        ],
        [
            "^ \"SMMC Inc\".",
            "Official Facebook Page of Doc Roy Bielgo.",
            "facebook.com.",
            "Retrieved December 20, 2022."
        ],
        [
            "^ \"HISTORY OF DEPED-ISABELA\".",
            "DepED Isabela | The official website of DepED Schools Division of Isabela.",
            "Retrieved March 13, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "^ \"Tumauini Church of Isabela stands proud amid fragile heritage scene\".",
            "Constantino Tejero of Inquirer.net.",
            "lifestyle.inquirer.net.",
            "17 May 2015.",
            "Retrieved May 18, 2015."
        ],
        [
            "^ \"Have you ever been to Isabela?",
            "If not, this is the time\".",
            "Carol RH Malasig of Manila Bulletin.",
            "mb.com.ph.",
            "Retrieved March 29, 2023."
        ],
        [
            "^ \"List of National Cultural Treasures and Important Cultural Properties of the Philippines\".",
            "Official Gazette PH.",
            "officialgazette.gov.ph.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Baroque Churches of the Philippines (Extension)\".",
            "UNESCO World Heritage Convention.",
            "whc.unesco.org.",
            "Retrieved December 31, 2022."
        ],
        [
            "^ \"Mangi Festival\".",
            "spcicdtourism.com.",
            "Retrieved 10 October 2014."
        ],
        [
            "^ Facebook.com - Happy Radio Isabela https://web.facebook.com/happyradio102.5.",
            "Retrieved April 28, 2024.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Tumauini."
        ],
        [
            "Tumauini on Facebook"
        ],
        [
            "Municipal Profile at the National Competitiveness Council of the Philippines"
        ],
        [
            "Tumauini at the Isabela Government Website"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Municipality of Tumauini"
        ],
        [
            "Places adjacent to Tumauini"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Cabagan"
        ],
        [
            "Maconacon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Tumauini"
        ],
        [
            "Divilacan"
        ],
        [
            "Ilagan"
        ],
        [
            "vte Province of IsabelaIlagan (capital and largest city)Municipalities"
        ],
        [
            "Alicia"
        ],
        [
            "Angadanan"
        ],
        [
            "Aurora"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Echague"
        ],
        [
            "Gamu"
        ],
        [
            "Jones"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Mallig"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Roxas"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tumauini"
        ],
        [
            "Component Cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Independent Component City"
        ],
        [
            "Santiago (Administratively independent from the province but grouped under Isabela by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Isabela"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tumauini&oldid=1221967595\""
        ],
        [
            "Categories: Municipalities of Isabela (province)Populated places on the Rio Grande de CagayanHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listCS1 errors: missing titleCS1 errors: bare URLArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ibanag-language textArticles containing Ilocano-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from March 2024Commons category link from WikidataFacebook ID not in WikidataPages using the Kartographer extension"
        ]
    ]
}