{
    "name": "Ubay",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Ubay, Bohol"
        ],
        [
            "22 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°03′22″N 124°28′23″E﻿ / ﻿10.056°N 124.47294°E﻿ / 10.056; 124.47294"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Bohol, Philippines"
        ],
        [
            "Municipality in Central Visayas, PhilippinesUbayMunicipalityMunicipality of Ubay"
        ],
        [
            "FlagSealNickname: Dairy Capital of BoholMap of Bohol with Ubay highlightedOpenStreetMapUbayLocation within the PhilippinesCoordinates: 10°03′22″N 124°28′23″E﻿ / ﻿10.056°N 124.47294°E﻿ / 10.056; 124.47294CountryPhilippinesRegionCentral VisayasProvinceBoholDistrict"
        ],
        [
            "2nd districtFoundedChartered1821Barangays44"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorConstantino H. Reyes • Vice MayorVictor A. Bonghanoy • RepresentativeMa.",
            "Vanessa C. Aumentado • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Maximo O. Boyles Jr.Isidore G. BesasElvira Bacolod-CajesVioleta D. ReyesLuis M. RotolConstancio V. AtuelChristopher O. VilladoresNador A. Vallecera"
        ],
        [
            " • Electorate50,205 voters (2022)Area • Revenue₱ 301.1 million (2020) • Assets₱ 524.7 million (2020) • Expenditure₱ 321.6 million (2020) • Liabilities₱ 126.5 million (2020)Service provider • ElectricityBohol 2 Electric Cooperative (BOHECO 2)Time zoneUTC+8 (PST)ZIP code6315PSGC071246000IDD : area code +63 (0)38Native languagesCebuano Boholano dialect TagalogPatron saintChrist Child"
        ],
        [
            "Ubay, officially the Municipality of Ubay (Cebuano: Munisipyo sa Ubay; Tagalog: Bayan ng Ubay),  is a fast growing 1st class municipality in the province of Bohol, Philippines.",
            "Based on the 2020 Philippine Statistics Authority census, it has a population of 81,799 people which is projected to grow to 100,000 in 2030."
        ],
        [
            "Ubay is in the northeast of the province, and has an uncontested area of 258.132847 square kilometers (25,813.2847 hectares) and has a contested area of 5.87 square kilometers (587.8688 hectares) with other Municipality per certification issued by the Land Management Bureau(LMB) of the DENR.",
            "It has a 61 kilometres (38 mi) of coastline.",
            "It is the largest (estimated eight times (8x) larger than the capital city of Tagbilaran) and most populated municipality in Bohol."
        ],
        [
            "Etymology"
        ],
        [
            "Poblacion area"
        ],
        [
            "One etymology derivation is that the town's name is a contraction of the term ubay-ubay, meaning \"alongside\"."
        ],
        [
            "According to Kaufmann's Visayan-English dictionary, the Visayan word \"ubay\"  means:to accompany other in bed or along the side, be they persons or animals;the flow of rivers and streams.",
            "from one place to another."
        ],
        [
            "The flow of seawater between the mainland and the island of Lapinig Grande (now Pres.",
            "C.P.",
            "Garcia town) could justify the second definition of Ubay.",
            "It is a situation that is permanent and the constant reference to the flow of water can make the term ubay be attached as the name of the place."
        ],
        [
            "An alternative derivation is that the term 'ubay-ubay' or 'alongside' became the byword of seafarers who used to travel close to the shorelines of Ubay to avoid the strong current of the Canigao Channel.",
            "There was a single path to follow reach the island trading centres.",
            "This trail was located alongside (ubay) the sandy beach.",
            "Later on the term Ubay became the original name of the community."
        ],
        [
            "History"
        ],
        [
            "Spanish Period"
        ],
        [
            "Historically, Ubay was part of Talibon, when the latter was established as a town in civil aspect in 1722."
        ],
        [
            "In 1744, the Dagohoy Revolution started, controlling the entire northeastern part of the province, stretching from Duero to Inabanga.",
            "As the revolution progresses, Jesuit were replaced by Augustinian Recollects in Bohol in 1768 led by Fr.",
            "Pedro de Santa Barbara,  who travelled through mountains with proposals of peace and resettlement for Dagohoy and its followers.",
            "Through his untiring intrepidness, later on, pacified patriots together with their cluster chieftains chose to resettle in southern coastal towns.",
            "Later in 1794, Fr.",
            "Manuel de la Consolacion, then parish priest of Inabanga, successfully brought hundreds of followers and resetlled them in towns of Talibon and Inabanga, as well in the barangays (villages) of San Pedro (Talibon), Pangpang (Buenavista), and Ubay.",
            "Therefore, much of early residents of Ubay were followers of Dagohoy."
        ],
        [
            "In 1821, Ubay became an independent town from Talibon in civil aspect.",
            "Its religious aspect was then still administered by the parish of Inabanga, until Talibon was able to establish a separate parish in 1831, making Ubay a visita.",
            "Residents clamor for an independent parish until a Catholic church was built."
        ],
        [
            "On January 15, 1876, an independent parish was finally established during the time of gobernadorcillo Saturnino Boyles.",
            "This also marked its first town fiesta.",
            "Later on, the date of town fiesta was moved every last Friday of January dedicated and honor of their patron saint, Holy Child."
        ],
        [
            "The official religious aspect of the town was established much later than the civil aspect.",
            "The decree of the Spanish Governor General José Malcampo, 3rd Marquess of San Rafael creating Ubay as a town in the religious aspect was on November 22, 1876, transcribing the Royal Order No.",
            "695 of the Ministry of Overseas dated October 5, 1877 issued by the King of Spain Alfonso XII."
        ],
        [
            "The parish of Ubay was fully completed on October 22, 1877, and it first visita was Cabulao"
        ],
        [
            "American Rule"
        ],
        [
            "On March 6, 1902, the entire municipality of Batuanan (now Alicia) was consolidated with Ubay through Philippine Commission Act No.",
            "370"
        ],
        [
            "On October 31, 1903, the old municipality of Ipil (now Trinidad) was divided into two.",
            "With Ipil River as demarcation line, the left bank was annexed to Talibon while the right bank was consolidated with Ubay.",
            "Furthermore, barangay Cabulao and the previously annexed municipality of Batuanan was separated from Ubay, together with barangay Libas, Candijay to create the new and distinct municipality of Mabini in virtue of Philippine Commission Act No.",
            "968."
        ],
        [
            "Modern Period"
        ],
        [
            "On September 1, 1947, the municipality of Ipil was reorganized, joining the barangays of Guinobatan, Mahagbu, and Tagum from Ubay together with other barangays of Talibon to create the renamed municipality of Trinidad through Executive Order No.",
            "80."
        ],
        [
            "On June 21, 1956, barangay Babag separated from Ubay together with other barangays of Carmen, Sierra-Bullones, and Trinidad to form the new municipality of Dagohoy through Executive Order No.",
            "184."
        ],
        [
            "On March 14, 1961, barangays of Corazon and Magsaysay separated from Ubay together with other barangays of Trinidad to form the independent municipality of San Miguel through Executive Order No.",
            "423."
        ],
        [
            "On December 29, 1961, barangay San Isidro (not the present San Isidro, Ubay) separated from Ubay, together with other barangays of Candijay, Guindulman, and Sierra-Bullones to create the municipality of Pilar through Executive Order No.",
            "460."
        ],
        [
            "On June 21, 1969, barangays of Aguining, Basiao, Bonbonon, Gaus, Pitogo, and Tugas separated from Ubay to create the independent municipality of Pitogo in virtue of Republic Act 5867."
        ],
        [
            "Science Cityhood"
        ],
        [
            "Main article: Cities of the Philippines"
        ],
        [
            "House Bill No.",
            "5203 was filed by the 2nd district representative Congresswoman Maria Vanessa C. Aumentado last September 27, 2021 for the conversion of the municipality of Ubay into a component city to be known as the Science City of Ubay in the province of Bohol.",
            "The bill was referred to the Committee on Local Government in the House of representatives.",
            "If enacted, it will be the second Science CIty in the country next to the Science City of Muñoz."
        ],
        [
            "Geography"
        ],
        [
            "The town is situated east of Trinidad, north of Alicia and Mabini, and northeast of San Miguel.",
            "It is 130 kilometres (81 mi) northeast of Tagbilaran."
        ],
        [
            "Climate"
        ],
        [
            " UbayAverage annual temperature in Ubay is 27·2°CHumidity 75–85%"
        ],
        [
            "Climate chart (explanation)"
        ],
        [
            "J"
        ],
        [
            "F"
        ],
        [
            "M"
        ],
        [
            "A"
        ],
        [
            "M"
        ],
        [
            "J"
        ],
        [
            "J"
        ],
        [
            "A"
        ],
        [
            "S"
        ],
        [
            "O"
        ],
        [
            "N"
        ],
        [
            "D"
        ],
        [
            "191"
        ],
        [
            "30"
        ],
        [
            "22"
        ],
        [
            "111"
        ],
        [
            "30"
        ],
        [
            "22"
        ],
        [
            "94"
        ],
        [
            "31"
        ],
        [
            "23"
        ],
        [
            "58"
        ],
        [
            "32"
        ],
        [
            "23"
        ],
        [
            "106"
        ],
        [
            "33"
        ],
        [
            "24"
        ],
        [
            "154"
        ],
        [
            "32"
        ],
        [
            "24"
        ],
        [
            "210"
        ],
        [
            "32"
        ],
        [
            "24"
        ],
        [
            "159"
        ],
        [
            "32"
        ],
        [
            "24"
        ],
        [
            "186"
        ],
        [
            "32"
        ],
        [
            "24"
        ],
        [
            "204"
        ],
        [
            "31"
        ],
        [
            "23"
        ],
        [
            "222"
        ],
        [
            "31"
        ],
        [
            "23"
        ],
        [
            "192"
        ],
        [
            "30"
        ],
        [
            "23"
        ],
        [
            "█ Average max.",
            "and min.",
            "temperatures in °C"
        ],
        [
            "█ Precipitation totals in mmSource: Climate: Ubay"
        ],
        [
            "Imperial conversion"
        ],
        [
            "JFMAMJJASOND"
        ],
        [
            "7.5"
        ],
        [
            "86"
        ],
        [
            "72"
        ],
        [
            "4.4"
        ],
        [
            "86"
        ],
        [
            "72"
        ],
        [
            "3.7"
        ],
        [
            "88"
        ],
        [
            "73"
        ],
        [
            "2.3"
        ],
        [
            "89"
        ],
        [
            "74"
        ],
        [
            "4.2"
        ],
        [
            "91"
        ],
        [
            "75"
        ],
        [
            "6.1"
        ],
        [
            "90"
        ],
        [
            "74"
        ],
        [
            "8.3"
        ],
        [
            "89"
        ],
        [
            "75"
        ],
        [
            "6.3"
        ],
        [
            "89"
        ],
        [
            "75"
        ],
        [
            "7.3"
        ],
        [
            "89"
        ],
        [
            "74"
        ],
        [
            "8"
        ],
        [
            "89"
        ],
        [
            "74"
        ],
        [
            "8.7"
        ],
        [
            "88"
        ],
        [
            "74"
        ],
        [
            "7.6"
        ],
        [
            "87"
        ],
        [
            "73"
        ],
        [
            "█ Average max.",
            "and min.",
            "temperatures in °F"
        ],
        [
            "█ Precipitation totals in inches"
        ],
        [
            "The climate is typically equatorial – temperature range over the year is less than three degrees Celsius (5.4 deg F), and annual rainfall exceeds 1,500 millimetres (59 in).",
            "The dry season starts in February and lasts through April sometimes extending to mid‑May.",
            "The climate in Ubay falls within Coronas climate type IV, characterized by not very pronounced maximum rainfall with a short dry season from one to three months and a wet season of nine to ten months."
        ],
        [
            "Ubay has a tropical climate.",
            "Most months of the year are marked by significant precipitation, making agriculture favorable – it supports at least two rice crops per year.",
            "The short dry season has little impact.",
            "Ubay is classified as Am (Tropical monsoon climate) by Köppen–Geiger climate classification system."
        ],
        [
            "Barangays"
        ],
        [
            "Map of Ubay showing barangays and islands"
        ],
        [
            "Ubay is politically subdivided into 44 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "These barnagys are organized into eight urban districts (UD):"
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " Area"
        ],
        [
            " PD 2020"
        ],
        [
            " UD  Date of Fiesta"
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " ha"
        ],
        [
            " acre"
        ],
        [
            " /km2"
        ],
        [
            " /sq mi"
        ],
        [
            " 071246001   Achila"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,429"
        ],
        [
            " 1,276"
        ],
        [
            "  ▴"
        ],
        [
            " 1.14%"
        ],
        [
            " 384949"
        ],
        [
            " 370"
        ],
        [
            " 960"
        ],
        [
            "IV"
        ],
        [
            "15 January"
        ],
        [
            " 071246002   Bay‑ang"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,906"
        ],
        [
            " 1,656"
        ],
        [
            "  ▴"
        ],
        [
            " 1.42%"
        ],
        [
            " 6321,562"
        ],
        [
            " 300"
        ],
        [
            " 780"
        ],
        [
            "III"
        ],
        [
            "21 May"
        ],
        [
            " 071246005   Benliw"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,193"
        ],
        [
            " 2,223"
        ],
        [
            "  ▾"
        ],
        [
            " −0.14%"
        ],
        [
            " 5891,455"
        ],
        [
            " 370"
        ],
        [
            " 960"
        ],
        [
            "VII"
        ],
        [
            "13 May"
        ],
        [
            " 071246004   Biabas"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,599"
        ],
        [
            " 2,573"
        ],
        [
            "  ▴"
        ],
        [
            " 0.10%"
        ],
        [
            " 2,2005,436"
        ],
        [
            " 120"
        ],
        [
            " 310"
        ],
        [
            "VIII"
        ],
        [
            "17 May"
        ],
        [
            " 071246007   Bongbong"
        ],
        [
            " 1.1%"
        ],
        [
            " 895"
        ],
        [
            " 807"
        ],
        [
            "  ▴"
        ],
        [
            " 1.04%"
        ],
        [
            " 161398"
        ],
        [
            " 560"
        ],
        [
            " 1,400"
        ],
        [
            "II"
        ],
        [
            "8 December"
        ],
        [
            " 071246008   Bood"
        ],
        [
            " 3.5%"
        ],
        [
            " 2,833"
        ],
        [
            " 2,717"
        ],
        [
            "  ▴"
        ],
        [
            " 0.42%"
        ],
        [
            " 152376"
        ],
        [
            " 1,900"
        ],
        [
            " 4,800"
        ],
        [
            "V"
        ],
        [
            "15 January"
        ],
        [
            " 071246009   Buenavista"
        ],
        [
            " 0.9%"
        ],
        [
            " 709"
        ],
        [
            " 688"
        ],
        [
            "  ▴"
        ],
        [
            " 0.30%"
        ],
        [
            " 6511,609"
        ],
        [
            " 110"
        ],
        [
            " 280"
        ],
        [
            "I"
        ],
        [
            "Last Saturday of April29 Apr 2023 27 Apr 2024 26 Apr 2025"
        ],
        [
            " 071246055   Bulilis"
        ],
        [
            " 2.5%"
        ],
        [
            " 2,046"
        ],
        [
            " 1,711"
        ],
        [
            "  ▴"
        ],
        [
            " 1.80%"
        ],
        [
            " 7401,829"
        ],
        [
            " 280"
        ],
        [
            " 720"
        ],
        [
            "II"
        ],
        [
            "8 December"
        ],
        [
            " 071246011   Cagting"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,712"
        ],
        [
            " 1,597"
        ],
        [
            "  ▴"
        ],
        [
            " 0.70%"
        ],
        [
            " 1,0442,580"
        ],
        [
            " 160"
        ],
        [
            " 420"
        ],
        [
            "VII"
        ],
        [
            "24 January"
        ],
        [
            " 071246027   Calanggaman"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,689"
        ],
        [
            " 1,623"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 6181,527"
        ],
        [
            " 270"
        ],
        [
            " 710"
        ],
        [
            "III"
        ],
        [
            "8 December"
        ],
        [
            " 071246056   California"
        ],
        [
            " 1.2%"
        ],
        [
            " 941"
        ],
        [
            " 801"
        ],
        [
            "  ▴"
        ],
        [
            " 1.62%"
        ],
        [
            " 319788"
        ],
        [
            " 290"
        ],
        [
            " 760"
        ],
        [
            "II"
        ],
        [
            "13 May"
        ],
        [
            " 071246012   Camali‑an"
        ],
        [
            " 0.8%"
        ],
        [
            " 642"
        ],
        [
            " 581"
        ],
        [
            "  ▴"
        ],
        [
            " 1.00%"
        ],
        [
            " 5321,315"
        ],
        [
            " 120"
        ],
        [
            " 310"
        ],
        [
            "III"
        ],
        [
            "26 November"
        ],
        [
            " 071246013   Camambugan"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,591"
        ],
        [
            " 2,251"
        ],
        [
            "  ▴"
        ],
        [
            " 1.42%"
        ],
        [
            " 5471,352"
        ],
        [
            " 470"
        ],
        [
            " 1,200"
        ],
        [
            "IV"
        ],
        [
            "15 May"
        ],
        [
            " 071246015   Casate"
        ],
        [
            " 3.3%"
        ],
        [
            " 2,661"
        ],
        [
            " 2,512"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 4601,137"
        ],
        [
            " 580"
        ],
        [
            " 1,500"
        ],
        [
            "IV"
        ],
        [
            "5 April"
        ],
        [
            " 071246017   Cuya"
        ],
        [
            " 0.7%"
        ],
        [
            " 538"
        ],
        [
            " 516"
        ],
        [
            "  ▴"
        ],
        [
            " 0.42%"
        ],
        [
            " 66163"
        ],
        [
            " 820"
        ],
        [
            " 2,100"
        ],
        [
            "VIII"
        ],
        [
            "6 February"
        ],
        [
            " 071246018   Fatima"
        ],
        [
            " 4.1%"
        ],
        [
            " 3,340"
        ],
        [
            " 3,235"
        ],
        [
            "  ▴"
        ],
        [
            " 0.32%"
        ],
        [
            " 66163"
        ],
        [
            " 5,100"
        ],
        [
            " 13,000"
        ],
        [
            "V"
        ],
        [
            "13 May"
        ],
        [
            " 071246019   Gabi"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,432"
        ],
        [
            " 1,378"
        ],
        [
            "  ▴"
        ],
        [
            " 0.39%"
        ],
        [
            " 1,6464,067"
        ],
        [
            " 87"
        ],
        [
            " 230"
        ],
        [
            "II"
        ],
        [
            "9 December"
        ],
        [
            " 071246020   Governor Boyles"
        ],
        [
            " 1.1%"
        ],
        [
            " 885"
        ],
        [
            " 888"
        ],
        [
            "  ▾"
        ],
        [
            " −0.03%"
        ],
        [
            " 8242,036"
        ],
        [
            " 110"
        ],
        [
            " 280"
        ],
        [
            "I"
        ],
        [
            "15 May"
        ],
        [
            " 071246021   Guintabo‑an"
        ],
        [
            " 0.8%"
        ],
        [
            " 676"
        ],
        [
            " 686"
        ],
        [
            "  ▾"
        ],
        [
            " −0.15%"
        ],
        [
            " 66163"
        ],
        [
            " 1,000"
        ],
        [
            " 2,700"
        ],
        [
            "VIII"
        ],
        [
            "15 January"
        ],
        [
            " 071246022   Hambabauran"
        ],
        [
            " 1.5%"
        ],
        [
            " 1,205"
        ],
        [
            " 1,106"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 5211,287"
        ],
        [
            " 230"
        ],
        [
            " 600"
        ],
        [
            "III"
        ],
        [
            "15 January"
        ],
        [
            " 071246023   Humayhumay"
        ],
        [
            " 2.2%"
        ],
        [
            " 1,802"
        ],
        [
            " 1,708"
        ],
        [
            "  ▴"
        ],
        [
            " 0.54%"
        ],
        [
            " 8152,014"
        ],
        [
            " 220"
        ],
        [
            " 570"
        ],
        [
            "IV"
        ],
        [
            "14 February"
        ],
        [
            " 071246024   Ilihan"
        ],
        [
            " 0.9%"
        ],
        [
            " 768"
        ],
        [
            " 802"
        ],
        [
            "  ▾"
        ],
        [
            " −0.43%"
        ],
        [
            " 6831,688"
        ],
        [
            " 110"
        ],
        [
            " 290"
        ],
        [
            "I"
        ],
        [
            "15 May"
        ],
        [
            " 071246025   Imelda"
        ],
        [
            " 2.3%"
        ],
        [
            " 1,865"
        ],
        [
            " 1,761"
        ],
        [
            "  ▴"
        ],
        [
            " 0.58%"
        ],
        [
            " 6571,624"
        ],
        [
            " 280"
        ],
        [
            " 740"
        ],
        [
            "VII"
        ],
        [
            "8 May &27 November"
        ],
        [
            " 071246026    Juagdan"
        ],
        [
            " 1.4%"
        ],
        [
            " 1,185"
        ],
        [
            " 1,121"
        ],
        [
            "  ▴"
        ],
        [
            " 0.56%"
        ],
        [
            " 121299"
        ],
        [
            " 980"
        ],
        [
            " 2,500"
        ],
        [
            "VII"
        ],
        [
            "23 May"
        ],
        [
            " 071246016   Katarungan"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,680"
        ],
        [
            " 1,524"
        ],
        [
            "  ▴"
        ],
        [
            " 0.98%"
        ],
        [
            " 4091,011"
        ],
        [
            " 410"
        ],
        [
            " 1,100"
        ],
        [
            "V"
        ],
        [
            "30 May"
        ],
        [
            " 071246031   Lomangog"
        ],
        [
            " 3.2%"
        ],
        [
            " 2,650"
        ],
        [
            " 2,025"
        ],
        [
            "  ▴"
        ],
        [
            " 2.73%"
        ],
        [
            " 6421,586"
        ],
        [
            " 410"
        ],
        [
            " 1,100"
        ],
        [
            "II"
        ],
        [
            "15 January"
        ],
        [
            " 071246030   Los Angeles"
        ],
        [
            " 0.7%"
        ],
        [
            " 601"
        ],
        [
            " 436"
        ],
        [
            "  ▴"
        ],
        [
            " 3.26%"
        ],
        [
            " 274677"
        ],
        [
            " 220"
        ],
        [
            " 570"
        ],
        [
            "II"
        ],
        [
            "27 April"
        ],
        [
            " 071246032   Pag‑asa"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,273"
        ],
        [
            " 1,168"
        ],
        [
            "  ▴"
        ],
        [
            " 0.86%"
        ],
        [
            " 378934"
        ],
        [
            " 340"
        ],
        [
            " 870"
        ],
        [
            "III"
        ],
        [
            "8 December"
        ],
        [
            " 071246033   Pangpang"
        ],
        [
            " 1.6%"
        ],
        [
            " 1,328"
        ],
        [
            " 1,220"
        ],
        [
            "  ▴"
        ],
        [
            " 0.85%"
        ],
        [
            " 4501,112"
        ],
        [
            " 300"
        ],
        [
            " 760"
        ],
        [
            "IV"
        ],
        [
            "15 December"
        ],
        [
            " 071246034   Poblacion"
        ],
        [
            " 4.1%"
        ],
        [
            " 3,331"
        ],
        [
            " 3,633"
        ],
        [
            "  ▾"
        ],
        [
            " −0.86%"
        ],
        [
            " 199492"
        ],
        [
            " 1,700"
        ],
        [
            " 4,300"
        ],
        [
            "V"
        ],
        [
            "Last Friday of January27 Jan 2023 26 Jan 2024 31 Jan 2025"
        ],
        [
            " 071246037   San Francisco"
        ],
        [
            " 2.1%"
        ],
        [
            " 1,688"
        ],
        [
            " 1,677"
        ],
        [
            "  ▴"
        ],
        [
            " 0.07%"
        ],
        [
            " 1,1072,736"
        ],
        [
            " 150"
        ],
        [
            " 390"
        ],
        [
            "I"
        ],
        [
            "26 June"
        ],
        [
            " 071246038   San Isidro"
        ],
        [
            " 0.9%"
        ],
        [
            " 771"
        ],
        [
            " 707"
        ],
        [
            "  ▴"
        ],
        [
            " 0.87%"
        ],
        [
            " 262647"
        ],
        [
            " 290"
        ],
        [
            " 760"
        ],
        [
            "VI"
        ],
        [
            "21 May"
        ],
        [
            " 071246040   San Pascual"
        ],
        [
            " 4.6%"
        ],
        [
            " 3,783"
        ],
        [
            " 3,127"
        ],
        [
            "  ▴"
        ],
        [
            " 1.92%"
        ],
        [
            " 9732,404"
        ],
        [
            " 390"
        ],
        [
            " 1,000"
        ],
        [
            "I"
        ],
        [
            "Last Saturday of April29 Apr 2023 27 Apr 2024 26 Apr 2025"
        ],
        [
            " 071246041   San Vicente"
        ],
        [
            " 1.3%"
        ],
        [
            " 1,056"
        ],
        [
            " 1,074"
        ],
        [
            "  ▾"
        ],
        [
            " −0.17%"
        ],
        [
            " 9662,387"
        ],
        [
            " 110"
        ],
        [
            " 280"
        ],
        [
            "VIII"
        ],
        [
            "5 April"
        ],
        [
            " 071246043   Sentinela"
        ],
        [
            " 1.1%"
        ],
        [
            " 939"
        ],
        [
            " 969"
        ],
        [
            "  ▾"
        ],
        [
            " −0.31%"
        ],
        [
            " 271670"
        ],
        [
            " 350"
        ],
        [
            " 900"
        ],
        [
            "VI"
        ],
        [
            "29 May"
        ],
        [
            " 071246044   Sinandigan"
        ],
        [
            " 2.7%"
        ],
        [
            " 2,242"
        ],
        [
            " 1,874"
        ],
        [
            "  ▴"
        ],
        [
            " 1.81%"
        ],
        [
            " 6071,500"
        ],
        [
            " 370"
        ],
        [
            " 960"
        ],
        [
            "VII"
        ],
        [
            "8 December"
        ],
        [
            " 071246045   Tapal"
        ],
        [
            " 1.9%"
        ],
        [
            " 1,516"
        ],
        [
            " 1,371"
        ],
        [
            "  ▴"
        ],
        [
            " 1.01%"
        ],
        [
            " 290717"
        ],
        [
            " 520"
        ],
        [
            " 1,400"
        ],
        [
            "VI"
        ],
        [
            "3 May"
        ],
        [
            " 071246046   Tapon"
        ],
        [
            " 3.5%"
        ],
        [
            " 2,828"
        ],
        [
            " 2,481"
        ],
        [
            "  ▴"
        ],
        [
            " 1.32%"
        ],
        [
            " 153378"
        ],
        [
            " 1,800"
        ],
        [
            " 4,800"
        ],
        [
            "V"
        ],
        [
            "29 June"
        ],
        [
            " 071246047   Tintinan"
        ],
        [
            " 0.9%"
        ],
        [
            " 707"
        ],
        [
            " 623"
        ],
        [
            "  ▴"
        ],
        [
            " 1.27%"
        ],
        [
            " 3177"
        ],
        [
            " 2,300"
        ],
        [
            " 5,900"
        ],
        [
            "VIII"
        ],
        [
            "29 September"
        ],
        [
            " 071246048   Tipolo"
        ],
        [
            " 3.1%"
        ],
        [
            " 2,526"
        ],
        [
            " 2,456"
        ],
        [
            "  ▴"
        ],
        [
            " 0.28%"
        ],
        [
            " 6551,619"
        ],
        [
            " 390"
        ],
        [
            " 1,000"
        ],
        [
            "VI"
        ],
        [
            "5 April"
        ],
        [
            " 071246049   Tubog"
        ],
        [
            " 1.2%"
        ],
        [
            " 983"
        ],
        [
            " 885"
        ],
        [
            "  ▴"
        ],
        [
            " 1.06%"
        ],
        [
            " 5141,270"
        ],
        [
            " 190"
        ],
        [
            " 500"
        ],
        [
            "III"
        ],
        [
            "16 May"
        ],
        [
            " 071246050   Tuboran"
        ],
        [
            " 1.7%"
        ],
        [
            " 1,394"
        ],
        [
            " 1,372"
        ],
        [
            "  ▴"
        ],
        [
            " 0.16%"
        ],
        [
            " 5471,352"
        ],
        [
            " 250"
        ],
        [
            " 660"
        ],
        [
            "IV"
        ],
        [
            "15 January"
        ],
        [
            " 071246052   Union"
        ],
        [
            " 2.9%"
        ],
        [
            " 2,392"
        ],
        [
            " 2,332"
        ],
        [
            "  ▴"
        ],
        [
            " 0.25%"
        ],
        [
            " 5141,270"
        ],
        [
            " 470"
        ],
        [
            " 1,200"
        ],
        [
            "VI"
        ],
        [
            "15 January"
        ],
        [
            " 071246054   Villa Teresita"
        ],
        [
            " 1.8%"
        ],
        [
            " 1,482"
        ],
        [
            " 1,407"
        ],
        [
            "  ▴"
        ],
        [
            " 0.52%"
        ],
        [
            " 262647"
        ],
        [
            " 570"
        ],
        [
            " 1,500"
        ],
        [
            "I"
        ],
        [
            "28 November"
        ],
        [
            "Total"
        ],
        [
            "81,799"
        ],
        [
            "68,578"
        ],
        [
            " ▴"
        ],
        [
            "1.78%"
        ],
        [
            "33,506"
        ],
        [
            "82,795"
        ],
        [
            "240"
        ],
        [
            "630"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of UbayYearPop.±% p.a.1903 7,355—    1918 8,255+0.77%1939 21,213+4.60%1948 29,961+3.91%1960 34,090+1.08%YearPop.±% p.a.1970 32,717−0.41%1975 34,195+0.89%1980 38,289+2.29%1990 48,902+2.48%1995 50,745+0.70%YearPop.±% p.a.2000 59,827+3.59%2007 65,900+1.34%2010 68,578+1.46%2015 73,712+1.38%2020 81,799+2.07%Source: Philippine Statistics Authority"
        ],
        [
            "When the first national census was held in 1903, the municipality had a population 7,355.",
            "It continued to grow until 1960 with 34,090 (annual growth rate of 2.73% over the period).",
            "The population markedly decreased in 1970 with the creation of the municipality of President Carlos P. Garcia, formerly a constituent barangay.",
            "Since 1970, average annual growth rate (1970–2020) is 1.85%."
        ],
        [
            "The primary language is Cebuano: Filipino and English are understood to a limited degree."
        ],
        [
            "Economy"
        ],
        [
            "Public market"
        ],
        [
            "Poverty incidence of Ubay"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  57.20"
        ],
        [
            "2009  50.12"
        ],
        [
            "2012  39.64"
        ],
        [
            "2015  34.39"
        ],
        [
            "2018  25.70"
        ],
        [
            "2021  30.62"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Ubay has a number of business establishments commercial trading firms engaged in retail and wholesale.",
            "The new public market building was completed in 2000.",
            "The regular market day is Monday and local traders from neighboring towns come to sell their merchandise consisting mostly of agricultural products and small consumer items like used clothes, household utensils, and other products.",
            "Ubay also provides a market for the neighboring island municipality of Pres.",
            "Carlos P. Garcia, Municipality of Bien Unido , Alica and Mabini.",
            "Another well-known public market is located in barangay San Pascual, south of the municipality."
        ],
        [
            "Ubay is one of the growth centers in and considered the dairy capital of the province where the Philippine Carabao Center (PCC), National Dairy Authority (NDA) and the Ubay Stock Farm the largest and oldest livestock in the country with more than 3,000 hectares is located in the Municipality.",
            "The Municipality is also center for agri-industrial production and the biggest producers of poultry products in central visayas produced by the Marcela Farms Inc. (Alturas group of companies) located in Barangay Lomangog produce tons of poultry products like dress chicken.",
            "Ubay is also one of the top producers of fish products as it has more than 1,000 hectares of fishpond.",
            "The Municipality is a center for agriculture with government establishments like the Philippine Coconut Authority (PCA), the Bureau of Fisheries and Aquatic Resources (BFAR), Bohol Experiential Station (BES), Bureau of Soil and Water Management (BSWM) and the Central Visayas Integrated Agricultural Research Center (CENVIARC) are located.",
            "The Municipality is also considered the rice granary of the province with 51% of its total land area is intended for agriculture in which majority of its rice fields are irrigated."
        ],
        [
            "Tourism and culture"
        ],
        [
            "Santo Niño Parish Church, Población"
        ],
        [
            "Ubay Green Park, Imelda"
        ],
        [
            "Ubay is the center of Eco-Agri Tourism considering its grass land area of the Ubay Stock Farm with carabaos and cows that similar to the scenery of New Zealand plus the learning experience you will gain when you visit their Department of Agriculture Facilities."
        ],
        [
            "Delicacies"
        ],
        [
            "Ube Calamay: It is a purple rice cake, (Calamay) with Ube or purple yam.",
            "This sweet and delightful delicacy is said to be originated from this town because of its large plantations of Ube (purple yam)."
        ],
        [
            "Fried Ube bread: Another mouthwatering delicacy made of ube.",
            "It is bread deep‑fried then filled with purple yam."
        ],
        [
            "Chocobao: a chocolate flavored pasteurized carabao milk that has a nutritional value that is a product of the Philippine Carabao Center in Barangay Lomangog."
        ],
        [
            "Puto cheese: a special puto made from the milk of carabao."
        ],
        [
            "Other dairy Products"
        ],
        [
            "Ubay-ubay Festival"
        ],
        [
            "Like the Sinulog of Cebu, the Ubay-ubay Festival is the town's own version in celebration and honor of the patron saint, Sr. Santo Niño.",
            "This colorful and fascinating festivity is a well-attended event where people flock the town's major roads and venues to view the grand street parade and the festival dance-competition.",
            "This celebration is held every last Friday of January."
        ],
        [
            "Government"
        ],
        [
            "Ubay Municipal Hall"
        ],
        [
            "Ubay is governed by the municipal mayor as head of the municipality.",
            "The vice mayor is the next highest position and acts as the presiding officer of the municipal council."
        ],
        [
            "Chief Executives of Ubay"
        ],
        [
            "Term"
        ],
        [
            "Title"
        ],
        [
            "Name"
        ],
        [
            "1821 – ?",
            "?"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Toribio Reyes"
        ],
        [
            "1854 – 1855"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Ysidro Cutamora"
        ],
        [
            "1855 – 1856"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Calistro Boiser"
        ],
        [
            "1856 – 1857"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Vicente Boiser"
        ],
        [
            "1857 – ?",
            "?"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Santiago Cutamora"
        ],
        [
            "1876 – ?",
            "?"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Saturnino Boyles"
        ],
        [
            "1892 – 1894"
        ],
        [
            "Gobernadorcillo"
        ],
        [
            "Marcelino Mendez"
        ],
        [
            "1894 – 1896"
        ],
        [
            "Capitan Municipal"
        ],
        [
            "Marcelino Mendez"
        ],
        [
            "1896 – 1901"
        ],
        [
            "Capitan Municipal"
        ],
        [
            "Juan Gaviola"
        ],
        [
            "1901 – 1902"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Ruperto Gaviola"
        ],
        [
            "1902 – 1906"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Eutiquio Boyles"
        ],
        [
            "1906 – 1910"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Ruperto Gaviola"
        ],
        [
            "1910 – 1912"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Bonifacio Reyes"
        ],
        [
            "1912 – 1924"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Ruperto Gaviola"
        ],
        [
            "1925 – 1930"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Jose Garces"
        ],
        [
            "1931 – 1935"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Carlos Boiser"
        ],
        [
            "1936 – 1940"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Ruperto Gaviola"
        ],
        [
            "1941 – 1942"
        ],
        [
            "Presidente Municipal"
        ],
        [
            "Lucio Cutanda"
        ],
        [
            "1942 – 1943"
        ],
        [
            "Military Mayor"
        ],
        [
            "Samson Sabalones"
        ],
        [
            "1944 – 1945"
        ],
        [
            "Military Mayor"
        ],
        [
            "Frank Lombardo"
        ],
        [
            "1946 – 1948"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Lucio Cutanda"
        ],
        [
            "1949 –"
        ],
        [
            "OIC Municipal Mayor"
        ],
        [
            "Marcelo Cuyno"
        ],
        [
            "1949 – 1952"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Lucio Cutanda"
        ],
        [
            "1953 – 1964"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Ricardo Boyles"
        ],
        [
            "1965 – 1968"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Sabiniano Cuyno"
        ],
        [
            "1969 – 1978"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Rufina Delima"
        ],
        [
            "1979 – 1980"
        ],
        [
            "OIC Municipal Mayor"
        ],
        [
            "Eutiquio Bernales"
        ],
        [
            "1981 – 1984"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Eutiquio Bernales"
        ],
        [
            "1985 – 1986"
        ],
        [
            "OIC Municipal Mayor"
        ],
        [
            "Pedro Sarabosing"
        ],
        [
            "1986 – 1987"
        ],
        [
            "OIC Municipal Mayor"
        ],
        [
            "Agapito Valleser"
        ],
        [
            "1987 – 1992"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Eliseo Boyles"
        ],
        [
            "1992 – 1998"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Eutiquio Bernales"
        ],
        [
            "1998 – 2004"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Manuel Alesna"
        ],
        [
            "2004 – 2013"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Eutiquio Bernales"
        ],
        [
            "2013 – 2016"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Galicano Atup"
        ],
        [
            "2016 – present"
        ],
        [
            "Municipal Mayor"
        ],
        [
            "Constantino Reyes"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transport"
        ],
        [
            "The most common form of local transportation is the tricycle for nearer barangays.",
            "For far barangays, the motorcycle is the most common.",
            "All barangays are connected by roads and the only places without roads are the steep slopes of the central mountains."
        ],
        [
            "The improvement of the Bohol circumferential road and the port facilities helped Ubay to become the trading and transportation hub of northeastern Bohol, connecting it to the neighboring island of Leyte and the rest of Bohol province.",
            "Passenger and cargo traffic to these destinations has noticeably increased over the years indicating an increasing volume of trade between these points."
        ],
        [
            "Land transportation is provided by various short and long-distance buses, jeeps and vans, connecting Ubay to the rest of the towns in the province.",
            "Tagbilaran can be reached from Ubay in two to three hours by bus or van.",
            "There are also daily combined road/ferry services to Metro Manila (Pasay / Cubao, Quezon City)."
        ],
        [
            "Ubay seaport is considered the province's principal gateway to Leyte, and Samar."
        ],
        [
            "Tapal Wharf is another port terminal located in northeastern barangay of Tapal that serves the President Carlos P. Garcia-Ubay and vice-versa route."
        ],
        [
            "Ubay Airport"
        ],
        [
            "Camambugan Airport"
        ],
        [
            "Ubay is home to one of only three airports in Bohol (the other  Bohol–Panglao International Airport and Tagbilaran Old Airport), but Ubay Airport is currently ongoing expansion and development which is delayed by the recent pandemic.",
            "The runway currently is only about 1,000 metres (3,280 ft) long.",
            "It is proposed to be a service airport for airlines and budget airport that will connect to other provinces and tourists from other tourism destinations."
        ],
        [
            "Health"
        ],
        [
            "For health services, the town has three public Rural Health Units (RHU) staffed by doctors, nurses, midwives, dentists, medical technologists and sanitary inspectors.",
            "A small government hospital was established to provide outpatient services to local residents.",
            "A private 15-bed hospital in Fatima also provides services for emergencies.",
            "A pediatrics and OB-gyne clinic complements the health services available in town.",
            "A Public Rural Health Unit (RHU) 4 and RHU 5 is being eyed to be constructed within three years period in 2023-2025."
        ],
        [
            "Don Emilio Del Valle Memorial Hospital in barangay Bood is a National Government Hospital  was established in 2003 from a donated lot with a current bed capacity of 300 as of 2019."
        ],
        [
            "Barangay Health Workers (BHW) from each barangay provide direct health care assistance to barangay residents."
        ],
        [
            "Public order and safety"
        ],
        [
            "The local police force is 37 police officers.",
            "Police–population ratio is 1:2,211, less favourable than the standard ratio of 1:1,000.",
            "The police are augmented by 492 Barangay Tanod volunteers.",
            "It is reported that crime rate in Ubay is relatively low.",
            "The local Fire Department is staffed by eight fire fighters with two fire trucks.",
            "Incidence of fires is reportedly low in the municipality."
        ],
        [
            "Utilities"
        ],
        [
            "Bohol was linked to the major source of geothermal power in Leyte through the underwater connection between Maasin City, Southern Leyte and Ubay.",
            "Presently, only three of the 44 barangays have no electricity, yet only 34.97 percent of the total households in the municipality have electricity compared to the province, which was 58.3 percent energized in 2000."
        ],
        [
            "The town proper and seven other barangays were served by the Ubay Water Service Cooperative.",
            "The cooperative planned to expand their service to eight other barangays in the near future.",
            "Due to consumer demand and the limited size of the supply, water service became difficult during dry months.",
            "Bohol province reported that 23.71 percent of its households had their own faucets from a community system while Ubay reported only 8.97 percent."
        ],
        [
            "For the province, 21.68 percent of households had access to shared faucets while Ubay only had 8.86 percent.",
            "In Ubay, slightly more than half (51.83%) of the households had access to dug wells."
        ],
        [
            "Education"
        ],
        [
            "Elementary Education"
        ],
        [
            "Ubay Central Elementary School at Poblacion, Ubay, Bohol, Philippines"
        ],
        [
            "There are 45 public elementary schools in the municipality located in each barangay and one on Tres Reyes island."
        ],
        [
            "Public Elementary Schools"
        ],
        [
            "Achila Elementary School"
        ],
        [
            "Bay-ang Elementary School"
        ],
        [
            "Benliw Elementary School"
        ],
        [
            "Bongbong Elementary School"
        ],
        [
            "Bood Elementary School"
        ],
        [
            "Buenavista Elementary School"
        ],
        [
            "Bulilis Elementary School"
        ],
        [
            "Cagting Elementary School"
        ],
        [
            "Calanggaman Elementary School"
        ],
        [
            "California Elementary School"
        ],
        [
            "Camambugan Elementary School"
        ],
        [
            "Casate Elementary School"
        ],
        [
            "Cuya Elementary School"
        ],
        [
            "Fatima Elementary School"
        ],
        [
            "Gabi Elementary School"
        ],
        [
            "Gov.",
            "Boyles Elementary School"
        ],
        [
            "Guintaboan Elementary School"
        ],
        [
            "Hambabauran Elementary School"
        ],
        [
            "Humayhumay Elementary School"
        ],
        [
            "Ilihan Elementary School"
        ],
        [
            "Imelda Elementary School"
        ],
        [
            "Juagdan Elementary School"
        ],
        [
            "Katarungan Elementary School"
        ],
        [
            "Lomangog Elementary School"
        ],
        [
            "Luz Elementary School (Camalian)"
        ],
        [
            "New Los Angeles Elementary School"
        ],
        [
            "Pag-asa Elementary School"
        ],
        [
            "Pangpang Elementary School"
        ],
        [
            "San Francisco Elementary School"
        ],
        [
            "San Isidro Elementary School"
        ],
        [
            "San Vicente Elementary School"
        ],
        [
            "Sentinela Elementary School"
        ],
        [
            "Sinandigan Elementary School"
        ],
        [
            "Tapal Integrated School"
        ],
        [
            "Tapon Elementary School"
        ],
        [
            "Tintinan Elementary School"
        ],
        [
            "Tipolo Elementary School"
        ],
        [
            "Tres Reyes Elementary School"
        ],
        [
            "Tubog Integrated School"
        ],
        [
            "Tuboran Elementary School"
        ],
        [
            "Ubay Central Elementary School (Poblacion)"
        ],
        [
            "Ubay II Central Elementary School (Biabas)"
        ],
        [
            "Ubay III Central Elementary School (San Pascual)"
        ],
        [
            "Union Elementary School"
        ],
        [
            "Villa Teresita Elementary School"
        ],
        [
            "There are 7 private pre-school and elementary schools."
        ],
        [
            "Private Pre-school and Elementary Schools"
        ],
        [
            "Benliw Apostolic Christian School, Inc. (Pre-school and Elementary Education)"
        ],
        [
            "Bohol Northern Star Colleges (Pre-school and Elementary Education) at Poblacion"
        ],
        [
            "Grace Multi-Level School (Pre-school) at Fatima"
        ],
        [
            "ICTHUS Christian Academy (Pre-school and Elementary Education) at Poblacion"
        ],
        [
            "Montessori Educational Learning Center of Ubay (Pre-school and Elementary Education) at Tapon"
        ],
        [
            "Sacred Heart Learning & Formation Center (Pre-school and Elementary Education) at Poblacion"
        ],
        [
            "Ubay Baptist Christian Academy (Pre-school and Elementary Education) at Fatima"
        ],
        [
            "Ubay Seventh-day Adventist Multigrade School (Pre-school and Elementary Education) at Fatima"
        ],
        [
            "Secondary Education"
        ],
        [
            "There are 19 public"
        ],
        [
            "List of High Schools"
        ],
        [
            "School ID"
        ],
        [
            "Institution Name"
        ],
        [
            "Location"
        ],
        [
            "Junior HS"
        ],
        [
            "Senior HS"
        ],
        [
            "Academic Track(s)"
        ],
        [
            "Type"
        ],
        [
            "302816"
        ],
        [
            "Biabas Trade High School"
        ],
        [
            "Biabas"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS2, TVL5"
        ],
        [
            "Public"
        ],
        [
            "404289"
        ],
        [
            "Bohol Northern Star Colleges"
        ],
        [
            "Poblacion"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "ABM1, HUMSS3, GAS, TVL"
        ],
        [
            "Private"
        ],
        [
            "312334"
        ],
        [
            "Bulilis National High School"
        ],
        [
            "Bulilis"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "ABM, GAS, HUMSS, STEM"
        ],
        [
            "Public"
        ],
        [
            "312351"
        ],
        [
            "Cagting High School"
        ],
        [
            "Cagting"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS, TVL"
        ],
        [
            "Public"
        ],
        [
            "302825"
        ],
        [
            "Camambugan National High School"
        ],
        [
            "Camambugan"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS, TVL"
        ],
        [
            "Public"
        ],
        [
            "312361"
        ],
        [
            "Don Aguedo Reyes Maboloc Memorial National HS"
        ],
        [
            "Villa Teresita"
        ],
        [
            "Yes"
        ],
        [
            "No"
        ],
        [
            "Public"
        ],
        [
            "313031"
        ],
        [
            "Erico Aumentado High School"
        ],
        [
            "Poblacion"
        ],
        [
            "Yes"
        ],
        [
            "No"
        ],
        [
            "Public"
        ],
        [
            "312354"
        ],
        [
            "Hambabauran High School"
        ],
        [
            "Hambabauran"
        ],
        [
            "Yes"
        ],
        [
            "No"
        ],
        [
            "Public"
        ],
        [
            "404291"
        ],
        [
            "Holy Child Academy"
        ],
        [
            "Poblacion"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "ABM, GAS"
        ],
        [
            "Private"
        ],
        [
            "446513"
        ],
        [
            "ICTHUS Christian Academy"
        ],
        [
            "Poblacion"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS, STEM4"
        ],
        [
            "Private"
        ],
        [
            "405892"
        ],
        [
            "Montessori Educational Learning Center"
        ],
        [
            "Tapon"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS, TVL"
        ],
        [
            "Private"
        ],
        [
            "500215"
        ],
        [
            "Pedro O. Bernales National High School"
        ],
        [
            "Tubog"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "TVL"
        ],
        [
            "Public"
        ],
        [
            "305935"
        ],
        [
            "Ricardo O. Boyles Sr. National High School"
        ],
        [
            "Casate"
        ],
        [
            "Yes"
        ],
        [
            "Public"
        ],
        [
            "404293"
        ],
        [
            "San Pascual Academy"
        ],
        [
            "San Pascual"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS"
        ],
        [
            "Private"
        ],
        [
            "302899"
        ],
        [
            "San Pascual National Agricultural High School"
        ],
        [
            "San Pascual"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "TVL"
        ],
        [
            "Public"
        ],
        [
            "312346"
        ],
        [
            "Tapal Integrated School"
        ],
        [
            "Tapal"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "TVL"
        ],
        [
            "Public"
        ],
        [
            "306874"
        ],
        [
            "Tipolo National High School"
        ],
        [
            "Tipolo"
        ],
        [
            "Yes"
        ],
        [
            "Public"
        ],
        [
            "302915"
        ],
        [
            "Ubay National Science High School"
        ],
        [
            "Fatima"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "ABM, HUMSS, STEM, TVL"
        ],
        [
            "Public"
        ],
        [
            "302914"
        ],
        [
            "Union National High School"
        ],
        [
            "Union"
        ],
        [
            "Yes"
        ],
        [
            "Yes"
        ],
        [
            "GAS, TVL"
        ],
        [
            "Public"
        ],
        [
            "^1  Accountancy, Business, and Management (ABM)"
        ],
        [
            "^2  General Academic Strand (GAS)"
        ],
        [
            "^3  Humanities and Social Sciences (HUMSS)"
        ],
        [
            "^4  Science, Technology, Engineering, and Mathematics (STEM)"
        ],
        [
            "^5  Technical, Vocational, and Livelihood (TVL)"
        ],
        [
            "Tertiary Education"
        ],
        [
            "Bohol Northern Star Colleges - To meet the increasing demands for college education,  Bohol Northeastern College was founded in 1996 by Bohol political leaders, former governors Erico B. Aumentado and David B. Tirol.",
            "The name was later changed to its present name in January 2007."
        ],
        [
            "Ubay Community College"
        ],
        [
            "Notable personalities"
        ],
        [
            "Erico B. Aumentado – Bohol governor who served three consecutive terms (2001–2010), former deputy speaker of the Philippine House of Representatives, former congressman of Bohol's 2nd District, former provincial vice-governor and board member."
        ],
        [
            "Karen Gallman - beauty queen, Miss Intercontinental 2018, the first ever Filipina to win the title.",
            "Also won Binibining Pilipinas Intercontinental 2018."
        ],
        [
            "References"
        ],
        [
            "^ a b c Agustin de la Cavada y Mendez de Vigo (1876).",
            "\"9\".",
            "Historia, Geografica, Geologica, y Estadistica de Filipinas Tomo I. Vol. 1.",
            "Manila: Consejo de la Hispanidad, Biblioteca.",
            "p. 259.",
            "ISBN 9781332712809."
        ],
        [
            "^ \"Ubay Bohol May 2022 Election Results\".",
            "Rappler.",
            "13 May 2022.",
            "Retrieved 6 November 2022."
        ],
        [
            "^  Municipality of Ubay |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b \"Ubay Bohol Travel Guide\".",
            "www.bohol-philippines.com.",
            "Retrieved 2019-05-15."
        ],
        [
            "^ Kaufmann 1934."
        ],
        [
            "^ a b Jes B. Tirol (March 27, 2011).",
            "\"Toponyms of Bohol and its Towns Part 12.",
            "Last of Series\".",
            "Bohol Chronicle.",
            "Archived from the original on April 5, 2011.",
            "Retrieved March 12, 2020."
        ],
        [
            "^ a b \"Municipality of Ubay\".",
            "Province of Bohol.",
            "Retrieved 10 September 2012."
        ],
        [
            "^ Jes B. Tirol (January 9, 2011).",
            "\"Toponyms of Bohol and its Towns, Part 1\".",
            "Bohol Chronicle.",
            "Retrieved June 1, 2013."
        ],
        [
            "^ Angel Martinez Cuesta, OAR (2019).",
            "\"Augustinian Recollects in the Philippines: Pastoral Work in the 18th Century\" (PDF).",
            "agustinosrecoletos.org.",
            "Order of Augustinian Recollects: 9–12.",
            "Retrieved June 1, 2023."
        ],
        [
            "^ Calendar for January 2024"
        ],
        [
            "^ a b Boysillo, Florencio (October 1990).",
            "\"The Province of Bohol\".",
            "Ubay Past and Present.",
            "47.",
            "Bohol Provincial Library, Tagbilaran City: 11."
        ],
        [
            "^ PBro.",
            "D. Felipe Redondo y Sendino, Fiscal Esclesiastico de Dicha Diocesis (1886).",
            "Breve Reseña de lo que fue y de lo que es la Diócesis de Cebu en las Islas Filpinas.",
            "Manila: Estabelcimiento Tipografico del Colegio de Sto.",
            "Tomas.",
            "pp.",
            "182–183."
        ],
        [
            "^ Francisco Sádaba del Carmen (1906).",
            "Catálogo de los Religiosos Agustinos Recoletos de la Provincia de San Nicolás de Tolentino de Filipinas desde el año 1906, en que llegó la primera misión à Manila hasta nuestros días.",
            "Madrid: Imprenta del Asilo de Huerfanos del Sagrado Corazon de Jesus.",
            "p. 547."
        ],
        [
            "^ Francisco Sádaba del Carmen (1906).",
            "Catálogo de los Religiosos Agustinos Recoletos de la Provincia de San Nicolás de Tolentino de Filipinas desde el año 1906, en que llegó la primera misión à Manila hasta nuestros días.",
            "Madrid: Imprenta del Asilo de Huerfanos del Sagrado Corazon de Jesus.",
            "pp.",
            "595, 619, 636–637, 630–631."
        ],
        [
            "^ \"Philippine Commission Act No.",
            "370, March 06, 1902\".",
            "Supreme Court E-Library Philippines.",
            "March 6, 1902.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ Annual Reports of the War Department, Volume 14.",
            "United States War Department.",
            "October 31, 1903. p. 22-23.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Executive Order No.",
            "80, s. 1947\".",
            "Official Gazette (Philippines).",
            "August 14, 1947.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Executive Order No.",
            "184, s. 1956\".",
            "Official Gazette (Philippines).",
            "June 21, 1956.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Executive Order No.",
            "423, s. 1961\".",
            "Official Gazette (Philippines).",
            "March 14, 1961.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Executive Order No.",
            "460, s. 1961\".",
            "Official Gazette (Philippines).",
            "December 29, 1961.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Republic Act No.",
            "5864, June 21, 1969\".",
            "Supreme Court E-Library Philippines.",
            "February 16, 1970.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ \"Presidential Decree No.",
            "1228, s. 1977\".",
            "Official Gazette (Philippines).",
            "October 27, 1977.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ Aumentado, Erico Aristotle.",
            "\"AN ACT CONVERTING THE MUNICIPALITY OF UBAY IN THE PROVINCE OF BOHOL INTO A COMPONENT CITY TO BE KNOWN AS THE SCIENCE CITY OF UBAY\" (PDF).",
            "House of Representatives.",
            "Retrieved April 20, 2021."
        ],
        [
            "^ Coronas 1920."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Barangay San Pascual\".",
            "Kimberly Basilad.",
            "March 14, 2019.",
            "Retrieved March 12, 2020."
        ],
        [
            "^ \"Ubay Annual Town Fiesta\".",
            "Ubay LGU.",
            "January 1, 2013.",
            "Retrieved October 22, 2014."
        ],
        [
            "^ Regalado Trota Jose (2001).",
            "Visita Iglesia: Bohol, a Guide to Historical Churches.",
            "National Commission for Culture and the Arts.",
            "pp. 101–102.",
            "ISBN 971-814-016-6."
        ],
        [
            "^ Bohol Philippines.com (December 31, 2021).",
            "\"History of Ubay Catholic Church\".",
            "Retrieved 25 August 2022."
        ],
        [
            "^ Ereccion de Pueblos, Bohol, Book 1.",
            "Manila: National Archives, Manila.",
            "1832–1891.",
            "p. 846."
        ],
        [
            "^ Guía oficial de las Islas Filipinas para 1894.",
            "Manila: Lit.",
            "Ramírez y Compañía, 1894.",
            "1894. p. 647-676.",
            "Retrieved August 10, 2023."
        ],
        [
            "^ Guía Oficial de las Islas Filipinas para 1894.",
            "Manila: Publicada por la Secretaria del Gobierno General.",
            "1894. p. 647.",
            "Retrieved November 21, 2020."
        ],
        [
            "^ Guía Oficial de las Islas Filipinas para 1897.",
            "Manila: Publicada por la Secretaria del Gobierno General.",
            "1897. p. 823.",
            "Retrieved November 21, 2020."
        ],
        [
            "^ Guía Oficial de las Islas Filipinas para 1898.",
            "Manila: Publicada por la Secretaria del Gobierno General.",
            "1898. p. 1064.",
            "Retrieved November 21, 2020."
        ],
        [
            "^ Report of the Philippine Commission to the Secretary of War United States.",
            "Philippine Commission (1900-1916).",
            "US Division of Insular Affairs War Department, Washington: Government Printing Office.",
            "December 1901. p. 158.",
            "Retrieved March 12, 2020."
        ],
        [
            "^ Annual Reports of the War Department, For the Fiscal Year Ended June 30, 1904, Volume XIV.",
            "US War Department, Washington: Government Printing Office.",
            "1904. p. 554.",
            "Retrieved March 12, 2020."
        ],
        [
            "^ US War Department Annual Reports, 1911, Volume IV.",
            "US War Department, Washington: Government Printing Office.",
            "1912. p. 175.",
            "Retrieved March 12, 2020."
        ],
        [
            "^ a b \"Ubay Seaport\".",
            "Bohol-Philippines.com.",
            "1 February 2014.",
            "Retrieved 8 March 2014."
        ],
        [
            "^ Bohol Standard 2010."
        ],
        [
            "^ \"The Southern Leyte Connection\".",
            "Leyte-Divers.com.",
            "1 February 2012.",
            "Retrieved 8 March 2015."
        ],
        [
            "^ \"7 seaport projects to be inaugurated in Bohol\".",
            "SunStar Cebu.",
            "October 28, 2021.",
            "Retrieved October 28, 2021."
        ],
        [
            "^ \"Republic Act No.",
            "11323\".",
            "Official Gazette (Philippines).",
            "April 17, 2019.",
            "Retrieved April 17, 2019."
        ],
        [
            "^ \"Don Emilio Del Valle Memorial Hospital\".",
            "March 6, 2019.",
            "Retrieved February 28, 2022."
        ],
        [
            "^ \"List of Public Schools in Bohol 2nd District\" (Spreadsheet).",
            "DepEd Bohol.",
            "Retrieved 21 Oct 2012."
        ],
        [
            "^ \"List and Status of Private Schools as of January 22, 2015\" (PDF).",
            "Deped - Central Visayas.",
            "January 31, 2015.",
            "Archived from the original (PDF) on April 2, 2015.",
            "Retrieved March 5, 2015."
        ],
        [
            "^ \"List of Public Senior High Schools in Bohol\".",
            "list.ph.",
            "December 31, 2015.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ \"List of Public Schools in Bohol 2nd District\".",
            "DepEd Bohol.",
            "Retrieved 21 Oct 2012."
        ],
        [
            "^ Chito M. Visarra (December 6, 2016).",
            "\"Opening Woes SHS's Limited Subject Offerings\".",
            "Bohol Chronicle.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ \"List of SHS\".",
            "Department of Education (Philippines).",
            "December 31, 2018.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ a b \"Division Memorandum No.",
            "0646 series of 2022\" (PDF).",
            "DepEd Division of Bohol.",
            "October 10, 2022.",
            "Retrieved October 21, 2022."
        ],
        [
            "^ \"BNSC Profile\".",
            "Commission on Higher Education (Philippines).",
            "December 31, 2019.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ A. Doydora.",
            "\"Ubay to establish municipal college\".",
            "November 20, 2019.",
            "Retrieved December 12, 2020."
        ],
        [
            "^ \"Karen Gallman is Miss Intercontinental 2018\".",
            "Rappler.",
            "January 27, 2019.",
            "Retrieved March 5, 2020."
        ],
        [
            "Sources"
        ],
        [
            "Akpenodu, Erik; Saloma, Czarina (2011).",
            "Casa Boholana: Vintage Houses of Bohol.",
            "Ateneo de Manila University Press.",
            "ISBN 978-9715506182."
        ],
        [
            "Bohol Chronicle, Antonio Amora.",
            "\"A Legacy of Life and Work\".",
            "Archived from the original on 16 January 2014.",
            "Retrieved 25 December 2013."
        ],
        [
            "Bohol Standard (4 July 2010).",
            "\"Ubay port offers a better life for many Boholanos\".",
            "Archived from the original on 9 April 2015.",
            "Retrieved 8 March 2015."
        ],
        [
            "Coronas, José (1920).",
            "The Climate and Weather of the Philippines, 1903 – 1918.",
            "Manila Observatory: Bureau of Philippines."
        ],
        [
            "Espinola, Manny; Maghirang, Antonio (2014).",
            "Ave, Jon P.; Rodriguez, Ces (eds.).",
            "NIA at 50 : A Legacy of Serving Filipino Farmers (PDF).",
            "Photography Raneil Ibay; Graphic Artists: Mario Santa Maria, Shannon Olaguer; Research Assistants: Jun Danganan, CJ Brillantes.",
            "National Irrigation Administration and Project Brio Media House.",
            "pp. 62–63.",
            "ISBN 978-9719596202."
        ],
        [
            "Kaufmann, J.",
            "(1934).",
            "Visayan-English Dictionary (PDF).",
            "Iloilo.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "Saz, Efren B.",
            "(2007).",
            "A comprehensive assessment of the agricultural extension system in the Philippines: case study of LGU extension in Ubay, Bohol (PDF).",
            "Philippine Institute for Development Studies, University of Leyte.",
            "Retrieved 24 January 2015."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Ubay, Bohol."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Municipality of Ubay, Bohol"
        ],
        [
            "Places adjacent to Ubay, Bohol"
        ],
        [
            "Bien Unido"
        ],
        [
            "Camotes Sea"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Trinidad"
        ],
        [
            "Ubay"
        ],
        [
            "Bohol Sea"
        ],
        [
            "San Miguel"
        ],
        [
            "Alicia"
        ],
        [
            "Mabini"
        ],
        [
            "vte Province of BoholTagbilaran (capital and largest city)Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alicia"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Baclayon"
        ],
        [
            "Balilihan"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen"
        ],
        [
            "Catigbian"
        ],
        [
            "Clarin"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Dagohoy"
        ],
        [
            "Danao"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Maribojoc"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Sagbayan"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Sevilla"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Component city"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Islands"
        ],
        [
            "Balicasag"
        ],
        [
            "Banacon"
        ],
        [
            "Bansaan"
        ],
        [
            "Bilangbilangan"
        ],
        [
            "Bohol"
        ],
        [
            "Cabilao"
        ],
        [
            "Cabulan"
        ],
        [
            "Hingotanan"
        ],
        [
            "Jandayan"
        ],
        [
            "Jao"
        ],
        [
            "Juagdan"
        ],
        [
            "Lapinig"
        ],
        [
            "Mahanay"
        ],
        [
            "Malingin"
        ],
        [
            "Mantatao"
        ],
        [
            "Maomawan"
        ],
        [
            "Pamilacan"
        ],
        [
            "Pangangan"
        ],
        [
            "Panglao"
        ],
        [
            "Sagasa"
        ],
        [
            "Sandingan"
        ],
        [
            "Tintinan"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Ubay,_Bohol&oldid=1224782152\""
        ],
        [
            "Categories: Ubay, BoholMunicipalities of BoholHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Tagalog-language textCS1 maint: location missing publisherCommons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}