{
    "name": "Uyugan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Uyugan"
        ],
        [
            "21 languages"
        ],
        [
            "閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogاردوTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 20°21′N 121°56′E﻿ / ﻿20.35°N 121.93°E﻿ / 20.35; 121.93"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Batanes, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Uyugan\" – news · newspapers · books · scholar · JSTOR (February 2014) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Cagayan Valley, PhilippinesUyuganMunicipalityMunicipality of UyuganUyugan landscape"
        ],
        [
            "FlagSealMap of Batanes with Uyugan highlightedOpenStreetMapUyuganLocation within the PhilippinesCoordinates: 20°21′N 121°56′E﻿ / ﻿20.35°N 121.93°E﻿ / 20.35; 121.93CountryPhilippinesRegionCagayan ValleyProvinceBatanesDistrict"
        ],
        [
            "Lone districtFoundedMay 20, 1909Barangays4"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorJonathan Enrique V. Nanud Jr. • Vice MayorArgel E. Hortiz • RepresentativeCiriaco B. Gato Jr. • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Anthony-Charles C. OrtizAniceto C. NanudAntonio Wilson B. BogadorRonald L. GaribayAndres A. YbayJerwin Joji N. CobicoBernardo C. delos SantosRalph Jordan M. Ebalin"
        ],
        [
            " • Electorate1,202 voters (2022)Area • Revenue₱ 50.24 million (2020) • Assets₱ 66.02 million (2020) • Expenditure₱ 45.7 million (2020) • Liabilities₱ 39.29 million (2020)Service provider • ElectricityBatanes Electric Cooperative (BATANELCO)Time zoneUTC+8 (PST)ZIP code3903PSGC020906000IDD : area code +63 (0)78Native languagesIvatan Tagalog IlocanoWebsiteuyuganbatanes.gov.ph"
        ],
        [
            "Uyugan, officially the Municipality of Uyugan (Ivatan: Kavahayan nu Uyugan; Tagalog: Bayan ng Uyugan), is a 6th class municipality in the province of Batanes, Philippines.",
            "According to the 2020 census, it has a population of 1,380 people, making it the least populated town in the province and second least populated in the country, behind Kalayaan, Palawan."
        ],
        [
            "History"
        ],
        [
            "Thousands of years before Spanish colonization, about a thousand people lived on fortified cliffs and hilltops scattered across today's Uyugan.",
            "The fortified settlements were called \"Idiang\" and derived from the Ivatan word \"Idi\" or \"Idian\" which means home or hometown.",
            "They belonged to the Ivatan tribes and spoke the same Ivatan language, but with a different accent."
        ],
        [
            "The Ivatan tribes who called the place home farmed, where soil permitted, and they fished.",
            "They were also a boat-making and seafaring people, and they traded with neighboring Taiwan to the North and Cagayan to the South."
        ],
        [
            "The Ivatan tribal settlements had a de facto tribal government, not very much different from that of tribal governments in the earlier stages of human evolution.",
            "The tribal settlement was headed by a chieftain with a deputy."
        ],
        [
            "Inter-tribal hostilities (Arap du Tukon) or War on the Hill were common in those days but for men only.",
            "Common law prohibited the harming of womenfolk who were the main providers of food in wartime."
        ],
        [
            "In the late 1600s, Dominican missionaries landed in Batanes.",
            "The native people were in the beginning were hostile to the early Spanish colonizers, but slowly they were able to adopt themselves to Spanish rule.",
            "The Spaniards had very different lifestyles, beliefs, and traditions than the Ivatan tribes and did not understand their social customs,  nature, religious beliefs, or love of the land."
        ],
        [
            "According to church records, the first mass and baptism in the islands was celebrated in what is now Imnajbu in Uyugan."
        ],
        [
            "The Spanish missionaries, finding the conditions harsh in Batanes, attempted to resettle the Ivatans in Cagayan, but they always found their way home, sailing back to Batanes."
        ],
        [
            "In 1782, Spanish Governor-General Jose Basco y Vargas sent an expedition to formally get the consent of the Ivatans to become subjects of the King of Spain."
        ],
        [
            "On June 26, 1783, de facto Ivatan independence was lost when on that day (called Batanes Day today) the representatives of the Spanish Crown met the representatives of the chiefs and nobles of Batanes on the Plains of Vasay (in what is now Basco) for the ceremonial formal annexation of Batanes to the Spanish Empire."
        ],
        [
            "The new province was named Provincia de la Conception.",
            "Governor-General Jose Basco y Vargas was named \"Conde de la Conquista de Batanes\" and the capital town of Basco was named after him.",
            "The Dominican Order established missions, among them the San Jose de Ivana mission which included all of present-day Uyugan and Sabtang."
        ],
        [
            "The Americans followed the Spaniards to Batanes after the Spanish naval defeat at Manila Bay.",
            "The USS Princeton dropped anchor at Basco Bay in February 1900.",
            "In 1901, the province was reclassified to a township, but provincial status was restored in 1909, and with it the creation of Uyugan as a separate township (municipality)."
        ],
        [
            "American public school system was introduced and general health and sanitation campaign was launched.",
            "In the 1930s, the Americans built a better road system that replaced the road system (El Camino Real) built during the Spanish period."
        ],
        [
            "Geography"
        ],
        [
            "Uyugan is located at 20°21′N 121°56′E﻿ / ﻿20.35°N 121.93°E﻿ / 20.35; 121.93 in the south-eastern part of Batan Island, bounded on the north by Mahatao, south by the Balintang Channel, east by the Philippine Sea, and west by Ivana.",
            "Uyugan is located at 20°21′N 121°56′E﻿ / ﻿20.35°N 121.93°E﻿ / 20.35; 121.93"
        ],
        [
            "According to the Philippine Statistics Authority, the municipality has a land area of 16.28 square kilometres (6.29 sq mi)  constituting 7.43% of the 219.01-square-kilometre- (84.56 sq mi) total area of Batanes."
        ],
        [
            "The Uyugan town proper (Centro or Idi to the Isantoninos) is 19 kilometres (12 mi) from Basco, the provincial capital.",
            "It is located along the banks of what was once a brook, a kilometer east of the Ivana-Uyugan border."
        ],
        [
            "There are two other major settlements in the municipality situated along the Pacific seaboard: Itbud and Imnajbu.",
            "Itbud is 4 kilometres (2.5 mi) from the town proper or Centro while Imnajbu is 2 kilometres (1.2 mi) farther north-east."
        ],
        [
            "The land is varied.",
            "It changes from rocky hills along the coasts to grassy and forest hills in the interior.",
            "Most of the land has been cleared for farming."
        ],
        [
            "In the language of the Ivatans, Uyugan means place of flowing water—which is never far away except in the town proper itself: Today's brook bed that cuts the town proper in half dried up during severe earthquakes in 1918."
        ],
        [
            "Barangays"
        ],
        [
            "Uyugan is politically subdivided into four barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            " PSGC"
        ],
        [
            " Barangay"
        ],
        [
            " Population"
        ],
        [
            " ±% p.a."
        ],
        [
            " 2020"
        ],
        [
            " 2010"
        ],
        [
            " 020906002   Imnajbu"
        ],
        [
            " 11.9%"
        ],
        [
            " 164"
        ],
        [
            " 159"
        ],
        [
            "  ▴"
        ],
        [
            " 0.31%"
        ],
        [
            " 020906003   Itbud"
        ],
        [
            " 34.9%"
        ],
        [
            " 482"
        ],
        [
            " 463"
        ],
        [
            "  ▴"
        ],
        [
            " 0.40%"
        ],
        [
            " 020906004   Kayuganan (Poblacion)"
        ],
        [
            " 22.6%"
        ],
        [
            " 312"
        ],
        [
            " 294"
        ],
        [
            "  ▴"
        ],
        [
            " 0.60%"
        ],
        [
            " 020906001   Kayvaluganan (Poblacion)"
        ],
        [
            " 24.6%"
        ],
        [
            " 339"
        ],
        [
            " 324"
        ],
        [
            "  ▴"
        ],
        [
            " 0.45%"
        ],
        [
            "Total"
        ],
        [
            "1,380"
        ],
        [
            "1,240"
        ],
        [
            " ▴"
        ],
        [
            "1.08%"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Uyugan, Batanes"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "24(75)"
        ],
        [
            "26(79)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "27(81)"
        ],
        [
            "26(79)"
        ],
        [
            "25(77)"
        ],
        [
            "23(73)"
        ],
        [
            "25(78)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "44(1.7)"
        ],
        [
            "35(1.4)"
        ],
        [
            "29(1.1)"
        ],
        [
            "48(1.9)"
        ],
        [
            "204(8.0)"
        ],
        [
            "238(9.4)"
        ],
        [
            "291(11.5)"
        ],
        [
            "325(12.8)"
        ],
        [
            "304(12.0)"
        ],
        [
            "202(8.0)"
        ],
        [
            "141(5.6)"
        ],
        [
            "60(2.4)"
        ],
        [
            "1,921(75.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "11.1"
        ],
        [
            "9.1"
        ],
        [
            "8.3"
        ],
        [
            "9.2"
        ],
        [
            "15.7"
        ],
        [
            "17.1"
        ],
        [
            "19.4"
        ],
        [
            "21.9"
        ],
        [
            "21.1"
        ],
        [
            "18.4"
        ],
        [
            "16.3"
        ],
        [
            "12.4"
        ],
        [
            "180"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Uyugan's climate ranges from humid oceanic to sub-tropic.",
            "The Philippine Sea/Pacific Ocean to the east moderate the climate—cooling summers.",
            "It is coldest in January and warmest in May."
        ],
        [
            "January temperatures average 20 °C (68 °F).",
            "May's average temperatures range from 30 to 35 °C (86 to 95 °F)."
        ],
        [
            "The average (mean) annual air temperature is less than 10 °C (50 °F) in January, but it is much more changeable in north-eastern Uyugan (Imnajbu)."
        ],
        [
            "Precipitation is heaviest during the non-summer months brought in by the typhoons that frequent the area.",
            "Uyugan's annual rainfall varies, but is highest in the north and lowest in the south.",
            "The heaviest rainfalls happen in a belt lying inland from Mount Chakarangan in north-western Uyugan (Songet) to Mount Vatohayao in north-eastern Uyugan (Imnajbu)."
        ],
        [
            "The weather is foggy at the onset of the colder months, caused by the cold polar air from the north (Continental Asia/Siberia) meeting warm moist air from the south."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of UyuganYearPop.±% p.a.1918 855—    1939 1,038+0.93%1948 1,208+1.70%1960 1,029−1.33%1970 1,058+0.28%1975 1,115+1.06%1980 1,122+0.13%1990 1,198+0.66%1995 1,265+1.02%2000 1,268+0.05%2007 1,203−0.72%2010 1,240+1.11%2015 1,297+0.86%2020 1,380+1.23%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, Uyugan had a population of 1,380.",
            "The population density was 85 inhabitants per square kilometre (220/sq mi)."
        ],
        [
            "Uyugan's population has not changed much since its founding as a separate township (municipality) on May 20, 1909.",
            "Its population is around a tenth of the population of Batanes."
        ],
        [
            "Half of Uyugan's population lives in the town proper or Uyugan Centro that comprises the barangays of Kayuganan and Kayvaluganan.",
            "The other half live in Itbud and Imnajbu."
        ],
        [
            "The four Uyugan barangays or municipal districts along the coasts and brooks.",
            "They grew up there because of the sea and fresh waters necessary for their livelihood.",
            "All of the barangays have a main street as the core of their socio-economic life."
        ],
        [
            "Most of the people speak Ivatan as their first language, and most speak Ilocano, Tagalog, and English as their second languages."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Uyugan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  6.00"
        ],
        [
            "2009  8.08"
        ],
        [
            "2012  18.13"
        ],
        [
            "2015  19.48"
        ],
        [
            "2018  13.24"
        ],
        [
            "2021  5.93"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The Uyugan economy is mainly agriculture and fishing."
        ],
        [
            "Farming in Uyugan began long before the arrival of the Spaniards.",
            "The Ivatans loved the land and cultivated many plants for food."
        ],
        [
            "Isantonino farmers started with root crops, but when the Spaniards arrived, they learned to grow other crops, while introducing livestock and vegetables.",
            "Farming meant growing root crops—often just enough to feed the farmer's family."
        ],
        [
            "Camoté and other root crops became Uyugan's most hardy and widely grown crops, but in the 1950s, livestock became more important than root crops on Uyugan farms.",
            "The government brought breeding bulls and the farmers moved to \"mixed\" farming on a small scale."
        ],
        [
            "Uyugan's farms are not scientific, but government agricultural extension workers give direction and support to farming methods.",
            "The farmers seldom have problems like plant and animal diseases and pests."
        ],
        [
            "Today's Isantonino farmer still could barely feed his family due to antiquated methods of farming dictated mainly by the topography of the land that at best is unsuitable to agriculture.",
            "Nevertheless, Uyugan was a leading producer of beef cattle and garlic prior to the global economy."
        ],
        [
            "Fishing plays a role in partly meeting the fish requirements of the municipality.",
            "Fishing methods use hook and line and cast nets."
        ],
        [
            "Situated north of Imnajbu is Madi Bay in Mahatao, one of the richest fishing grounds in all of mainland Batanes, where Isantoninos (Uyugan) along with Isancarnos (Mahatao) and other Ivatans (Ivasays) engaged in coastal fishing."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Uyugan, belonging to the lone congressional district of the province of Batanes, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ciriaco B. Gato Jr."
        ],
        [
            "Mayor"
        ],
        [
            "Jonathan Enrique V. Nanud Jr."
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Johnard C. Baldomar"
        ],
        [
            "Councilors"
        ],
        [
            "Jonalyn Jennevieve B. Viloria"
        ],
        [
            "Andres A. Ybay"
        ],
        [
            "Jeffrey E. Cobico"
        ],
        [
            "Joseph C. Ybay"
        ],
        [
            "Anthony-Charles C. Ortiz"
        ],
        [
            "Alicia P. Baldomar"
        ],
        [
            "Isabel Ofelia E. Cobico"
        ],
        [
            "Jerwin Joji N. Cobico"
        ],
        [
            "Education"
        ],
        [
            "The Schools Division of Batanes governs the town's public education system.",
            "The division office is a field office of the DepEd in Cagayan Valley region.",
            "The office governs the public and private elementary and public and private high schools throughout the municipality."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Uyugan |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^  https://www.philatlas.com/luzon/r02/batanes/uyugan.html.",
            "{{cite web}}: Missing or empty |title= (help)"
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Batanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^ \"Municipal: Uyugan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^"
        ],
        [
            "\"Uyugan, Batanes : Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 5 January 2019."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region II (Cagayan Valley)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Batanes\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "Retrieved March 6, 2022."
        ],
        [
            "^ \"DEPED REGIONAL OFFICE NO.",
            "02\".",
            "DepED RO2 | The official website of DepED Regional Office No.",
            "02."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Uyugan."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Uyugan"
        ],
        [
            "Mahatao"
        ],
        [
            "Ivana"
        ],
        [
            "Uyugan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Balintang Channel (Luzon Strait)"
        ],
        [
            "vte Province of BatanesBasco (capital and largest municipality)Municipalities"
        ],
        [
            "Basco"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Mahatao"
        ],
        [
            "Sabtang"
        ],
        [
            "Uyugan"
        ],
        [
            "BarangaysSee: List of barangays in Batanes"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Uyugan&oldid=1221158764\""
        ],
        [
            "Category: Municipalities of BatanesHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: missing titleCS1 errors: bare URLCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from February 2014All articles needing additional referencesCoordinates on WikidataArticles containing Ivatan-language textArticles containing Tagalog-language textWikipedia articles needing clarification from November 2016All articles with unsourced statementsArticles with unsourced statements from November 2016Commons category link from WikidataPages using the Kartographer extension"
        ]
    ]
}