{
    "name": "Vintar",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Vintar"
        ],
        [
            "18 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganBahasa MelayuNederlandsPangasinanPortuguêsSvenskaTagalogTiếng ViệtWinaray"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°13′50″N 120°38′56″E﻿ / ﻿18.2306°N 120.6489°E﻿ / 18.2306; 120.6489"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Ilocos Norte, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Vintar\" – news · newspapers · books · scholar · JSTOR (October 2013) (Learn how and when to remove this message)"
        ],
        [
            "Municipality in Ilocos Region, PhilippinesVintarMunicipalityMunicipality of VintarVintar Bikeline 2020"
        ],
        [
            "FlagMap of Ilocos Norte with Vintar highlightedOpenStreetMapVintarLocation within the PhilippinesCoordinates: 18°13′50″N 120°38′56″E﻿ / ﻿18.2306°N 120.6489°E﻿ / 18.2306; 120.6489CountryPhilippinesRegionIlocos RegionProvinceIlocos NorteDistrict"
        ],
        [
            "1st districtFounded1909Barangays33"
        ],
        [
            "  (see Barangays)Government  • TypeSangguniang Bayan • MayorRichard Degala • Vice MayorMaribel Albano • RepresentativeFerdinand Alexander Marcos III • Municipal Council"
        ],
        [
            "Members"
        ],
        [
            "Randy A. DegalaMaribel A. AlbanoMaricel B. ForondaFerdinand B. MabanagJobel Fred M. ForondaNestor Marino A. MadambaAntero A. CaluyaArlene L. Ruadap"
        ],
        [
            " • Electorate22,110 voters (2022)Area • Revenue₱ 261.7 million (2020) • Assets₱ 526.9 million (2020) • Expenditure₱ 204.8 million (2020) • Liabilities₱ 118 million (2020)Service provider • ElectricityIlocos Norte Electric Cooperative (INEC)Time zoneUTC+8 (PST)ZIP code2915PSGC012823000IDD : area code +63 (0)77Native languagesIlocano Tagalog"
        ],
        [
            "Vintar, officially the Municipality of Vintar (Ilocano: Ili ti Vintar; Tagalog: Bayan ng Vintar), is a 1st class municipality in the province of Ilocos Norte, Philippines.",
            "According to the 2020 census, it has a population of 33,339 people."
        ],
        [
            "Vintar is the largest municipality in Ilocos Norte.",
            "Its patron saint is Saint Nicholas de Tolentino.",
            "It is home to one of the biggest convents in the province where it houses the Saint Nicholas Academy.",
            "It is also where Vintar Dam is located, first dam funded by the World Bank in Southeast Asia- an important cultural property listed by the National Commission for Culture and the Arts (NCCA)  and is also the site of the Umok ni Siwawer Eco-Tourism Nature Park, the town's popular picnic resort."
        ],
        [
            "Etymology"
        ],
        [
            "Vintar derived its name from the Ilocano word, \"intar\", which used to describe the formation or order taken by the subject from their ruler whenever the chief called them to attention.",
            "It is said that a visiting Spanish missionary heard the word and added the letter V, referring to the “V” formation that the missionary saw."
        ],
        [
            "History"
        ],
        [
            "The town's earliest settlers are believed to be of Malay in origin.",
            "They first settled on a hill overlooking the Bislak.",
            "The town was founded by the Spanish missionaries who got lost in the woods while hunting between Sarrat and Piddig.",
            "Vintar became a visita of Bacarra but it was later established as a Parish of San Nicolas de Tolentino.",
            "Earlier in 1763, Vintar was reverted to a visita until it became independent in 1774."
        ],
        [
            "In 1903, Vintar was annexed as a barrio of Bacarra.",
            "It gained its separation and independence in 1909."
        ],
        [
            "The town is home to one of the biggest convents in Ilocos Norte.",
            "In 1931, an earthquake partially destroyed its church and convent.",
            "Five years later, it was restored.",
            "The convent which houses the Saint Nicolas Academy was restored in 1982."
        ],
        [
            "Vintar was one of the Ilocos region municipalities where various human rights violations were documented during the martial law era, despite public perception that the region was supportive of the Marcos administration."
        ],
        [
            "Culture"
        ],
        [
            "Vintar celebrates the feast of St. Nicholas every 10 September- a religious tradition inherited from the Augustinians lives that still practice the distribution of “tinapay ni San Nicolas” (unleavened bread).",
            "But the Siwawer Festival, the annual town fiesta of Vintar is held from December 26–30 of every year."
        ],
        [
            "The people of Vintar engage in farming, fishing and herding.",
            "The town is generally rural but famous all over the province for its beautiful women with strongly Spanish features.",
            "Hence the town has its monicker, “The Home of Beautiful People”."
        ],
        [
            "Vintar is also the site of four (4) important cultural properties listed by the National Commission for Culture and the Arts.",
            "These are Vintar Dam, the Old Municipal Building, San Nicolas de Tolentino Parish Church and the Gabaldon Building."
        ],
        [
            "Vintar was once known for Abel Iloco or Inabel, especially the classic Binandera Abel, which flourished “in the north of the river,” as proven by a loom displayed at the Museo de Siwawer in Barangay Abkir."
        ],
        [
            "Geography"
        ],
        [
            "Vintar is located on a plain land surrounded by mountains.",
            "Vintar is surrounded and bordered by:"
        ],
        [
            "Bangui, Adams, Dumalneg, Burgos and Pagudpud in the north;"
        ],
        [
            "Laoag, Sarrat, Piddig, and Carasi in the south;"
        ],
        [
            "Pasuquin and Bacarra in the west;"
        ],
        [
            "Calanasan, Apayao in the east."
        ],
        [
            "The town is considered as the sixth major river system in the region.",
            "Its head waters are on the western Cordillera slopes at the Kalinga and Apayao borders.",
            "It flows eastward and irrigates most of the flat lands of Ilocos Norte before making its exit into the China Sea.",
            "Vintar has the largest land area in Ilocos Norte."
        ],
        [
            "Barangays"
        ],
        [
            "Vintar is politically subdivided into 33 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Abkir"
        ],
        [
            "Alejo Malasig"
        ],
        [
            "Alsem"
        ],
        [
            "Bago"
        ],
        [
            "Bulbulala"
        ],
        [
            "Cabangaran"
        ],
        [
            "Cabayo"
        ],
        [
            "Cabisocolan"
        ],
        [
            "Canaam"
        ],
        [
            "Columbia"
        ],
        [
            "Dagupan"
        ],
        [
            "Dipilat"
        ],
        [
            "Esperanza"
        ],
        [
            "Ester"
        ],
        [
            "Isic Isic"
        ],
        [
            "Lubnac"
        ],
        [
            "Mabanbanag"
        ],
        [
            "Malampa"
        ],
        [
            "Manarang"
        ],
        [
            "Margaay"
        ],
        [
            "Namoroc"
        ],
        [
            "Parparoroc"
        ],
        [
            "Parut"
        ],
        [
            "Pedro F. Alviar"
        ],
        [
            "Salsalamagui"
        ],
        [
            "San Jose"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pedro"
        ],
        [
            "San Ramon"
        ],
        [
            "San Roque (Poblacion)"
        ],
        [
            "Santa Maria"
        ],
        [
            "Tamdagan"
        ],
        [
            "Visaya"
        ],
        [
            "Sub-divisions"
        ],
        [
            "Poblacion"
        ],
        [
            "Poblacion is the center-most subdivision of Vintar.",
            "Poblacion is composed of 5 barangays namely:"
        ],
        [
            "1- San Roque"
        ],
        [
            "2- San Nicolas"
        ],
        [
            "3- San Pedro"
        ],
        [
            "4- Santa Maria"
        ],
        [
            "5- San Ramon"
        ],
        [
            "Metro Poblacion"
        ],
        [
            "Metro Poblacion is composed of 5 barangays namely:"
        ],
        [
            "6- Parut"
        ],
        [
            "7- Alejo Malasig"
        ],
        [
            "8- Margaay"
        ],
        [
            "9- Lubnac"
        ],
        [
            "10- Parparoroc"
        ],
        [
            "Pallas Valley"
        ],
        [
            "It is located at the north-east of Vintar.",
            "Pallas Valley is composed of 4 barangays namely:"
        ],
        [
            "11- Bulbulala"
        ],
        [
            "12- Namoroc"
        ],
        [
            "13- Mabanbanag"
        ],
        [
            "14- Ester"
        ],
        [
            "North of the River (Amian ti Karayan)"
        ],
        [
            "North of the River or \"Amian ti Karayan\" is located north of the Bislak River from Poblacion.",
            "It is called so after the Ilocano word \"Amian\" which means north.",
            "Amian ti Karayan is composed of 8 barangays namely:"
        ],
        [
            "16- Salsalamagui"
        ],
        [
            "17- P.F.",
            "Alviar"
        ],
        [
            "18- Abkir"
        ],
        [
            "19- Columbia"
        ],
        [
            "20- Cabisuculan"
        ],
        [
            "21- Malampa"
        ],
        [
            "22- Manarang"
        ],
        [
            "24- Alsem"
        ],
        [
            "Lower Surong Valley"
        ],
        [
            "15- Visaya"
        ],
        [
            "23- Dipilat"
        ],
        [
            "25- Tamdagan"
        ],
        [
            "26- Canaam"
        ],
        [
            "27- Esperanza"
        ],
        [
            "28- Bago"
        ],
        [
            "29/30- San Jose/Sto.Tomas"
        ],
        [
            "Upper Surong Valley"
        ],
        [
            "Upper Surong Valley is composed of 4 barangays namely:"
        ],
        [
            "31- Dagupan"
        ],
        [
            "32- Cabangaran"
        ],
        [
            "33- Cabayo"
        ],
        [
            "34- Isic Isic"
        ],
        [
            " Vintar town with mountains in the background"
        ],
        [
            "Mount Baguinsuso"
        ],
        [
            "Mount Baguinsuso, also known as Mount Masadsada (Ilocano which means \"passable valley\"), is among the most recognized landmarks located in Barangay 15- Visaya."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Vintar, Ilocos Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "26(79)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "26(79)"
        ],
        [
            "29(85)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20(68)"
        ],
        [
            "20(68)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "22(72)"
        ],
        [
            "21(70)"
        ],
        [
            "23(73)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "55(2.2)"
        ],
        [
            "41(1.6)"
        ],
        [
            "37(1.5)"
        ],
        [
            "41(1.6)"
        ],
        [
            "184(7.2)"
        ],
        [
            "215(8.5)"
        ],
        [
            "261(10.3)"
        ],
        [
            "256(10.1)"
        ],
        [
            "245(9.6)"
        ],
        [
            "216(8.5)"
        ],
        [
            "142(5.6)"
        ],
        [
            "129(5.1)"
        ],
        [
            "1,822(71.8)"
        ],
        [
            "Average rainy days"
        ],
        [
            "14.1"
        ],
        [
            "11.1"
        ],
        [
            "11.8"
        ],
        [
            "12.5"
        ],
        [
            "21.8"
        ],
        [
            "25.2"
        ],
        [
            "25.5"
        ],
        [
            "24.9"
        ],
        [
            "23.8"
        ],
        [
            "18.2"
        ],
        [
            "16.4"
        ],
        [
            "17.0"
        ],
        [
            "222.3"
        ],
        [
            "Source: Meteoblue (modeled/calculated data, not measured locally)"
        ],
        [
            "Vintar is divided into two types of climate:"
        ],
        [
            "90% or the Western Part: Two pronounced seasons, dry from December to May and wet from June to November.",
            "Maximum rain period is from June to September."
        ],
        [
            "10% or the Eastern Part: No very pronounced maximum rain period, with a short dry season lasting only from one to three months."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of VintarYearPop.±% p.a.1903 9,435—    1918 11,686+1.44%1939 14,153+0.92%1948 14,882+0.56%1960 17,359+1.29%1970 19,455+1.15%1975 21,655+2.17%1980 23,356+1.52%YearPop.±% p.a.1990 27,084+1.49%1995 27,460+0.26%2000 29,031+1.20%2007 29,405+0.18%2010 31,448+2.47%2015 32,220+0.46%2020 33,339+0.67%Source: Philippine Statistics Authority"
        ],
        [
            "In the 2020 census, the population of Vintar was 33,339 people, with a density of 54 inhabitants per square kilometre or 140 inhabitants per square mile."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Vintar"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  18.70"
        ],
        [
            "2009  16.79"
        ],
        [
            "2012  15.30"
        ],
        [
            "2015  8.50"
        ],
        [
            "2018  4.18"
        ],
        [
            "2021  6.61"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Transportation"
        ],
        [
            "Vintar can be reached through air via Laoag International Airport at Laoag City, then hiring a tricycle or any other public transportation.",
            "From Manila by bus, it will take about 10 to 12 hours in reaching the center of Vintar.",
            "Farinas and Maria De Leon are the major companies that have a daily trip to Vintar."
        ],
        [
            "Festival"
        ],
        [
            "Siwawer Festival is the annual festival of Vintar.",
            "This festival of the town is being celebrated in honor of the siwawer the local name of the brahminy kite species of eagle that soars the skies of Vintar.",
            "The Festival starts on December 4 which is also the Vintar Day, the foundation of the municipality when it was separated from the town of Bacarra in 1909."
        ],
        [
            "Government"
        ],
        [
            "Local government"
        ],
        [
            "Main article: Sangguniang Bayan"
        ],
        [
            "Vintar, belonging to the first congressional district of the province of Ilocos Norte, is governed by a mayor designated as its local chief executive and by a municipal council as its legislative body in accordance with the Local Government Code.",
            "The mayor, vice mayor, and the councilors are elected directly by the people through an election which is being held every three years."
        ],
        [
            "Elected officials"
        ],
        [
            "Members of the Municipal Council(2019–2022)"
        ],
        [
            "Position"
        ],
        [
            "Name"
        ],
        [
            "Congressman"
        ],
        [
            "Ferdinand Alexander Marcos III"
        ],
        [
            "Mayor"
        ],
        [
            "Richard A. Degala"
        ],
        [
            "Vice-Mayor"
        ],
        [
            "Maribel A. Albano"
        ],
        [
            "Councilors"
        ],
        [
            "Rikrik Ong"
        ],
        [
            "Antikel Degala"
        ],
        [
            "Marie Foronda"
        ],
        [
            "Antero A. Caluya"
        ],
        [
            "Josey Florian Foronda"
        ],
        [
            "Fred Foronda"
        ],
        [
            "Lindy Castillo"
        ],
        [
            "Carlito Rasdas"
        ],
        [
            "Municipal seal"
        ],
        [
            "The shield is derived from the provincial seal of Ilocos Norte."
        ],
        [
            "The letter V stands for the word Vintar, the name of the municipality."
        ],
        [
            "The eagle represents the native hawk, commonly called Siwawer by the old folks and after which the people of Vintar are referred to."
        ],
        [
            "Landscape, plow, rice stalk, onion, garlic, mango, eggplant and tobacco leaf, at the left side of the shield representing the municipality's principal farming industries."
        ],
        [
            "Dam, gate valve, water and fish at the right side of the shield represent Vintar-Laoag-Bacarra irrigation system.",
            "The dam also stands for the Siwawers, a resort the town is famous for; the fish symbolizes one of the main income-generating products of the locality."
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Vintar |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ a b c \"Ilocanos remember dark days of martial law, vow to continue fight\".",
            "2 October 2012."
        ],
        [
            "^ Adriano, Leilanie (March 21, 2024).",
            "\"Reviving Ilocos cultural traditions through weaving\".",
            "Philippine News Agency.",
            "Retrieved March 23, 2024."
        ],
        [
            "^"
        ],
        [
            "\"Province: Ilocos Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 12 November 2016."
        ],
        [
            "^"
        ],
        [
            "\"Vintar: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 4 March 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region I (Ilocos Region)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Ilocos Norte\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"VINTAR\".",
            "ABS-CBN.",
            "Retrieved 24 July 2023."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Vintar."
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Vintar"
        ],
        [
            "Burgos"
        ],
        [
            "Bangui / Dumalneg / Adams"
        ],
        [
            "PasuquinBacarra"
        ],
        [
            "Vintar"
        ],
        [
            "Calanasan, Apayao"
        ],
        [
            "Laoag"
        ],
        [
            "Piddig / Carasi"
        ],
        [
            "vte Province of Ilocos NorteLaoag (capital and largest city)Municipalities"
        ],
        [
            "Adams"
        ],
        [
            "Bacarra"
        ],
        [
            "Badoc"
        ],
        [
            "Bangui"
        ],
        [
            "Banna"
        ],
        [
            "Burgos"
        ],
        [
            "Carasi"
        ],
        [
            "Currimao"
        ],
        [
            "Dingras"
        ],
        [
            "Dumalneg"
        ],
        [
            "Marcos"
        ],
        [
            "Nueva Era"
        ],
        [
            "Pagudpud"
        ],
        [
            "Paoay"
        ],
        [
            "Pasuquin"
        ],
        [
            "Piddig"
        ],
        [
            "Pinili"
        ],
        [
            "San Nicolas"
        ],
        [
            "Sarrat"
        ],
        [
            "Solsona"
        ],
        [
            "Vintar"
        ],
        [
            "Component cities"
        ],
        [
            "Batac"
        ],
        [
            "Laoag"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Norte"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Vintar&oldid=1215156208\""
        ],
        [
            "Category: Municipalities of Ilocos NorteHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from October 2013All articles needing additional referencesInfobox mapframe without OSM relation ID on WikidataCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersPages using the Kartographer extension"
        ]
    ]
}