{
    "name": "Zumarraga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Zumarraga, Samar"
        ],
        [
            "20 languages"
        ],
        [
            "Bikol CentralCebuanoChavacano de ZamboangaDeutschEspañolFrançaisIlokanoBahasa IndonesiaItalianoKapampanganქართულიBahasa MelayuNederlandsNorsk bokmålPangasinanPortuguêsSvenskaTagalogWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°38′20″N 124°50′28″E﻿ / ﻿11.639°N 124.841°E﻿ / 11.639; 124.841"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Municipality in Samar, Philippines"
        ],
        [
            "Municipality in Eastern Visayas, PhilippinesZumarragaMunicipalityMunicipality of ZumarragaDowntown area"
        ],
        [
            "FlagMap of Samar with Zumarraga highlightedOpenStreetMapZumarragaLocation within the PhilippinesCoordinates: 11°38′20″N 124°50′28″E﻿ / ﻿11.639°N 124.841°E﻿ / 11.639; 124.841CountryPhilippinesRegionEastern VisayasProvinceSamarDistrict"
        ],
        [
            "2nd districtNamed forZumarraga, SpainBarangays25"
        ],
        [
            "  (see Barangays)Government  • Revenue₱ 104 million (2020) • Assets₱ 118.4 million (2020) • Expenditure₱ 91.5 million (2020) • Liabilities₱ 49.61 million (2020)Service provider • ElectricitySamar 2 Electric Cooperative (SAMELCO 2)Time zoneUTC+8 (PST)ZIP code6725PSGC086023000IDD : area code +63 (0)55Native languagesWaray Tagalog"
        ],
        [
            "Zumarraga, officially the Municipality of Zumarraga (Waray: Bungto han Zumarraga; Tagalog: Bayan ng Zumarraga), is a 5th class island municipality in the province of  Samar , Philippines.",
            "According to the 2020 census, it has a population of 16,279 people."
        ],
        [
            "It is formerly known as Buad, Rawis, and Kawayan.",
            "The town itself, notably its downtown area, is considered by many heritage scholars as a heritage zone due to the many heritage houses within its vicinity.",
            "The local government unit is currently conserving the history and traditions of the town."
        ],
        [
            "The town is also famous for two beverages which it specializes in.",
            "These are the kinutil (tuba wine with egg yolk) and dubado (tuba wine with melted tablea)."
        ],
        [
            "History"
        ],
        [
            "St. Anthony of Padua, Zumarraga's Patron Saint"
        ],
        [
            "The town of Zumaraga was known for quite a number years before some other towns in Samar were recognized.",
            "This was because of a flourishing fishing industry in the town."
        ],
        [
            "This started with a small settlement of a few villagers who came with their families from Leyte.",
            "They discovered the place while they were on their fishing trips and were overtaken by a storm during which they anchored and took refuge on the place now known as \"Rawes\".",
            "To their amazement they found the place good for settlement, naturally pleasing due to the presence of bamboo.",
            "So when they returned to settle they named the place \"Kawayan\"."
        ],
        [
            "These villagers became prosperous because of the abundance of fish in the waters which surrounded the islands.",
            "It as for this reason that many people from neighboring places flocked for some fishing business.",
            "The first to come were the Ferreras from Leyte."
        ],
        [
            "The news of this rich fishing village reached the ears of the Moro pirates so they extended their piracy to Visayan waters.",
            "To keep themselves safe, the natives built strong stone fortifications on the top of the hill overlooking the whole town.",
            "Today, these fortifications still remain, a symbol of the unity of our forefathers; without their unity these forts would not have been built."
        ],
        [
            "Nobody can tell the exact date of the coming of the Spaniards to the islands, but in 1848 a Spanish friar was sent to the place.",
            "It was said that with their coming, they already found the natives willing to obey and follow the laws of the self-governing body which ruled the village.",
            "The name of the place was already \"Buad\" derived from the local dialect \"Binuwaaran\" a term for the digging made by wild pigs.",
            "Later on the birth peace known the first municipal primary of the birthplace of the first Spanish priest, Rev.",
            "Fr.",
            "Martin Yepes who was born in Zumarraga, a town in Spain."
        ],
        [
            "On March 13, 1863, the town became an independent parish by virtue of a decree of the King of Spain.",
            "1869, issued on Oct. 12, 1865, confirming the town as a parish under a certain diocese.",
            "The parish priest then had its jurisdiction over the islands of Buad and Daram including Paranas."
        ],
        [
            "With the coming of the Spanish friars, came educational, spiritual and moral upliftment on the part of the natives.",
            "As such, these attracted the people from the neighboring towns and provinces.",
            "Foremost of the immigrants were the Zetas from Palo, Leyt, the Astorgas from Barugo, Leyte, the Villaflors from Cariga, Leyte, The Dazas, the Magas and Narios from Catbalogan, Samar, the Carcellars, Zosas, Versosas and Castillos."
        ],
        [
            "A well organized local government was established with the executive known as \"Capitan\".",
            "The early capitanes in the order of succession were: Tenorio RFerrer (Capitan Toyang), Nepomuceno Zeta (Capitan Sinoy), Nicolas Custodio (Capitan Colas), Salvador Zeta (Captain Badoy), Brigido Heal (Capitan Bido), Tomas Bello, Hilario Villaflor and Agustin Astorga.",
            "These town officials were appointed by the Gobernadorcillo upon the recommendation of the parish priest who also served as the local \"Inspector\".",
            "Much had happened during the Spanish era but no record exists showing any evidence.",
            "However, tales and riddles of our great grandfathers are told and retold from generation to generation."
        ],
        [
            "Americans came.",
            "Changes were made from the national to local levels.",
            "Free elections were introduced.",
            "The local town executive became known as \"Presidente\".",
            "The presidents in the order of their tenure of office were: Mario Maga, 1910; Luis Villaflor, 1911; Lucio Mijares, 1913; Leodergario Carcellar, 1914; Enrique Nario, 1916; Benito Astorga, 1920; Enrique Nario, 1926; and Rodrigo Daza, 1931."
        ],
        [
            "Population growth came mainly by immigration from neighboring places.",
            "With the increased population came an increase in industry and business particularly in fishing.",
            "It was during this rapid development that the wharf and a part of the breakwater \"Sea wall\" was constructed.",
            "The most illustrious son of Zumaraga, the late Pedro R. Arteche, represented his people in the constitutional convention in 1936; he subsequently occupied the gubernatorial seat of the provinces of Samar.",
            "During this period the elected town executive were known as \"Mayor\".",
            "The elected town mayors up to the outbreak of the second World War were: 1936-1938 Mayor: Emilio Zeta; Vice Mayor: Leodegario Carcellar; 1939-Mayor: Francisco Zosa; Vice Mayor: Francisco Castillo."
        ],
        [
            "Naturally after the war, destructions were evident but the local government tried its very best to reconstruct all that were damaged.",
            "Efforts were made by the local town officials to make the better Zumaraga before the war, the best.",
            "Significant public works improvements were made.",
            "Worthy of mention were the cementing of streets, the establishment of the Puericculture Center, putting up an electric light, a Public market, and the construction of additional pre-fab, Marcos type and the Bagong Lipunan buildings.",
            "A private Catholic High School was established by few civic-spirited citizens, duly recognized by the government and is presently solving the needs of the youth of the town and its vicinity, for secondary education.",
            "The edifice of the Roman Catholic Church which is the material symbol of undying filial live, faith and devotion towards Christianity and to its most honored Patron St. Anthony of Padua, had been built centuries ago, is now being reconstructed.",
            "Such project has been attributed to different priest assigned, the Parish Council and the generosity of the Zumaraganhons now residing in Manila, Cebu City, Iligan City, Tacloban City, Catbalogan, and Calbayog  who have prospered in their own lines of profession and industry and through the collective efforts of all Zumaraganhons."
        ],
        [
            "The present municipal administration under the energetic leadership of Mayor Bibiano Z. Letaba has done tangible progress as regards cleanliness and peace and order.",
            "The municipality is also at present the recipient of several National projects in conformity with the goals and objectives of the New Society.",
            "Especially to improve and better the life of the common man."
        ],
        [
            "Geography"
        ],
        [
            "Barangays"
        ],
        [
            "Zumarraga is divided into 25 barangays.",
            "Each barangay consists of puroks and some have sitios."
        ],
        [
            "Alegria"
        ],
        [
            "Arado"
        ],
        [
            "Arteche"
        ],
        [
            "Bioso"
        ],
        [
            "Boblaran"
        ],
        [
            "Botaera"
        ],
        [
            "Buntay"
        ],
        [
            "Camayse"
        ],
        [
            "Canwarak"
        ],
        [
            "Ibarra"
        ],
        [
            "Lumalantang"
        ],
        [
            "Macalunod"
        ],
        [
            "Maga-an"
        ],
        [
            "Maputi"
        ],
        [
            "Monbon"
        ],
        [
            "Mualbual"
        ],
        [
            "Pangdan"
        ],
        [
            "Poro"
        ],
        [
            "San Isidro"
        ],
        [
            "Sugod"
        ],
        [
            "Tinaugan"
        ],
        [
            "Tubigan"
        ],
        [
            "Poblacion 1 (Barangay 1)"
        ],
        [
            "Poblacion 2 (Barangay 2)"
        ],
        [
            "Marapilit"
        ],
        [
            "Talib"
        ],
        [
            "Igpit opol"
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Zumarraga, Samar"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27(81)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "28(82)"
        ],
        [
            "28(82)"
        ],
        [
            "29(84)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "23(74)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "114(4.5)"
        ],
        [
            "81(3.2)"
        ],
        [
            "94(3.7)"
        ],
        [
            "81(3.2)"
        ],
        [
            "119(4.7)"
        ],
        [
            "192(7.6)"
        ],
        [
            "186(7.3)"
        ],
        [
            "158(6.2)"
        ],
        [
            "167(6.6)"
        ],
        [
            "185(7.3)"
        ],
        [
            "202(8.0)"
        ],
        [
            "176(6.9)"
        ],
        [
            "1,755(69.2)"
        ],
        [
            "Average rainy days"
        ],
        [
            "18.6"
        ],
        [
            "14.7"
        ],
        [
            "16.8"
        ],
        [
            "17.8"
        ],
        [
            "22.3"
        ],
        [
            "25.9"
        ],
        [
            "27.5"
        ],
        [
            "26.2"
        ],
        [
            "26.6"
        ],
        [
            "27.0"
        ],
        [
            "24.6"
        ],
        [
            "22.3"
        ],
        [
            "270.3"
        ],
        [
            "Source: Meteoblue"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of ZumarragaYearPop.±% p.a.1903 9,992—    1918 11,068+0.68%1939 21,225+3.15%1948 30,593+4.15%1960 11,549−7.80%1970 12,064+0.44%1975 13,297+1.97%1980 12,821−0.73%1990 13,324+0.39%1995 14,505+1.60%2000 15,423+1.32%2007 16,743+1.14%2010 16,936+0.42%2015 16,295−0.73%2020 16,279−0.02%Source: Philippine Statistics Authority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Zumarraga"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  46.10"
        ],
        [
            "2009  49.86"
        ],
        [
            "2012  49.53"
        ],
        [
            "2015  49.90"
        ],
        [
            "2018  38.87"
        ],
        [
            "2021  34.28"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "References"
        ],
        [
            "^  Municipality of Zumarraga |  (DILG)"
        ],
        [
            "^ \"2015 Census of Population, Report No.",
            "3 – Population, Land Area, and Population Density\" (PDF).",
            "Philippine Statistics Authority.",
            "Quezon City, Philippines.",
            "August 2016.",
            "ISSN 0117-1453.",
            "Archived (PDF) from the original on May 25, 2021.",
            "Retrieved July 16, 2021."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ Kapuso Mo, Jessica Soho: Comfort food ng mga Waray.",
            "YouTube.",
            "Archived from the original on 2021-12-11."
        ],
        [
            "^"
        ],
        [
            "\"Zumarraga: Average Temperatures and Rainfall\".",
            "Meteoblue.",
            "Retrieved 29 February 2020."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VIII (Eastern Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^"
        ],
        [
            "\"Province of Samar (Western Samar)\".",
            "Municipality Population Data.",
            "Local Water Utilities Administration Research Division.",
            "Retrieved 17 December 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2003 City and Municipal Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "23 March 2009."
        ],
        [
            "^ \"City and Municipal Level Poverty Estimates; 2006 and 2009\" (PDF).",
            "Philippine Statistics Authority.",
            "3 August 2012."
        ],
        [
            "^ \"2012 Municipal and City Level Poverty Estimates\" (PDF).",
            "Philippine Statistics Authority.",
            "31 May 2016."
        ],
        [
            "^ \"Municipal and City Level Small Area Poverty Estimates; 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "10 July 2019."
        ],
        [
            "^ \"PSA Releases the 2018 Municipal and City Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "15 December 2021.",
            "Retrieved 22 January 2022."
        ],
        [
            "^ \"PSA Releases the 2021 City and Municipal Level Poverty Estimates\".",
            "Philippine Statistics Authority.",
            "2 April 2024.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Zumarraga Profile at PhilAtlas.com"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Zumarraga, Samar"
        ],
        [
            "CatbaloganMaqueda Bay"
        ],
        [
            "Daram / Zumarraga Channel"
        ],
        [
            "Zumarraga"
        ],
        [
            "Villareal Bay / Calbiga"
        ],
        [
            "Buad ChannelVillareal"
        ],
        [
            "Villareal Bay / Pinabacdao"
        ],
        [
            "vte Province of SamarCatbalogan (capital)  Calbayog (largest city)Municipalities"
        ],
        [
            "Almagro"
        ],
        [
            "Basey"
        ],
        [
            "Calbiga"
        ],
        [
            "Daram"
        ],
        [
            "Gandara"
        ],
        [
            "Hinabangan"
        ],
        [
            "Jiabong"
        ],
        [
            "Marabut"
        ],
        [
            "Matuguinao"
        ],
        [
            "Motiong"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Paranas"
        ],
        [
            "Pinabacdao"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Sebastian"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tarangnan"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Component cities"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Authority control databases"
        ],
        [
            "VIAF"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Zumarraga,_Samar&oldid=1188642236\""
        ],
        [
            "Categories: Municipalities of Samar (province)Island municipalities in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textArticles with VIAF identifiersPages using the Kartographer extension"
        ]
    ]
}