{
    "name": "Batangas",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Batangas"
        ],
        [
            "42 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийScotsSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°50′N 121°00′E﻿ / ﻿13.83°N 121°E﻿ / 13.83; 121"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Calabarzon, Philippines"
        ],
        [
            "This article is about the Philippine province.",
            "For its capital city, see Batangas City.",
            "For other uses, see Batangas (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Batangas\" – news · newspapers · books · scholar · JSTOR (April 2011) (Learn how and when to remove this message)"
        ],
        [
            "Province in Calabarzon, PhilippinesBatangasProvinceProvince of Batangas"
        ],
        [
            "From left-to-right, top-to-bottom: Batangas Provincial Capitol; Taal Volcano; Taal Basilica; Agoncillo–Mariño House; Malabrigo Point Lighthouse; view from Mount Batulao"
        ],
        [
            "FlagSealNicknames: Land of Rolling Hills and Wide Shore Lands.Lalawigan ng mga MagigitingMotto: \"Rich Batangas!",
            "\"Anthem: Himno ng Batangan (Batangas Hymn)Location in the PhilippinesOpenStreetMapCoordinates: 13°50′N 121°00′E﻿ / ﻿13.83°N 121°E﻿ / 13.83; 121CountryPhilippinesRegionCalabarzonFoundedDecember 8, 1581CapitalBatangas CityLargest cityLipaGovernment • TypeSangguniang Panlalawigan • GovernorHermilando I. Mandanas  (PDP–Laban) • Vice GovernorJose Antonio S. Leviste II  (PDP–Laban) • LegislatureBatangas Provincial BoardArea • Total2,908,494 • Rank7th out of 81 • Density930/km2 (2,400/sq mi)  • Rank6th out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "5"
        ],
        [
            " Batangas City"
        ],
        [
            " Calaca"
        ],
        [
            " Lipa"
        ],
        [
            " Santo Tomas"
        ],
        [
            " Tanauan"
        ],
        [
            " • Municipalities"
        ],
        [
            "29"
        ],
        [
            " Agoncillo"
        ],
        [
            " Alitagtag"
        ],
        [
            " Balayan"
        ],
        [
            " Balete"
        ],
        [
            " Bauan"
        ],
        [
            " Calatagan"
        ],
        [
            " Cuenca"
        ],
        [
            " Ibaan"
        ],
        [
            " Laurel"
        ],
        [
            " Lemery"
        ],
        [
            " Lian"
        ],
        [
            " Lobo"
        ],
        [
            " Mabini"
        ],
        [
            " Malvar"
        ],
        [
            " Mataasnakahoy"
        ],
        [
            " Nasugbu"
        ],
        [
            " Padre Garcia"
        ],
        [
            " Rosario"
        ],
        [
            " San Jose"
        ],
        [
            " San Juan"
        ],
        [
            " San Luis"
        ],
        [
            " San Nicolas"
        ],
        [
            " San Pascual"
        ],
        [
            " Santa Teresita"
        ],
        [
            " Taal"
        ],
        [
            " Talisay"
        ],
        [
            " Taysan"
        ],
        [
            " Tingloy"
        ],
        [
            " Tuy"
        ],
        [
            " • Barangays1,078 • DistrictsLegislative districts of BatangasDemographics • Ethnic groupsTagalog (99%)Others (1%)Time zoneUTC+8 (PHT)ZIP code4200–4234IDD : area code +63 (0)43ISO 3166 codePH-BTGSpoken languagesTagalog"
        ],
        [
            "(Batangueño dialect)EnglishWebsitewww.batangas.gov.ph"
        ],
        [
            "Batangas, officially the Province of Batangas (Tagalog: Lalawigan ng Batangas IPA: ), is a first class province of the Philippines located in the southwestern part of Luzon in the Calabarzon region.",
            "Its capital is the city of Batangas, and is bordered by the provinces of Cavite and Laguna to the north, and Quezon to the east.",
            "Across the Verde Island Passages to the south is the island of Mindoro and to the west lies the South China Sea.",
            "Poetically, Batangas is often referred to by its ancient name, Kumintáng."
        ],
        [
            "The province of Batangas was billed as the second richest province in the Philippines by the Commission on Audit by the year 2020.",
            "It has been the second richest province in the country for two consecutive years.",
            "In 2020, its provincial government posted a record high of ₱25.2 billion worth of assets, the largest in Calabarzon and the whole Luzon."
        ],
        [
            "Batangas is one of the most popular tourist destinations near Metro Manila.",
            "It is home to the well-known Taal Volcano, one of the Decade Volcanoes, and the small nearby town of Taal which keeps ancestral houses, churches, and other architecture dating back to the 19th century.",
            "The province also has numerous beaches and diving spots including Anilao in Mabini, Sombrero Island in Tingloy, Ligpo Island and Sampaguita Beach in Bauan, Matabungkay in Lian, Punta Fuego in Nasugbu, the municipality of Calatagan, and Laiya in San Juan.",
            "All of the marine waters of the province are part of the Verde Island Passage, the center of the world's marine biodiversity."
        ],
        [
            "Batangas City has the second largest international seaport in the Philippines after Metro Manila.",
            "The identification of the city as an industrial growth center in the region and being the focal point of the Calabarzon program is seen in the increasing number of business establishments in the city's Central Business District (CBD) as well as numerous industries operating in the province's industrial parks.",
            "Lipa City has passed Batangas City as the most populous city in the province."
        ],
        [
            "Etymology"
        ],
        [
            "The name Batangas is derived from the term batangan, which has two definitions: a log found in the Calumpang River, and rafts used to fish in Taal Lake."
        ],
        [
            "The Batangas dialect of Tagalog closely resembles the Old Tagalog spoken before the arrival of the Spanish.",
            "This is why the Summer Institute of Linguistics calls this province the center of the Tagalog language.",
            "The strong presence of Tagalog culture is evident to this day."
        ],
        [
            "Batangas also has one of the highest literacy rates in the country at 96.5%, with men having a slightly higher literacy rate at 97.1% compared to women at 95.9%.",
            "The combined average literacy rate is 96%."
        ],
        [
            "Historical precedents"
        ],
        [
            "\"Kumintang\" redirects here.",
            "For the Taiwanese political party, see Kuomintang."
        ],
        [
            "The first recorded name of the province was Kumintáng, whose political center was the present-day municipality (town) of Taal, prior to moving to the municipality of Balayan.",
            "Balayan was considered the most progressive town of the region.",
            "An eruption of Taal Volcano destroyed a significant portion of the town, causing residents to transfer to Bonbon (now Taal), the name eventually encompassing the bounds of the modern province."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Large centers of population already thrived along the coasts and rivers of present-day Batangas.",
            "Barangays lined the Pansipit River draining Bombon Lake (now Taal), a major waterway.",
            "The area was a major site for the Maritime Jade Road, one of the most extensive sea-based trade networks of a single geological material in the prehistoric world, operating for ~3,000 years from ~2000 BCE to ~1000 CE.",
            "Trading relations with other Philippine peoples, Borneo, Chinese, Japanese, among others were maintained."
        ],
        [
            "Archaeological findings and written accounts by the Spanish explorers in the mid-16th century show that pre-colonial Tagalogs have long histories in complex, stratified societies with trade networks encompassing Southeast and East Asia.",
            "This was shown by certain jewelry, made from a chambered nautilus shell, where tiny holes were created by a drill-like tool.",
            "The ancient peoples of present-day Batangas were influenced by trade with Indianized states and to a lesser degree China, as shown in many loanwords from Sanskrit and unearthed tradeware ceramics primarily from China and present-day Vietnam and Thailand.",
            "A Buddhist image unearthed in Calatagan was reproduced in mould on a clay medallion in bas-relief.",
            "According to experts, the image in the pot strongly resembles the iconographic portrayal of Buddha in Siam, India, and Nepal.",
            "The pot shows Buddha Amithāba in the tribhanga"
        ],
        [
            "One of the major archaeological finds was in January 1941, where two crude stone figures were found in Palapat, also in Calatagan.",
            "They were later donated to the National Museum.",
            "One of them was destroyed during World War II."
        ],
        [
            "Eighteen years later, a grave was excavated in nearby Punta Buaya.",
            "Pieces of brain coral were carved behind the heads of the 12 remains that were found.",
            "The site was named Likha (meaning \"create\").",
            "The remains were accompanied by furniture that could be traced as early as the 14th century.",
            "Potteries, as well as bracelets, stoneware, and metal objects were also found in the area, suggesting that the people who lived there had extensive contact with people from as far as China."
        ],
        [
            "The presence of dining utensils such as plates or \"chalices\" found with the remains also suggest that prehistoric Batangueños believed in the idea of life-after-death.",
            "Thus, the Batangueños, like their neighbors in other parts of Asia, have similar customs of burying furniture with the dead."
        ],
        [
            "Like the nearby tribes, the Batangan or the early Batangueños were a non-aggressive people.",
            "Partly because most of the tribes in their immediate environment were related to them by blood.",
            "Some weapons Batangans used included the bakyang (bows and arrows), the bangkaw (spears), and the suwan (bolo)."
        ],
        [
            "Being highly superstitious, the use of agimat (amulet or talisman) showed that these people believed in the presence of higher beings and other things unseen.",
            "The natives believed that forces of nature were a manifestation these higher beings."
        ],
        [
            "The term 'Tagalog' may have been derived from the word taga-ilog or \"river dwellers\" referring to the Pasig River located further up north of the region.",
            "However, Wang Teh-Ming in his writings on Sino-Filipino relations points out that Batangas was the real center of the Tagalogs, which he then identified as Ma-yi or Ma-i.",
            "According to the Chinese Imperial Annals, Ma-yi had its center in the province and extends to as far as present-day Cavite, Laguna, Rizal, Quezon, Bataan, Bulacan, Mindoro, Marinduque, Nueva Ecija, some parts of Zambales, and Tarlac.",
            "However, many historians interchangeably use the term Tagalog and Batangueño."
        ],
        [
            "Henry Otley Beyer, an American archaeologist, also showed in his studies that the early Batangueños had a special affinity with the precious stone known as the jade.",
            "He named the Late Paleolithic Period of the Philippines as the Batangas Period in recognition of the multitude of jade found in the excavated caves in the province.",
            "Beyer identified that the jade-cult reached the province as early as 800 B.C.",
            "and lasted until 200 B.C."
        ],
        [
            "Spanish colonial period"
        ],
        [
            "In 1570, Spanish generals Martin de Goiti and Juan de Salcedo explored the coast of Batangas on their way to Manila and came upon a settlement at the mouth of Pansipit River.",
            "In 1572, the town of Taal was founded and its convent and stone church were constructed later."
        ],
        [
            "Officially, the Province of Bonbon was founded by Spain in 1578, through Fr.",
            "Estaban Ortiz and Fr.",
            "Juan de Porras.",
            "It was named after the name that was given to it by the Muslim natives who inhabited the area."
        ],
        [
            "In 1581, the Spanish government abolished Bonbon Province and created a new province which came to be known as Balayan Province.",
            "The new province was composed of the present provinces of Batangas, Mindoro, Marinduque, southeast Laguna, southeast Quezon, and Camarines.",
            "After the devastating eruption of Taal Volcano in 1754, the old town of Taal, present day San Nicolas, was buried.",
            "The capital was eventually transferred to Batangas (now a city) for fear of further eruptions where it has remained to date."
        ],
        [
            "In the same years that de Goiti and Salcedo visited the province, the Franciscan missionaries came to Taal, which later became the first Spanish settlement in Batangas and one of the earliest in the Philippines.",
            "In 1572, the Augustinians founded Taal in the place of Wawa, now San Nicolas, and from there began preaching in Balayan and in all the big settlements around the lake of Bombon (Taal).",
            "The Augustinians, who were the first missionaries in the diocese, remained until the revolution against Spain.",
            "Among the first missionaries were eminent men, which included Alfonso de Albuquerque, Diego Espinas, Juan de Montojo, and others."
        ],
        [
            "During the first ten years, the whole region around the Lake of Bombon was completely Christianized.",
            "It was done through the preaching of men who had learned the first rudiments of the language of the people.",
            "At the same time, they started writing manuals of devotion in Tagalog, such as novenas, and had written the first Tagalog grammar that served other missionaries who came."
        ],
        [
            "Foundation of important parishes followed throughout the years: 1572, the Taal Parish was founded by the Augustinians; 1581, the Batangas Parish under Fray Diego Mexica; 1596, Bauan Parish administered by the Augustinian missionaries; 1605, Lipa Parish under the Augustinian administration; 1774, Balayan Parish was founded; By the end of the 1700s, Batangas had 15,014 native families and 451 Spanish Filipino families;: 31, 54, 113  1852, Nasugbu Parish was established; and 1868, Lemery Parish too."
        ],
        [
            "The town of Nasugbu became an important centre of trade during the Spanish occupation of the country.",
            "It was the site of the first recorded battle between two European Forces in Asia in Fortune Island, Nasugbu, Batangas.",
            "In the late part of the 20th century, the inhabitants of Fortune Island discovered a sunken galleon that contained materials sold in the Manila-Acapulco Galleon Trade."
        ],
        [
            "Batangas was also among the first of the eight Philippine provinces to revolt against Spain and one of the provinces placed under Martial Law by Spanish Governor-General Ramon Blanco on August 30, 1896.",
            "This event was given distinction when Marcela Agoncillo, also a native of the province, made the Philippine Flag, which bears a sun with eight rays to represent these eight provinces."
        ],
        [
            "American invasion era"
        ],
        [
            "Map of Batangas in 1918"
        ],
        [
            "When the Americans forbade the Philippine flag from being flown anywhere in the country, Batangas was one of the places where the revolutionaries chose to propagate their propaganda.",
            "Many, especially the revolutionary artists, chose Batangas as the place to perform their plays.",
            "In an incident recorded by Amelia Bonifacio in her diary, the performance of Tanikalang Ginto in the province led not only to the arrest of the company but all of the audience.",
            "Later, the play was banned from being shown anywhere in the country."
        ],
        [
            "General Miguel Malvar is recognized as the last Filipino general to surrender to the United States in the Philippine–American War."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "After the attack on Pearl Harbor on December 7, 1941, the Japanese sent their planes to attack the Philippines, launching major air raids throughout the country.",
            "The bombings resulted in the destruction of the Batangas Airport located in Batangas City, of which nothing remains today."
        ],
        [
            "When Gen. Douglas MacArthur ordered the overall retreat of the American-Filipino Forces to Bataan in 1942, the province was ultimately abandoned and later came under direct Japanese occupation.",
            "During this time, the Imperial Japanese Army committed many crimes against civilians including the massacre of 328 people in Bauan, 320 in Taal, 300 in Cuenca, 107 in San Jose, and 39 in Lucero."
        ],
        [
            "Liberation"
        ],
        [
            "XIV Corps of 158th RCT, 11th Airborne Division and 1st Cavalry Division campaign in Batangas and nearby province."
        ],
        [
            "As part of the Philippines Campaign (1944–45), the province's liberation began on January 31, 1945, when elements of the 11th Airborne Division, part of the U.S. Eighth Army went ashore at Nasugbu, Batangas.",
            "However, Batangas was not the main objective of the invasion force.",
            "Instead, most of its units headed north to capture Manila, and by March 3, the capital was completely secured."
        ],
        [
            "Liberation of Batangas proper by American forces began in March 1945 by the 11th Airborne Division and the 158th Regimental Combat Team (RCT)."
        ],
        [
            "Afterwards, the 158th RCT turned northward to meet the Japanese Fuji Force defenses at Mt.",
            "Maculot in Cuenca on March 19.",
            "The 158th disengaged from the Japanese on March 23 and were relieved by the 11th Airborne's 187th Glider Infantry Regiment.",
            "Another 11th Airborne Division task force, the 188th Infantry was ordered to dispatch troops around Batangas City and its remaining frontiers."
        ],
        [
            "Lipa after being Liberated by the Allied Forces"
        ],
        [
            "The last major offensive for the capture of the Lipa Corridor began when 188th Infantry Task Force from Batangas City left for Lipa on March 24."
        ],
        [
            "The 188th Infantry met stiff resistance from Fuji Force's 86th Airfield Battalion on March 26.",
            "To the north, the 1st Cavalry attacked the remaining Japanese defenses in the towns of Santo Tomas and Tanauan and succeeded in linking up with the advancing 187th and 188th task forces from the south."
        ],
        [
            "With the capture of Lipa and Mt.",
            "Malepunyo, organized resistance ended in the province.",
            "Some elements of the 188th Infantry Task Force were left to clear the Batangas mountains located southeast of the province from the remaining Japanese."
        ],
        [
            "Throughout the battle, recognized Filipino guerrilla fighters played an important key role in the advancement of the combined American and Philippine Commonwealth troops, providing key roads and intelligence on the location of Japanese defenses and movements.",
            "The 11th Airborne and attached Filipino guerrillas had 390 casualties, of which 90 were killed.",
            "The Japanese, however, lost 1,490 men.",
            "By the end of April 1945, Batangas was liberated and fully secured under Allied control, thus ending all hostilities."
        ],
        [
            "The movements of the military general headquarters and military camps of the Philippine Commonwealth Army happened from January 3, 1942, to June 30, 1946, and included the province of Batangas.",
            "During the engagements of the Anti-Japanese Imperial Military Operations in Manila, southern Luzon, Mindoro, and Palawan from 1942 to 1945, (including the provinces of Rizal, Cavite, Laguna, Batangas, Mindoro, and Palawan), units of the Philippine Constabulary, with the local guerrilla resistance joined with the U.S. liberation military forces against the Imperial Japanese armed forces."
        ],
        [
            "Under the Southern Luzon Campaign, local Filipino soldiers of the 4th, 42nd, 43rd, 45th, and 46th Infantry Divisions of the Philippine Commonwealth Army and 4th Constabulary Regiment of the Philippine Constabulary joined the battle for the liberation of Batangas."
        ],
        [
            "Philippine independence"
        ],
        [
            "After Douglas MacArthur made his famous landing in the Island of Leyte, he came next to the town of Nasugbu to mark the liberation of Luzon.",
            "This historic landing is remembered by the people of Batangas every last day of January, a holiday for the Nasugbugueños."
        ],
        [
            "Former official seal of Batangas Province, designed and in use since 1950.",
            "It was replaced in 2009 during Vilma Santos's tenure as governor."
        ],
        [
            "After the United States of America relinquished control of the Philippines, statesmen from Batangas featured prominently in the government.",
            "These include the legislators Felipe Agoncillo, Galicano Apacible (who later became the Secretary of Agriculture), Ramon Diokno, Apolinario R. Apacible, Expedito Leviste, Gregorio Katigbak, Teodoro Kalaw, Claro M. Recto, and José Laurel, Jr."
        ],
        [
            "It is also notable that when President Manuel L. Quezon left the Philippines during the Japanese Occupation, the Japanese government in the Philippines chose the Batangueño José Laurel, Sr. to be the president of the Japanese-sponsored Second Philippine Republic."
        ],
        [
            "Under the Marcos Presidency"
        ],
        [
            "Batangueños were not spared the social and economic turmoil that began during the second term of President Ferdinand Marcos, including his 1971 suspension of the writ of habeas corpus, his 1972 declaration of martial law, and his continued hold on power from the lifting of martial law in 1981 until his ouster under the People Power Revolution of 1986."
        ],
        [
            "Prominent Batangueño Senator Jose W. Diokno was one of the first people Marcos imprisoned without charges,"
        ],
        [
            "In 1981, Marcos used his Presidential “power of eminent domain” to convert 167 hectares of agricultural lands in San Rafael, Calaca, for industrial use, paving the way for the construction of the Semirara Calaca power plant regardless of its health and environmental impact."
        ],
        [
            "Among the later victims of the regime were student leaders Ismael Umali, Noel Clarete, and Aurelio Magpantay from Western Philippine Colleges in Batangas City, who disappeared after a protest rally in March 1984, and whose mangled bodies were later discovered abandoned in nearby Cavite province."
        ],
        [
            "Contemporary"
        ],
        [
            "After the ouster of Ferdinand Marcos and the creation of the Fifth Philippine Republic, numerous Batanguenos took up prominent positions in government - most prominently Salvador Laurel, who became Vice President of the Philippines under the first Aquino administration, and Renato Corona, who became Chief Justice of the Supreme Court of the Philippines."
        ],
        [
            "Geography"
        ],
        [
            "Political division"
        ],
        [
            "Taal Volcano"
        ],
        [
            "Batangas' landscape is largely of plains dotted by mountains, including one of the world's smallest volcanoes, Mt.",
            "Taal, with an elevation of 600 metres (2,000 ft), located in the middle of the Taal Lake.",
            "Other important peaks are Mount Macolod with an elevation of 830 metres (2,720 ft), Mt.",
            "Banoy with 960 metres (3,150 ft), Mt.",
            "Talamitam with 700 metres (2,300 ft), Mt.",
            "Pico de Loro with 664 metres (2,178 ft), Mt.",
            "Batulao with 693 metres (2,274 ft), Mt.",
            "Manabo with 830 metres (2,720 ft), and Mt.",
            "Daguldol with 672 metres (2,205 ft)."
        ],
        [
            "Batangas has several islands, including Tingloy, Verde Island (Isla Verde), and Fortune Island of Nasugbu."
        ],
        [
            "According to Guinness World Records, the largest island in a lake on an island is situated in Batangas (particularly at Vulcan Point in Crater Lake, which rests in the middle of Taal Island in Lake Taal, on the island of Luzon)."
        ],
        [
            "Flora and fauna"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(January 2023) (Learn how and when to remove this message)"
        ],
        [
            "The malabayabas, or Philippine teak, is endemic to Batangas.",
            "The province is also home to the kabag (Haplonycteris fischeri), one of the world's smallest fruit bats.",
            "In the municipality of Nasugbu, wild deer still inhabit the remote areas of barangays Looc, Papaya, Bulihan, and Dayap."
        ],
        [
            "In the second half of 2006, scientists from the United States discovered that the Coral Triangle has its centre at the Isla Verde Passage, a part of the province.",
            "According to the study made by American marine biologist Kent Carpenter, Batangas seas host more than half of the world's species of coral.",
            "It is also home to dolphins and once in a while, the passage of the world's biggest fish: the whale shark or the butanding, as the locals call it may be observed.",
            "The municipality of San Juan has a resident marine turtle or pawikan.",
            "Pawikans like the Olive ridley sea turtle, leather back sea turtle, and green sea turtle can be seen in Nasugbu up to the present."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Batangas comprises 29 municipalities and 5 cities.",
            "In land terms, Nasugbu is the largest municipality in Batangas with over 278.51km² while San Nicolas is the smallest municipality with  22.61 km².",
            "In population density, Taal is the most densely populated with over 2,066 people per km² but Lobo is the least densely populated with over 230 people per km²."
        ],
        [
            " †  Provincial capital and component city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Agoncillo"
        ],
        [
            "3rd"
        ],
        [
            "1.3%"
        ],
        [
            "39,101"
        ],
        [
            "38,059"
        ],
        [
            "0.52%"
        ],
        [
            "49.96"
        ],
        [
            "19.29"
        ],
        [
            "780"
        ],
        [
            "2,000"
        ],
        [
            "21"
        ],
        [
            "13°56′05″N 120°55′43″E﻿ / ﻿13.9348°N 120.9285°E﻿ / 13.9348; 120.9285﻿ (Agoncillo)"
        ],
        [
            "Alitagtag"
        ],
        [
            "3rd"
        ],
        [
            "0.9%"
        ],
        [
            "26,819"
        ],
        [
            "25,300"
        ],
        [
            "1.12%"
        ],
        [
            "24.76"
        ],
        [
            "9.56"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "19"
        ],
        [
            "13°51′55″N 121°00′17″E﻿ / ﻿13.8653°N 121.0046°E﻿ / 13.8653; 121.0046﻿ (Alitagtag)"
        ],
        [
            "Balayan"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "95,913"
        ],
        [
            "90,699"
        ],
        [
            "1.07%"
        ],
        [
            "108.73"
        ],
        [
            "41.98"
        ],
        [
            "880"
        ],
        [
            "2,300"
        ],
        [
            "48"
        ],
        [
            "13°57′01″N 120°44′00″E﻿ / ﻿13.9503°N 120.7334°E﻿ / 13.9503; 120.7334﻿ (Balayan)"
        ],
        [
            "Balete"
        ],
        [
            "3rd"
        ],
        [
            "0.8%"
        ],
        [
            "24,055"
        ],
        [
            "22,661"
        ],
        [
            "1.14%"
        ],
        [
            "25.00"
        ],
        [
            "9.65"
        ],
        [
            "960"
        ],
        [
            "2,500"
        ],
        [
            "13"
        ],
        [
            "14°01′00″N 121°05′59″E﻿ / ﻿14.0168°N 121.0998°E﻿ / 14.0168; 121.0998﻿ (Balete)"
        ],
        [
            "Batangas City"
        ],
        [
            "†"
        ],
        [
            "Lone"
        ],
        [
            "12.1%"
        ],
        [
            "351,437"
        ],
        [
            "329,874"
        ],
        [
            "0.45%"
        ],
        [
            "282.96"
        ],
        [
            "109.25"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "105"
        ],
        [
            "13°45′22″N 121°03′28″E﻿ / ﻿13.7561°N 121.0577°E﻿ / 13.7561; 121.0577﻿ (Batangas City)"
        ],
        [
            "Bauan"
        ],
        [
            "2nd"
        ],
        [
            "3.1%"
        ],
        [
            "90,819"
        ],
        [
            "91,297"
        ],
        [
            "−0.10%"
        ],
        [
            "53.31"
        ],
        [
            "20.58"
        ],
        [
            "1,700"
        ],
        [
            "4,400"
        ],
        [
            "40"
        ],
        [
            "13°47′33″N 121°00′27″E﻿ / ﻿13.7925°N 121.0076°E﻿ / 13.7925; 121.0076﻿ (Bauan)"
        ],
        [
            "Calaca"
        ],
        [
            "∗"
        ],
        [
            "1st"
        ],
        [
            "3.0%"
        ],
        [
            "87,361"
        ],
        [
            "81,859"
        ],
        [
            "1.22%"
        ],
        [
            "114.58"
        ],
        [
            "44.24"
        ],
        [
            "760"
        ],
        [
            "2,000"
        ],
        [
            "40"
        ],
        [
            "13°55′49″N 120°48′46″E﻿ / ﻿13.9304°N 120.8128°E﻿ / 13.9304; 120.8128﻿ (Calaca)"
        ],
        [
            "Calatagan"
        ],
        [
            "1st"
        ],
        [
            "2.0%"
        ],
        [
            "58,719"
        ],
        [
            "56,449"
        ],
        [
            "0.75%"
        ],
        [
            "101.50"
        ],
        [
            "39.19"
        ],
        [
            "580"
        ],
        [
            "1,500"
        ],
        [
            "25"
        ],
        [
            "13°49′58″N 120°37′56″E﻿ / ﻿13.8329°N 120.6322°E﻿ / 13.8329; 120.6322﻿ (Calatagan)"
        ],
        [
            "Cuenca"
        ],
        [
            "3rd"
        ],
        [
            "1.2%"
        ],
        [
            "36,235"
        ],
        [
            "32,783"
        ],
        [
            "1.92%"
        ],
        [
            "58.18"
        ],
        [
            "22.46"
        ],
        [
            "620"
        ],
        [
            "1,600"
        ],
        [
            "21"
        ],
        [
            "13°54′05″N 121°02′57″E﻿ / ﻿13.9015°N 121.0492°E﻿ / 13.9015; 121.0492﻿ (Cuenca)"
        ],
        [
            "Ibaan"
        ],
        [
            "4th"
        ],
        [
            "2.0%"
        ],
        [
            "58,507"
        ],
        [
            "52,970"
        ],
        [
            "1.91%"
        ],
        [
            "68.99"
        ],
        [
            "26.64"
        ],
        [
            "850"
        ],
        [
            "2,200"
        ],
        [
            "26"
        ],
        [
            "13°49′11″N 121°08′09″E﻿ / ﻿13.8196°N 121.1358°E﻿ / 13.8196; 121.1358﻿ (Ibaan)"
        ],
        [
            "Laurel"
        ],
        [
            "3rd"
        ],
        [
            "1.5%"
        ],
        [
            "43,210"
        ],
        [
            "39,444"
        ],
        [
            "1.75%"
        ],
        [
            "71.29"
        ],
        [
            "27.53"
        ],
        [
            "610"
        ],
        [
            "1,600"
        ],
        [
            "21"
        ],
        [
            "14°03′01″N 120°56′00″E﻿ / ﻿14.0504°N 120.9332°E﻿ / 14.0504; 120.9332﻿ (Laurel)"
        ],
        [
            "Lemery"
        ],
        [
            "1st"
        ],
        [
            "3.2%"
        ],
        [
            "93,186"
        ],
        [
            "93,157"
        ],
        [
            "0.01%"
        ],
        [
            "109.80"
        ],
        [
            "42.39"
        ],
        [
            "850"
        ],
        [
            "2,200"
        ],
        [
            "46"
        ],
        [
            "13°53′01″N 120°54′48″E﻿ / ﻿13.8837°N 120.9132°E﻿ / 13.8837; 120.9132﻿ (Lemery)"
        ],
        [
            "Lian"
        ],
        [
            "1st"
        ],
        [
            "1.9%"
        ],
        [
            "56,280"
        ],
        [
            "52,660"
        ],
        [
            "1.27%"
        ],
        [
            "76.80"
        ],
        [
            "29.65"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "19"
        ],
        [
            "14°02′09″N 120°39′12″E﻿ / ﻿14.0357°N 120.6534°E﻿ / 14.0357; 120.6534﻿ (Lian)"
        ],
        [
            "Lipa"
        ],
        [
            "∗"
        ],
        [
            "Lone"
        ],
        [
            "12.8%"
        ],
        [
            "372,931"
        ],
        [
            "332,386"
        ],
        [
            "2.22%"
        ],
        [
            "209.40"
        ],
        [
            "80.85"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "72"
        ],
        [
            "13°56′29″N 121°09′51″E﻿ / ﻿13.9414°N 121.1642°E﻿ / 13.9414; 121.1642﻿ (Lipa)"
        ],
        [
            "Lobo"
        ],
        [
            "2nd"
        ],
        [
            "1.4%"
        ],
        [
            "40,736"
        ],
        [
            "41,504"
        ],
        [
            "−0.35%"
        ],
        [
            "175.03"
        ],
        [
            "67.58"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "26"
        ],
        [
            "13°38′50″N 121°12′36″E﻿ / ﻿13.6473°N 121.2100°E﻿ / 13.6473; 121.2100﻿ (Lobo)"
        ],
        [
            "Mabini"
        ],
        [
            "2nd"
        ],
        [
            "1.7%"
        ],
        [
            "50,858"
        ],
        [
            "46,211"
        ],
        [
            "1.84%"
        ],
        [
            "44.47"
        ],
        [
            "17.17"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "34"
        ],
        [
            "13°44′51″N 120°56′28″E﻿ / ﻿13.7476°N 120.9412°E﻿ / 13.7476; 120.9412﻿ (Mabini)"
        ],
        [
            "Malvar"
        ],
        [
            "3rd"
        ],
        [
            "2.2%"
        ],
        [
            "64,379"
        ],
        [
            "56,270"
        ],
        [
            "2.60%"
        ],
        [
            "33.00"
        ],
        [
            "12.74"
        ],
        [
            "2,000"
        ],
        [
            "5,200"
        ],
        [
            "15"
        ],
        [
            "14°03′15″N 121°09′17″E﻿ / ﻿14.0542°N 121.1548°E﻿ / 14.0542; 121.1548﻿ (Malvar)"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "3rd"
        ],
        [
            "1.1%"
        ],
        [
            "30,621"
        ],
        [
            "29,187"
        ],
        [
            "0.92%"
        ],
        [
            "19.66"
        ],
        [
            "7.59"
        ],
        [
            "1,600"
        ],
        [
            "4,100"
        ],
        [
            "16"
        ],
        [
            "13°57′45″N 121°06′49″E﻿ / ﻿13.9625°N 121.1137°E﻿ / 13.9625; 121.1137﻿ (Mataas na Kahoy)"
        ],
        [
            "Nasugbu"
        ],
        [
            "1st"
        ],
        [
            "4.7%"
        ],
        [
            "136,524"
        ],
        [
            "134,113"
        ],
        [
            "0.34%"
        ],
        [
            "278.51"
        ],
        [
            "107.53"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "42"
        ],
        [
            "14°04′24″N 120°37′56″E﻿ / ﻿14.0734°N 120.6322°E﻿ / 14.0734; 120.6322﻿ (Nasugbu)"
        ],
        [
            "Padre Garcia"
        ],
        [
            "4th"
        ],
        [
            "1.8%"
        ],
        [
            "51,853"
        ],
        [
            "48,302"
        ],
        [
            "0.50%"
        ],
        [
            "41.51"
        ],
        [
            "16.03"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "18"
        ],
        [
            "13°52′40″N 121°12′42″E﻿ / ﻿13.8777°N 121.2116°E﻿ / 13.8777; 121.2116﻿ (Padre Garcia)"
        ],
        [
            "Rosario"
        ],
        [
            "4th"
        ],
        [
            "4.4%"
        ],
        [
            "128,352"
        ],
        [
            "116,764"
        ],
        [
            "1.82%"
        ],
        [
            "226.88"
        ],
        [
            "87.60"
        ],
        [
            "570"
        ],
        [
            "1,500"
        ],
        [
            "48"
        ],
        [
            "13°50′39″N 121°12′13″E﻿ / ﻿13.8442°N 121.2035°E﻿ / 13.8442; 121.2035﻿ (Rosario)"
        ],
        [
            "San Jose"
        ],
        [
            "4th"
        ],
        [
            "2.7%"
        ],
        [
            "79,868"
        ],
        [
            "76,971"
        ],
        [
            "0.71%"
        ],
        [
            "53.29"
        ],
        [
            "20.58"
        ],
        [
            "1,500"
        ],
        [
            "3,900"
        ],
        [
            "33"
        ],
        [
            "13°52′49″N 121°06′07″E﻿ / ﻿13.8802°N 121.1019°E﻿ / 13.8802; 121.1019﻿ (San Jose)"
        ],
        [
            "San Juan"
        ],
        [
            "4th"
        ],
        [
            "3.9%"
        ],
        [
            "114,068"
        ],
        [
            "108,585"
        ],
        [
            "0.94%"
        ],
        [
            "273.40"
        ],
        [
            "105.56"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "42"
        ],
        [
            "13°49′29″N 121°23′46″E﻿ / ﻿13.8246°N 121.3962°E﻿ / 13.8246; 121.3962﻿ (San Juan)"
        ],
        [
            "San Luis"
        ],
        [
            "2nd"
        ],
        [
            "1.2%"
        ],
        [
            "36,172"
        ],
        [
            "33,149"
        ],
        [
            "1.68%"
        ],
        [
            "42.56"
        ],
        [
            "16.43"
        ],
        [
            "850"
        ],
        [
            "2,200"
        ],
        [
            "26"
        ],
        [
            "13°51′31″N 120°54′59″E﻿ / ﻿13.8585°N 120.9163°E﻿ / 13.8585; 120.9163﻿ (San Luis)"
        ],
        [
            "San Nicolas"
        ],
        [
            "3rd"
        ],
        [
            "0.8%"
        ],
        [
            "23,908"
        ],
        [
            "22,623"
        ],
        [
            "1.06%"
        ],
        [
            "22.61"
        ],
        [
            "8.73"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "18"
        ],
        [
            "13°55′49″N 120°57′08″E﻿ / ﻿13.9302°N 120.9521°E﻿ / 13.9302; 120.9521﻿ (San Nicolas)"
        ],
        [
            "San Pascual"
        ],
        [
            "2nd"
        ],
        [
            "2.4%"
        ],
        [
            "69,009"
        ],
        [
            "65,424"
        ],
        [
            "1.02%"
        ],
        [
            "50.70"
        ],
        [
            "19.58"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "29"
        ],
        [
            "13°47′04″N 121°01′49″E﻿ / ﻿13.7844°N 121.0302°E﻿ / 13.7844; 121.0302﻿ (San Pascual)"
        ],
        [
            "Santa Teresita"
        ],
        [
            "3rd"
        ],
        [
            "0.7%"
        ],
        [
            "21,559"
        ],
        [
            "21,127"
        ],
        [
            "0.39%"
        ],
        [
            "16.30"
        ],
        [
            "6.29"
        ],
        [
            "1,300"
        ],
        [
            "3,400"
        ],
        [
            "17"
        ],
        [
            "13°52′11″N 120°58′37″E﻿ / ﻿13.8698°N 120.9769°E﻿ / 13.8698; 120.9769﻿ (Santa Teresita)"
        ],
        [
            "Santo Tomas"
        ],
        [
            "∗"
        ],
        [
            "3rd"
        ],
        [
            "7.5%"
        ],
        [
            "218,500"
        ],
        [
            "179,844"
        ],
        [
            "3.78%"
        ],
        [
            "95.41"
        ],
        [
            "36.84"
        ],
        [
            "2,300"
        ],
        [
            "6,000"
        ],
        [
            "30"
        ],
        [
            "14°06′24″N 121°09′42″E﻿ / ﻿14.1068°N 121.1616°E﻿ / 14.1068; 121.1616﻿ (Santo Tomas)"
        ],
        [
            "Taal"
        ],
        [
            "1st"
        ],
        [
            "2.1%"
        ],
        [
            "61,460"
        ],
        [
            "56,327"
        ],
        [
            "1.67%"
        ],
        [
            "29.76"
        ],
        [
            "11.49"
        ],
        [
            "2,100"
        ],
        [
            "5,400"
        ],
        [
            "42"
        ],
        [
            "13°52′49″N 120°55′26″E﻿ / ﻿13.8803°N 120.9238°E﻿ / 13.8803; 120.9238﻿ (Taal)"
        ],
        [
            "Talisay"
        ],
        [
            "3rd"
        ],
        [
            "1.6%"
        ],
        [
            "46,238"
        ],
        [
            "45,301"
        ],
        [
            "0.39%"
        ],
        [
            "28.20"
        ],
        [
            "10.89"
        ],
        [
            "1,600"
        ],
        [
            "4,100"
        ],
        [
            "21"
        ],
        [
            "14°05′40″N 121°01′19″E﻿ / ﻿14.0944°N 121.0219°E﻿ / 14.0944; 121.0219﻿ (Talisay)"
        ],
        [
            "Tanauan"
        ],
        [
            "∗"
        ],
        [
            "3rd"
        ],
        [
            "6.7%"
        ],
        [
            "193,936"
        ],
        [
            "173,366"
        ],
        [
            "2.16%"
        ],
        [
            "107.16"
        ],
        [
            "41.37"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "48"
        ],
        [
            "14°05′07″N 121°09′10″E﻿ / ﻿14.0853°N 121.1528°E﻿ / 14.0853; 121.1528﻿ (Tanauan)"
        ],
        [
            "Taysan"
        ],
        [
            "4th"
        ],
        [
            "1.4%"
        ],
        [
            "40,146"
        ],
        [
            "38,007"
        ],
        [
            "1.05%"
        ],
        [
            "93.62"
        ],
        [
            "36.15"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "20"
        ],
        [
            "13°47′48″N 121°11′19″E﻿ / ﻿13.7968°N 121.1885°E﻿ / 13.7968; 121.1885﻿ (Taysan)"
        ],
        [
            "Tingloy"
        ],
        [
            "2nd"
        ],
        [
            "0.7%"
        ],
        [
            "19,215"
        ],
        [
            "17,919"
        ],
        [
            "1.34%"
        ],
        [
            "33.07"
        ],
        [
            "12.77"
        ],
        [
            "580"
        ],
        [
            "1,500"
        ],
        [
            "15"
        ],
        [
            "13°39′33″N 120°52′24″E﻿ / ﻿13.6592°N 120.8734°E﻿ / 13.6592; 120.8734﻿ (Tingloy)"
        ],
        [
            "Tuy"
        ],
        [
            "1st"
        ],
        [
            "1.6%"
        ],
        [
            "46,519"
        ],
        [
            "43,743"
        ],
        [
            "1.18%"
        ],
        [
            "94.65"
        ],
        [
            "36.54"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "22"
        ],
        [
            "14°01′19″N 120°43′48″E﻿ / ﻿14.0219°N 120.7299°E﻿ / 14.0219; 120.7299﻿ (Tuy)"
        ],
        [
            "Total"
        ],
        [
            "2,908,494"
        ],
        [
            "2,694,335"
        ],
        [
            "1.47%"
        ],
        [
            "3,115.05"
        ],
        [
            "1,202.73"
        ],
        [
            "930"
        ],
        [
            "2,400"
        ],
        [
            "1,078"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Climate"
        ],
        [
            "Batangas falls under two climates: the tropical savanna climate (As/Aw) and the bordering tropical monsoon climate (Am), under the Köppen climate classification.",
            "The same geographical divide is also labelled as Type I and Type III, respectively, under the PAGASA climate classification.",
            "Most of the province belongs to the tropical former, with well-defined dry and wet seasons, while parts lying to the east belong to the latter, with unpronounced dry and wet seasons influenced by the monsoons.",
            "Batangas City, the provincial capital, belongs to the tropical savanna climate, but is strongly influenced by the bordering monsoon climate, characterized by short dry seasons and longer wet seasons.",
            "Typhoons are a periodic occurrence especially during the southwest monsoon (habagat)."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BatangasYearPop.±% p.a.1903 257,715—    1918 340,199+1.87%1939 442,034+1.25%1948 510,224+1.61%1960 681,414+2.44%YearPop.±% p.a.1970 926,308+3.11%1975 1,032,009+2.19%1980 1,174,201+2.61%1990 1,476,783+2.32%1995 1,658,567+2.20%YearPop.±% p.a.2000 1,905,348+3.02%2007 2,245,869+2.29%2010 2,377,395+2.09%2015 2,694,335+2.41%2020 2,908,494+1.52%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Batangas in the 2020 census was 2,908,494 people, with a density of 930 inhabitants per square kilometre or 2,400 inhabitants per square mile."
        ],
        [
            "Tagalogs are the predominant people in Batangas, being the native settlers in the province, distantly followed by Bicolanos, Visayans, Kapampangans, Pangasinenses, and Ilocanos, as well as Maguindanaons, Maranaos, Tausugs and other ethnolinguistic groups from Mindanao."
        ],
        [
            "Batangas also has one of the highest literacy rates in the country at 96.5%, with males having a slightly higher literacy rate at 97.1% than females with 95.9%.",
            "Combined average literacy rate is 96%."
        ],
        [
            "Language"
        ],
        [
            "Main article: Batangas Tagalog"
        ],
        [
            "The dialect of Tagalog spoken in the province closely resembles the Old Tagalog spoken before the arrival of the Spanish.",
            "Hence, the Summer Institute of Linguistics  called this province the heartland of the Tagalog language.",
            "A strong presence of the Tagalog culture is visible up to the present day.",
            "Many educated Batangueños speak a version of Tagalog from the Spanish colonial era but with English terms, as in modern Filipino or standard Tagalog, because of mass media and modern versions of the Tagalog Bible."
        ],
        [
            "Linguistically, Batangueños are also known for their unique affectation of often placing the particles eh or ga (equivalent to the particle ba in Filipino), usually as a marker of stress on the sentence, at the end of their spoken sentences or speech; for example: \"Ay, oo nga, eh!\"",
            "(\"Aye, yes, indeed!\").",
            "Some even prolong the particle 'eh' into 'ala eh', though this has no meaning in itself."
        ],
        [
            "English is widely understood in the province.",
            "Spanish is also understood to some extent, especially by older-generation people in the towns of Nasugbu, Taal, and Lemery, which still have Spanish-speaking minorities.",
            "Bicolano, Kapampangan, Ilocano, Visayan, Maguindanaon, Maranao and Tausug are also spoken by a minority due to the influx of migrants from the Bicol Region, Ilocos Region, Cordillera Administrative Region, Cagayan Valley, Central Luzon, Visayas and Mindanao."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Catholicism"
        ],
        [
            "The majority of Batangas' population are religiously affiliated with Roman Catholicism, and Iglesia Filipina Independiente."
        ],
        [
            "Others"
        ],
        [
            "Other groups include Members Church of God International (MCGI),  Other major religions include Islam, Buddhism, Seventh-day Adventist Church, Jesus Is Lord Church Worldwide, Protestantism, Jehovah's Witnesses, and the Church of Jesus Christ of Latter-day Saints."
        ],
        [
            "Economy"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(February 2009) (Learn how and when to remove this message)"
        ],
        [
            "This article needs to be updated.",
            "Please help update this article to reflect recent events or newly available information.",
            "(July 2016)"
        ],
        [
            "Poverty incidence of Batangas"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  14.41"
        ],
        [
            "2009  17.08"
        ],
        [
            "2012  19.04"
        ],
        [
            "2015  22.32"
        ],
        [
            "2018  11.43"
        ],
        [
            "2021  4.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The province of Batangas was billed as the second richest province in the Philippines by the Commission on Audit by year 2020.",
            "It has been the second richest province in the country for two consecutive years.",
            "In 2020, its provincial government posted a record high of ₱25.2 billion worth of assets, the largest in Calabarzon and the whole Luzon."
        ],
        [
            "Products"
        ],
        [
            "Batangas is known for its butterfly knives, locally known as balisong, with its manufacture also becoming an industry in the province."
        ],
        [
            "Agriculture and fisheries"
        ],
        [
            "Pineapples are also common in Batangas.",
            "Aside from the fruit, the leaves are also useful such that an industry has been created from it.",
            "Pineapple leaves fibers are processed to form a silk-like fabric known as piña, from which the barong tagalog, the national costume of the Philippines is made."
        ],
        [
            "Livestock as an industry also thrives in Batangas.",
            "The term bakang Batangas (literally \"Batangas cow\") is associated with the country's best species of cattle, and are widely sought throughout the country.",
            "Cattle raising is widely practiced in Batangas such that every Saturday is an auction day in the municipalities of San Juan, Bauan and Padre Garcia."
        ],
        [
            "Fishing plays a very important part of the economy of the province.",
            "Although the tuna industry in the country is centered in General Santos, Batangas is also known for the smaller species of the said fish.",
            "The locals even have their own names for it.",
            "Some of them are bigeye tuna (tambakol), yellowfin tuna (berberabe), tambakulis, Pacific bluefin tuna (tulingan), bullet tuna (bonito) and another species also called bonito but actually Gymnosarda unicolor.",
            "There is also an important industry for the wahoo (tanigi)."
        ],
        [
            "Aside from the South China Sea, Taal Lake also provides a source of freshwater fishes to the country.",
            "The lake is home to Sardinella tawilis or simply tawilis, a species of freshwater sardine that is endemic to the lake.",
            "Taal Lake also provides farmed Chanos chanos or bangus.",
            "There is also a good volume of Oreochromis niloticus niloticus and Oreochromis aureus, both locally called tilapia.",
            "It is ecologically important to note that neither bangus nor tilapia are native to the lake, and are considered an invasive species."
        ],
        [
            "Sugar is also a major industry.",
            "After Hacienda Luisita, the country's former largest sugar producer, was broken-up for land reform, the municipality of Nasugbu has been the home of the current largest sugar producing company, the Central Azucarera de Don Pedro.",
            "Rice cakes and sweets are also a strong industry."
        ],
        [
            "Some towns (those adjacent to Laguna) have a prosperous bamboo based industry, where several houses and furniture are made of bamboo.",
            "Natives say that food cooked in bamboo has an added scent and flavor.",
            "Labong, or bamboo shoots, is cooked with coconut milk or with other ingredients to make a Batangas delicacy."
        ],
        [
            "Industries"
        ],
        [
            "Batangas houses 5 industrial parks registered under the Philippine Economic Zone Authority (PEZA), which are concentrated along the route of STAR Tollway and Jose P. Laurel Highway.",
            "The largest of those industrial parks are LIMA Technology Center, a 500-hectare (1,200-acre) commercial and industrial zone oriented to tech companies at Lipa and Malvar, and the First Philippine Industrial Park (FPIP), with over 350 hectares (860 acres) at Santo Tomas and Tanauan, and Light Industry and Science Park IV (LISP IV), a live-work community with 170-hectare industrial area located at the heart of Malvar, Batangas."
        ],
        [
            "Batangas City and the nearby municipalities of San Pascual, Bauan, and Mabini also have large-scale industrial activity connected with their seaside location, including power generation, oil and gas processing and transhipment, and ship repairs."
        ],
        [
            "Government"
        ],
        [
            "GovernorHermilando MandanasVice GovernorMark Leviste"
        ],
        [
            "The Provincial Capitol of Batangas"
        ],
        [
            "With the provinces in the island of Panay, Ilocos Sur and Pampanga, Batangas was one of the earliest provinces established by the Spaniards who settled in the country.",
            "It was headed by Martin de Goiti and since then has become one of the most important regions of the Philippines.",
            "Batangas first came to be known as Bonbon.",
            "It was named after Taal Lake, which was also originally called Bonbon.",
            "Some of the earliest settlements in Batangas were established in the vicinity of Taal Lake.",
            "In 1534, Batangas became the first practically organized province in Luzon.",
            "Balayan was the capital of the province for 135 years from 1597 to 1732.",
            "In 1732, it was moved to Taal, then the flourishing and most progressive town in the province, it wasn't until 1754 that the capital was destroyed by the Great Taal Eruption of 1754.",
            "It was in 1889 that the capital was moved to the present, Batangas City."
        ],
        [
            "Batangas has been called by some Philippine historians as the \"Cradle of Noble Heroes\", citing the notable number of people from it who were declared Philippine national heroes and those who became leaders of the country.",
            "Among them are Teodoro M. Kalaw, Apolinario Mabini, Jose Laurel, and Felipe Agoncillo."
        ],
        [
            "Incumbent officials"
        ],
        [
            "Governor: Hermilando I. Mandanas (PDP–Laban)"
        ],
        [
            "Vice Governor: Jose Antonio S. Leviste II (PDP–Laban)"
        ],
        [
            "Board Members:"
        ],
        [
            "Representation"
        ],
        [
            "Name"
        ],
        [
            "Name"
        ],
        [
            "First District"
        ],
        [
            "Carlo Roman G. Rosales (NP/One Batangas)"
        ],
        [
            "Armie Marie C. Bausas (NP/One Batangas)"
        ],
        [
            "Second District"
        ],
        [
            "Arlina B. Magboo (Aksyon/One Batangas)"
        ],
        [
            "Wilson Leonardo T. Rivera (NP/One Batangas)"
        ],
        [
            "Third District"
        ],
        [
            "Alfredo C. Corona (NPC/One Batangas)"
        ],
        [
            "Rodolfo M. Balba (NP/One Batangas)"
        ],
        [
            "Fourth District"
        ],
        [
            "Jonas Patrick M. Gozos (NP/One Batangas)"
        ],
        [
            "Jesus H. De Veyra (NP/One Batangas)"
        ],
        [
            "Fifth District (Batangas City)"
        ],
        [
            "Ma.",
            "Claudette U. Ambida-Alday (NP/One Batangas)"
        ],
        [
            "Arthur G. Blanco (NP/One Batangas)"
        ],
        [
            "Sixth District (Lipa City)"
        ],
        [
            "Lydio A. Lopez, Jr (NP/One Batangas)"
        ],
        [
            "Aries Emmanuel D. Mendoza (NP/One Batangas)"
        ],
        [
            "Philippine Councilors League President"
        ],
        [
            "Melvin V. Vidal"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Liga ng Mga Barangay President"
        ],
        [
            "Fernando R. Rocafort"
        ],
        [
            "City of Lipa"
        ],
        [
            "Sangguniang Kabataan Provincial Federation President"
        ],
        [
            "Voltaire Aedrian P. Pua"
        ],
        [
            "City of Lipa"
        ],
        [
            "Representatives"
        ],
        [
            "Main article: Legislative districts of Batangas"
        ],
        [
            "From top to bottom: 1st district to 6th district"
        ],
        [
            "Elected Representatives"
        ],
        [
            "1st District: Joseph Eric R. Buhain (NP)"
        ],
        [
            "2nd District: Gerville R. Luistro (Lakas)"
        ],
        [
            "3rd District: Ma.",
            "Theresa V. Collantes (NPC)"
        ],
        [
            "4th District: Lianda B. Bolilia (NP/One Batangas)"
        ],
        [
            "5th District (Lone District of Batangas City): Mario Vittorio A. Mariño (NP/One Batangas)"
        ],
        [
            "6th District (Lone District of Lipa City): Ralph G. Recto (NP/One Batangas)"
        ],
        [
            "List of former governors"
        ],
        [
            "Main article: Governor of Batangas"
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Roads"
        ],
        [
            "STAR Tollway in Tanauan.",
            "Since 2010, STAR Tollway has been interconnected with the South Luzon Expressway to Metro Manila"
        ],
        [
            "Batangas has a total of 556 kilometers (345 mi) of national roads, mostly paved.",
            "The Southern Tagalog Arterial Road (STAR Tollway, officially numbered E2), Maharlika Highway (N1 and AH26) and Jose P. Laurel Highway (N4) forms the highway backbone of the province, and a network of secondary and tertiary national roads links most of the municipalities.",
            "The provincial government maintains a network of provincial roads to supplement the national roads and connect municipalities and barangays not connected directly to the main highway network."
        ],
        [
            "Batangas Laguna Tayabas Bus Company Incorporated (BLTBCo.)",
            "is one of the oldest bus transport companies in the Philippines has routes within Southern Tagalog region.",
            "The company has historical roots in Batangas and has been founded in 1918.",
            "At present, the routes have been incorporated with Del Monte Land Transport Bus Company (DLTBCo)."
        ],
        [
            "The Cavite-Tagaytay-Batangas (CTBEX) is a proposed expressway from the municipality of Silang, Cavite up to the town of Nasugbu.",
            "CTBEX is to connect with the Cavite–Laguna Expressway (CALAEX).",
            "Once opened, this will provide motorists a faster route to the resort towns of Nasugbu, Lian and Calatagan in the western part of the province."
        ],
        [
            "Water transport"
        ],
        [
            "Batangas Port, the starting point of the western route of the Western Nautical Highway and also a principal port."
        ],
        [
            "Batangas Port in Batangas City is the principal port for ferry access to Mindoro, Tablas, Romblon, and other islands.",
            "Montenegro Lines is the largest of a number of passenger shipping companies operating out of Batangas.",
            "Condensate tankers offload at Batangas in sizeable quantity.",
            "Batangas Port is expanded in 2008 to house facilities for container ships."
        ],
        [
            "Being an entry point to the rest of the archipelago, Batangas has roll-on/roll-off (RoRo) ferry connections with Mindoro and Visayas.",
            "The western portion of the Nautical Highway starts at Batangas, and connects with Calapan, Oriental Mindoro.",
            "Batangas Port serves as another principal port, along with the Manila International Port for inter-island and international cargo shipping, as well as interisland passenger shipping."
        ],
        [
            "Electricity"
        ],
        [
            "Poles of the Batangas II Electric Cooperative in Lipa.",
            "Batangas II Electric Cooperative is one of three major power distribution utilities in Batangas, along with Batangas I Electric Cooperative and Meralco."
        ],
        [
            "Electric power in Batangas is mostly distributed by electric cooperatives, namely the Batangas I Electric Cooperative (BATELEC-I) and Batangas II Electric Cooperative (BATELEC-II).",
            "The former serves the western part of Batangas, like Nasugbu, Calatagan, Balayan, Lemery, and Taal, while the latter serves the eastern part, like Lipa, Tanauan, Talisay, San Jose, and Rosario.",
            "The municipalities of Bauan and Ibaan, and LIMA Technology Center are served by local utility companies.",
            "Santo Tomas, the First Philippine Industrial Park (FPIP) in Tanauan, San Pascual and Batangas City, however, are served by the Metro Manila-based electric company, Meralco.",
            "Some large industrial customers are supplied by the 69,000 volt grid, operated by National Grid Corporation of the Philippines (NGCP), BATELEC-II, and Meralco."
        ],
        [
            "Batangas houses three power plants that provide the bulk of power used in Luzon.",
            "Power plants include the 600-megawatt (MW) Calaca Coal Fired Power Plant in Calaca, the 500 MW, 1000 MW, and 414 MW San Lorenzo-Santa Rita-San Gabriel Combined Cycle Power Plant,"
        ],
        [
            "Most power plants in Batangas, however, use fossil fuels, such as coal and natural gas, and are the subjects of environmental grievances because of their effects on ecosystems.",
            "One power plant to be built at Mabacong, Batangas City, is facing opposition from environmentalists and the Roman Catholic Archdiocese of Lipa, owing to its effect on residents and the aquatic ecosystem on Verde Island Passage."
        ],
        [
            "Culture"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(January 2023) (Learn how and when to remove this message)"
        ],
        [
            "Way of life"
        ],
        [
            "Maria Kalaw Katigbak, a Filipino historian, was quoted to call the Batangueños the Hybrid-Tagalogs.",
            "One particular custom in the Batangas culture is the so-called Matanda sa Dugo (lit.",
            "older by blood) practice wherein one expresses respect not because of age but because of consanguinity.",
            "During the early times, the custom of having very large families were very common.",
            "Thus, a particular person's uncle could be of the same age, or even younger than himself.",
            "Because of the custom, the older person would still address the younger one with an honorary title such as tiyo/tio or simply kuya if they can no longer establish the actual relationship or add the honorific ho / po in their sentences when addressing the younger instead of the other way around.",
            "This often draws confusion from the other provinces who are not accustomed to such practices.",
            "This practice exists until today."
        ],
        [
            "Batangueños are very \"regionalistic\".",
            "When one learns that another in the room is also from Batangas, the two would be together until the end of the event.",
            "In workplace settings, a Batangueno may also express preference for another Batangueno as long as the workplace regulations allow.",
            "Thus, the running joke on the Batangas Mafia."
        ],
        [
            "Batangueños are also known for high-toned conversations that seemingly sound like a heating argument to non-Batangueños but in fact, they are not always the case, as they are just normal conversations."
        ],
        [
            "They also tend to live in a large extended family.",
            "It has been observed that a piece of land remains undivided until the family connection becomes too difficult to establish actual blood relations.",
            "Marriages between relatives of the fifth generation is still restrained in the Batangan culture even if Philippine laws allow it."
        ],
        [
            "Batangueños have been known for their religious practices, where devotees of the Catholic religion perform rituals such as dances (subli) and chants (luwa/lua) to express their faith.",
            "One of these is the ritual called Pasión/Pasyon based on the passion of Jesus Christ in which religious chants are recited during the Lenten season.",
            "In May, the people of Bauan and Alitagtag celebrate the feast day of the Mahal na Poon ng Santa Cruz (lit.",
            "Lord of the Holy Cross), a ritual dance called the Subli is made to honor the Poon.",
            "In the town of Taal, they celebrate the feast day of Our Lady of Caysasay and San Martin de Tours a two-day celebration where a procession begins from the shrine of the Virgin going towards the Pansipit River from which the fluvial procession and another procession towards the Basilica are made in honor of the Virgin Mary.",
            "Fiestas in other towns usually start in the month of May and last up to the first day of June, usually the plaza near the church becomes the center of activities."
        ],
        [
            "Mythology and literature"
        ],
        [
            "Scholars also identified that the ancient Batangueños, like the rest of the Tagalog tribe, worship the Supreme Creator, known as Bathala.",
            "Lesser gods like Mayari, the goddess of the moon and her honorary brother Apolake, god of the sun, were also present.",
            "Dambana practices are also present in the province."
        ],
        [
            "For literature, Padre Vicente Garcia came to be known when he wrote an essay to defend José Rizal's Noli Me Tangere."
        ],
        [
            "In 2004, the province of Batangas gave Domingo Landicho (familiarly called Inggo by Batangueños) who was born in the province the Dangal ng Batangas (Pride of Batangas) Award for being the \"Peoples' Poet\"."
        ],
        [
            "Music"
        ],
        [
            "Further information: Filipino Traditional Music"
        ],
        [
            "Musicologists identified Batangas as the origin of the kumintang, an ancient war song, which later evolved to become the signature of Filipino love songs the kundiman.",
            "From the ancient kumintang, another vocal music emerged, identified as the awit.",
            "The huluna, a psalm-like lullaby, is also famous in some towns, especially Bauan."
        ],
        [
            "During the Lenten Season, the Christian passion-narrative, called Pasyon by the natives, is expected in every corners of the province.",
            "In fact according to scholars, the very first printed version of the pasyon was authored by a layman from Rosario named Gaspar Aquino de Belen.",
            "Although de Belen's version was printed in 1702, it is still debated whether there were earlier versions."
        ],
        [
            "Debates may also be done while singing.",
            "Batangueños are known for the duplo (a sung debate where each line of the verse must be octosyllabic) and the karagatan (a sung debate where each line of the verse must be dodecasyllabic.)",
            "The latter, whose literal meaning is \"ocean\", got its name from the opening lines.",
            "Always, the karagatan is opened by saying some verses that alludes the depth of the sea and comparing it to the difficulty of joining the debate.",
            "And as mentioned above, the debate must be sung."
        ],
        [
            "Batangas is also the origin of the balitao.",
            "Aside from being a form of vocal music, the balitao is also a form of dance music.",
            "Together with the subli, it is the most famous form of dance native to Batangas."
        ],
        [
            "Architecture and sculpture"
        ],
        [
            "Basilica de San Martin in Taal"
        ],
        [
            "As shown in its ancient churches, Batangas is home to some of the best preserved colonial architectures in the country, especially evident in the municipality of Taal."
        ],
        [
            "Though not as popular as the carving industry of Paete, Taal is still known for the sculptures engraved in furniture.",
            "Sometimes, altar tables coming from Taal were called the \"friars' choice\"."
        ],
        [
            "According to Milagros Covarubias-Jamir, another Filipino scholar, the furniture that came from Taal during the colonial times was comparable to equivalent quality furniture from China."
        ],
        [
            "Cuisine"
        ],
        [
            "Bulalo"
        ],
        [
            "Lomi Batangas"
        ],
        [
            "Goto"
        ],
        [
            "Aobo sa dilaw"
        ],
        [
            "Longganisang Taal"
        ],
        [
            "Tapang Taal"
        ],
        [
            "Sinaing na tulingan"
        ],
        [
            "Taghilaw"
        ],
        [
            "Sinigang na maliputo"
        ],
        [
            "Sinunggaok or sampene"
        ],
        [
            "Bagoong Balayan"
        ],
        [
            "Tinapa ng Lemery"
        ],
        [
            "Pupor (Batangas chicharon)"
        ],
        [
            "Tamales ng Ibaan"
        ],
        [
            "Sumang magkayakap ng Tanauan"
        ],
        [
            "Kalamay kapit"
        ],
        [
            "Nilupak"
        ],
        [
            "Kapeng barako"
        ],
        [
            "Tsokolate tablea (tsokolate eh and tsokolate ah"
        ],
        [
            "Panutsa"
        ],
        [
            "Murkon (Batangas embutido)"
        ],
        [
            "Museums"
        ],
        [
            "Museo ng Katipunan: Barangay Bulaklakan, Lipa"
        ],
        [
            "Apolinario Mabini Shrine: Marcela Agoncillo Historical Landmark, Barangay zone 4, Taal, Batangas"
        ],
        [
            "Museo ni Miguel Malvar: Gov.",
            "Malvar St, Poblacion 1, Santo Tomas, Batangas"
        ],
        [
            "Museo ng Batangas at Aklatang Panlalawigan: includes the Dr. Jose P. Laurel Library, Tanauan, Batangas"
        ],
        [
            "Notable people"
        ],
        [
            "National heroes and patriots"
        ],
        [
            "Apolinario Mabini — Filipino revolutionary"
        ],
        [
            "Miguel Malvar — Filipino general who served during the Philippine Revolution and the Philippine–American War"
        ],
        [
            "Felipe Agoncillo — the Filipino lawyer representative to the negotiations in Paris that led to the Treaty of Paris (1898)"
        ],
        [
            "Marcela Agoncillo — the principal seamstress of the first and official flag of the Philippines"
        ],
        [
            "Galicano Apacible —  co-founder of La Solidaridad"
        ],
        [
            "Ananias Diokno — Filipino general during the Philippine Revolution and the Philippine-American War"
        ],
        [
            "Juan Cailles — Filipino general during the  Philippine-American War"
        ],
        [
            "Gliceria Marella de Villavicencio — heroine of the Revolution, \"Godmother of the Revolutionary Forces\""
        ],
        [
            "Clemencia López — Filipina feminist, and suffragist"
        ],
        [
            "Maria Orosa — Filipina food technologist, pharmaceutical chemist, and war heroine"
        ],
        [
            "Teodoro Kalaw — Filipino scholar, legislator, and historian"
        ],
        [
            "Claro M. Recto —  statesman, jurist, poet."
        ],
        [
            "Politics and Government"
        ],
        [
            "José P. Laurel — President of the Second Philippine Republic, a Japanese-sponsored government during World War II"
        ],
        [
            "Salvador Laurel — 8th Vice President of the Philippines"
        ],
        [
            "Jose Laurel Jr. — 9th Speaker of the House of Representatives of the Philippines, and Member of the Philippine Constitutional Commission of 1986."
        ],
        [
            "Manuel Araullo, 3rd Chief Justice of the Supreme Court of the Philippines"
        ],
        [
            "Querube Makalintal, 11th Chief Justice of the Supreme Court of the Philippines, 14th Speaker of the House of Representatives of the Philippines"
        ],
        [
            "Ramon Aquino, 15th Chief Justice of the Supreme Court of the Philippines"
        ],
        [
            "Ramón Diokno, 63rd Associate Justice of the Supreme Court of the Philippines and former senator."
        ],
        [
            "Cecilia Muñoz-Palma -  Filipino jurist and the first woman Associate Justice of the Supreme Court of the Philippines."
        ],
        [
            "Angelina Sandoval-Gutierrez — 147th Associate Justice of the Supreme Court of the Philippines."
        ],
        [
            "Cancio Garcia — 156th  Associate Justice of the Supreme Court of the Philippines."
        ],
        [
            "Leon Ma.",
            "A. Garcia — lawyer and appointed mayor of Davao City from 1947 to 1949."
        ],
        [
            "Rosmari Carandang — 181st  Associate Justice of the Supreme Court of the Philippines."
        ],
        [
            "Antonio de las Alas - former senator and 3rd Secretary of the Department of Finance."
        ],
        [
            "Sotero Laurel — former senator"
        ],
        [
            "Ralph Recto — Senator of the Philippines"
        ],
        [
            "Vilma Santos – former House Representative of the 6th district of Batangas, 22nd Governor of Batangas, and film actress"
        ],
        [
            "Domingo F. Panganiban — 36th Secretary of the Department of Agriculture, former Lead Convenor National Poverty Commission (NAPC)."
        ],
        [
            "Renato de Villa — 20th Chief of Staff of the Armed Forces of the Philippines, and 18th Secretary of the Department of National Defense"
        ],
        [
            "Eduardo Ermita — 22nd Secretary of the Department of National Defense, and former Executive Secretary"
        ],
        [
            "Leandro Mendoza — 35th Secretary of the Department of Transportation and Communications, former Executive Secretary, and 8th Chief of the Philippine National Police"
        ],
        [
            "Benjamin Diokno — 5th Governor of the Bangko Sentral ng Pilipinas, and 6th Secretary of the Department of Budget and Management"
        ],
        [
            "Efren L. Abu  - 35th Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Noel Clement — 52nd Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Rommel Sandoval – Philippine Army captain and Medal of Valor recipient"
        ],
        [
            "Arts and Sciences"
        ],
        [
            "Leonor Orosa-Goquingco — National Artist of the Philippines for Dance"
        ],
        [
            "Bienvenido Lumbera — National Artist of the Philippines for Literature"
        ],
        [
            "Gregorio Y. Zara — National Scientist of the Philippines for Engineering and Inventions"
        ],
        [
            "Teodoro Agoncillo — National Scientist of the Philippines for Philippine History"
        ],
        [
            "Deogracias Villadolid — biologist"
        ],
        [
            "Anastacio Caedo — Filipino sculptor"
        ],
        [
            "Lito Mayo — graphic artist, print-maker, avant-garde poet, social activist, sculptor."
        ],
        [
            "Religion"
        ],
        [
            "Alfredo Obviar —  Filipino Venerable; Bishop Emeritus of Lucena."
        ],
        [
            "Vicente García — Filipino priest, hero and a defender of Jose P. Rizal."
        ],
        [
            "Armin Luistro, FSC — 28th Superior General of the Institute of the Brothers of the Christian Schools, 36th Secretary of the Department of Education."
        ],
        [
            "Gaudencio Rosales - Filipino Cardinal who has served as the 31st Archbishop of Manila, 6th Archbishop of Lipa, and 2nd Bishop of Malaybalay."
        ],
        [
            "Ramon Arguelles —  Filipino Roman Catholic Archbishop; Archbishop Emeritus of Lipa"
        ],
        [
            "Reynaldo G. Evangelista - Filipino Roman Catholic Bishop who is currently the Bishop of Imus.",
            "He was a former Bishop of Boac."
        ],
        [
            "Marcelino Antonio Maralit - Filipino Roman Catholic Bishop who is currently the Bishop of Boac."
        ],
        [
            "Fernando Suarez — Filipino Catholic priest who performs faith healing."
        ],
        [
            "Sports, Popular Culture and Entertainment"
        ],
        [
            "Arsenio Laurel - champion race car driver from the Philippines.",
            "He was the first two-time winner of the Macau Grand Prix, winning it consecutively in 1962 and 1963."
        ],
        [
            "Nora Daza – Filipina veteran gourmet chef, restaurateur, socio-civic leader, television host."
        ],
        [
            "Ed Lingao – journalist and newscaster."
        ],
        [
            "Ai-Ai delas Alas — actress, comedian, singer and TV host"
        ],
        [
            "Simon Ibarra – actor"
        ],
        [
            "Charlie Dizon - actress, model"
        ],
        [
            "Ogie Alcasid — singer-songwriter, television presenter, comedian, parodist, and actor"
        ],
        [
            "TJ Trinidad –  actor, singer and model"
        ],
        [
            "Leo Martinez —  actor, comedian and director"
        ],
        [
            "Zanjoe Marudo — actor and model"
        ],
        [
            "Jade Lopez – Filipina actress, dramatic artist"
        ],
        [
            "Jason Gainza — actor, impersonator"
        ],
        [
            "Joshua Garcia — actor, model and endorser"
        ],
        [
            "Alyssa Valdez – volleyball player and former member of collegiate varsity volleyball team of Ateneo de Manila University in both indoor and beach volleyball."
        ],
        [
            "Kim Fajardo – volleyball athlete, and former team captain of the De La Salle University women's volleyball team."
        ],
        [
            "Jovit Baldivino — singer and grand champion of Pilipinas Got Talent: Season 1"
        ],
        [
            "Perfecto de Castro — musician and YouTuber, former guitarist of Rivermaya from 1994-1995"
        ],
        [
            "Francis Reyes — musician and radio announcer, guitarist of the Dawn, former station manager of now-defunct NU107.5 FM"
        ],
        [
            "Darius Semaña — musician, lead guitarist of Parokya ni Edgar"
        ],
        [
            "Dennis Datu - reporter, host of ABS-CBN News"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on April 19, 2016.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ a b c Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"History – Official Website of the Province of Batangas\".",
            "Retrieved September 22, 2023."
        ],
        [
            "^ \"History – Official Website of the Province of Batangas\".",
            "Retrieved September 22, 2023."
        ],
        [
            "^ Tsang, Cheng-hwa (2000), \"Recent advances in the Iron Age archaeology of Taiwan\", Bulletin of the Indo-Pacific Prehistory Association, 20: 153–158, doi:10.7152/bippa.v20i0.11751"
        ],
        [
            "^ Turton, M. (2021).",
            "Notes from central Taiwan: Our brother to the south.",
            "Taiwan’s relations with the Philippines date back millenia, so it’s a mystery that it’s not the jewel in the crown of the New Southbound Policy.",
            "Taiwan Times."
        ],
        [
            "^ Everington, K. (2017).",
            "Birthplace of Austronesians is Taiwan, capital was Taitung: Scholar.",
            "Taiwan News."
        ],
        [
            "^ Bellwood, P., H. Hung, H., Lizuka, Y.",
            "(2011).",
            "Taiwan Jade in the Philippines: 3,000 Years of Trade and Long-distance Interaction.",
            "Semantic Scholar."
        ],
        [
            "^ \"tribhanga\".",
            "Archived from the original on January 15, 2009.",
            "Retrieved January 6, 2007."
        ],
        [
            "^ Juan R. Francisco (1963).",
            "\"A Buddhist Image from Karitunan Site, Calatagan, Batangas Province\" (PDF).",
            "Asian Studies.",
            "1 (1)."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ Batangas Airport in Barangay Alaingilan destroyed after Japanese air raids Archived 2010-07-26 at the Wayback Machine"
        ],
        [
            "^ Lt. César Basa's actions at the Japanese Air Raids in the Batangas Airfield"
        ],
        [
            "^ Christine Sherman,  M.J. Thurman, War Crimes, Japan's World War II, p.136"
        ],
        [
            "^ \"Landing Craft Infantry LCI\"."
        ],
        [
            "^ a b c d e f g h i j \"HyperWar: US Army in WWII: Triumph in the Philippines \"."
        ],
        [
            "^ Flanagan, Lt. Gen. E. M. Jr. (1989).",
            "The Angels: A History of the 11th Airborne Division.",
            "San Francisco: Presidio Press.",
            "p. 480.",
            "ISBN 0891413588."
        ],
        [
            "^ administrator (October 15, 2015).",
            "\"DIOKNO, Jose W.\" Bantayog ng mga Bayani.",
            "Retrieved October 4, 2020."
        ],
        [
            "^ Romero, Paolo.",
            "\"Enrile apologizes to Martial Law victims, blames 'unlucid intervals'\".",
            "philstar.com.",
            "Archived from the original on October 31, 2018.",
            "Retrieved October 4, 2020."
        ],
        [
            "^ Ayroso, Dee (April 20, 2016).",
            "\"Marcos era saw most rapid environmental degradation, biodiversity loss\".",
            "Bulatlat.",
            "Retrieved October 4, 2020."
        ],
        [
            "^ Contributor, Staff (April 25, 2016).",
            "\"UMALI, Ismael G.\" Bantayog ng mga Bayani.",
            "Retrieved October 4, 2020.",
            "{{cite web}}: |last= has generic name (help)"
        ],
        [
            "^ \"History – Official Website of the Province of Batangas\".",
            "Archived from the original on October 20, 2020."
        ],
        [
            "^ a b \"Province: Batangas\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities (PDF).",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Batangas: Close to Two Million People\".",
            "Archived from the original on February 8, 2019.",
            "Retrieved August 24, 2018."
        ],
        [
            "^ \"MCGI leads charitable outreach in Sta.",
            "Rosa, Laguna and Talisay, Batangas\".",
            "MCGI Cares.",
            "December 18, 2022."
        ],
        [
            "^ \"Batangas Statistical Tables (2015)\".",
            "Philippine Statistics Authority.",
            "Retrieved August 15, 2018."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Figures tabulated from 2015 road data for Region IV-A Archived 2017-04-07 at the Wayback Machine by Department of Public Works and Highways"
        ],
        [
            "^ \"Our Power Plants\".",
            "First Gen. Archived from the original on April 19, 2017.",
            "Retrieved April 10, 2017."
        ],
        [
            "^ Rivera, Danessa (April 29, 2016).",
            "\"Semirara Mining, Meralco seal partnership for Calaca plant expansion\".",
            "The Philippine Star.",
            "Philstar.",
            "Retrieved April 10, 2017."
        ],
        [
            "^ \"Batangas priests lead fight vs. coal-fired power plant\".",
            "Inquirer.net.",
            "Philippine Daily Inquirer.",
            "May 2015.",
            "Retrieved January 6, 2017."
        ],
        [
            "^ Antonio de las Alas (PDF)."
        ],
        [
            "^ \"Antonio De Las Alas | Taal Batangas\".",
            "www.taal.ph.",
            "Archived from the original on September 5, 2017.",
            "Retrieved January 18, 2019."
        ],
        [
            "^ Galang, Zoilo M. (1953).",
            "Encyclopedia of the Philippines: Government and politics.",
            "E. Floro."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Batangas at Wikimedia Commons"
        ],
        [
            " Batangas travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Batangas at OpenStreetMap"
        ],
        [
            "Official Website of the Provincial Government of Batangas"
        ],
        [
            "Places adjacent to Batangas"
        ],
        [
            "Cavite / Laguna"
        ],
        [
            "South China Sea"
        ],
        [
            "Batangas"
        ],
        [
            "Quezon"
        ],
        [
            "Isla Verde PassageOccidental Mindoro"
        ],
        [
            "Isla Verde PassageOriental Mindoro"
        ],
        [
            "Tayabas BayMarinduque"
        ],
        [
            "vte Province of BatangasBatangas City (capital)  Lipa City (largest city)Component cities"
        ],
        [
            "Batangas City"
        ],
        [
            "Calaca"
        ],
        [
            "Lipa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tanauan"
        ],
        [
            "Municipalities"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alitagtag"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Bauan"
        ],
        [
            "Calatagan"
        ],
        [
            "Cuenca"
        ],
        [
            "Ibaan"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Lobo"
        ],
        [
            "Mabini"
        ],
        [
            "Malvar"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Nasugbu"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Rosario"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Taal"
        ],
        [
            "Talisay"
        ],
        [
            "Taysan"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Articles related to Batangas"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Spain"
        ],
        [
            "France"
        ],
        [
            "BnF data"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Other"
        ],
        [
            "IdRef"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Batangas&oldid=1231260390\""
        ],
        [
            "Categories: BatangasProvinces of the PhilippinesProvinces of CalabarzonStates and territories established in 15811581 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksAll articles with dead external linksArticles with dead external links from January 2018Articles with permanently dead external linksCS1 errors: generic nameArticles with short descriptionShort description is different from WikidataArticles needing additional references from April 2011All articles needing additional referencesUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Coordinates on WikidataArticles containing Tagalog-language textPages with Tagalog IPAWikipedia articles needing clarification from January 2016All articles with unsourced statementsArticles with unsourced statements from January 2016Articles needing additional references from January 2023Articles with unsourced statements from June 2016Articles needing additional references from February 2009Wikipedia articles in need of updating from July 2016All Wikipedia articles in need of updatingPages using multiple image with auto scaled imagesArticles with unsourced statements from August 2020Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with BNE identifiersArticles with BNF identifiersArticles with BNFdata identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersArticles with SUDOC identifiersPages using the Kartographer extension"
        ]
    ]
}