{
    "name": "Batanes",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Batanes"
        ],
        [
            "47 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어Հայերենहिन्दीHrvatskiIlokanoBahasa IndonesiaItalianoעבריתKapampanganქართულიLatinaLatviešuМакедонскиMalagasyBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray吴语中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 20°35′N 121°54′E﻿ / ﻿20.58°N 121.9°E﻿ / 20.58; 121.9"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Cagayan Valley, PhilippinesBatanesProvinceProvince of Batanes(from top: left to right) Lighthouse in Sabtang Island, Chavayan Beach in Sabtang, Mount Iraya, Batan Island, Malboro country in Mahatao and"
        ],
        [
            "Batan island  coastal rocky cliffs."
        ],
        [
            "FlagSealAnthem: Beautiful Batanes IslesLocation in the PhilippinesCoordinates: 20°35′N 121°54′E﻿ / ﻿20.58°N 121.9°E﻿ / 20.58; 121.9CountryPhilippinesRegionCagayan ValleyFoundedJune 26, 1783Capitaland largest municipalityBascoGovernment • GovernorMarilou  Cayco (PFP) • Vice GovernorIgnacio C. Villa (LP) • LegislatureBatanes Provincial BoardArea • Rank81st out of 81 • Density93/km2 (240/sq mi)  • Rank73rd out of 81Divisions • Independent cities0 • Component cities0 • Municipalities"
        ],
        [
            "6"
        ],
        [
            " BascoItbayatIvanaMahataoSabtangUyugan"
        ],
        [
            " • Barangays29 • DistrictsLegislative district of BatanesTime zoneUTC+8 (PHT)ZIP code3900–3905IDD : area code +63 (0)78ISO 3166 codePH-BTNSpoken languagesIvatanItbayatenIsamurongenIlocanoTagalogEnglish"
        ],
        [
            "Batanes, officially the Province of Batanes (Ivatan: Provinsiya nu Batanes; Ilocano: Probinsia ti Batanes; Filipino: Lalawigan ng Batanes, IPA: ), is an archipelagic province in the Philippines, administratively part of the Cagayan Valley region.",
            "It is the northernmost province in the Philippines, and the smallest, both in population and land area.",
            "The capital is Basco, located on the island of Batan."
        ],
        [
            "The island group is located approximately 162 kilometres (101 mi) north of the Luzon mainland and about 190 kilometres (120 miles) south of Taiwan (Pingtung County), separated from the Babuyan Islands of Cagayan Province by the Balintang Channel, and from Taiwan by the Bashi Channel."
        ],
        [
            "Etymology"
        ],
        [
            "The name Batanes is a hispanicised plural form derived from the Ivatan endonym Batan."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "The ancestors of today's Ivatans descended from Austronesians who migrated to the islands 4,000 years ago during the Neolithic period.",
            "They lived in fortified mountain areas called idjangs and drank sugar-cane wine, or palek.",
            "They used gold as currency and were farmers.",
            "They were seafarers and boat-builders.",
            "Batanes was a major site for the Maritime Jade Road, one of the most extensive sea-based trade networks of a single geological material in the prehistoric world, operating for 3,000 years from 2000 BCE to 1000 CE."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1687, the British explorer, privateer, and naturalist William Dampier, known for kidnapping indigenous peoples in the Philippines and selling them as slaves in Europe,"
        ],
        [
            "In 1783, the Spanish claimed Batanes as part of the Philippines under the rule of Governor-General José Basco y Vargas.",
            "Batanes was ruled as part of the Provincia de Cagayan.",
            "The Bashi Channel was increasingly used by English East India Company ships and the Spanish authorities brought the islands under their direct administration to prevent them falling under British control."
        ],
        [
            "Using guns, the Spanish ended the revolution, killing Aman Dangat and several other Ivatan leaders.",
            "Basco and Ivana were the first towns established under full Spanish control.",
            "Mahatao was then administered by Basco, while Uyugan and Sabtang, by Ivana.",
            "Itbayat was not organized until the 1850s, its coast being a ridge.",
            "Soon, Ilocanos came to the islands and integrated with the local population."
        ],
        [
            "Roads, ports, bridges, churches and government buildings were built in this time.",
            "Limestone technology used by the Spanish spread to the islands, making bridges strong and fortified.",
            "Some of these bridges still remain at Ivana and Mahatao.",
            "By 1890, many Ivatans were in Manila, and became ilustrados, who then brought home with them the revolutionary ideas of the Katipunan.",
            "These Ivatans, who were then discontented with Spanish rule, killed the ruling General Fortea and declared the end of Spanish rule."
        ],
        [
            "American colonial era"
        ],
        [
            "Toward the end of the Spanish administration, Batanes was made a part of Cagayan.",
            "Due to historical reasons from that time, some segments of Taiwan society argue that the islands should not belong to the Philippines.",
            "During the American colonial period, additional public schools were constructed and more Ivatan became aware of their place in the Philippines."
        ],
        [
            "In 1920, the first wireless telegraph was installed, followed by an airfield in 1930.",
            "New roads were constructed and the Batanes High School was instituted."
        ],
        [
            "Japanese occupation"
        ],
        [
            "Because of their strategic location, the islands was one of the first points occupied by invading Japanese imperial forces at the outbreak of the Pacific War.",
            "The morning of December 8, 1941, the Batan Task Force from Taiwan landed on the Batan Islands, which became the first American territory occupied by the Japanese.",
            "The purpose of the invasion was to secure the existing small airfield outside Basco, which was accomplished without resistance.",
            "Japanese fighters from Basco took part in the raid on Clark Air Base the following day.",
            "Over the next several days, the success of the Japanese bombing of Clark Field rendered a base at Basco unnecessary, and on December 10, 1941, the naval combat force was withdrawn to participate in the invasion of Camiguin."
        ],
        [
            "As part of an administrative reorganization, the province of Batanes was downgraded into a municipality of Cagayan from 1942 to 1944.",
            "Upon its restoration, Victor de Padua, an Ilocano who was one of the first School Superintendents on Batan was made Provincial Governor.",
            "Early in 1945 the island was liberated by the Philippine Commonwealth forces of the 1st and 12th Infantry Division of the Philippine Commonwealth Army."
        ],
        [
            "Philippine independence"
        ],
        [
            "Batanes was briefly marred by political violence during the 1969 presidential elections, when the Philippine Constabulary's Special Forces allowed motorcycle-riding goons dubbed the \"Suzuki boys\" to secure the victory of Rufino Antonio Jr., an ally of President Ferdinand Marcos, as representative of the Lone District of Batanes in the House of Representatives of the Philippines through a campaign of terror and intimidation.",
            "The resulting outcry led to the Supreme Court decrying the \"rape of democracy\" in the province, and annulled Antonio's victory in 1970 in favor of his rival, Jorge Abad."
        ],
        [
            "In 1984, Pacita Abad, the foremost Ivatan visual artist, became the first woman to be awarded the Ten Outstanding Young Men (TOYM) award, breaking 25 years of male dominance.",
            "In her acceptance speech, she said, \"it was long overdue that Filipina women were recognized, as the Philippines was full of outstanding women\" and referred proudly to her mother."
        ],
        [
            " Vahay ni Dakay Ivatan house, one of the oldest structures in the Batanes islands.",
            "The house is made of limestone and coral and its roofing of cogon grass."
        ],
        [
            "In 1993, the Batanes Protected Landscape and Seascape, which encompassed the entire province, was listed in the Tentative List of the Philippines for UNESCO World Heritage Site inscription in the future."
        ],
        [
            "In 1997, the Indigenous Peoples Rights act or IPRA was passed in Philippine Congress.",
            "The law paved the way for the indigenous territorial rights of the Ivatans.",
            "The province has since promoted its Ivatan roots.",
            "Part of the Ilocano population has returned to mainland Luzon.",
            "On December 7, 2004, Pacita Abad died after finishing her last international art work while suffering from cancer."
        ],
        [
            "Geography"
        ],
        [
            "The province has a total area of 219.01 square kilometres (84.56 sq mi) comprising ten islands situated within the Luzon Strait between the Balintang Channel and Taiwan.",
            "The islands are sparsely populated and subject to frequent typhoons.",
            "The three largest islands, Batan, Itbayat, and Sabtang, are the only inhabited islands."
        ],
        [
            "The northernmost island in the province, also the northernmost land in the entire Philippines, is Mavulis (or Y'ami) Island.",
            "Other islands in the chain are Misanga (or North), Ditarem, Siayan, Diogo (or Dinem), Ivuhos, and Dequey.",
            "The islands are part of the Luzon Volcanic Arc."
        ],
        [
            "Topography"
        ],
        [
            "Batanes Hills"
        ],
        [
            "Almost one-half of Batanes is hills and mountains.",
            "Batan Island is generally mountainous on the north and southeast.",
            "It has a basin in the interior.",
            "Itbayat Island slopes gradually to the west, being mountainous and hilly along its northern, eastern coast.",
            "On Sabtang, mountains cover the central part, making the island slope outward to the coast."
        ],
        [
            "The islands are situated between the vast expanse of the waters of Bashi Channel and Balintang Channel, where the Pacific Ocean merges with the China Sea.",
            "The area is a sea lane between the Philippines and Japan, China, Hong Kong and Taiwan.",
            "It is rich with marine resources, including the rarest sea corals in the world."
        ],
        [
            "The province is hilly and mountainous, with only 1,631.5 hectares or 7.1% of its area level to undulating terrain.",
            "78.2% or 17,994.4 hectares vary from rolling hills to steep and very steep.",
            "Forty-two percent (42%) or 9,734.40 hectares are steep to very steep land.",
            "Because of the terrain of the province, drainage is good and prolonged flooding is non-existent."
        ],
        [
            "The main island of Batan has the largest share of level and nearly level lands, followed by Itbayat and Sabtang, respectively.",
            "Itbayat has gently rolling hills and nearly level areas on semi-plateaus surrounded by continuous massive cliffs rising from 20 to 70 metres (66–230 feet) above sea level, with no shorelines.",
            "Sabtang has its small flat areas spread sporadically on its coasts, while its interior is dominated by steep mountains and deep canyons.",
            "Batan Island and Sabtang have intermittent stretches of sandy beaches and rocky shorelines."
        ],
        [
            "The terrain of the province, while picturesque at almost every turn, has limited the potential for expansion of agriculture in an already very small province."
        ],
        [
            "A Batanes stone house"
        ],
        [
            "Climate"
        ],
        [
            "Batanes has a tropical climate (Köppen climate classification Am).",
            "The average yearly temperature is 26.0 °C (78.8 °F).",
            "The average monthly temperature ranges from 22.0 °C (71.6 °F) in January to 28.5 °C (83.3 °F) in July, similar to that of Southern Taiwan.",
            "Precipitation is abundant throughout the year.",
            "The rainiest month is August.",
            "The driest month is April.",
            "November to February are the coldest months."
        ],
        [
            "There is a misconception that Batanes is constantly battered by typhoons."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Batanes is subdivided into 6 municipalities, all encompassed by a lone congressional district."
        ],
        [
            "Political divisions"
        ],
        [
            "Municipality"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "20°27′03″N 121°58′10″E﻿ / ﻿20.4509°N 121.9694°E﻿ / 20.4509; 121.9694﻿ (Basco)"
        ],
        [
            "Basco"
        ],
        [
            "†"
        ],
        [
            "50.5%"
        ],
        [
            "9,517"
        ],
        [
            "8,579"
        ],
        [
            "+2.00%"
        ],
        [
            "33.67"
        ],
        [
            "13.00"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "6"
        ],
        [
            "20°47′09″N 121°50′27″E﻿ / ﻿20.7858°N 121.8407°E﻿ / 20.7858; 121.8407﻿ (Itbayat)"
        ],
        [
            "Itbayat"
        ],
        [
            "16.6%"
        ],
        [
            "3,128"
        ],
        [
            "2,867"
        ],
        [
            "+1.67%"
        ],
        [
            "83.13"
        ],
        [
            "32.10"
        ],
        [
            "38"
        ],
        [
            "98"
        ],
        [
            "5"
        ],
        [
            "20°22′16″N 121°54′51″E﻿ / ﻿20.3711°N 121.9142°E﻿ / 20.3711; 121.9142﻿ (Ivana)"
        ],
        [
            "Ivana"
        ],
        [
            "7.5%"
        ],
        [
            "1,407"
        ],
        [
            "1,327"
        ],
        [
            "+1.12%"
        ],
        [
            "16.54"
        ],
        [
            "6.39"
        ],
        [
            "85"
        ],
        [
            "220"
        ],
        [
            "4"
        ],
        [
            "20°24′57″N 121°56′52″E﻿ / ﻿20.4158°N 121.9479°E﻿ / 20.4158; 121.9479﻿ (Mahatao)"
        ],
        [
            "Mahatao"
        ],
        [
            "9.0%"
        ],
        [
            "1,703"
        ],
        [
            "1,555"
        ],
        [
            "+1.75%"
        ],
        [
            "12.90"
        ],
        [
            "4.98"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "4"
        ],
        [
            "20°19′57″N 121°52′25″E﻿ / ﻿20.3324°N 121.8735°E﻿ / 20.3324; 121.8735﻿ (Sabtang)"
        ],
        [
            "Sabtang"
        ],
        [
            "9.0%"
        ],
        [
            "1,696"
        ],
        [
            "1,621"
        ],
        [
            "+0.86%"
        ],
        [
            "40.70"
        ],
        [
            "15.71"
        ],
        [
            "42"
        ],
        [
            "110"
        ],
        [
            "6"
        ],
        [
            "20°20′59″N 121°56′22″E﻿ / ﻿20.3497°N 121.9394°E﻿ / 20.3497; 121.9394﻿ (Uyugan)"
        ],
        [
            "Uyugan"
        ],
        [
            "7.3%"
        ],
        [
            "1,380"
        ],
        [
            "1,297"
        ],
        [
            "+1.19%"
        ],
        [
            "16.28"
        ],
        [
            "6.29"
        ],
        [
            "85"
        ],
        [
            "220"
        ],
        [
            "4"
        ],
        [
            "Total"
        ],
        [
            "18,831"
        ],
        [
            "17,246"
        ],
        [
            "+1.69%"
        ],
        [
            "203.22"
        ],
        [
            "78.46"
        ],
        [
            "93"
        ],
        [
            "240"
        ],
        [
            "29"
        ],
        [
            " †  Provincial capital"
        ],
        [
            "  Municipality"
        ],
        [
            "^ The globe  icon marks the town center."
        ],
        [
            "Barangays"
        ],
        [
            "Main article: List of barangays in Batanes"
        ],
        [
            "The 6 municipalities of the province comprise a total of 29 barangays.",
            "Ihuvok II in Basco was the most populous in 2010, and Nakanmuan in Sabtang was the least."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BatanesYearPop.±% p.a.1903 8,293—    1918 8,214−0.06%1939 9,512+0.70%1948 10,705+1.32%1960 10,309−0.31%YearPop.±% p.a.1970 11,398+1.01%1975 11,870+0.82%1980 12,091+0.37%1990 15,026+2.20%1995 14,180−1.08%YearPop.±% p.a.2000 16,467+3.26%2007 15,974−0.42%2010 16,604+1.42%2015 17,246+0.73%2020 18,831+1.74%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Batanes in the 2020 census was 18,831 people,.",
            "The population density was 86 inhabitants per square kilometre or 220 inhabitants per square mile."
        ],
        [
            "An elderly Ivatan woman inside her house."
        ],
        [
            "The natives are called Ivatans.",
            "They share prehistoric cultural and linguistic commonalities with the Babuyan on Babuyan Island and the Tao people of Orchid Island."
        ],
        [
            "This divided homeland is a result of the Dutch invasion of Taiwan in 1624 (Dutch Formosa) and Spanish invasion in 1626 (Spanish Formosa).",
            "The northern half of the Ivatan homeland, Formosa and Orchid Island were part of the Viceroyalty of New Spain.",
            "This area came under Dutch governance.",
            "The Dutch were expelled in 1662 by forces of the Chinese Southern Ming dynasty, led by the Chinese pirate Koxinga who then set himself up as The King of Taiwan."
        ],
        [
            "The southern half of the Ivatan homeland, the islands of Batanes, was reinforced and fortified by Spanish refugees from Formosa, before being formally joined in the 18th century with the Spanish government in Manila."
        ],
        [
            "An Ilocano minority population lives in Batanes.",
            "Some have left and returned to mainland Luzon."
        ],
        [
            "The main languages spoken in Batanes are Ivatan, which is spoken on the islands of Batan and Sabtang.",
            "Itbayaten is spoken primarily on the island of Itbayat.",
            "The Ivatan which is dominant in the province is considered to be one of the Austronesian languages.",
            "From college level down to elementary level, the language is widely spoken.",
            "The  Ivatans widely speak and understand the Ilocano (lingua franca of northern Luzon), Tagalog, and English languages."
        ],
        [
            "Batanes Ilocanos are bilingual in Ilocano and Ivatan.",
            "They speak Ilocano with an Ivatan accent."
        ],
        [
            "Ivatan-speaking communities can be found in almost every part of the country, mainly in mainland Luzon and in Bukidnon, Lanao and Cotabato in Mindanao, as well as overseas."
        ],
        [
            "Religion"
        ],
        [
            "The large majority (94%) of the island's people adhere to Roman Catholicism.",
            "The remaining faiths are other Christian Churches."
        ],
        [
            "Ecology"
        ],
        [
            "Livestock freely roaming in the green hills in Batanes"
        ],
        [
            "An extensive survey of the ecology of Batanes"
        ],
        [
            "Flora and fauna"
        ],
        [
            "The province is the home of the unique conifer species Podocarpus costalis.",
            "Although it is reportedly growing in some other places such as coasts of Luzon, Catanduanes and even Taiwan, full blossoming and fruiting are observed only in Batanes.",
            "Its fruiting capacity on the island remains a mystery but is likely due to several factors such as climate, soil and type of substratum of the island."
        ],
        [
            "Several species of birds, bats, reptiles and amphibians inhabit the island.",
            "Many of those are endemic to the Philippines.",
            "The island is a sanctuary of different migratory birds during winter in the Northern Hemisphere."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Batanes"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  16.56"
        ],
        [
            "2009  14.40"
        ],
        [
            "2012  33.33"
        ],
        [
            "2015  13.68"
        ],
        [
            "2018  9.56"
        ],
        [
            "2021  2.60"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "About 75% of the Ivatans are farmers and fishermen.",
            "The rest are employed in the government and services sector.",
            "Garlic and cattle are major cash crops.",
            "Ivatans plant camote (sweet potato), cassava, gabi or tuber and a unique variety of white uvi.",
            "Sugarcane is raised to produce palek, a kind of native wine, and vinegar."
        ],
        [
            "In recent years, fish catch has declined due to the absence of technical know-how.",
            "Employment opportunities are scarce.",
            "Most of the educated Ivatans have migrated to urban centers or have gone abroad."
        ],
        [
            "A wind diesel generating plant was commissioned in 2004."
        ],
        [
            "Distance and bad weather work against its economic growth.",
            "Certain commodities like rice, soft drinks, and gasoline carry a 75% to 100% mark-up over Manila retail prices."
        ],
        [
            "Transportation"
        ],
        [
            "The island province of Batanes is accessible by air, via Basco Airport and Itbayat Airport.",
            "There are daily flights from Manila by Philippine Airlines bound to Basco Airport at Batan Island.",
            "There are also flights from Tuguegarao City (Cagayan) by Sky Pasada as of 2024.",
            "These two airlines make Batan Island accessible from the mainland via air travel.",
            "The other local airlines previously serving Basco Airport have stopped their transport services after the COVID 19 Pandemic.",
            "As of 2024, PAL Express has flown to Batanes since May 2013.",
            "Meanwhile, Itbayat , an island Municipality of the Province of Batanes, is accessible via Basco Airport.",
            "There are no direct flights from the mainland to Itbayat.",
            "Itbayat may also be accessed via ferry boats from Basco.",
            "Meanwhile, Sabtang, also an island municipality like Itbayat, is accesible via ferry boats from Batan Island, particularly from Ivana Port, a Municipality of in the main Island of Batan."
        ],
        [
            "Values"
        ],
        [
            "The Ivatan people of Batanes are one of the most egalitarian societies in the Philippines.",
            "The prime motivator of the cultural values of the Ivatans are imbibed in their pre-colonial belief systems of respecting nature and all people.",
            "The Ivatans, both the older and younger generations, have one of the highest incidences of social acceptance to minority groups in the country."
        ],
        [
            "The Ivatans have a high respect for the elderly and the prowess of natural phenomena such as waves, sea breeze, lightning, thunders, earthquakes, and wildlife congregations.",
            "Discriminating someone based on skin color, ethnic origin, sexual orientation, gender identity, age, and traditions on nature is unacceptable in Ivatan values.",
            "Land grabbing is a grave crime in Ivatan societies, making ancestral domain certification an important part of Ivatan jurisprudence since the enactment of the IPRA Law."
        ],
        [
            "Heritage"
        ],
        [
            "This section focuses too much on specific examples without explaining their importance to its main subject.",
            "Please help improve this article by citing reliable, secondary sources that evaluate and synthesize these or similar examples within a broader context.",
            "(June 2016)"
        ],
        [
            "The entire province is listed in the UNESCO tentative list for inscription in the World Heritage List.",
            "The government has been finalizing the site's inscription, establishing museums and conservation programs since 2001.",
            "Seven intangible heritage elements of the Ivatan have been set by the Philippine government in its initial inventory in 2012.",
            "The elements are undergoing a process to be included in the UNESCO Intangible Cultural Heritage Lists."
        ],
        [
            "Natural"
        ],
        [
            "White sand beach at Sabtang island"
        ],
        [
            "Sabtang Island is undisturbed and unspoiled.",
            "It has intermittent white sand beaches with steep mountains and deep canyons with small level areas sporadically found along the coastline.",
            "Southwest of Batan Island, Sabtang is accessible by 30-minute falowa ride from Radiwan Port in Ivana.",
            "Sabtang Island is also the take-off point for Ivuhos Island from Barangay Nakanmuan."
        ],
        [
            "Itbayat Island is located north of Batan Island.",
            "Itbayat is shaped like a giant bowl.",
            "The island is surrounded by massive boulders and cliffs rising from 20 to 70 feet (6.1–21.3 metres) above sea level and has no shoreline.",
            "It has a dirt airstrip for light aircraft.",
            "A regular ferry runs the Batan-Itbayat route.",
            "Travel time is about four hours by falowa from Basco Seaport.",
            "A light plane flies from Basco Airport to Itbayat at around P1,875 per person and leaves only when the plane is full."
        ],
        [
            "Batan Island is the most populated island of the province.",
            "It is composed of four municipalities: Basco, Ivana, Uyugan, and Mahatao.",
            "Basco is the center of commerce and the seat of the provincial government."
        ],
        [
            "Mount Iraya is a dormant volcano standing at 1,517 metres (4,977 feet) whose last eruption was recorded in 505 AD.",
            "Mountaineering, trekking, and trailblazing are recommended sports activities on the mountain.",
            "Walking distance from Basco, the top of Mt.",
            "Iraya can be reached in about three hours."
        ],
        [
            "Mavulis Island is the northernmost island of Batanes.",
            "From this location, one can see Formosa (Taiwan) on a clear day.",
            "Tatus or coconut crabs abound on the island surrounded by rich marine life."
        ],
        [
            "Di-atay Beach is a cove with multi-colored rocks and white sand ideal for picnics and beachcombing.",
            "Located along the highway of Mahatao, it is 9.85 kilometres (6.12 miles) from Basco."
        ],
        [
            "Songsong in Chadpidan Bay is an hour of exhilarating trek from Basco proper (3 kilometres (1.9 miles)).",
            "It is famous for its beautiful sunset view."
        ],
        [
            "Naidi Hills is walking distance from Basco."
        ],
        [
            "Chawa Cave is for the more adventurous.",
            "An enchanted cave with a natural salt bed whose mouth opens to the south China Sea and is accessible through the boulders of Chawa Point in Mahatao.",
            "It is 4 kilometres (2.5 miles) from Basco."
        ],
        [
            "Sitio Diura at Racuj-a-Ide is the fishermen's village at Mananoy Bay.",
            "Fishing season is marked by a festival in mid-March called Kapayvanuvanua.",
            "Visitors are treated with fresh fish delicacies from the Pacific Ocean.",
            "Within the area is the legendary Spring of Youth and living cave with crystal limestone formations.",
            "The bay is nine kilometres (5.6 miles) from Basco."
        ],
        [
            "Nakabuang Cave is 5.5 kilometres (3.4 miles) from San Vicente Centro in Sabtang."
        ],
        [
            "Mt.",
            "Matarem is an extinct volcano 495 metres (1,624 feet) at its summit.",
            "It is eight kilometres (5.0 miles) from Basco."
        ],
        [
            "White Beach at Vatang, Hapnit, and Mavatuy Point, all in Mahatao."
        ],
        [
            "Storm-proof Stone houses in Batanes many residents during typhoon made up their already-fortified houses with wood and secured the roofs with nets and ropes.",
            "This was done to ensure that the structures—which symbolize the Ivatan's strength and resilience against disasters—outlast the high-pressure winds of a typhoon that is expected to unleash.",
            "Tapangkos or covering were also installed on the doors and windows of several buildings in Batanes, including the capitol building.",
            "During heavy storms, it was also a time for Bayanihan of the residents as they helped each other tie-down roofs."
        ],
        [
            "Man-made"
        ],
        [
            "Radar Tukon was a United States weather station on a hilltop.",
            "It offers a magnificent 360-degree view of Batan Island, the South China Sea, Mt.",
            "Iraya, Basco proper, boulder lined cliffs and the Pacific Ocean.",
            "At present, it houses the northernmost weather station in the Philippines, the Basco Radar Station, and is only 2.75 kilometres (1.71 miles) from Basco."
        ],
        [
            "Old Loran Station housed a US Coast Guard detachment for almost two decades and is about 25 kilometres (16 miles) from Basco."
        ],
        [
            "Ruins Of Songsong is a ghost barangay which is a cluster of roofless shells of old stone houses abandoned after a tidal wave that hit the island of Batan in the 1950s.",
            "It has a long stretch of beach.",
            "The ruins are 23 kilometres (14 miles) from Basco."
        ],
        [
            "San Jose Church in Ivana was built in 1814.",
            "It has a crenelated fortress-like campanile.",
            "The church fronts the Ivana Seaport and is 14 kilometres (8.7 miles) from Basco."
        ],
        [
            "Kanyuyan Beach & Port at Baluarte Bay in Basco is the port of call of the cargo ships bringing goods from Manila."
        ],
        [
            "San Carlos Borromeo Church and a convent at Mahatao are six kilometres (3.7 miles) from Basco.",
            "It was completed in 1789 and still retains its centuries-old features."
        ],
        [
            "Idjangs or fortified stone fortresses where the native Ivatans' ancestors migrated to Batanes as early as 4,000 BC lived in them for defensive cover."
        ],
        [
            "Fundacion Pacita is a lodging house and restaurant, which was formerly owned by Pacita Abad, the most iconic Ivatan visual artist.",
            "The house has been redecorated and filled with numerous art works of Pacita Abad after she died in 2004."
        ],
        [
            "Historical"
        ],
        [
            "Radiwan Point at Ivana Seaport is where the Katipuneros landed on September 18, 1898.",
            "It is also the ferry station of the falowas plying the islands of Sabtang and Itbayat."
        ],
        [
            "Boat-shaped Stone Grave Markers, Chuhangin Burial Site, Ivuhos Island, Sabtang, Batanes"
        ],
        [
            "Chavulan Burial Jar Site, Ivuhos Island, Sabtang Island"
        ],
        [
            "Arrangement of Stone with Holes, Sumnanga, Sabtang"
        ],
        [
            "Columnar Stones, Post Holes, Stone Anchors, Itbud Idyang, Uyugan, Batanes"
        ],
        [
            "Arrangement of Stone Walls, Idyang Site, Basco, Batanes"
        ],
        [
            "Paso Stone Formation, Ivuhos Island, Sabtang, Batanes"
        ],
        [
            "Columnar Stone with Holes, Mahatao, Batanes"
        ],
        [
            "Intangible heritage"
        ],
        [
            "In 2012, the National Commission for Culture and the Arts (NCCA) and the ICHCAP of UNESCO published Pinagmulan: Enumeration from the Philippine Inventory of Intangible Cultural Heritage.",
            "The first edition of the UNESCO-backed book included (1) Laji, (2) Kapayvanuvanuwa Fishing Ritual, (3) Kapangdeng Ritual, (4) Traditional Boats in Batanes, (5) Sinadumparan Ivatan House Types, (6) Ivatan Basketry, and (7) Ivatan (Salakot) Hat Weaving, signifying their great importance to Philippine intangible cultural heritage.",
            "The local government of Batanes, in cooperation with the NCCA, is given the right to nominate the 7 distinct elements into the UNESCO Intangible Cultural Heritage Lists."
        ],
        [
            "Gallery"
        ],
        [
            "An old Spanish bridge in Ivana"
        ],
        [
            "A rocky shore in Batanes"
        ],
        [
            "Gloomy sky over the lighthouse in Basco"
        ],
        [
            "An Ivatan holding one of many types of traditional Ivatan baskets"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on April 19, 2016.",
            "Retrieved March 5, 2020."
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ Tsang, Cheng-hwa (2000), \"Recent advances in the Iron Age archaeology of Taiwan\", Bulletin of the Indo-Pacific Prehistory Association, 20: 153–158, doi:10.7152/bippa.v20i0.11751"
        ],
        [
            "^ Turton, M. (2021).",
            "Notes from central Taiwan: Our brother to the south.",
            "Taiwan’s relations with the Philippines date back millennia, so it’s a mystery that it’s not the jewel in the crown of the New Southbound Policy.",
            "Taiwan Times."
        ],
        [
            "^ Everington, K. (2017).",
            "Birthplace of Austronesians is Taiwan, capital was Taitung: Scholar.",
            "Taiwan News."
        ],
        [
            "^ Bellwood, P., H. Hung, H., Lizuka, Y.",
            "(2011).",
            "Taiwan Jade in the Philippines: 3,000 Years of Trade and Long-distance Interaction.",
            "Semantic Scholar."
        ],
        [
            "^ https://www.britishmuseum.org/collection/term/BIOG156134#:~:text=The%20unfortunate%20%27Painted%20Prince%27%20was,in%20Oxford%20the%20following%20year."
        ],
        [
            "^ 4000 Years of Migration and Cultural Exchange.",
            "Vol. 40.",
            "ANU Press.",
            "2013.",
            "ISBN 9781925021271.",
            "JSTOR j.ctt5hgz91."
        ],
        [
            "^ Howard T. Fry, \"The Eastern Passage and Its Impact on Spanish Policy in the Philippines, 1758–1790\", Philippine Studies, vol.33, First Quarter, 1985, pp.3–21, p.18."
        ],
        [
            "^ a b Churchill, Bernardita Reyes; Quiason, Serafin D.; Tan, Samuel K. (1998).",
            "The Philippine Revolution and Beyond: Papers from the International Conference on the Centennial of the 1896 Philippine Revolution.",
            "Philippine Centennial Commission, National Commission for Culture and the Arts.",
            "p. 586.",
            "ISBN 9789719201823.",
            "Retrieved September 30, 2019."
        ],
        [
            "^ \"Bashi Strait: a lesson in geography\".",
            "Taipei Times.",
            "September 23, 2004."
        ],
        [
            "^ \"Batan isles have never been part of Philippines - Taipei Times\".",
            "Taipei Times.",
            "May 25, 2013."
        ],
        [
            "^ Chen, Hurng-Yu (September 2021).",
            "\"The Pending Territorial Sovereignty of the Batanes Islands: A Taiwan Perspective\".",
            "Issues & Studies.",
            "57 (3).",
            "doi:10.1142/S1013251121500119.",
            "ISSN 1013-2511."
        ],
        [
            "^ Act No.",
            "1952 (May 20, 1909), An Act to Provide for the Establishment of the Province of Batanes; to Amend Paragraph Seven of Section Sixty-eight of Act Numbered Eleven Hundred and Eighty-nine in Certain Particulars; to Authorize the Provincial Board of the Province of Batanes, With the Approval of the Governor-General, to Extend the Time for the Payment Without Penalty of Taxes and Licenses; to Amend Section Five of Act Numbered Fifteen Hundred and Eighty-two, Entitled \"the Election Law,\" by Increasing the Number of Delegates to the Philippine Assembly to Eighty-one, and for Other Purposes, retrieved June 30, 2023"
        ],
        [
            "^ \"The First Landings\".",
            "Retrieved March 18, 2014."
        ],
        [
            "^ Philippines (August 31, 1942).",
            "Official Gazette Philippines, 1942. p. 447-448.",
            "Retrieved March 2, 2023.",
            "{{cite book}}: |work= ignored (help)"
        ],
        [
            "^ \"Blood and money, not gold and honey, birthed Solid North\".",
            "Rappler.",
            "June 26, 2022.",
            "Retrieved July 13, 2023."
        ],
        [
            "^ \"Pacita Abad: Woman of Color\".",
            "Archived from the original on June 27, 2018.",
            "Retrieved June 27, 2018."
        ],
        [
            "^ Centre, UNESCO World Heritage.",
            "\"Batanes Protected landscapes and seascapes\".",
            "UNESCO World Heritage Centre."
        ],
        [
            "^ \"Pacita Abad Biography – Pacita Abad on artnet\".",
            "www.artnet.com."
        ],
        [
            "^ a b \"Province: Batanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ Clark, Steven (September 14, 2016).",
            "\"Eye of typhoon Meranti passes over Philippines' Itbayat\".",
            "Channel NewsAsia.",
            "Archived from the original on September 15, 2016.",
            "Retrieved September 14, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ www.BatanesOnline.com Archived December 12, 2007, at the Wayback Machine"
        ],
        [
            "^ \"Final Report Batanes Biodiversity Survey\".",
            "quantum-conservation.org.",
            "Archived from the original on January 13, 2017.",
            "Retrieved March 31, 2018."
        ],
        [
            "^ Centre, UNESCO World Heritage.",
            "\"UNESCO World Heritage Centre - Tentative Lists\".",
            "whc.unesco.org.",
            "Retrieved March 31, 2018."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Boston, 677 Huntington Avenue; Ma 02115 +1495‑1000 (December 13, 2017).",
            "\"Vinegar\".",
            "The Nutrition Source.",
            "Retrieved October 9, 2021.",
            "{{cite web}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ \"ICHCAP - e-Knowledge Center\".",
            "www.ichcap.org.",
            "Archived from the original on February 1, 2018.",
            "Retrieved March 31, 2018."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Batanes travel guide from Wikivoyage"
        ],
        [
            " Media related to Batanes at Wikimedia Commons"
        ],
        [
            " Geographic data related to Batanes at OpenStreetMap"
        ],
        [
            "Batanes Islands Cultural Atlas"
        ],
        [
            "Northern Luzon cultures Archived December 23, 2020, at the Wayback Machine"
        ],
        [
            "Batanes Travel and Tours"
        ],
        [
            "Batanes Budget Travel Guide"
        ],
        [
            "TRAVEL TIP: A Guide on Planning a Trip to Batanes"
        ],
        [
            "Places adjacent to Batanes"
        ],
        [
            "Pingtung County,  TaiwanBashi Channel (Luzon Strait)"
        ],
        [
            "South China Sea"
        ],
        [
            "Batanes"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Balintang Channel (Luzon Strait)Cagayan"
        ],
        [
            "vte Province of BatanesBasco (capital and largest municipality)Municipalities"
        ],
        [
            "Basco"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Mahatao"
        ],
        [
            "Sabtang"
        ],
        [
            "Uyugan"
        ],
        [
            "BarangaysSee: List of barangays in Batanes"
        ],
        [
            "Articles related to Batanes"
        ],
        [
            "vteCagayan Valley (Region II)Regional center"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provinces"
        ],
        [
            "Batanes"
        ],
        [
            "Cagayan"
        ],
        [
            "Isabela"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Quirino"
        ],
        [
            "Independent component city"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Aglipay"
        ],
        [
            "Alcala"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Alicia"
        ],
        [
            "Allacapan"
        ],
        [
            "Ambaguio"
        ],
        [
            "Amulung"
        ],
        [
            "Angadanan"
        ],
        [
            "Aparri"
        ],
        [
            "Aritao"
        ],
        [
            "Aurora"
        ],
        [
            "Bagabag"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Bambang"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Buguey"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Diadi"
        ],
        [
            "Diffun"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Echague"
        ],
        [
            "Enrile"
        ],
        [
            "Gamu"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Jones"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Maddela"
        ],
        [
            "Mahatao"
        ],
        [
            "Mallig"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Quezon (Isabela)"
        ],
        [
            "Quezon (Nueva Vizcaya)"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "Sabtang"
        ],
        [
            "Saguday"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Solana"
        ],
        [
            "Solano"
        ],
        [
            "Tuao"
        ],
        [
            "Tumauini"
        ],
        [
            "Uyugan"
        ],
        [
            "Villaverde"
        ],
        [
            "Luzon, Philippines"
        ],
        [
            "vteProtected areas in Cagayan ValleyNational parks"
        ],
        [
            "Bangan Hill"
        ],
        [
            "Fuyot Springs"
        ],
        [
            "Natural parks"
        ],
        [
            "Northern Sierra Madre"
        ],
        [
            "Natural monuments"
        ],
        [
            "Salinas"
        ],
        [
            "Protected landscapes"
        ],
        [
            "Casecnan"
        ],
        [
            "Magapit"
        ],
        [
            "Quirino"
        ],
        [
            "Protected landscapes and seascapes"
        ],
        [
            "Batanes"
        ],
        [
            "Peñablanca"
        ],
        [
            "Resource reserves"
        ],
        [
            "Upper Agno River Basin"
        ],
        [
            "Marine reserves"
        ],
        [
            "Palaui Island"
        ],
        [
            "Watershed forest reserves"
        ],
        [
            "Bawa"
        ],
        [
            "Dupax"
        ],
        [
            "Pantabangan–Carranglan Watershed"
        ],
        [
            "Talavera"
        ],
        [
            "Tumauini"
        ],
        [
            "Wangag"
        ],
        [
            "Wilderness areas"
        ],
        [
            "Isabela"
        ],
        [
            "Protected areas of the Philippines"
        ],
        [
            "vteWorld Heritage Sites in the PhilippinesCultural"
        ],
        [
            "Baroque Churches of the Philippines (San Agustin, Paoay, Santa Maria, Miagao)"
        ],
        [
            "Historic Town of Vigan"
        ],
        [
            "Rice Terraces of the Philippine Cordilleras (Batad, Bangaan, Hungduan, Mayoyao Central, Nagacadan)"
        ],
        [
            "Natural"
        ],
        [
            "Mount Hamiguitan Range Wildlife Sanctuary"
        ],
        [
            "Puerto Princesa Subterranean River National Park"
        ],
        [
            "Tubbataha Reef"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vteRoman Catholic Territorial Prelature of BatanesPraelatura Territorialis BatanensisTerritories"
        ],
        [
            "Batanes"
        ],
        [
            "Ordinaries"
        ],
        [
            "Peregrin de la Fuente Nesta"
        ],
        [
            "Mario de Leon Baltazar"
        ],
        [
            "Paala Jose Salazar"
        ],
        [
            "Camilo Diaz Gregorio"
        ],
        [
            "Cathedral"
        ],
        [
            "Basco Cathedral"
        ],
        [
            "Parishes"
        ],
        [
            "Calayan"
        ],
        [
            "Camiguin"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Mahatao"
        ],
        [
            "Sabtang"
        ],
        [
            "Uyugan-Itbud"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Batanes&oldid=1232549880\""
        ],
        [
            "Categories: BatanesProvinces of the PhilippinesProvinces of Cagayan ValleyIsland provinces of the PhilippinesIslands of LuzonProtected landscapes and seascapes of the PhilippinesStates and territories established in 19091909 establishments in the PhilippinesWorld Heritage Tentative List for the PhilippinesFormer sub-provinces of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: periodical ignoredWebarchive template wayback linksCS1 maint: numeric names: authors listUse mdy dates from December 2022Use Philippine English from December 2022All Wikipedia articles written in Philippine EnglishArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Ivatan-language textArticles containing Filipino-language textPages with Tagalog IPAAll articles with unsourced statementsArticles with unsourced statements from June 2020Wikipedia articles needing clarification from February 2007All pages needing factual verificationWikipedia articles needing factual verification from June 2023Articles with unsourced statements from April 2020All articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from May 2012Articles with unsourced statements from May 2012Articles with unsourced statements from September 2016Articles with unsourced statements from July 2018Wikipedia articles needing context from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiers"
        ]
    ]
}