{
    "name": "Bukidnon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Bukidnon"
        ],
        [
            "41 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 7°55′N 125°05′E﻿ / ﻿7.92°N 125.08°E﻿ / 7.92; 125.08"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "For the indigenous people in the province known as the \"Bukidnon\", see Lumad § Bukidnon."
        ],
        [
            "Province in Northern Mindanao, PhilippinesBukidnonProvinceProvince of BukidnonTop to bottom: Kitanglad Range National Park; Pulangi River at San Jose, Quezon; Bukidnon Welcome Marker at Alae, Manolo Fortich; Mangima Canyon; Bukidnon Provincial Capitol; Overview at Palacapao, Quezon; Kalatungan Range National Park"
        ],
        [
            "FlagSealNicknames: \"The Food Basket of Region X\"  \"The Eco-tourism and Cultural Heritage Capital of Northern Mindanao\"  \"Highland Paradise in the Heart of Mindanao\" • Total1,541,308 • Rank17th out of 81 • Density150/km2 (380/sq mi)  • Rank61st out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "2"
        ],
        [
            " Malaybalay"
        ],
        [
            " Valencia"
        ],
        [
            " • Municipalities"
        ],
        [
            "20"
        ],
        [
            " Baungon"
        ],
        [
            " Cabanglasan"
        ],
        [
            " Damulog"
        ],
        [
            " Dangcagan"
        ],
        [
            " Don Carlos"
        ],
        [
            " Impasugong"
        ],
        [
            " Kadingilan"
        ],
        [
            " Kalilangan"
        ],
        [
            " Kibawe"
        ],
        [
            " Kitaotao"
        ],
        [
            " Lantapan"
        ],
        [
            " Libona"
        ],
        [
            " Malitbog"
        ],
        [
            " Manolo Fortich"
        ],
        [
            " Maramag"
        ],
        [
            " Pangantucan"
        ],
        [
            " Quezon"
        ],
        [
            " San Fernando"
        ],
        [
            " Sumilao"
        ],
        [
            " Talakag"
        ],
        [
            " • Barangays464 • DistrictsLegislative districts of BukidnonTime zoneUTC+8 (PST)ZIP code8700–8723IDD : area code +63 (0)88ISO 3166 codePH-BUKSpoken languagesCebuanoManoboTalaandigMaguindanaonIranunIlocanoHiligaynonHigaononFilipinoEnglish and other minority languagesIncome Classification1st classWebsitewww.bukidnon.gov.ph"
        ],
        [
            "Bukidnon (/buːˈkɪdnɒn/), officially the Province of Bukidnon (Cebuano: Lalawigan sa Bukidnon; Filipino: Lalawigan ng Bukidnon; Hiligaynon: Kapuroan sang Bukidnon; Binukid and Higaonon: Probinsya ta Bukidnon), is a landlocked province in the Philippines located in the Northern Mindanao region."
        ],
        [
            "The province is composed of 2 component cities and 20 municipalities.",
            "It is the third largest province in the country in terms of total area of jurisdiction behind Palawan and Isabela respectively."
        ],
        [
            "The name \"Bukidnon\" means \"highlander\" or \"mountain dweller.\"",
            "Occupying a wide plateau in the north central part of the island of Mindanao, the province is considered to be the food basket of the region, being the major producer of rice and corn.",
            "Products from plantations in the province also include pineapples, bananas and sugarcane."
        ],
        [
            "Situated within Bukidnon is Mount Dulang-dulang, the 2nd highest mountain in the country, with an elevation of 2,938 metres (9,639 ft) located in the Kitanglad Mountain Range."
        ],
        [
            "Bukidnon was consecutively ranked 5th in the list of richest provinces in the Philippines for four straight years according to the Commission on Audit's 2018, 2019, 2020, and 2021 Annual Financial Reports which were posted in 2019, early to late 2021, and 2022, respectively."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "One of the \"tulugan\" at Kaamulan Park, Malaybalay"
        ],
        [
            "According to oral history of the Indigenous people of Bukidnon, there were four main tribes in Central Mindanao: the Maranaos who dwell in Lanao del Sur, and the Maguindanao, Manobo and Talaandig tribes who respectively inhabit the eastern, southern, and north-central portions of the original province of Cotabato.",
            "When the civil government divided central Mindanao into provinces at the turn of the 20th century, the groups included in the province of Bukidnon are the Talaandig and the Manobo, as well as other smaller Lumad tribes.",
            "The Visayans, particularly the Cebuanos and the Hiligaynons from the Northern Mindanao coastline and the southern Visayas, migrated into the province.",
            "The Visayans are still referred to by the Lumad as the dumagat (\"sea people\") to distinguish them from the original mountain tribes.",
            "This was followed by various groups from Luzon, namely, the Ilocanos, the Igorots and the Ivatans, many of whom were merchants and wealthy entrepreneurs.",
            "All contributed massive acculturation among the Indigenous tribes.",
            "Most of those who moved to the mountains and forest continued to hold on their ancestors' cultural heritage.",
            "The wide variety of Filipino groups now thrives in the province and contributed immensely in the socioeconomic development."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Bukidnon Provincial Capitol, Malaybalay"
        ],
        [
            "Bukidnon became a part of Misamis in the latter part of 1850.",
            "The whole area was then called \"Malaybalay\" and the people were known as Bukidnons (highlanders or mountain dwellers)."
        ],
        [
            "American invasion era"
        ],
        [
            "The Philippine Commission, then headed by Commissioner Dean C. Worcester, Secretary of Interior, proposed the separation of Bukidnon from Misamis Province.",
            "On August 20, 1907, the Philippine Commission Act No.",
            "1693 was enacted the Province of Agusan and sub-province of Bukidnon.",
            "Bukidnon became a regular province on March 10, 1917, by virtue of the creation of the Department of Mindanao and Sulu under Act 2711."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "In 1942, invading Japanese troops entered Bukidnon.",
            "Mount Capistrano was a civilian evacuation area in the World War II.",
            "In 1945, the province was liberated from Japanese occupation by Filipino and American troops with the aid of Bukidnon-based Filipino guerrillas during the Second World War."
        ],
        [
            "Geography"
        ],
        [
            "Bukidnon is a landlocked plateau in North Central Mindanao.",
            "It is bounded on the north by Misamis Oriental and Cagayan de Oro; on the south by North Cotabato and Davao City; on the east by Agusan del Sur and Davao del Norte; and west by Lanao del Sur.",
            "It lies between parallels 7°25' and 8°38' north latitude and meridians 124°03' and 125°16' east longitude.",
            "Malaybalay, the capital town, is about 850 kilometers (530 mi) by air from Manila and 91 kilometers (57 mi) by road from Cagayan de Oro."
        ],
        [
            "It has two important landmarks, Mount Kitanglad and Pulangi River.",
            "Mount Kitanglad has a peak of 2,899 meters (9,511 ft) above sea level.",
            "Pulangi River, on the other hand, traverses through the northeastern and southern part of the province towards the Rio Grande de Mindanao."
        ],
        [
            "Land area"
        ],
        [
            "The province's total land area is 10,498.59 square kilometres (4,053.53 sq mi),10,498.59 making it the largest in Mindanao in terms of land area.",
            "It accounts for 59 percent (59%) of Northern Mindanao.",
            "Thirty-eight percent (38%) is classified as alienable and disposable.",
            "The rest is timberland forest."
        ],
        [
            "It also accounts for 80 percent (80%) or 34 million metric tons of the region's nonmetallic mineral deposits, which include high grade white and red clay, gold, chromite, copper, serpentine, manganese, quartz and limestone deposits can also be found in the province."
        ],
        [
            "Topography"
        ],
        [
            "Mangima Canyon at Maluko, Manolo Fortich.",
            "Also located in the town is a canyon near barangay Lunocan, dubbed as the \"Grand Canyon of the Philippines\"."
        ],
        [
            "Much of Bukidnon is an extensive plateau, but the southern and eastern boundaries are mountainous.",
            "The province's average elevation is 915 meters (3,002 ft) above sea level.",
            "The slope gradient peaks at 2,899 meters (9,511 ft) of Mount Kitanglad, an extinct volcano occupying the central portion.",
            "Two other mountain bodies are found in its southern portion, Mount Kalatungan and Mount Tangkulan, which rise to 2,287 meters (7,503 ft) and 1,678 meters (5,505 ft), respectively.",
            "The rest of the province is composed of nearly level terraces, alluvial plains, canyons and gorges.",
            "The volcanic terraces and volcanic foot slopes that are ≥500 m above sea level are estimated to be about 221,600 hectares (548,000 acres)."
        ],
        [
            "Gently rolling grassland plateau are cut by deep and wide canyons of the Cagayan, Pulangi, and Tagoloan rivers and their tributaries, which cover a greater part of the province.",
            "The Bukidnon plateau is mainly of volcanic zone consisting of pyroclastic, basaltic and andesitic cones."
        ],
        [
            "View from Musuan Peak of the Maapag Plain of central Bukidnon.",
            "The foothills of the Kalatungan Mountain Range is visible on the upper right."
        ],
        [
            "The whole eastern and southern border adjoining the provinces of Agusan, Davao del Norte, and Cotabato are covered by lofty and densely forested Pantaron Mountain Range, also known as the Central Cordillera.",
            "The Central Cordillera is a mountain range of sedimentary, metamorphic and igneous rocks.",
            "About 49% of the land resource of the province is of rugged hills and mountains and 33% of undulating to rolling terrain."
        ],
        [
            "At Mailag, 23 kilometers (14 mi) south of Malaybalay, the plateau begins to descend and gradually merges into the lowlands of Cotabato province."
        ],
        [
            "Climate"
        ],
        [
            "Two types of climate are roughly divided by the northern and southern areas of Bukidnon.",
            "The northern part is classified as belonging to Type III, that is, there is no pronounced rain period but relatively dry during the months of November to May.",
            "In the southern portion of the province, the climate is classified as Type IV with no dry season.",
            "The driest area is Baungon, while the wettest is the Calabugao plain.",
            "The climate is relatively cool and humid throughout the year."
        ],
        [
            "The average annual rainfall is 2,800 millimeters (110 in).",
            "Just like in other parts of the country, rainfall is more pronounced from June to October compared to other months of the year.",
            "February to April are the drier months."
        ],
        [
            "Temperature ranges vary with elevation.",
            "In areas lower than 500 meters (1,600 ft) above sea level (m.a.s.l.",
            "), the recorded temperature range is between 20 and 34 °C (68 and 93 °F).",
            "Areas with elevations greater than 500 meters (1,600 ft) above sea level would have temperatures ranging from 18 to 28 °C (64 to 82 °F)."
        ],
        [
            "Relative humidity also varies with elevation, with those above 500 m having relative humidity of about 80%, while areas lying below 500 meters (1,600 ft), 65-7 percent.",
            "Thus, the Malaybalay-Impasugong area and those around the volcanic cones approximate semi-temperate conditions and can support the cultivation of highland tropical crops."
        ],
        [
            "Based on the records of climatological stations within and near the province, lithology and land form, three agro-ecological zones are identified.",
            "One covers the mountainous eastern side (Central Cordillera), which is generally wet, with rainfall of about 2,340 to 4,000 millimeters (92 to 157 in) per annum.",
            "Another covers the high altitude volcanic plains, the Malaybalay-Impasug-ong area, and the foot slopes of Mount Kitanglad, and Mount Kalatungan.",
            "These areas have an annual rainfall in the range of 2,490 to 3,680 millimeters (98 to 145 in).",
            "The third zone covers the south-central and the north-western parts of the province, with elevations of less than 500 meters, relatively dry with mean annual rainfall in the range of 1,700 to 2,600 millimeters (67 to 102 in)."
        ],
        [
            "Bodies of water"
        ],
        [
            "A waterfall found within the boundaries of the Kalatungan Mountain Range"
        ],
        [
            "Rivers"
        ],
        [
            "Bukidnon is home to the largest concentration of watersheds in Mindanao.",
            "It is endowed with six major river systems, namely: Pulangi, Tagoloan, Cagayan, Manupali, Muleta, and Bobonawan rivers.",
            "These rivers and their tributaries carved the landscape of the province, creating numerous canyons into the plateau."
        ],
        [
            "The Pulangi River, considered the longest river in the province, is a tributary of the Rio Grande de Mindanao.",
            "Its headwaters are found in the mountains of Kalabugao, Impasugong.",
            "It is the largest as well as the longest river found in the province.",
            "It covers the following cities and municipalities of the province: Impasugong, Malaybalay, Cabanglasan, San Fernando, Valencia, Maramag, Quezon, Don Carlos, Kitaotao, Dangcagan, Kibawe and Damulog."
        ],
        [
            "The Tagoloan River has its headwaters in the mountains of Can-ayan, Malaybalay.",
            "It traverses the province northwestward passing through Malaybalay, Impasugong, Sumilao, Manolo Fortich, Malitbog and finally empties into the sea at Tagoloan, Misamis Oriental."
        ],
        [
            "The Pulangi River winding through the Maapag Plain in Valencia City"
        ],
        [
            "The Cagayan River watershed is found mostly in the municipality of Talakag.",
            "Its headwaters are found in the Kitanglad Mountain Range in central Bukidnon.",
            "The river flows northward through the municipalities of Talakag and Baungon.",
            "Its mouth lies at Cagayan de Oro in Misamis Oriental, where it is the main source of potable water."
        ],
        [
            "The Manupali River, a major tributary of the Pulangi River, starts in the mountains of Lantapan, Bukidnon, picking up tributaries along the way from the Kalatungan and Kitanglad Mountain Ranges.",
            "It forms part of the natural boundary of the Valencia and Lantapan.",
            "It flows eastward towards Malaybalay, eventually joining the Pulangi River in Valencia."
        ],
        [
            "The Muleta River is found in the southern portion of the province covering the municipalities of Pangantucan, Don Carlos, Kitaotao, Dangcagan, Kibawe, Kadingilan and Damulog.",
            "It is another important tributary of the Pulangi River and flows southward.",
            "It will join the Pulangi River in the boundary of Bukidnon and Cotabato province."
        ],
        [
            "The Blue Water Cave in Quezon"
        ],
        [
            "The Bobonawan River, found in the municipality of Cabanglasan, is another tributary of the Pulangi River.",
            "It covers most of the parts of the municipality, flowing southward towards Pulangi River."
        ],
        [
            "Lakes"
        ],
        [
            "Aside from the relatively important river systems, various lakes also dot the landscape of the province.",
            "Pinamaloy Lake, in Don Carlos, Bukidnon, is the largest in the province covering about 50 hectares.",
            "It was named after Barangay Pinamaloy, where the lake is located.",
            "Another lake is found in Pigtauranan, Pangantucan called the Napalit Lake.",
            "The lake covers an area of 36 hectares and is one of the tourist spots in Pangantucan, Bukidnon.",
            "There are 24 floating islets in the lake.",
            "The third significant inland body of water in the province is Apo Lake at Guinoyoran, Valencia.",
            "It occupies an approximate area of 25 hectares.",
            "A man-made lake called Maramag Basin is found in Maramag, Bukidnon, which was the result of the construction of the Pulangi IV Hydroelectric Dam of the National Power Corporation (NPC) in the course of the Pulangi River."
        ],
        [
            "Springs and waterfalls"
        ],
        [
            "There are also numerous springs and waterfalls located in the province.",
            "Some of the waterfalls include the Alalum Falls, Dimadungawan Falls, Dila Falls, Gantungan Falls, Natigbasan Falls, Sagumata Falls, Magubo Falls, and Balisbisan Falls."
        ],
        [
            "Biodiversity"
        ],
        [
            "The Pantaron Mountain Range in Bukidnon is a biodiverse area that hosts endemic fauna.",
            "It is home to the critically endangered Philippine eagle, the vulnerable Philippine deer, the Philippine flying lemur, and the Mindanao gymnure."
        ],
        [
            "Mount Musuan and Mount Kalatungan, along with Mount Malindang in Misamis Occisdental, are also home to the Philippine eagle, Aceros leococephalus, and Tarsius syrichta.",
            "The three mountains are home to more than 1,000 plant species, including 12 that are endangered, 221 that are endemic, 17 that are rare, and 187 that are economically or socioculturally important."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Bukidnon is subdivided into 20 municipalities and 2 cities."
        ],
        [
            "Political divisions"
        ],
        [
            " †  Provincial capital and component city ∗  Component city  Municipality"
        ],
        [
            "City ormunicipality"
        ],
        [
            "Date ofcreation"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Baungon"
        ],
        [
            "13 Feb 1957"
        ],
        [
            "2.4%"
        ],
        [
            "37,111"
        ],
        [
            "34,336"
        ],
        [
            "+1.49%"
        ],
        [
            "328.34"
        ],
        [
            "126.77"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "16"
        ],
        [
            "8°18′45″N 124°41′14″E﻿ / ﻿8.3125°N 124.6871°E﻿ / 8.3125; 124.6871﻿ (Baungon)"
        ],
        [
            "Cabanglasan"
        ],
        [
            "13 Aug 1979"
        ],
        [
            "2.4%"
        ],
        [
            "36,286"
        ],
        [
            "33,997"
        ],
        [
            "+1.25%"
        ],
        [
            "243.30"
        ],
        [
            "93.94"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "15"
        ],
        [
            "8°04′35″N 125°18′04″E﻿ / ﻿8.0765°N 125.3011°E﻿ / 8.0765; 125.3011﻿ (Cabanglasan)"
        ],
        [
            "Damulog"
        ],
        [
            "16 Aug 1971"
        ],
        [
            "2.6%"
        ],
        [
            "39,322"
        ],
        [
            "30,302"
        ],
        [
            "+5.09%"
        ],
        [
            "244.19"
        ],
        [
            "94.28"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "17"
        ],
        [
            "7°28′53″N 124°56′20″E﻿ / ﻿7.4813°N 124.9388°E﻿ / 7.4813; 124.9388﻿ (Damulog)"
        ],
        [
            "Dangcagan"
        ],
        [
            "29 Aug 1961"
        ],
        [
            "1.7%"
        ],
        [
            "26,076"
        ],
        [
            "23,723"
        ],
        [
            "+1.82%"
        ],
        [
            "422.69"
        ],
        [
            "163.20"
        ],
        [
            "62"
        ],
        [
            "160"
        ],
        [
            "14"
        ],
        [
            "7°36′36″N 125°00′15″E﻿ / ﻿7.6099°N 125.0041°E﻿ / 7.6099; 125.0041﻿ (Dangcagan)"
        ],
        [
            "Don Carlos"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "4.5%"
        ],
        [
            "69,273"
        ],
        [
            "66,959"
        ],
        [
            "+0.65%"
        ],
        [
            "213.72"
        ],
        [
            "82.52"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "29"
        ],
        [
            "7°41′02″N 124°59′41″E﻿ / ﻿7.6838°N 124.9946°E﻿ / 7.6838; 124.9946﻿ (Don Carlos)"
        ],
        [
            "Impasugong"
        ],
        [
            "6 Sep 1877"
        ],
        [
            "3.5%"
        ],
        [
            "53,863"
        ],
        [
            "47,859"
        ],
        [
            "+2.28%"
        ],
        [
            "1,051.17"
        ],
        [
            "405.86"
        ],
        [
            "51"
        ],
        [
            "130"
        ],
        [
            "13"
        ],
        [
            "8°18′12″N 125°00′03″E﻿ / ﻿8.3033°N 125.0008°E﻿ / 8.3033; 125.0008﻿ (Impasugong)"
        ],
        [
            "Kadingilan"
        ],
        [
            "16 Aug 1971"
        ],
        [
            "2.2%"
        ],
        [
            "33,735"
        ],
        [
            "33,778"
        ],
        [
            "−0.02%"
        ],
        [
            "171.94"
        ],
        [
            "66.39"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "17"
        ],
        [
            "7°36′00″N 124°54′36″E﻿ / ﻿7.6001°N 124.9099°E﻿ / 7.6001; 124.9099﻿ (Kadingilan)"
        ],
        [
            "Kalilangan"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "2.8%"
        ],
        [
            "43,711"
        ],
        [
            "41,601"
        ],
        [
            "+0.95%"
        ],
        [
            "251.43"
        ],
        [
            "97.08"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "14"
        ],
        [
            "7°44′48″N 124°44′53″E﻿ / ﻿7.7468°N 124.7480°E﻿ / 7.7468; 124.7480﻿ (Kalilangan)"
        ],
        [
            "Kibawe"
        ],
        [
            "1 Jul 1956"
        ],
        [
            "2.7%"
        ],
        [
            "41,897"
        ],
        [
            "39,612"
        ],
        [
            "+1.07%"
        ],
        [
            "304.13"
        ],
        [
            "117.43"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "23"
        ],
        [
            "7°34′04″N 124°59′25″E﻿ / ﻿7.5678°N 124.9903°E﻿ / 7.5678; 124.9903﻿ (Kibawe)"
        ],
        [
            "Kitaotao"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "3.5%"
        ],
        [
            "53,796"
        ],
        [
            "50,260"
        ],
        [
            "+1.30%"
        ],
        [
            "788.78"
        ],
        [
            "304.55"
        ],
        [
            "68"
        ],
        [
            "180"
        ],
        [
            "35"
        ],
        [
            "7°38′20″N 125°00′27″E﻿ / ﻿7.6390°N 125.0074°E﻿ / 7.6390; 125.0074﻿ (Kitaotao)"
        ],
        [
            "Lantapan"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "4.3%"
        ],
        [
            "65,974"
        ],
        [
            "61,776"
        ],
        [
            "+1.26%"
        ],
        [
            "328.35"
        ],
        [
            "126.78"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "14"
        ],
        [
            "8°01′34″N 124°59′17″E﻿ / ﻿8.0262°N 124.9880°E﻿ / 8.0262; 124.9880﻿ (Lantapan)"
        ],
        [
            "Libona"
        ],
        [
            "1 Jul 1956"
        ],
        [
            "3.2%"
        ],
        [
            "48,965"
        ],
        [
            "43,969"
        ],
        [
            "+2.07%"
        ],
        [
            "374.37"
        ],
        [
            "144.55"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "14"
        ],
        [
            "8°20′05″N 124°44′37″E﻿ / ﻿8.3346°N 124.7435°E﻿ / 8.3346; 124.7435﻿ (Libona)"
        ],
        [
            "Malaybalay"
        ],
        [
            "†"
        ],
        [
            "19 Oct 1907"
        ],
        [
            "12.4%"
        ],
        [
            "190,712"
        ],
        [
            "174,625"
        ],
        [
            "+1.69%"
        ],
        [
            "969.19"
        ],
        [
            "374.21"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "46"
        ],
        [
            "8°09′19″N 125°07′49″E﻿ / ﻿8.1553°N 125.1304°E﻿ / 8.1553; 125.1304﻿ (Malaybalay)"
        ],
        [
            "Malitbog"
        ],
        [
            "25 Jun 1963"
        ],
        [
            "1.7%"
        ],
        [
            "26,741"
        ],
        [
            "24,453"
        ],
        [
            "+1.72%"
        ],
        [
            "581.85"
        ],
        [
            "224.65"
        ],
        [
            "46"
        ],
        [
            "120"
        ],
        [
            "11"
        ],
        [
            "8°32′11″N 124°52′45″E﻿ / ﻿8.5363°N 124.8792°E﻿ / 8.5363; 124.8792﻿ (Malitbog)"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "21 Jun 1957"
        ],
        [
            "7.3%"
        ],
        [
            "113,200"
        ],
        [
            "100,210"
        ],
        [
            "+2.35%"
        ],
        [
            "413.60"
        ],
        [
            "159.69"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "22"
        ],
        [
            "8°21′57″N 124°51′49″E﻿ / ﻿8.3659°N 124.8637°E﻿ / 8.3659; 124.8637﻿ (Manolo Fortich)"
        ],
        [
            "Maramag"
        ],
        [
            "1 Jul 1956"
        ],
        [
            "7.0%"
        ],
        [
            "108,293"
        ],
        [
            "102,089"
        ],
        [
            "+1.13%"
        ],
        [
            "447.26"
        ],
        [
            "172.69"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "20"
        ],
        [
            "7°45′40″N 125°00′17″E﻿ / ﻿7.7611°N 125.0047°E﻿ / 7.7611; 125.0047﻿ (Maramag)"
        ],
        [
            "Pangantucan"
        ],
        [
            "25 Jun 1963"
        ],
        [
            "3.7%"
        ],
        [
            "56,580"
        ],
        [
            "53,126"
        ],
        [
            "+1.21%"
        ],
        [
            "461.72"
        ],
        [
            "178.27"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "19"
        ],
        [
            "7°49′56″N 124°49′42″E﻿ / ﻿7.8322°N 124.8282°E﻿ / 7.8322; 124.8282﻿ (Pangantucan)"
        ],
        [
            "Quezon"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "7.1%"
        ],
        [
            "109,624"
        ],
        [
            "104,116"
        ],
        [
            "+0.99%"
        ],
        [
            "626.86"
        ],
        [
            "242.03"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "31"
        ],
        [
            "7°43′51″N 125°06′00″E﻿ / ﻿7.7309°N 125.1000°E﻿ / 7.7309; 125.1000﻿ (Quezon)"
        ],
        [
            "San Fernando"
        ],
        [
            "18 Jun 1966"
        ],
        [
            "4.1%"
        ],
        [
            "63,045"
        ],
        [
            "56,138"
        ],
        [
            "+2.23%"
        ],
        [
            "705.06"
        ],
        [
            "272.23"
        ],
        [
            "89"
        ],
        [
            "230"
        ],
        [
            "24"
        ],
        [
            "7°55′00″N 125°19′43″E﻿ / ﻿7.9168°N 125.3287°E﻿ / 7.9168; 125.3287﻿ (San Fernando)"
        ],
        [
            "Sumilao"
        ],
        [
            "1 Jul 1956"
        ],
        [
            "1.9%"
        ],
        [
            "29,531"
        ],
        [
            "27,660"
        ],
        [
            "+1.25%"
        ],
        [
            "196.95"
        ],
        [
            "76.04"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "10"
        ],
        [
            "8°19′37″N 124°58′40″E﻿ / ﻿8.3270°N 124.9779°E﻿ / 8.3270; 124.9779﻿ (Sumilao)"
        ],
        [
            "Talakag"
        ],
        [
            "22 Feb 1917"
        ],
        [
            "5.0%"
        ],
        [
            "77,027"
        ],
        [
            "71,644"
        ],
        [
            "+1.39%"
        ],
        [
            "786.40"
        ],
        [
            "303.63"
        ],
        [
            "98"
        ],
        [
            "250"
        ],
        [
            "29"
        ],
        [
            "8°13′56″N 124°36′13″E﻿ / ﻿8.2322°N 124.6035°E﻿ / 8.2322; 124.6035﻿ (Talakag)"
        ],
        [
            "Valencia City"
        ],
        [
            "∗"
        ],
        [
            "16 Jan 1961"
        ],
        [
            "14.0%"
        ],
        [
            "216,546"
        ],
        [
            "192,993"
        ],
        [
            "+2.22%"
        ],
        [
            "587.29"
        ],
        [
            "226.75"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "31"
        ],
        [
            "7°54′10″N 125°05′23″E﻿ / ﻿7.9028°N 125.0898°E﻿ / 7.9028; 125.0898﻿ (Valencia)"
        ],
        [
            "Total"
        ],
        [
            "1,541,308"
        ],
        [
            "1,415,226"
        ],
        [
            "+1.64%"
        ],
        [
            "10,498.59"
        ],
        [
            "4,053.53"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "464"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Barangays"
        ],
        [
            "Pulangi Riverside Boulevard"
        ],
        [
            "The province has 464 barangays under its jurisdiction.",
            "The table below shows the Top 20 Largest Barangays according to population."
        ],
        [
            "Rank"
        ],
        [
            "Barangay"
        ],
        [
            "City/Municipality"
        ],
        [
            "Population (2015)"
        ],
        [
            "1"
        ],
        [
            "Poblacion"
        ],
        [
            "Valencia"
        ],
        [
            "35,793"
        ],
        [
            "2"
        ],
        [
            "Casisang"
        ],
        [
            "Malaybalay City"
        ],
        [
            "25,696"
        ],
        [
            "3"
        ],
        [
            "Lumbo"
        ],
        [
            "Valencia"
        ],
        [
            "16,082"
        ],
        [
            "4"
        ],
        [
            "Poblacion"
        ],
        [
            "Quezon"
        ],
        [
            "15,247"
        ],
        [
            "5"
        ],
        [
            "North Poblacion"
        ],
        [
            "Maramag"
        ],
        [
            "14,799"
        ],
        [
            "6"
        ],
        [
            "Dologon"
        ],
        [
            "Maramag"
        ],
        [
            "14,093"
        ],
        [
            "7"
        ],
        [
            "Butong"
        ],
        [
            "Quezon"
        ],
        [
            "13,258"
        ],
        [
            "8"
        ],
        [
            "South Poblacion"
        ],
        [
            "Maramag"
        ],
        [
            "12,165"
        ],
        [
            "9"
        ],
        [
            "Damilag"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "11,713"
        ],
        [
            "10"
        ],
        [
            "Batangan"
        ],
        [
            "Valencia"
        ],
        [
            "11,550"
        ],
        [
            "11"
        ],
        [
            "Kisolon"
        ],
        [
            "Sumilao"
        ],
        [
            "11,532"
        ],
        [
            "12"
        ],
        [
            "Don Carlos Sur (Poblacion)"
        ],
        [
            "Don Carlos"
        ],
        [
            "11,385"
        ],
        [
            "13"
        ],
        [
            "Poblacion"
        ],
        [
            "Impasugong"
        ],
        [
            "11,279"
        ],
        [
            "14"
        ],
        [
            "Poblacion"
        ],
        [
            "Pangantucan"
        ],
        [
            "10,970"
        ],
        [
            "15"
        ],
        [
            "Bagontaas"
        ],
        [
            "Valencia"
        ],
        [
            "10,619"
        ],
        [
            "16"
        ],
        [
            "Halapitan (Poblacion)"
        ],
        [
            "San Fernando"
        ],
        [
            "10,221"
        ],
        [
            "17"
        ],
        [
            "Agusan Canyon"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "11,385"
        ],
        [
            "18"
        ],
        [
            "Sumpong"
        ],
        [
            "Malaybalay"
        ],
        [
            "9,302"
        ],
        [
            "19"
        ],
        [
            "Alae"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "9,135"
        ],
        [
            "20"
        ],
        [
            "Barangay 9 (Poblacion)"
        ],
        [
            "Malaybalay"
        ],
        [
            "9,033"
        ],
        [
            "Legislative districts"
        ],
        [
            "Main article: Legislative districts of Bukidnon"
        ],
        [
            "Bukidnon has four legislative districts namely the first, second, third and fourth districts."
        ],
        [
            "Legislative District"
        ],
        [
            "City/Municipality"
        ],
        [
            "Land Area"
        ],
        [
            "Population (2015)"
        ],
        [
            "Density (2010)"
        ],
        [
            "1st District"
        ],
        [
            "Municipalities: Baungon, Libona, Malitbog, Manolo Fortich, Sumilao and Talakag"
        ],
        [
            "2,229.17 km2"
        ],
        [
            "302,272"
        ],
        [
            "125.14 person/km2"
        ],
        [
            "2nd District"
        ],
        [
            "City: Malaybalay City"
        ],
        [
            "Municipalities: Cabanglasan, Impasugong, Lantapan and San Fernando"
        ],
        [
            "3,144.44 km2"
        ],
        [
            "374,395"
        ],
        [
            "106.60 person/km2"
        ],
        [
            "3rd District"
        ],
        [
            "Municipalities: Damulog, Dangcagan, Don Carlos, Kadingilan, Kibawe, Kitaotao, Maramag and Quezon"
        ],
        [
            "1,816.11 km2"
        ],
        [
            "450,839"
        ],
        [
            "228.08 person/km2"
        ],
        [
            "4th District"
        ],
        [
            "City: Valencia"
        ],
        [
            "Municipalities: Kalilangan and Pangantucan"
        ],
        [
            "1,104.06 km2"
        ],
        [
            "287,720"
        ],
        [
            "244.71 person/km2"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of BukidnonYearPop.±% p.a.1903 21,163—    1918 46,519+5.39%1939 57,561+1.02%1948 63,470+1.09%1960 194,368+9.77%YearPop.±% p.a.1970 414,762+7.86%1975 532,818+5.15%1980 631,634+3.46%1990 843,891+2.94%1995 940,403+2.05%YearPop.±% p.a.2000 1,060,415+2.61%2007 1,190,284+1.61%2010 1,299,192+3.24%2015 1,415,226+1.64%2020 1,541,308+1.69%Source: Philippine Statistics Authority"
        ],
        [
            "Based on the 2020 census, Bukidnon has a total population of 1,541,308 residents."
        ],
        [
            "In the 2000 census, males slightly edge the females with 546,234, accounting for about 52% of the province's total population while females, with 514,181, account about 48%.",
            "Based on age distribution, Bukidnon has a fairly young population, with ages 14 and below accounting 42.15% or 446, 952.",
            "The 15-34 age bracket account for 33.68% of the province's population or 357,112.",
            "Ages 55 and above barely accounts 6.5% of the total.",
            "The average population growth rate of the province is 2.05% (2.03% if exponential) from 2000 to 2010.",
            "Male-to-female ratio in the province stood at 1.06."
        ],
        [
            "Population density"
        ],
        [
            "The average population density for the province is 128 persons per square km.",
            "The cities/municipalities with the highest population densities are the following: Don Carlos (353/km2), Kitaotao (250/km2), Valencia (244/km2), Maramag (213/km2) and Quezon (202/km2).",
            "The cities/municipalities with the lowest densities, on the other hand are: Impasugong (29/km2), Talakag (58/km2), San Fernando (63/km2), Malitbog (75/km2) and Damulog (83/km2)."
        ],
        [
            "Population by congressional districts"
        ],
        [
            "Population percentage by District (2010)"
        ],
        [
            "District III has the highest population among the four provincial congressional districts, with 31.86% of the total population of the province.",
            "It is followed by District II with 26.45% of the total population and District I with a population share of 21.36%.",
            "The least populated district is District IV with population percentage share of 20.33%."
        ],
        [
            "Valencia has the highest population among the cities/municipalities of the province with 192,993 inhabitants, accounting 13.64% of the province's total.",
            "It is closely followed by Malaybalay with 174,625 inhabitants or 12.34% of the provincial population.",
            "Quezon is at third with 104,116 inhabitants or 7.36% of the total, with Maramag and Manolo Fortich rounding out the fourth and fifth with 102,089 and 100,210 inhabitants, respectively."
        ],
        [
            "The four largest local government units of Bukidnon (Valencia, Malaybalay, Quezon, and Maramag) are clustered together in the central part of the province.",
            "It is also in the national roads of these cities/municipalities that daily road use volume are high."
        ],
        [
            "Languages"
        ],
        [
            "Languages Spoken (2010)"
        ],
        [
            "Language"
        ],
        [
            "Speakers"
        ],
        [
            "Cebuano/Bisaya"
        ],
        [
            "734,848"
        ],
        [
            "Higaonon"
        ],
        [
            "154,295"
        ],
        [
            "Hiligaynon"
        ],
        [
            "119,133"
        ],
        [
            "Binukid/Bukidnon"
        ],
        [
            "76,812"
        ],
        [
            "Talaandig"
        ],
        [
            "55,757"
        ],
        [
            "Ilocano"
        ],
        [
            "26,954"
        ],
        [
            "Matigsalug"
        ],
        [
            "18,263"
        ],
        [
            "Others"
        ],
        [
            "108,815"
        ],
        [
            "The lingua franca of the region is Cebuano.",
            "Minority languages include Higaonon, Bukid, Ilianen, Matigsalug, Hiligaynon, Maranao, Maguindanao, Iranun, Ilocano, and Waray.",
            "Tagalog and English are generally understood and widely used in schools, business, and government offices."
        ],
        [
            "Ethnicity"
        ],
        [
            "Bukidnon's population by ethnic origin (2000)"
        ],
        [
            "According to ethnicity, majority of the people in Bukidnon are Cebuano accounting for approximately 41% of the total population.",
            "The Bukidnon Lumads (Bukidnon, Higaonon, Manobo, Talaandig, etc.)",
            "account for about 24% of the total population of the province.",
            "The Maranaos form about 8% of the total population followed by the Hiligaynon/Ilonggo and Boholano groups with 12.7% and 7.37%, respectively, of the province's total population."
        ],
        [
            "Indigenous inhabitants of Bukidnon are the Lumad peoples, including the Bukidnon, Higaonon, Manobo, and Talaandig.",
            "Their cultures and traditions are embodied in oral folk literature of the province, which are classified into; antoka (riddles), basahan (proverbs or wise sayings), kaliga (ceremonial songs), limbay (lyric poem), sala (love song), idangdang (ballad), ulaging (epic), and nanangon (folktales).",
            "Religion is monotheistic.",
            "They believe in one God.",
            "Magbabaya (the ruler of all) has minor gods and goddesses under his command (Example: Bulalakaw watches rivers and lakes, Tumpas Nanapiyaw or Itumbangol watches the bases of the earth, night, and day)."
        ],
        [
            "Many of the province's inhabitants, however, are descendants of immigrants from Cebu or elsewhere in Central Visayas."
        ],
        [
            "Religion"
        ],
        [
            "Religion in Bukidnon"
        ],
        [
            "Religion"
        ],
        [
            "percentage"
        ],
        [
            "Roman Catholic"
        ],
        [
            "80.7%"
        ],
        [
            "Protestant  (other Christians)"
        ],
        [
            "15%"
        ],
        [
            "Islam"
        ],
        [
            "4%"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Catholicism"
        ],
        [
            "The majority of the population are Christians (predominantly Roman Catholic, 80.7%."
        ],
        [
            "Others"
        ],
        [
            "Significant other Christian denomination minority at 15%, followed by Islam (4%), and other religious groups comprising 0.3%.",
            "Ethnic religion is still in practice by native Lumads across the province."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Bukidnon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  43.55"
        ],
        [
            "2009  45.97"
        ],
        [
            "2012  49.00"
        ],
        [
            "2015  54.01"
        ],
        [
            "2018  27.56"
        ],
        [
            "2021  22.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Binaki, a type of steamed corn cake wrapped with corn husks is believed to have originated in Bukidnon"
        ],
        [
            "Bukidnon is an agricultural economy.",
            "It is a major producer of rice, maize, sugar, coffee, rubber, pineapple, banana, tomato, flowers, cassava, and other fruits and vegetables.",
            "Almost all large firms operating in the province are into production or processing of these agricultural products.",
            "Recognized by the Food and Agriculture Organization as a foot-and-mouth disease-free province, it is also a major producer of poultry, hogs, goats, and cattle."
        ],
        [
            "The Philippine Carabao Center's outlet in Central Mindanao University makes dairy products from water buffalos.",
            "Due to being landlocked, Bukidnon relies on the nearby cities of Cagayan de Oro and Davao for the supply of marine products.",
            "However, the province has its own supply of freshwater products such as tilapia, carp, catfish, mudfish, gourami, barb, goby, climbing perch, freshwater eels, giant freshwater prawn or shrimps, native freshwater snails or freshwater clams, and freshwater crabs, either via inland fishing or fry production aquaculture in inland fish farms and fish hatcheries."
        ],
        [
            "Del Monte Pineapple fields in Manolo Fortich"
        ],
        [
            "Del Monte Philippines, Inc. (DMPI), Lapanday Diversified Products Corp. and Mt.",
            "Kitanglad Agri-Development Corporation are engaged in pineapple production.",
            "Dole Philippines (Skyland) and Mt.",
            "Kitanglad Agri-Ventures, Inc. are into banana production.",
            "DMPI is also engaged in cattle fattening.",
            "Bukidnon Sugar Milling Corporation (BUSCO) and Crystal Sugar Milling are into sugar milling and refining."
        ],
        [
            "Phil-Agro Industrial Corporation is in starch production.",
            "Menzi Agricultural Development is in cacao production.",
            "Agaropyta Phils.",
            "Inc., Bukidnon Greens Inc., FP Obrero Farms and ARDEM, Inc. are in cutflower production."
        ],
        [
            "Food manufacturing giants, San Miguel Foods Corp. (SMPFCI), Monterey Farms Corp., Swift Foods, Inc. have intensified their contract breeding and growing operations in the province.",
            "Valencia Rubbertex, Inc., an 80-20 Japanese-Filipino joint venture produces rubber boots and rubber shoes for Japan."
        ],
        [
            "Robinsons Place Valencia"
        ],
        [
            "As one of the major anchors in crop production, Bukidnon is moving forward towards establishing its position as a principal trader of rice, corn, sugar, potato, tomato and many other commercial and industrial crops.",
            "As the second largest producer of corn in the country, it reached a total production of 481,370 metric tons.",
            "In year 2000, vast tracts of cornfields, rice paddles, and sugar plantations are distributed all over the province."
        ],
        [
            "Bukidnon has already assumed its role as producer and supplier of fresh fruits and vegetables.",
            "These produce are either sold in domestic markets or exported to Japan and other neighboring countries.",
            "Fresh pineapples, banana, sugarcane and cutflower grown over the years are among its exports.",
            "New agri-business industries are still growing such as strawberry farming.",
            "Even export of rubber boots and shoes, an infant industry in the province is increasing tremendously."
        ],
        [
            "A wide variety of resource-based handicrafts is extensively produced from rattan, bamboo, and wood.",
            "San Fernando is known for its rattan furniture.",
            "Bamboo baskets, wood wares and carvings, mats, and other handmade products are ideal souvenir items."
        ],
        [
            "Bukidnon Investment Grid"
        ],
        [
            "During the mid-1990s, the provincial government of Bukidnon, after careful studies and consultation, has adopted a strategic program called the Bukidnon Investment Grid or BIG.",
            "This program is aimed to confine all its investment promotion activities and projects to the strip of land three kilometers from both sides of the Sayre Highway from Damulog to Manolo Fortich, and along the national/provincial road from Kibawe to Kadingilan; Don Carlos to Kadingilan; Maramag to Quezon; Maramag to Kadingilan; Kadingilan to Pangantucan; Valencia City to San Fernando; Malaybalay City to Cabanglasan; Malaybalay to Lantapan; Manolo Fortich to Libona; Libona to Cagayan de Oro; Talakag to Pangantucan; and Malitbog to Tagoloan in Misamis Oriental."
        ],
        [
            "Transportation"
        ],
        [
            "The province is very well accessible by road primarily from the cities of Cagayan de Oro and Davao with alternate road networks as well from the cities of Butuan (via Agusan del Sur), Iligan (via Talakag), Marawi (via Talakag), Tagum (via San Fernando), and the province of Cotabato."
        ],
        [
            "Sayre Highway in Malaybalay City"
        ],
        [
            "The entire province is bisected from north to south by the four-lane Sayre Highway from Cagayan de Oro to Kabacan, North Cotabato via Maramag (Bukidnon–Cotabato Road); and by the two-to-four lane Bukidnon–Davao Road (colloquially known as \"BuDa\") from Quezon to Davao City.",
            "Both are components of National Route 10 (N10) of the Philippine highway network, and a spur of the Asian Highway 26 (AH26) of the Asian highway network.",
            "The Sayre Highway intersects with the BuDa Road in the barrio of Dologon in Maramag, where it changes to route N943 and continues on to Dangcagan, Damulog, and Kabacan."
        ],
        [
            "The Sayre Highway (formerly \"Route 3\") was renamed in honor of Francis Bowes Sayre, Sr., the U.S. Philippine High Commissioner who spearheaded its construction during the American occupation of the Philippines."
        ],
        [
            "There are several airstrips in the province being used by private firms.",
            "Commercial flights used to be flown from the Malaybalay Airstrip, but it was closed down by the provincial government in the late 1990s.",
            "The airport where it used to be located was converted into a low-cost housing project.",
            "A proposed domestic airport site in the municipality of Don Carlos has already been on the talks since 2008 and in 2013, the Bukidnon Airport Development Project proposal was finalized.",
            "There are no seaports in Bukidnon because the province is landlocked.",
            "The nearest passenger seaport is in Cagayan de Oro."
        ],
        [
            "Education"
        ],
        [
            "Universities and colleges"
        ],
        [
            "The following universities and colleges of Bukidnon are the tertiary schools."
        ],
        [
            "Main entrance to the Central Mindanao University grounds"
        ],
        [
            "Valencia Colleges (Bukidnon), Inc."
        ],
        [
            "School"
        ],
        [
            "Location"
        ],
        [
            "ACLC College of Bukidnon"
        ],
        [
            "Hagkol, Valencia"
        ],
        [
            "Bukidnon State University"
        ],
        [
            "Malaybalay"
        ],
        [
            "Central Mindanao University"
        ],
        [
            "Musuan, Maramag, Bukidnon"
        ],
        [
            "Don Carlos Polytechnic College"
        ],
        [
            "Poblacion, Don Carlos, Bukidnon"
        ],
        [
            "IBA College of Mindanao"
        ],
        [
            "Valencia, Bukidnon"
        ],
        [
            "Maramag Polytechnic College"
        ],
        [
            "North Poblacion, Maramag, Bukidnon"
        ],
        [
            "Mindanao Arts and Technological Institute"
        ],
        [
            "Malaybalay"
        ],
        [
            "Mountain View College"
        ],
        [
            "MVC Complex, Mt.",
            "Nebo, Valencia"
        ],
        [
            "Northern Bukidnon State College"
        ],
        [
            "Manolo Fortich, Bukidnon"
        ],
        [
            "Philippine College Foundation"
        ],
        [
            "Valencia, Bukidnon"
        ],
        [
            "Philippine Countryville College"
        ],
        [
            "Maramag, Bukidnon"
        ],
        [
            "Quezon Institute of Technology, Inc."
        ],
        [
            "Quezon, Bukidnon"
        ],
        [
            "San Agustin Institute of Technology"
        ],
        [
            "Valencia"
        ],
        [
            "San Isidro College"
        ],
        [
            "Impalambong, Malaybalay"
        ],
        [
            "STI College"
        ],
        [
            "Malaybalay City and Valencia"
        ],
        [
            "St. James School of Science and Technology"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia Colleges (Bukidnon), Inc."
        ],
        [
            "Valencia"
        ],
        [
            "Festivals"
        ],
        [
            "A Kaamulan float"
        ],
        [
            "The province celebrates the Kaamulan Festival, an ethnic cultural festival held annually in Malaybalay, Bukidnon from the mid-February up to March 10, the founding date of the Bukidnon as a province in 1917.",
            "It is held to celebrate the culture and tradition of the seven ethnic tribal groups—Bukidnon, Higaonon, Talaandig, Manobo, Matigsalug, Tigwahanon, and Umayamnon—that originally inhabit the province.",
            "Kaamulan comes from the indigenous Binukid word amul meaning \"to gather\".",
            "Kaamulan is gathering for a purpose—a datuship ritual, a wedding ceremony, a thanksgiving festival during harvest time, a peace pact, or all of these together.",
            "The festival started in 1974 and is celebrated until now.",
            "It is the only authentic ethnic festival in the Philippines."
        ],
        [
            "Further information: Kaamulan Festival"
        ],
        [
            "Bukidnon Hymn: Bukidnon My Home"
        ],
        [
            "The Provincial Hymn was composed by Filomeno Bautista between 1925 and 1932.",
            "Nimecio Jun Beltran authored a provincial resolution requiring the singing of the provincial hymn in all and every events in the Province of Bukidnon where the Philippine National Anthem is also sung."
        ],
        [
            "Official Binukid Version:Bukidnon Kanak Ha Banuwa"
        ],
        [
            "Official English- version:Bukidnon My Home"
        ],
        [
            "Unofficial Cebuano Version:Bukidnon Matahum"
        ],
        [
            "Bisan pa hindu a"
        ],
        [
            "Lalag ku'g uli a"
        ],
        [
            "Dini ta Bukidnun"
        ],
        [
            "Kanak ha banuwa"
        ],
        [
            "Buntud ha matangkaw,"
        ],
        [
            "Kalasan...makupal,"
        ],
        [
            "Patag ha malu-ag,"
        ],
        [
            "Ha tungkay madagway."
        ],
        [
            "Chorus:"
        ],
        [
            "Bunturan,  balalayan"
        ],
        [
            "Basakan, kapatagan"
        ],
        [
            "Pastuhan, kapinyahan"
        ],
        [
            "Alan-alan kauyagan"
        ],
        [
            "Langit din piglambungan"
        ],
        [
            "Pig-aldawan kalamagan"
        ],
        [
            "Singenem uranan"
        ],
        [
            "Alan-alan kaayaran"
        ],
        [
            "Wherever I may roam"
        ],
        [
            "The distant lands to see"
        ],
        [
            "I long to go back home"
        ],
        [
            "To sweet Bukidnon home"
        ],
        [
            "Her lovely mountains high"
        ],
        [
            "Her forests old and grand"
        ],
        [
            "Bring memories to me"
        ],
        [
            "The home I long to see."
        ],
        [
            "Chorus:"
        ],
        [
            "There my heart, yearns to be"
        ],
        [
            "In far away, Bukidnon land."
        ],
        [
            "Under its blue starry sky,"
        ],
        [
            "Where love and joy never die."
        ],
        [
            "(Repeat Chorus)"
        ],
        [
            "Bisan asa kita"
        ],
        [
            "Sa hakayong dapit"
        ],
        [
            "Mobalik gihapon"
        ],
        [
            "sa atong Bukidnon"
        ],
        [
            "Nindot ang Kabukiran"
        ],
        [
            "Lunhaw'ng Kalasangan"
        ],
        [
            "Tam-is palandungon"
        ],
        [
            "Yuta ko'ng matahum"
        ],
        [
            "KORUS:"
        ],
        [
            "Dughan ko nagahandum"
        ],
        [
            "Sa yuta ko nga Bukidnon"
        ],
        [
            "May Kahayag ug Kalinaw"
        ],
        [
            "Gugma'g kalipay sa kanunay"
        ],
        [
            "(Balik KORUS)"
        ],
        [
            "Notable people"
        ],
        [
            "Gerald Tabios - elite endurance athlete"
        ],
        [
            "Arcelle Tadena - scaled crossfit athlete"
        ],
        [
            "Alfredo Lagamon - Associate Justice, Court of Appeals"
        ],
        [
            "Caesar Fortich - Secretary of Agriculture"
        ],
        [
            "Clare Cabiguin – Pinoy Big Brother: Teen Edition 1 - 4th Placer"
        ],
        [
            "Elenito Galido - Bishop of the Roman Catholic Diocese of Iligan"
        ],
        [
            "Joey Ayala - singer-songwriter and composer"
        ],
        [
            "Migz Zubiri - politician"
        ],
        [
            "Lorenzo S. Dinlayan - USEC, Office of Cultural Communities"
        ],
        [
            "Oona Barretto - scholar of Pinoy Dream Academy (season 1)"
        ],
        [
            "Nelbert Omolon - PBA Player"
        ],
        [
            "Nereus Acosta - politician"
        ],
        [
            "Reynan Dal-Anay - 1st Runner-up of The Voice Kids (Philippines season 2)"
        ],
        [
            "Roel Manlangit - Grand Champion of Pilipinas Got Talent (season 4)"
        ],
        [
            "Romeo M. Recina - Brig.",
            "Gen., PC-INP Recom 11 Commander"
        ],
        [
            "Sheree (real name Sweet Faye V. Bautista) - Singer / dancer / model & actress (former Viva Hot Babe)"
        ],
        [
            "Virgilio Garcillano - former government official"
        ],
        [
            "Ivy Grace Paredes – The X Factor UK 2016 contender"
        ],
        [
            "Rowell \"Roy\" Ucat – internet celebrity, songwriter, popularly known as \"Medyo Maldito\""
        ],
        [
            "Mario Fernandez – a multi-medalist national boxer"
        ],
        [
            "Teofisto Guingona III – politician/former senator"
        ],
        [
            "Archie Gamboa - 21st Chief of the Philippine National Police"
        ],
        [
            "Samuel Duran (real name Samuel Quilab) – professional boxer; former WBC International Bantamweight Champion and former OPBF Featherweight Champion"
        ],
        [
            "Leonil B. Lazarito – international boxing promoter/matchmaker, professional boxing manager"
        ],
        [
            "Mark Anthony N. Geraldo – professional boxer; former WBO Asia-Pacific youth super flyweight champion and PBF bantamweight champion"
        ],
        [
            "Manny Pacquiao – Filipino professional boxer and senator born in Kibawe"
        ],
        [
            "See also"
        ],
        [
            "Kitanglad Mountain Range"
        ],
        [
            "References"
        ],
        [
            "^ \"Department of Tourism\".",
            "tourism.gov.ph.",
            "Archived from the original on March 21, 2018.",
            "Retrieved May 1, 2018."
        ],
        [
            "^ \"Bukidnon Celebrates 100th Year in 2014\".",
            "Provincial Government of Bukidnon.",
            "March 19, 2014.",
            "Archived from the original on September 28, 2015.",
            "Retrieved September 27, 2015."
        ],
        [
            "^ a b \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved June 10, 2014."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ Sombrito, Elvira.",
            "\"Soil Redistribution Studies Using Fallout 137Cs\" (PDF).",
            "International Atomic Energy Agency.",
            "Retrieved September 9, 2010."
        ],
        [
            "^ \"Mt.",
            "Dulang-Dulang (2,938+)\".",
            "~ Pinoy Mountaineer.",
            "September 2, 2007.",
            "Archived from the original on August 30, 2012.",
            "Retrieved October 27, 2012."
        ],
        [
            "^ \"The highest mountains in the Philippines ~ Pinoy Mountaineer\".",
            "Pinoymountaineer.com.",
            "February 2, 2008.",
            "Archived from the original on October 25, 2012.",
            "Retrieved October 27, 2012."
        ],
        [
            "^ \"COA: Makati is Philippines' richest city, Cebu the richest province (2018) by GMA News 2019\".",
            "October 16, 2019.",
            "Archived from the original on November 28, 2019.",
            "Retrieved November 28, 2019."
        ],
        [
            "^ \"Makati still richest city, Cebu remains wealthiest province: COA report by ABS-CBN News\".",
            "Archived from the original on January 14, 2021.",
            "Retrieved January 14, 2021."
        ],
        [
            "^ \"Quezon City now richest LGU – COA\".",
            "Archived 2021-12-25 at the Wayback Machine CNN Philippines."
        ],
        [
            "^ Oona Paredes (2016).",
            "\"Rivers of Memory and Oceans of Difference in the Lumad World of Mindanao\".",
            "TRaNS: Trans-Regional and -National Studies of Southeast Asia.",
            "4 (Special Issue 2 (Water in Southeast Asia)): 329–349.",
            "doi:10.1017/trn.2015.28."
        ],
        [
            "^ \"Pantaron Range, Bukidnon\".",
            "Foundation for the Philippine Environment.",
            "Archived from the original on January 28, 2024.",
            "Retrieved January 28, 2024."
        ],
        [
            "^ Tordecilla, Jaemark (December 16, 2010).",
            "\"The spirits, flora, fauna thrive in Mount Kitanglad\".",
            "Mindanews.",
            "Archived from the original on September 27, 2022.",
            "Retrieved January 28, 2024."
        ],
        [
            "^ Fernandez, Rudy A.",
            "(November 30, 2003).",
            "\"Plant, animal species on 3 Mindanao mountains threatened\".",
            "Philippine Star.",
            "Archived from the original on January 23, 2018.",
            "Retrieved January 28, 2024."
        ],
        [
            "^ \"Province: Bukidnon\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c d Census of Population (2015).",
            "\"Region X (Northern Mindanao)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ http://www.officialgazette.gov.ph/downloads/1957/02feb/19570213-EO-0235-RM.pdf Archived 2021-05-07 at the Wayback Machine"
        ],
        [
            "^ \"Brief History – Impasugong, Bukidnon\".",
            "Archived from the original on June 26, 2020.",
            "Retrieved March 8, 2020."
        ],
        [
            "^ \"Bukidnon My Home on Facebook\".",
            "Facebook.",
            "Archived from the original on April 27, 2022."
        ],
        [
            "^ Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region X (Northern Mindanao)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Cairns, Malcolm (2015).",
            "Shifting Cultivation and Environmental Change: Indigenous People, Agriculture and Forest Conservation.",
            "Routledge.",
            "ISBN 9781317750192.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Table 11.",
            "Household Population by Ethnicity and Sex: 2010\" (PDF).",
            "psa.gov.ph.",
            "Archived (PDF) from the original on March 30, 2018.",
            "Retrieved May 1, 2018."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on March 4, 2018.",
            "Retrieved March 4, 2018.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Bukidnon 2nd\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on October 15, 2018.",
            "Retrieved August 27, 2018."
        ],
        [
            "^ \"Davao City 2nd\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on August 28, 2018.",
            "Retrieved August 27, 2018."
        ],
        [
            "^ \"Cagayan de Oro 2nd\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on September 9, 2018.",
            "Retrieved September 9, 2018."
        ],
        [
            "^ \"HyperWar: US Army in WWII: Fall of the Philippines \".",
            "www.ibiblio.org.",
            "Archived from the original on February 24, 2020.",
            "Retrieved February 25, 2020."
        ],
        [
            "^ \"Bukidnon Airport (Maraymaray Airstrip) in Don Carlos, Bukidnon by Philippine Aviation\".",
            "PBase.",
            "Archived from the original on October 23, 2017.",
            "Retrieved May 1, 2018."
        ],
        [
            "^ Bukidnon airport to be constructed in 2012 – Sen. Zubiri (Bukidnon News) Archived 2015-12-22 at the Wayback Machine"
        ],
        [
            "^ \"Don Carlos is best choice for Bukidnon airport (MindaNews)\".",
            "August 6, 2013.",
            "Archived from the original on December 22, 2015.",
            "Retrieved August 31, 2015."
        ],
        [
            "^ Maraymaray, Don Carlos; Bukidnon Airport Development Project (Don Carlos Official Website) Archived 2017-08-08 at the Wayback Machine"
        ],
        [
            "^ \"PROJECT WATCH: New Bukidnon (Don Carlos) Development Airport to start this year; P425 million budget allocated\".",
            "cdodev.com.",
            "January 7, 2018.",
            "Archived from the original on January 8, 2018.",
            "Retrieved May 1, 2018."
        ],
        [
            "^ \"Foreign diplomats to grace Bukidnon's Kaamulan fest\".",
            "Archived from the original on March 28, 2009.",
            "Retrieved June 27, 2018."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Bukidnon at Wikimedia Commons"
        ],
        [
            " Geographic data related to Bukidnon at OpenStreetMap"
        ],
        [
            "Provincial Government of Bukidnon"
        ],
        [
            "Philippine Standard Geographic Code listing for Bukidnon"
        ],
        [
            "Places adjacent to Bukidnon"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Lanao del NorteLanao del Sur"
        ],
        [
            "Bukidnon"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao del Norte"
        ],
        [
            "vteProvince of BukidnonMalaybalay (capital)  Valencia City (largest city)Municipalities"
        ],
        [
            "Baungon"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Impasugong"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kitaotao"
        ],
        [
            "Lantapan"
        ],
        [
            "Libona"
        ],
        [
            "Malitbog"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Maramag"
        ],
        [
            "Pangantucan"
        ],
        [
            "Quezon"
        ],
        [
            "San Fernando"
        ],
        [
            "Sumilao"
        ],
        [
            "Talakag"
        ],
        [
            "Component cities"
        ],
        [
            "Malaybalay"
        ],
        [
            "Valencia"
        ],
        [
            "Articles related to Bukidnon"
        ],
        [
            "vteNorthern Mindanao (Region X)Regional center"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Provinces"
        ],
        [
            "Bukidnon"
        ],
        [
            "Camiguin"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Iligan"
        ],
        [
            "Component cities"
        ],
        [
            "El Salvador"
        ],
        [
            "Gingoog"
        ],
        [
            "Malaybalay"
        ],
        [
            "Oroquieta"
        ],
        [
            "Ozamiz"
        ],
        [
            "Tangub"
        ],
        [
            "Valencia"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cagayan de Oro"
        ],
        [
            "Malaybalay"
        ],
        [
            "Mambajao"
        ],
        [
            "Oroquieta"
        ],
        [
            "Tubod"
        ],
        [
            "Municipalities"
        ],
        [
            "Aloran"
        ],
        [
            "Alubijid"
        ],
        [
            "Bacolod"
        ],
        [
            "Baliangao"
        ],
        [
            "Balingasag"
        ],
        [
            "Balingoan"
        ],
        [
            "Baloi"
        ],
        [
            "Baroy"
        ],
        [
            "Baungon"
        ],
        [
            "Binuangan"
        ],
        [
            "Bonifacio"
        ],
        [
            "Cabanglasan"
        ],
        [
            "Calamba"
        ],
        [
            "Catarman"
        ],
        [
            "Clarin"
        ],
        [
            "Claveria"
        ],
        [
            "Concepcion"
        ],
        [
            "Damulog"
        ],
        [
            "Dangcagan"
        ],
        [
            "Don Carlos"
        ],
        [
            "Don Victoriano Chiongbian"
        ],
        [
            "Gitagum"
        ],
        [
            "Guinsiliban"
        ],
        [
            "Impasugong"
        ],
        [
            "Initao"
        ],
        [
            "Jasaan"
        ],
        [
            "Jimenez"
        ],
        [
            "Kadingilan"
        ],
        [
            "Kalilangan"
        ],
        [
            "Kapatagan"
        ],
        [
            "Kauswagan"
        ],
        [
            "Kibawe"
        ],
        [
            "Kinoguitan"
        ],
        [
            "Kitaotao"
        ],
        [
            "Kolambugan"
        ],
        [
            "Lagonglong"
        ],
        [
            "Laguindingan"
        ],
        [
            "Lala"
        ],
        [
            "Lantapan"
        ],
        [
            "Libertad"
        ],
        [
            "Libona"
        ],
        [
            "Linamon"
        ],
        [
            "Lopez Jaena"
        ],
        [
            "Lugait"
        ],
        [
            "Magsaysay (Lanao del Norte)"
        ],
        [
            "Magsaysay (Misamis Oriental)"
        ],
        [
            "Mahinog"
        ],
        [
            "Maigo"
        ],
        [
            "Malitbog"
        ],
        [
            "Mambajao"
        ],
        [
            "Manolo Fortich"
        ],
        [
            "Manticao"
        ],
        [
            "Maramag"
        ],
        [
            "Matungao"
        ],
        [
            "Medina"
        ],
        [
            "Munai"
        ],
        [
            "Naawan"
        ],
        [
            "Nunungan"
        ],
        [
            "Opol"
        ],
        [
            "Panaon"
        ],
        [
            "Pangantucan"
        ],
        [
            "Pantao Ragat"
        ],
        [
            "Pantar"
        ],
        [
            "Plaridel"
        ],
        [
            "Poona Piagapo"
        ],
        [
            "Quezon"
        ],
        [
            "Sagay"
        ],
        [
            "Salay"
        ],
        [
            "Salvador"
        ],
        [
            "San Fernando"
        ],
        [
            "Sapad"
        ],
        [
            "Sapang Dalaga"
        ],
        [
            "Sinacaban"
        ],
        [
            "Sugbongcogon"
        ],
        [
            "Sultan Naga Dimaporo"
        ],
        [
            "Sumilao"
        ],
        [
            "Tagoloan (Lanao del Norte)"
        ],
        [
            "Tagoloan (Misamis Oriental)"
        ],
        [
            "Talakag"
        ],
        [
            "Talisayan"
        ],
        [
            "Tangcal"
        ],
        [
            "Tubod"
        ],
        [
            "Tudela"
        ],
        [
            "Villanueva"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Bukidnon&oldid=1234583957\""
        ],
        [
            "Categories: BukidnonProvinces of the PhilippinesProvinces of Northern MindanaoStates and territories established in 19141914 establishments in the PhilippinesFormer sub-provinces of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from January 2018Articles with permanently dead external linksWebarchive template wayback linksAll articles with bare URLs for citationsArticles with bare URLs for citations from March 2022Articles with PDF format bare URLs for citationsAccuracy disputes from March 2022CS1 maint: archived copy as titleUse mdy dates from April 2024Articles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Cebuano-language textArticles containing Filipino-language textArticles containing Hiligaynon-language textLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}