{
    "name": "Cagayan",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cagayan"
        ],
        [
            "42 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 18°00′N 121°48′E﻿ / ﻿18°N 121.8°E﻿ / 18; 121.8"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "This article is about the province in the Philippines.",
            "For other uses, see Cagayan (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Cagayan\" – news · newspapers · books · scholar · JSTOR (January 2014) (Learn how and when to remove this message)"
        ],
        [
            "Province in Cagayan Valley, PhilippinesCagayanProvince(from top: left to right) Sierra Madre Mountains in Santa Ana, Smith and Babuyan Claro Volcano, Beach in Buguey, Buntun Bridge in Tuguegarao, Pinacanauan River and Downtown Tuguegarao."
        ],
        [
            "FlagSealNickname(s): Land of Smile and BeautyMotto: Pabaruen ti CagayanLocation in the PhilippinesOpenStreetMapCoordinates: 18°00′N 121°48′E﻿ / ﻿18°N 121.8°E﻿ / 18; 121.8CountryPhilippinesRegionCagayan ValleyFoundedJune 29, 1583Capitaland largest cityTuguegaraoGovernment • GovernorManuel Mamba (Nacionalista) • Vice GovernorMelvin K. Vargas Jr. (PDP–Laban) • LegislatureCagayan Provincial BoardArea • Rank23rd out of 81 • Density130/km2 (350/sq mi)  • Rank63rd out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " Tuguegarao"
        ],
        [
            " • Municipalities"
        ],
        [
            "28"
        ],
        [
            " Abulug"
        ],
        [
            " Alcala"
        ],
        [
            " Allacapan"
        ],
        [
            " Amulung"
        ],
        [
            " Aparri"
        ],
        [
            " Baggao"
        ],
        [
            " Ballesteros"
        ],
        [
            " Buguey"
        ],
        [
            " Calayan"
        ],
        [
            " Camalaniugan"
        ],
        [
            " Claveria"
        ],
        [
            " Enrile"
        ],
        [
            " Gattaran"
        ],
        [
            " Gonzaga"
        ],
        [
            " Iguig"
        ],
        [
            " Lal-lo"
        ],
        [
            " Lasam"
        ],
        [
            " Pamplona"
        ],
        [
            " Peñablanca"
        ],
        [
            " Piat"
        ],
        [
            " Rizal"
        ],
        [
            " Sanchez-Mira"
        ],
        [
            " Santa Ana"
        ],
        [
            " Santa Praxedes"
        ],
        [
            " Santa Teresita"
        ],
        [
            " Santo Niño (Faire)"
        ],
        [
            " Solana"
        ],
        [
            " Tuao"
        ],
        [
            " • Barangays820 • DistrictsLegislative districts of CagayanTime zoneUTC+8 (PHT)ZIP code3500–3528IDD : area code +63 (0)78ISO 3166 codePH-CAGSpoken languagesIlocanoIbanagItawisIvatanTagalogEnglishWebsitewww.cagayan.gov.ph"
        ],
        [
            "Cagayan (/kɑːɡəˈjɑːn/ kah-gə-YAHN), officially the Province of Cagayan (Ilocano: Probinsia ti Cagayan; Ibanag: Provinsiya na Cagayan; Itawit: Provinsiya ya Cagayan; Filipino: Lalawigan ng Cagayan), is a province in the Philippines located in the Cagayan Valley region, covering the northeastern tip of Luzon.",
            "Its capital is the city of Tuguegarao.",
            "It is about 431 kilometres (268 mi) northwest of Manila, and includes the Babuyan Islands to the north.",
            "The province borders Ilocos Norte and Apayao to the west, and Kalinga and Isabela to the south."
        ],
        [
            "Cagayan was one of the early provinces that existed during the Spanish colonial period.",
            "Called La Provincia de Cagayan, its borders essentially covered the entire Cagayan Valley, which included the present provinces of Isabela, Quirino, Nueva Vizcaya, Batanes and portions of Kalinga, Apayao, and Aurora.",
            "The former capital was Nueva Segovia, which also served as the seat of the Diocese of Nueva Segovia.",
            "remain of the former vastness of the province.",
            "The entire region, however, is still referred to as Cagayan Valley."
        ],
        [
            "Etymology"
        ],
        [
            "A folk legend holds that the name was originally derived from the tagay, a plant that grows abundantly in the northern part of the province.",
            "The term Catagayan, \"the place where the tagay grows\" was shortened to Cagayan."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Cagayan has a prehistoric civilization with rich and diverse culture.",
            "According to archaeologists, the earliest man in the Philippines probably lived in Cagayan thousands"
        ],
        [
            "In the classical era, Gattaran and Lal-lo was the home of hunter-gatherers who specialized in hunting mollusks.",
            "These hunter-gatherers have stockpiled their leftover mollusk shells in numerous sites in Gattaran and Lal-lo, until eventually, the shells formed into the largest stock of shell-midden sites in the entire Philippines."
        ],
        [
            "The Atta or Negritos were the first people in valley.",
            "They were later moved to the uplands or variably assimilated by the Austronesians, from whom the Ibanags, Itawes, Yogads, Gaddangs, Irayas and Malawegs descended - who actually came from one ethnicity.",
            "These are the people found by the Spaniards in the different villages along the rivers all over Cagayan.",
            "The Spaniards rightly judged that these various villagers came from a single racial stock and decided to make the Ibanag language the lingua franca, both civilly and ecclesiastically for the entire people of Cagayan which they called collectively as the Cagayanes which later was transliterated to become Cagayanos."
        ],
        [
            "Cagayan was a major site for the Maritime Jade Road, one of the most extensive sea-based trade networks of a single geological material in the prehistoric world, operating for 3,000 years from 2000 BCE to 1000 CE."
        ],
        [
            "Even before the Spaniards came to Cagayan, the Cagayanos have already made contact with various civilizations like the Chinese, Japanese and even Indians, as evidenced by various artifacts and even the presence of minor to moderate foreign linguistic elements in the languages of the natives."
        ],
        [
            "Various other peoples, mainly the Ilocanos, Pangasinenses, Kapampangans and Tagalogs, as well as Visayans, Moros and even foreigners like the Chinese, Indians, Arabs, Spaniards and others were further infused to the native Cagayanes to become the modern Cagayano that we know today."
        ],
        [
            "The north coast was also the site of a Wokou state when the Japanese pirate-lord Tay Fusa set up his stronghold there before its destruction during the 1582 Cagayan battles."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1581, Captain Juan Pablo Carreon arrived in Cagayan with a hundred fully equipped soldiers and their families by order of Gonzalo Ronquillo de Peñaloza, the fourth Spanish Governor-General of the Philippines.",
            "The expeditionary force was sent to explore the Cagayan Valley, to convert the natives to Catholicism, and to establish ecclesiastical missions and towns throughout the valley."
        ],
        [
            "On June 29, 1583, Spanish conquistador Juan de Salcedo traced the northern coastline of Luzon and set foot on the Massi (Pamplona), Tular, and Aparri areas."
        ],
        [
            "La Provincia de Cagayan"
        ],
        [
            "In 1583, through a Spanish Royal Decree, the entire northeastern portion of Luzon (specifically, all territories east of the Cordillera mountains and those north of the Caraballo mountains) including the islands in the Balintang Channel were organized into one large political unit called the La Provincia de Cagayan.",
            "The provincia's territorial delineation encompassed the present provinces of Batanes, Isabela, Quirino, Nueva Vizcaya, including portions of Kalinga, Apayao, and Aurora.",
            "Its capital was Nueva Segovia (the present municipality of Lal-lo)."
        ],
        [
            "The Spanish friars soon established mission posts in Camalaniugan and Lal-lo (Nueva Segovia), which became the seat of the Diocese established by Pope Clement VIII on August 14, 1595."
        ],
        [
            "A founding population of 200 Spanish citizens from Europe accompanied by 100 soldiers set up settlements across Cagayan Valley.",
            ": 31, 54, 113"
        ],
        [
            "The see was moved in 1758 to Vigan because of its relative distance.",
            "The Spanish influence can still be seen in the massive churches and other buildings."
        ],
        [
            "In 1839, Nueva Vizcaya was established as a politico-military province and was separated from Cagayan.",
            "Later, Isabela was founded as a separate province on May 1, 1856, its areas carved from southern Cagayan and eastern Nueva Vizcaya territories."
        ],
        [
            "During the late 18th century, the New Spain government encouraged the expansion of trade and development of commodity crops.",
            "Among these was tobacco, and lands in Cagayan became the center of a vertically integrated monopoly: tobacco was grown there and shipped to Manila, where it was processed and made into cigarettes and cigars.",
            "The development of the related bureaucracy and accounting systems was done under the leadership of José de Gálvez, who as visitor-general to Mexico from 1765 to 1772 developed the monopoly there and increased revenues to the Crown.",
            "He worked in the Philippines as Minister of the Indies from 1776 to 1787, constructing a similar monopoly there under Governor-General Basco y Vargas (1778–1787)."
        ],
        [
            "The establishment of the civil government of Cagayan through the 1583 Spanish Royal Decree is commemorated in the annual Aggao Nac Cagayan celebrations of the Provincial Government of Cagayan and its people."
        ],
        [
            "An old map of Cagayan during the 1918 Census"
        ],
        [
            "American era"
        ],
        [
            "When the Treaty of Paris was signed in 1898, ending the Spanish–American War, the United States took over the Philippines.",
            "It influenced the culture, most notably in agriculture and education, as well as in public works and communications.",
            "A naval base also increased interaction between local Filipinos and American sailors and administrators.",
            "At the close of the 18th century, there were 29 municipalities in the province of Cagayan.",
            "After the Philippines came under American sovereignty in 1902, more municipalities were founded.",
            "Since then, due to centralization and shifting of populations, the number of municipalities is back to 29.",
            "A new wave of immigration began in the late 19th and 20th centuries with the arrival of another group of the Ilocano settlers who came in large numbers.",
            "They now constitute the largest group in the province, and it was only in this large-scale Ilocano immigration & settlement that made Ilocano language replaced Ibanag as the lingua franca of the province."
        ],
        [
            "Japanese occupation"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(November 2015)"
        ],
        [
            "During the Second World War, with air raids by Japanese fighters and bombers, the province of Cagayan suffered much destruction by bombing and later invasion.",
            "Japanese Imperial forces entered Cagayan in 1942.",
            "While under the Japanese Occupation, several pre-war infantry divisions and regular units of the Philippine Commonwealth Army were re-established during the period on January 3, 1942, to June 30, 1946.",
            "They established general headquarters, camps and garrisoned troops in the province of Cagayan, and began operations against the Japanese Occupation forces in the Cagayan Valley.",
            "This included sending troops to the provinces of Cagayan and Isabela, and helping the local soldiers of the 11th and 14th Infantry Regiment of the USAFIP-NL, the local guerrilla fighters and the U.S. liberation forces.",
            "They fought against the Japanese Imperial forces from 1942 to 1945."
        ],
        [
            "The Battle off Cape Engaño on October 26, 1944, was held off Cape Engaño.",
            "At that time American carrier forces attacked the Japanese Northern Force.",
            "This became the concluding action of the Battle of Leyte Gulf.",
            "The Japanese lost 4 carriers, 3 light cruisers and 9 destroyers."
        ],
        [
            "In 1945, the combined United States and Philippine troops, together with the recognized guerrillas, took Cagayan.",
            "Part of the action were the Filipino soldiers of the 11th and 14th Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL liberated the province of Cagayan during the Second World War."
        ],
        [
            "Northern Luzon topographical map showing Cagayan"
        ],
        [
            "Postwar Era"
        ],
        [
            "After World War II Baldomero Perez of Tuguegarao was temporarily appointed as Governor of Cagayan by the Philippine Civil Affairs Unit, serving until he was replaced by Peregrino R. Quinto in 1946."
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos and Human rights abuses of the Marcos dictatorship"
        ],
        [
            "Beginning in the 1970s, Cagayan became known as a bailiwick of Juan Ponce Enrile of Gonzaga, who as Secretary and later Minister of National Defense became one of the most powerful figures during the Martial Law period under President Ferdinand Marcos.",
            "His influence enabled the construction of Port Irene, a modernized international harbor facility in Santa Ana that was named after Marcos' daughter Irene, which later formed the basis for the creation of the Cagayan Special Economic Zone and Freeport, whose enabling law was authored by Enrile as a Senator in 1995 and now includes Santa Ana and parts of Aparri."
        ],
        [
            "Loan-funded government spending to promote Ferdinand Marcos’ 1969 reelection campaign caused"
        ],
        [
            "With only a year left in his last constitutionally allowed term as president Ferdinand Marcos placed the Philippines under Martial Law in September 1972 and thus retained the position for fourteen more years."
        ],
        [
            "During that time, logging concessions were awarded in the province by the Marcoses to Enrile and other cronies, leading to the severe degradation of forest cover in the province that contributed to widespread flooding and other environmental issues that persist today."
        ],
        [
            "During the People Power revolution"
        ],
        [
            "Main articles: 1986 Philippine presidential election, People Power Revolution, and Provisional Government of the Philippines (1986–1987)"
        ],
        [
            "Cagayan saw incidents of political violence during the 1986 Philippine presidential election, including the fatal shooting by militiamen of opposition leader Euginio Coloma in the municipality of Buguey."
        ],
        [
            "A number of Cagayanon politicians played parts in the People Power Revolution two weeks after the election, and in the following one year in which the Philippines was under an  interim provisional revolutionary government between 1986 and 1987.",
            "This included Enrile, whose failed"
        ],
        [
            "Contemporary"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(May 2024)"
        ],
        [
            "Hotel Delfino siege"
        ],
        [
            "Main article: 1990 Hotel Delfino siege"
        ],
        [
            "Cagayan was also the site of the Hotel Delfino Siege in Tuguegarao, which took place on March 4, 1990, when efforts to arrest suspended governor Rodolfo Aguinaldo for supporting rebellions against the government of President Corazon Aquino led to him storming the provincial capitol and taking hostages including his would-be arresting officer, Brigadier General Oscar Florendo of the Armed Forces of the Philippines Civil Relations Service.",
            "The stand-off deteriorated into a series of gun-battles throughout the town, with Florendo being killed presumably in a crossfire inside the hotel and Aguinaldo managing to escape and go into hiding before later surrendering and being cleared of legal charges by winning reelection in 1992.",
            "He was later elected congressman in 1998 but was assassinated by the New People's Army in 2001."
        ],
        [
            "2020 Ulysses Flood"
        ],
        [
            "Further information: Typhoon Vamco"
        ],
        [
            "Cagayan has been heavily impacted by changing weather pattern changes resulting from climate change,"
        ],
        [
            "In November 2020, Typhoon Vamco (locally known in the Philippines as Typhoon Ulysses) crossed the country, dams from all around Luzon neared their spilling points, forcing them to release large amounts of water into their impounds including Magat Dam.",
            "The dam opened all of its 7 gates at 24 metres (79 ft), releasing over 5,037 cubic metres (1,331,000 US gal) of water into the Cagayan River flooding numerous riverside towns.",
            "Waters under the Buntun Bridge went up as high as 13 metres (43 ft), flooding the nearby barangays up to the roofs of houses."
        ],
        [
            "Because there was very little media coverage of the flooding in the area in the wake of the COVID-19 lockdown in Luzon and the Shutdown of ABS-CBN broadcasting earlier that year,"
        ],
        [
            "Geography"
        ],
        [
            "See also: Babuyan Group of Islands and Palaui Island"
        ],
        [
            "Political map of Cagayan"
        ],
        [
            "Situated within the Cagayan Valley region, the province is bounded by the Philippine Sea on the east; on the south by Isabela province; on the west by the Cordillera Mountains; and on the north by the Balintang Channel and the Babuyan Group of Islands.",
            "About 2 kilometres (1.2 mi) from the northeastern tip of the province is the island of Palaui; a few kilometers to the west is Fuga Island.",
            "The Babuyan Group of Islands, which includes Calayan, Dalupiri, Camiguin, and Babuyan Claro, is about 60 nautical miles (110 km) north of Luzon mainland."
        ],
        [
            "The eastern coast forms the northern portion of the Sierra Madre mountain range, while the western limits are generally hilly to low in elevation.",
            "The central area, dominated by a large valley, forms the lower basin of the country's longest river, the Cagayan.",
            "The mouth is located at the northern town of Aparri."
        ],
        [
            "The province of Cagayan comprises an aggregate land area of 9,295.75 square kilometres (3,589.11 sq mi) which constitutes approximately three percent of the total land area of the country, making it the second largest province in the region."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Cagayan comprises 28 municipalities and one city divided into three congressional districts.",
            "It has 820 barangays.",
            "Tuguegarao City (as of December 18, 1999) is the provincial capital, regional seat, and center of business, trade, and education and the only city in the province."
        ],
        [
            " †  Provincial capital and component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Abulug"
        ],
        [
            "2nd"
        ],
        [
            "2.7%"
        ],
        [
            "34,579"
        ],
        [
            "32,497"
        ],
        [
            "1.19%"
        ],
        [
            "162.60"
        ],
        [
            "62.78"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "20"
        ],
        [
            "18°26′37″N 121°27′26″E﻿ / ﻿18.4436°N 121.4573°E﻿ / 18.4436; 121.4573﻿ (Abulug)"
        ],
        [
            "Alcala"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "41,295"
        ],
        [
            "38,883"
        ],
        [
            "1.15%"
        ],
        [
            "168.64"
        ],
        [
            "65.11"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "25"
        ],
        [
            "17°54′09″N 121°39′24″E﻿ / ﻿17.9024°N 121.6567°E﻿ / 17.9024; 121.6567﻿ (Alcala)"
        ],
        [
            "Allacapan"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "35,234"
        ],
        [
            "33,571"
        ],
        [
            "0.92%"
        ],
        [
            "306.80"
        ],
        [
            "118.46"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "27"
        ],
        [
            "18°13′33″N 121°33′16″E﻿ / ﻿18.2259°N 121.5545°E﻿ / 18.2259; 121.5545﻿ (Allacapan)"
        ],
        [
            "Amulung"
        ],
        [
            "3rd"
        ],
        [
            "4.0%"
        ],
        [
            "50,336"
        ],
        [
            "47,860"
        ],
        [
            "0.97%"
        ],
        [
            "264.51"
        ],
        [
            "102.13"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "47"
        ],
        [
            "17°50′14″N 121°43′24″E﻿ / ﻿17.8371°N 121.7234°E﻿ / 17.8371; 121.7234﻿ (Amulung)"
        ],
        [
            "Aparri"
        ],
        [
            "1st"
        ],
        [
            "5.4%"
        ],
        [
            "68,839"
        ],
        [
            "65,649"
        ],
        [
            "0.91%"
        ],
        [
            "286.64"
        ],
        [
            "110.67"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "42"
        ],
        [
            "18°21′26″N 121°38′14″E﻿ / ﻿18.3572°N 121.6371°E﻿ / 18.3572; 121.6371﻿ (Aparri)"
        ],
        [
            "Baggao"
        ],
        [
            "1st"
        ],
        [
            "6.9%"
        ],
        [
            "87,753"
        ],
        [
            "82,782"
        ],
        [
            "1.12%"
        ],
        [
            "995.49"
        ],
        [
            "384.36"
        ],
        [
            "88"
        ],
        [
            "230"
        ],
        [
            "48"
        ],
        [
            "18°16′16″N 121°40′48″E﻿ / ﻿18.2710°N 121.6799°E﻿ / 18.2710; 121.6799﻿ (Baggao)"
        ],
        [
            "Ballesteros"
        ],
        [
            "2nd"
        ],
        [
            "2.7%"
        ],
        [
            "34,488"
        ],
        [
            "34,299"
        ],
        [
            "0.10%"
        ],
        [
            "120.00"
        ],
        [
            "46.33"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "19"
        ],
        [
            "18°24′36″N 121°30′55″E﻿ / ﻿18.4100°N 121.5152°E﻿ / 18.4100; 121.5152﻿ (Ballesteros)"
        ],
        [
            "Buguey"
        ],
        [
            "1st"
        ],
        [
            "2.5%"
        ],
        [
            "32,148"
        ],
        [
            "30,175"
        ],
        [
            "1.21%"
        ],
        [
            "164.50"
        ],
        [
            "63.51"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "30"
        ],
        [
            "18°17′11″N 121°50′05″E﻿ / ﻿18.2865°N 121.8347°E﻿ / 18.2865; 121.8347﻿ (Buguey)"
        ],
        [
            "Calayan"
        ],
        [
            "2nd"
        ],
        [
            "1.4%"
        ],
        [
            "17,410"
        ],
        [
            "16,702"
        ],
        [
            "0.79%"
        ],
        [
            "494.53"
        ],
        [
            "190.94"
        ],
        [
            "35"
        ],
        [
            "91"
        ],
        [
            "12"
        ],
        [
            "19°15′43″N 121°28′33″E﻿ / ﻿19.2619°N 121.4758°E﻿ / 19.2619; 121.4758﻿ (Calayan)"
        ],
        [
            "Camalaniugan"
        ],
        [
            "1st"
        ],
        [
            "2.0%"
        ],
        [
            "25,236"
        ],
        [
            "24,923"
        ],
        [
            "0.24%"
        ],
        [
            "76.50"
        ],
        [
            "29.54"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "28"
        ],
        [
            "18°16′30″N 121°40′28″E﻿ / ﻿18.2750°N 121.6744°E﻿ / 18.2750; 121.6744﻿ (Camalaniugan)"
        ],
        [
            "Claveria"
        ],
        [
            "2nd"
        ],
        [
            "2.5%"
        ],
        [
            "31,900"
        ],
        [
            "29,921"
        ],
        [
            "1.23%"
        ],
        [
            "194.80"
        ],
        [
            "75.21"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "41"
        ],
        [
            "18°36′32″N 121°05′02″E﻿ / ﻿18.6089°N 121.0839°E﻿ / 18.6089; 121.0839﻿ (Claveria)"
        ],
        [
            "Enrile"
        ],
        [
            "3rd"
        ],
        [
            "2.9%"
        ],
        [
            "36,705"
        ],
        [
            "35,834"
        ],
        [
            "0.46%"
        ],
        [
            "166.60"
        ],
        [
            "64.32"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "22"
        ],
        [
            "17°33′39″N 121°41′22″E﻿ / ﻿17.5609°N 121.6895°E﻿ / 17.5609; 121.6895﻿ (Enrile)"
        ],
        [
            "Gattaran"
        ],
        [
            "1st"
        ],
        [
            "4.6%"
        ],
        [
            "58,874"
        ],
        [
            "56,661"
        ],
        [
            "0.73%"
        ],
        [
            "707.50"
        ],
        [
            "273.17"
        ],
        [
            "83"
        ],
        [
            "210"
        ],
        [
            "50"
        ],
        [
            "18°03′41″N 121°38′36″E﻿ / ﻿18.0614°N 121.6433°E﻿ / 18.0614; 121.6433﻿ (Gattaran)"
        ],
        [
            "Gonzaga"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "41,680"
        ],
        [
            "38,892"
        ],
        [
            "1.33%"
        ],
        [
            "567.43"
        ],
        [
            "219.09"
        ],
        [
            "73"
        ],
        [
            "190"
        ],
        [
            "25"
        ],
        [
            "18°15′34″N 121°59′37″E﻿ / ﻿18.2594°N 121.9937°E﻿ / 18.2594; 121.9937﻿ (Gonzaga)"
        ],
        [
            "Iguig"
        ],
        [
            "3rd"
        ],
        [
            "2.4%"
        ],
        [
            "30,060"
        ],
        [
            "27,862"
        ],
        [
            "1.46%"
        ],
        [
            "109.90"
        ],
        [
            "42.43"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "23"
        ],
        [
            "17°45′09″N 121°44′17″E﻿ / ﻿17.7525°N 121.7380°E﻿ / 17.7525; 121.7380﻿ (Iguig)"
        ],
        [
            "Lal-lo"
        ],
        [
            "1st"
        ],
        [
            "3.8%"
        ],
        [
            "48,733"
        ],
        [
            "44,506"
        ],
        [
            "1.74%"
        ],
        [
            "702.80"
        ],
        [
            "271.35"
        ],
        [
            "69"
        ],
        [
            "180"
        ],
        [
            "35"
        ],
        [
            "18°12′05″N 121°39′39″E﻿ / ﻿18.2015°N 121.6607°E﻿ / 18.2015; 121.6607﻿ (Lal-lo)"
        ],
        [
            "Lasam"
        ],
        [
            "2nd"
        ],
        [
            "3.2%"
        ],
        [
            "41,225"
        ],
        [
            "39,135"
        ],
        [
            "1.00%"
        ],
        [
            "213.70"
        ],
        [
            "82.51"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "30"
        ],
        [
            "18°03′52″N 121°36′05″E﻿ / ﻿18.0645°N 121.6015°E﻿ / 18.0645; 121.6015﻿ (Lasam)"
        ],
        [
            "Pamplona"
        ],
        [
            "2nd"
        ],
        [
            "2.0%"
        ],
        [
            "24,781"
        ],
        [
            "23,596"
        ],
        [
            "0.94%"
        ],
        [
            "209.67"
        ],
        [
            "80.95"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "18"
        ],
        [
            "18°27′49″N 121°20′28″E﻿ / ﻿18.4637°N 121.3412°E﻿ / 18.4637; 121.3412﻿ (Pamplona)"
        ],
        [
            "Peñablanca"
        ],
        [
            "3rd"
        ],
        [
            "4.0%"
        ],
        [
            "50,300"
        ],
        [
            "48,584"
        ],
        [
            "0.66%"
        ],
        [
            "1,246.23"
        ],
        [
            "481.17"
        ],
        [
            "40"
        ],
        [
            "100"
        ],
        [
            "24"
        ],
        [
            "17°37′32″N 121°47′07″E﻿ / ﻿17.6255°N 121.7854°E﻿ / 17.6255; 121.7854﻿ (Peñablanca)"
        ],
        [
            "Piat"
        ],
        [
            "2nd"
        ],
        [
            "2.0%"
        ],
        [
            "24,805"
        ],
        [
            "23,597"
        ],
        [
            "0.96%"
        ],
        [
            "181.81"
        ],
        [
            "70.20"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "18"
        ],
        [
            "17°47′30″N 121°28′37″E﻿ / ﻿17.7918°N 121.4770°E﻿ / 17.7918; 121.4770﻿ (Piat)"
        ],
        [
            "Rizal"
        ],
        [
            "2nd"
        ],
        [
            "1.5%"
        ],
        [
            "19,077"
        ],
        [
            "17,994"
        ],
        [
            "1.12%"
        ],
        [
            "124.40"
        ],
        [
            "48.03"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "29"
        ],
        [
            "17°50′45″N 121°20′45″E﻿ / ﻿17.8457°N 121.3458°E﻿ / 17.8457; 121.3458﻿ (Rizal)"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "2nd"
        ],
        [
            "2.1%"
        ],
        [
            "26,164"
        ],
        [
            "24,541"
        ],
        [
            "1.23%"
        ],
        [
            "218.77"
        ],
        [
            "84.47"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "18"
        ],
        [
            "18°33′33″N 121°14′05″E﻿ / ﻿18.5591°N 121.2347°E﻿ / 18.5591; 121.2347﻿ (Sanchez-Mira)"
        ],
        [
            "Santa Ana"
        ],
        [
            "1st"
        ],
        [
            "2.8%"
        ],
        [
            "35,688"
        ],
        [
            "32,906"
        ],
        [
            "1.56%"
        ],
        [
            "440.81"
        ],
        [
            "170.20"
        ],
        [
            "81"
        ],
        [
            "210"
        ],
        [
            "16"
        ],
        [
            "18°27′27″N 122°08′33″E﻿ / ﻿18.4576°N 122.1425°E﻿ / 18.4576; 122.1425﻿ (Santa Ana)"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "2nd"
        ],
        [
            "0.3%"
        ],
        [
            "4,434"
        ],
        [
            "4,154"
        ],
        [
            "1.25%"
        ],
        [
            "78.11"
        ],
        [
            "30.16"
        ],
        [
            "57"
        ],
        [
            "150"
        ],
        [
            "10"
        ],
        [
            "18°33′47″N 120°59′24″E﻿ / ﻿18.5631°N 120.9901°E﻿ / 18.5631; 120.9901﻿ (Santa Praxedes)"
        ],
        [
            "Santa Teresita"
        ],
        [
            "1st"
        ],
        [
            "1.5%"
        ],
        [
            "19,573"
        ],
        [
            "19,038"
        ],
        [
            "0.53%"
        ],
        [
            "166.98"
        ],
        [
            "64.47"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "13"
        ],
        [
            "18°14′55″N 121°54′33″E﻿ / ﻿18.2487°N 121.9091°E﻿ / 18.2487; 121.9091﻿ (Santa Teresita)"
        ],
        [
            "Santo Niño (Faire)"
        ],
        [
            "2nd"
        ],
        [
            "2.2%"
        ],
        [
            "28,537"
        ],
        [
            "27,219"
        ],
        [
            "0.90%"
        ],
        [
            "423.13"
        ],
        [
            "163.37"
        ],
        [
            "67"
        ],
        [
            "170"
        ],
        [
            "31"
        ],
        [
            "17°53′02″N 121°34′09″E﻿ / ﻿17.8838°N 121.5692°E﻿ / 17.8838; 121.5692﻿ (Santo Niño)"
        ],
        [
            "Solana"
        ],
        [
            "3rd"
        ],
        [
            "7.0%"
        ],
        [
            "88,445"
        ],
        [
            "82,502"
        ],
        [
            "1.33%"
        ],
        [
            "234.60"
        ],
        [
            "90.58"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "38"
        ],
        [
            "17°39′03″N 121°41′27″E﻿ / ﻿17.6508°N 121.6907°E﻿ / 17.6508; 121.6907﻿ (Solana)"
        ],
        [
            "Tuao"
        ],
        [
            "3rd"
        ],
        [
            "5.0%"
        ],
        [
            "63,970"
        ],
        [
            "61,535"
        ],
        [
            "0.74%"
        ],
        [
            "225.82"
        ],
        [
            "87.19"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "32"
        ],
        [
            "17°44′05″N 121°27′19″E﻿ / ﻿17.7346°N 121.4552°E﻿ / 17.7346; 121.4552﻿ (Tuao)"
        ],
        [
            "Tuguegarao City"
        ],
        [
            "†"
        ],
        [
            "3rd"
        ],
        [
            "13.1%"
        ],
        [
            "166,334"
        ],
        [
            "153,502"
        ],
        [
            "1.54%"
        ],
        [
            "144.80"
        ],
        [
            "55.91"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "49"
        ],
        [
            "17°36′45″N 121°43′58″E﻿ / ﻿17.6125°N 121.7327°E﻿ / 17.6125; 121.7327﻿ (Tuguegarao)"
        ],
        [
            "Total"
        ],
        [
            "1,268,603"
        ],
        [
            "1,199,320"
        ],
        [
            "1.08%"
        ],
        [
            "9,398.07"
        ],
        [
            "3,628.62"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "820"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Former names are italicized.^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Barangays"
        ],
        [
            "The 28 municipalities and 1 city of the province comprise a total of 820 barangays, with Ugac Sur in Tuguegarao City as the most populous in 2010, and Centro 15 (Poblacion) in Aparri as the least.",
            "If cities are excluded, Maura in Aparri has the highest population."
        ],
        [
            "Further information: List of barangays in Cagayan"
        ],
        [
            "Climate"
        ],
        [
            "Cagayan has a tropical savannah climate (Aw) with hot days and warm nights that last year round."
        ],
        [
            "Climate data for Cagayan"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "27.9(82.2)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "32.7(90.9)"
        ],
        [
            "33.2(91.8)"
        ],
        [
            "33.8(92.8)"
        ],
        [
            "33.5(92.3)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "28.3(82.9)"
        ],
        [
            "31.4(88.6)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "20.6(69.1)"
        ],
        [
            "21.8(71.2)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "23.8(74.8)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "22.8(73.0)"
        ],
        [
            "21.5(70.7)"
        ],
        [
            "23.3(74.0)"
        ],
        [
            "Average rainy days"
        ],
        [
            "8"
        ],
        [
            "4"
        ],
        [
            "3"
        ],
        [
            "2"
        ],
        [
            "6"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "10"
        ],
        [
            "9"
        ],
        [
            "11"
        ],
        [
            "11"
        ],
        [
            "85"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CagayanYearPop.±% p.a.1903 147,946—    1918 191,320+1.73%1939 292,270+2.04%1948 311,088+0.70%1960 445,289+3.03%1970 581,237+2.70%1975 644,075+2.08%1980 711,476+2.01%1990 829,867+1.55%1995 895,050+1.43%2000 993,580+2.26%2007 1,072,571+1.06%2010 1,124,773+1.74%2015 1,199,320+1.23%2020 1,268,603+1.11%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Cagayan in the 2020 census was 1,268,603 people, with a density of 140 inhabitants per square kilometre or 360 inhabitants per square mile."
        ],
        [
            "The majority of people living in Cagayan are of Ilocano descent, mostly from migrants coming from the Ilocos Region.",
            "Originally, the more numerous groups were the Ibanags, who were first sighted by the Spanish explorers and converted to Christianity by missionaries, the reason why the Ibanag language had spread throughout the valley region prior to the arrival of the migrating Ilocanos.",
            "Cagayan is predominantly Roman Catholic with 85% of the population affiliated and the Aglipayan Church has a very strong minority in the province.The increasing numbers of the Iglesia Ni Cristo ."
        ],
        [
            "Aside from Ilocanos and Ibanags, Malawegs, Itawits, Gaddangs, groups of nomadic Aetas, as well as families of Ibatans who have assimilated into the Ibanag-Ilocano culture make Cagayan their home.",
            "More recently, a new group from the south, the Muslim Filipinos, have migrated to this province and have made a community for themselves.",
            "In addition to this, Tagalog-speaking peoples from Central Luzon and Southern Luzon have also settled in the area, as well as a few Pangasinans and Kapampangans from the central plains, and Cebuanos and Hiligaynons from Visayas and Mindanao."
        ],
        [
            "Languages Spoken (2000)"
        ],
        [
            "Language"
        ],
        [
            "Speakers"
        ],
        [
            "Ilocano"
        ],
        [
            "680,256"
        ],
        [
            "Ibanag"
        ],
        [
            "177,499"
        ],
        [
            "Itawit"
        ],
        [
            "84,382"
        ],
        [
            "Tagalog"
        ],
        [
            "28,961"
        ],
        [
            "Major languages spoken are Ilocano followed by Ibanag, Yogad and Gaddang.",
            "Ilocanos and Ibanags speak Ilocano with an Ibanag accent, as descendants of Ilocanos from first generation in Cagayan who lived within Ibanag population learned Ibanag; same situation with Ilocano tinged by Gaddang, Paranan, Yogad, and Itawis accents when descendants of Ilocanos from first generation in Cagayan who lived within Gaddang, Paranan, Yogad, and Itawis populations learned their languages.",
            "People especially in the capital and commercial centers speak and understand English and Tagalog/Filipino.",
            "Tagalogs, Ilocanos, and Ibanags speak Tagalog with an Ibanag accent, as descendants of Tagalogs from first generation in Cagayan who lived within Ibanag population learned Ibanag.",
            "Languages not native in the province are also spoken there such as Maranao, Maguindanaon, Tausug, Pangasinan, Kapampangan, Cebuano and Hiligaynon to varying degrees by their respective ethnic communities within the province."
        ],
        [
            "Endangered languages"
        ],
        [
            "There are two endangered indigenous languages in Cagayan.",
            "These are the Dupaninan Agta language (with fewer than 1400 remaining speakers) and the Central Cagayan Agta language (with fewer than 799 remaining speakers); both of these are listed as Vulnerable according to the UNESCO Atlas of the World's Endangered Languages.",
            "All remaining speakers of the languages are among the community's elders.",
            "Without a municipality-wide teaching mechanism of the two endangered languages for the youth where the languages are present, the languages may be extinct within 3-5 decades, making them languages in grave peril unless a teaching-mechanism is established by either the government or an educational institution in the municipalities of Gattaran and Baggao."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cagayan"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  29.63"
        ],
        [
            "2009  27.75"
        ],
        [
            "2012  19.71"
        ],
        [
            "2015  16.67"
        ],
        [
            "2018  15.99"
        ],
        [
            "2021  7.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Agricultural products are rice, corn, peanut, beans, and fruits.",
            "Livestock products include cattle, hogs, carabaos, and poultry.",
            "Fishing various species of fish from the coastal towns is also undertaken.",
            "Woodcraft furniture made of hardwood, rattan, bamboo, and other indigenous materials are also available in the province."
        ],
        [
            "Fishing boat in Claveria"
        ],
        [
            "The Northern Cagayan International Airport, in Lal-lo, was built to support the Cagayan Special Economic Zone in northern Cagayan, which also serves seaborne traffic through Port Irene.",
            "The airport project involved the construction of a 2,200-meter runway, with a width of 45 meters, following the standards of the International Civil Aviation Organization.",
            "Completed in October 2014, the international airport can accommodate large aircraft such as the Airbus A319-100 and Boeing regional jets of comparable size."
        ],
        [
            "Tourism"
        ],
        [
            "Since Cagayan faces the Philippine Sea, an extensive shoreline sprawls along the northern coastal towns of Sanchez Mira, Pamplona, Santa Praxedes, Claveria, Buguey, Aparri, Ballesteros, Abulug, and the islands of Palaui, Fuga, and island municipality of Calayan.",
            "Sanchez Mira, Claveria, and Santa Praxedes have facilities for excursion stays while Fuga Island is being developed as a world-class recreation and tourism center.",
            "Activities include whale watching at the Calayan Islands, and scuba diving, snorkeling and fishing in Palaui Island of Santa Ana.",
            "The airstrip at Claveria could be used as a jump-off point to Fuga Island."
        ],
        [
            "The Sambali Festival is celebrated throughout the province in commemoration of its founding.",
            "Hotels include the Governors Garden Hotel, Hotel Candice, Hotel Roma and Hotel Kimikarlai all in Tuguegarao City."
        ],
        [
            "Claveria is host to several scenic attractions which include: the Lakay-Lakay Lagoon, the rocky formation along the Camalaggaon Caves, the Roadside Park overlooking the Claveria Bay, Macatel Falls with its clear waters that run in abundance throughout the year, the Pata Lighthouse, and the Claveria Beach Resort along the white sand coasts."
        ],
        [
            "Notable personalities"
        ],
        [
            "Bretman Rock - beauty influencer and social media personality.",
            "From Sanchez Mira."
        ],
        [
            "Kakai Bautista - actress and comedian."
        ],
        [
            "Jeth Troy U. Rosario - a professional basketball player for TNT Ka Tropa of the PBA."
        ],
        [
            "Paco Román -  Filipino-Spanish soldier and later became a revolutionary during Philippine Revolution and Philippine–American War.",
            "Roman had the rank of a colonel in the revolutionary army, and served as the close aide of General Antonio Luna.",
            "From Alcala."
        ],
        [
            "Cesar Adib Majul - Philippine historian"
        ],
        [
            "Salvador Lazo Lazo - Filipino prelate of the Roman Catholic Church.",
            "He served as Bishop of San Fernando de La Union from 1981 to 1993."
        ],
        [
            "Ricardo Baccay - third Bishop of the Diocese of Alaminos, Pangasinan and former Auxiliary Bishop of the Archdiocese of Tuguegarao.",
            "Born in Tuguegarao."
        ],
        [
            "Eulogio Balao - former Secretary of the Department of National Defense and former Senator of the Republic of the Philippines, from Tuguegarao City."
        ],
        [
            "Diosdado P. Banatao - entrepreneur and engineer working in the high-tech industry.",
            "From Iguig."
        ],
        [
            "Orestes Ojeda - A film actor and an art enthusiast, who was born and raised in Tuguegarao."
        ],
        [
            "Lilia Cuntapay - An actress, also known as the \"Queen of Philippine Horror Films\", from Gonzaga."
        ],
        [
            "Maja Ross Andres Salvador - a popular actress of ABS-CBN, born and raised in Barangay Canayun, Abulug."
        ],
        [
            "Silvetre Bello III,-a cabinet member and secretary under two presidents, Corazon Aquino (Justice) and Rodrigo Roa Duterte (Labour and Employment), also served as Presidential Adviser on the Peace Process under the Duterte administration from Gattaran."
        ],
        [
            "Arthur Tugade - a cabinet member and secretary of the Department of Transportation under the Duterte administration also serve as government-owned Bases Conversion and Development Authority under the late President Benigno Aquino III.",
            "from Claveria."
        ],
        [
            "Juan Ponce Enrile, -cabinet member and became secretary  under two presidents, Ferdinand Marcos Sr. (finance, justice, and defense) and Corazon Aquino (defense), also became a senator and later became President of the Senate of the Philippines (2008–2013).",
            "And currently, Chief Presidential Legal Counsel is under the administration of Ferdinand Marcos Jr. from Gonzaga."
        ],
        [
            "See also"
        ],
        [
            "Callao Man"
        ],
        [
            "Our Lady of Piat"
        ],
        [
            "Malaueg Church"
        ],
        [
            "Roman Catholic Archdiocese of Tuguegarao"
        ],
        [
            "Lal-lo and Gattaran Shell Middens"
        ],
        [
            "References"
        ],
        [
            "^ a b \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved January 20, 2014."
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b c d e f g Lancion, Conrado M. Jr.; de Guzman, Rey (cartography) (1995).",
            "\"The Provinces\".",
            "Fast Facts about Philippine Provinces (The 2000 Millenium ed.).",
            "Makati, Philippines: Tahanan Books.",
            "pp.",
            "48, 49, 84, 118.",
            "ISBN 971-630-037-9.",
            "Retrieved January 16, 2015."
        ],
        [
            "^ Reid, Lawrence; Elizaga, Elson.",
            "\"The Meaning of 'Cagayan'\".",
            "elson.elizaga.net.",
            "Retrieved March 20, 2021."
        ],
        [
            "^ Elizaga, Elson.",
            "\"What is the Meaning of 'Cagayan'?\".",
            "Mindanao Gold Star Daily.",
            "Retrieved March 2, 2023. mindanaogoldstardaily.com"
        ],
        [
            "^ Tsang, Cheng-hwa (2000), \"Recent advances in the Iron Age archaeology of Taiwan\", Bulletin of the Indo-Pacific Prehistory Association, 20: 153–158, doi:10.7152/bippa.v20i0.11751"
        ],
        [
            "^ Turton, M. (2021).",
            "Notes from central Taiwan: Our brother to the south.",
            "Taiwan's relations with the Philippines date back millenia, so it's a mystery that it's not the jewel in the crown of the New Southbound Policy.",
            "Taiwan Times."
        ],
        [
            "^ Everington, K. (2017).",
            "Birthplace of Austronesians is Taiwan, capital was Taitung: Scholar.",
            "Taiwan News."
        ],
        [
            "^ Bellwood, P., Hung, H., Lizuka, Y.",
            "(2011).",
            "Taiwan Jade in the Philippines: 3,000 Years of Trade and Long-distance Interaction.",
            "Semantic Scholar."
        ],
        [
            "^ Barreveld, Dirk J.",
            "(April 3, 2001).",
            "The Dutch Discovery of Japan: The True Story Behind James Clavell's Famous Novel Shogun.",
            "iUniverse.",
            "ISBN 9780595192618 – via Google Books."
        ],
        [
            "^ \"A History of the Philippines by David P. Barrows\".",
            "The City of Nueva Segovia, at the mouth of the Cagayan, was founded in the governorship of Ronquillo, when the valley of the Cagayan was first occupied and the Japanese colonists, who had settled there, were expelled.",
            "It had at the beginning of the seventeenth century two hundred Spaniards, living in houses of wood.",
            "There was a fort of stone, where some artillery was mounted.",
            "Besides the two hundred Spanish inhabitants there were one hundred regular Spanish soldiers, with their officers and the alcalde mayor of the province.",
            "Nueva Segovia was also the seat of a bishopric which included all northern Luzon.",
            "The importance of the then promising city has long ago disappeared, and the pueblo of Lallo, which marks its site, is an insignificant native town."
        ],
        [
            "^ Convicts or Conquistadores?",
            "Spanish Soldiers in the Seventeenth-Century Pacific By Stephanie J. Mawson AGI, México, leg.",
            "25, núm.",
            "62; AGI, Filipinas, leg.",
            "8, ramo 3, núm.",
            "50; leg.",
            "10, ramo 1, núm.",
            "6; leg.",
            "22, ramo 1, núm.",
            "1, fos.",
            "408 r –428 v; núm.",
            "21; leg.",
            "32, núm.",
            "30; leg.",
            "285, núm.",
            "1, fos.",
            "30 r –41 v ."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ a b Jane Baxter, Chris Poullaos, Practices, Profession and Pedagogy in Accounting: Essays in Honour of Bill Birkett, Sydney University Press, 2009, pp.152-161"
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Cororaton, Cesar B.",
            "\"Exchange Rate Movements in the Philippines\".",
            "DPIDS Discussion Paper Series 97-05: 3, 19."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Pimentel, Benjamin (2006).",
            "U.G.",
            "an underground tale: the journey of Edgar Jopson and the first quarter storm generation.",
            "Pasig: Anvil Publishing, Inc. ISBN 9712715906.",
            "OCLC 81146038."
        ],
        [
            "^ Rodis, Rodel.",
            "\"Remembering the First Quarter Storm\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on January 31, 2015.",
            "Retrieved January 27, 2020."
        ],
        [
            "^ Lacaba, Jose F. (1982).",
            "Days of Disquiet, Nights of Rage: The First Quarter Storm & Related Events.",
            "Manila: Salinlahi Pub.",
            "House.",
            "pp.",
            "11–45, 157–178."
        ],
        [
            "^ Robles, Raissa (2016).",
            "Marcos Martial Law: Never Again.",
            "Filipinos for a Better Philippines, Inc."
        ],
        [
            "^ \"History of Tuguegarao\".",
            "Tuguegarao City Government Official.",
            "Retrieved May 8, 2024."
        ],
        [
            "^ Magno, Alexander R., ed.",
            "(1998).",
            "\"Democracy at the Crossroads\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ \"Alfred McCoy, Dark Legacy: Human rights under the Marcos regime\".",
            "Ateneo de Manila University.",
            "September 20, 1999."
        ],
        [
            "^ Abinales, P.N.",
            "; Amoroso, Donna J.",
            "(2005).",
            "State and society in the Philippines.",
            "Lanham, MD: Rowman & Littlefield Publishers.",
            "ISBN 978-0742510234.",
            "OCLC 57452454."
        ],
        [
            "^ \"Gone too soon: 7 youth leaders killed under Martial Law\".",
            "Rappler.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ a b Rocamora, Rick (2023).",
            "Dark Memories of Torture, Incarceration, Disappeareance, and Death under Ferdinand E. Marcos Sr.'s Martial Law.",
            "Quezon City.",
            "ISBN 979-8-218-96751-2.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ \"Ricky Lee, martial law detainee, on historical revisionism: 'Para akong binubura'\".",
            "September 16, 2021."
        ],
        [
            "^ \"Victims recall horrors of Marcos' martial law\".",
            "ABS-CBN News.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ \"Martyrs and Heroes: Romeo Crismo\".",
            "Bantayog ng mga Bayani.",
            "May 28, 2023.",
            "Retrieved May 8, 2024."
        ],
        [
            "^ REYES, RACHEL A. G. (October 18, 2016).",
            "\"Marcos cronies and the golden oriole of Isabela\".",
            "Archived from the original on November 8, 2020.",
            "Retrieved May 10, 2024."
        ],
        [
            "^ Danguilan Vitug, Marites (1993).",
            "The Politics of Logging: Power from the Forest.",
            "Manila: Philippine Center for Investigative Journalism.",
            "ISBN 978-971-8686-01-0."
        ],
        [
            "^ Pawilen, Reidan M. (May 2021).",
            "\"The Solid North myth: an Investigation on the status of dissent and human rights during the Marcos Regime in Regions 1 and 2, 1969-1986\".",
            "University of the Philippines Los Baños University Knowledge Digital Repository.",
            "Archived from the original on November 13, 2021.",
            "Retrieved May 22, 2022."
        ],
        [
            "^ \"Day One (EDSA: The Original People Power Revolution by Angela Stuart-Santiago)\".",
            "Archived from the original on August 7, 2015.",
            "Retrieved March 15, 2015."
        ],
        [
            "^ Davide, Hilario.",
            "\"The Final Report of the Fact-Finding Commission: IV: Military Intervention in the Philippines: 1986–1987\".",
            "Official Gazette of the Republic of the Philippines.",
            "Archived from the original on October 21, 2017.",
            "Retrieved January 31, 2023."
        ],
        [
            "^ \"Female Governors 1920-90\".",
            "guide2womenleaders.com.",
            "Retrieved May 8, 2024."
        ],
        [
            "^ Macalalad, Rhonalyn & Delfino, Rafaela & Badilla, Roy & Paat, Socrates & Bagtasa, Gerry.",
            "(2023).",
            "Role of Historical Warming on the Extreme Flooding Event Due to Typhoon Vamco (Ulysses) 2020 in the Philippines.",
            "The Philippine Journal of Fisheries.",
            "152.",
            "197-212."
        ],
        [
            "^ \"Climate Change and Disasters in the Philippines | Heinrich Böll Foundation | Southeast Asia Regional Office\".",
            "th.boell.org.",
            "Archived from the original on September 27, 2023.",
            "Retrieved May 9, 2024."
        ],
        [
            "^ \"Robredo assures Cagayan Valley: We heard you, gov't finding ways to reach you\".",
            "November 13, 2020."
        ],
        [
            "^ \"Cagayan province turned into 'Pacific Ocean': Disaster management official\".",
            "November 13, 2020."
        ],
        [
            "^ \"Netizens blame lack of mass info dissemination in far-flung areas after Typhoon Ulysses\".",
            "Archived from the original on June 18, 2021.",
            "Retrieved May 9, 2024."
        ],
        [
            "^ \"CagayanNeedsHelp: Netizens' appeal for help goes viral on social media\".",
            "Manila Bulletin."
        ],
        [
            "^ \"NIA to review protocols on Magat Dam water release after Cagayan, Isabela floods\".",
            "November 17, 2020."
        ],
        [
            "^ a b c \"Province: Cagayan\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region II (Cagayan Valley)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region II (Cagayan Valley)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Weather forecast for Province of Cagayan, Philippines\".",
            "Storm247.",
            "Archived from the original on December 20, 2016.",
            "Retrieved January 31, 2016."
        ],
        [
            "^ \"Table 4.",
            "Household Population by Ethnicity and Sex: Cagayan, 2000\".",
            "Archived from the original on March 5, 2016.",
            "Retrieved December 7, 2017."
        ],
        [
            "^ \"UNESCO Atlas of the World's Languages in danger\".",
            "www.unesco.org."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Business Mirror: 1B Airport in Cagayan \"CA nixes foreclosure of subdivision owned by Ochoa's brother-in-law\".",
            "BusinessMirror.",
            "Archived from the original on January 10, 2012.",
            "Retrieved November 23, 2011.",
            "Retrieved November 23, 2011."
        ],
        [
            "^ Paraiso Philippines: Cagayan Archived November 9, 2020, at the Wayback Machine, retrieved November 23, 2011."
        ],
        [
            "^ Wadi, Julkipli (2010).",
            "Tadem, Eduardo C.",
            "(ed.).",
            "\"Introduction - Islam and Philippine Society: The Writings of Cesar Adib Majul\" (PDF).",
            "Asian Studies.",
            "46 (1–2).",
            "Quezon City, Philippines: Asian Center, University of the Philippines Diliman.",
            "ISSN 0004-4679."
        ],
        [
            "^ Schumacher, John N. (2008).",
            "Muslims in the Philippines (Review)."
        ],
        [
            "^ Veneracion, Jaime B.",
            "(February 6, 2013).",
            "\"Remembering Cesar Adib Majul and Teodoro Agoncillo (University of the Philippines System Website)\".",
            "web-old.up.edu.ph.",
            "Archived from the original on September 12, 2017.",
            "Retrieved September 12, 2017."
        ],
        [
            "^ Salvador Lazo Lazo"
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Cagayan travel guide from Wikivoyage"
        ],
        [
            " Media related to Cagayan (province) at Wikimedia Commons"
        ],
        [
            " Geographic data related to Cagayan at OpenStreetMap"
        ],
        [
            "Official Website of the Provincial Government of Cagayan"
        ],
        [
            "Places adjacent to Cagayan"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Batanes /Balintang Channel (Luzon Strait)"
        ],
        [
            "Apayao"
        ],
        [
            "Cagayan"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Kalinga"
        ],
        [
            "Isabela"
        ],
        [
            "vte Province of CagayanTuguegarao (capital and largest city)Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Alcala"
        ],
        [
            "Allacapan"
        ],
        [
            "Amulung"
        ],
        [
            "Aparri"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Buguey"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Enrile"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Rizal"
        ],
        [
            "Sanchez Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Solana"
        ],
        [
            "Tuao"
        ],
        [
            "Component city"
        ],
        [
            "Tuguegarao"
        ],
        [
            "BarangaysSee: List of barangays in Cagayan"
        ],
        [
            "Articles related to Cagayan"
        ],
        [
            "vteCagayan Valley (Region II)Regional center"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provinces"
        ],
        [
            "Batanes"
        ],
        [
            "Cagayan"
        ],
        [
            "Isabela"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Quirino"
        ],
        [
            "Independent component city"
        ],
        [
            "Santiago"
        ],
        [
            "Component cities"
        ],
        [
            "Cauayan"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Ilagan"
        ],
        [
            "Tuguegarao"
        ],
        [
            "Municipalities"
        ],
        [
            "Abulug"
        ],
        [
            "Aglipay"
        ],
        [
            "Alcala"
        ],
        [
            "Alfonso Castañeda"
        ],
        [
            "Alicia"
        ],
        [
            "Allacapan"
        ],
        [
            "Ambaguio"
        ],
        [
            "Amulung"
        ],
        [
            "Angadanan"
        ],
        [
            "Aparri"
        ],
        [
            "Aritao"
        ],
        [
            "Aurora"
        ],
        [
            "Bagabag"
        ],
        [
            "Baggao"
        ],
        [
            "Ballesteros"
        ],
        [
            "Bambang"
        ],
        [
            "Basco"
        ],
        [
            "Bayombong"
        ],
        [
            "Benito Soliven"
        ],
        [
            "Buguey"
        ],
        [
            "Burgos"
        ],
        [
            "Cabagan"
        ],
        [
            "Cabarroguis"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calayan"
        ],
        [
            "Camalaniugan"
        ],
        [
            "Claveria"
        ],
        [
            "Cordon"
        ],
        [
            "Delfin Albano"
        ],
        [
            "Diadi"
        ],
        [
            "Diffun"
        ],
        [
            "Dinapigue"
        ],
        [
            "Divilacan"
        ],
        [
            "Dupax del Norte"
        ],
        [
            "Dupax del Sur"
        ],
        [
            "Echague"
        ],
        [
            "Enrile"
        ],
        [
            "Gamu"
        ],
        [
            "Gattaran"
        ],
        [
            "Gonzaga"
        ],
        [
            "Iguig"
        ],
        [
            "Itbayat"
        ],
        [
            "Ivana"
        ],
        [
            "Jones"
        ],
        [
            "Kasibu"
        ],
        [
            "Kayapa"
        ],
        [
            "Lal-lo"
        ],
        [
            "Lasam"
        ],
        [
            "Luna"
        ],
        [
            "Maconacon"
        ],
        [
            "Maddela"
        ],
        [
            "Mahatao"
        ],
        [
            "Mallig"
        ],
        [
            "Nagtipunan"
        ],
        [
            "Naguilian"
        ],
        [
            "Palanan"
        ],
        [
            "Pamplona"
        ],
        [
            "Peñablanca"
        ],
        [
            "Piat"
        ],
        [
            "Quezon (Isabela)"
        ],
        [
            "Quezon (Nueva Vizcaya)"
        ],
        [
            "Quirino"
        ],
        [
            "Ramon"
        ],
        [
            "Reina Mercedes"
        ],
        [
            "Rizal"
        ],
        [
            "Roxas"
        ],
        [
            "Sabtang"
        ],
        [
            "Saguday"
        ],
        [
            "San Agustin"
        ],
        [
            "San Guillermo"
        ],
        [
            "San Isidro"
        ],
        [
            "San Manuel"
        ],
        [
            "San Mariano"
        ],
        [
            "San Mateo"
        ],
        [
            "San Pablo"
        ],
        [
            "Sanchez-Mira"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Praxedes"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Solana"
        ],
        [
            "Solano"
        ],
        [
            "Tuao"
        ],
        [
            "Tumauini"
        ],
        [
            "Uyugan"
        ],
        [
            "Villaverde"
        ],
        [
            "Luzon, Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cagayan&oldid=1233715122\""
        ],
        [
            "Categories: CagayanProvinces of the PhilippinesProvinces of Cagayan ValleyStates and territories established in 15831583 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherWebarchive template wayback linksUse Philippine English from August 2022All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Articles needing additional references from January 2014All articles needing additional referencesArticles with short descriptionShort description is different from WikidataPages using infobox settlement with possible nickname listCoordinates on WikidataArticles containing Ilocano-language textArticles containing Ibanag-language textArticles containing Itawit-language textArticles containing Filipino-language textArticles needing more detailed referencesAll articles with unsourced statementsArticles with unsourced statements from August 2023Articles to be expanded from November 2015All articles to be expandedArticles using small message boxesWikipedia articles needing clarification from April 2016Articles to be expanded from May 2024Articles with unsourced statements from June 2016All articles with vague or ambiguous timeVague or ambiguous time from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}