{
    "name": "Capiz",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Capiz"
        ],
        [
            "42 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°23′N 122°38′E﻿ / ﻿11.38°N 122.63°E﻿ / 11.38; 122.63"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "This article is about the Philippine province.",
            "For other uses, see Capiz (disambiguation)."
        ],
        [
            "Province in Western Visayas, PhilippinesCapizProvince(from top: left to right) Panay Church, Capiz Provincial Capitol,  Panitan Plaza, Ivisan and Dao Church."
        ],
        [
            "FlagSealNickname: Seafood Capital of the PhilippinesAnthem: O, CapizLocation in the PhilippinesOpenStreetMapCoordinates: 11°23′N 122°38′E﻿ / ﻿11.38°N 122.63°E﻿ / 11.38; 122.63CountryPhilippinesRegionWestern VisayasSpanish Settlement1566Encomienda1569Politico-Military Province1716FoundedApril 15, 1901Capitaland largest cityRoxasGovernment • GovernorFredenil H. Castro (Lakas-CMD) • Vice GovernorJames \"Mitang\" O. Magbanua (Lakas-CMD) • LegislatureCapiz Provincial BoardArea • Total804,952 • Rank38th out of 81 • Density310/km2 (800/sq mi)  • Rank25th out of 81DemonymCapiznon/CapizeñoDivisions • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " Roxas"
        ],
        [
            " • Municipalities"
        ],
        [
            "16"
        ],
        [
            " Cuartero"
        ],
        [
            " Dao"
        ],
        [
            " Dumalag"
        ],
        [
            " Dumarao"
        ],
        [
            " Ivisan"
        ],
        [
            " Jamindan"
        ],
        [
            " Maayon"
        ],
        [
            " Mambusao"
        ],
        [
            " Panay"
        ],
        [
            " Panitan"
        ],
        [
            " Pilar"
        ],
        [
            " Pontevedra"
        ],
        [
            " President Roxas"
        ],
        [
            " Sapian"
        ],
        [
            " Sigma"
        ],
        [
            " Tapaz"
        ],
        [
            " • Barangays473 • DistrictsLegislative districts of CapizTime zoneUTC+8 (PST)ZIP Code5800–5816IDD : area code +63 (0)36ISO 3166 codePH-CAPHDI 0.650 (Medium)HDI rank32nd in Philippines (2019)Spoken languagesCapiznonHiligaynonAklanonKinaray-aIgbokTagalogEnglishGDP (2022)₱74.38 billion $1.268 billion Growth rate 8.8%Websitecapiz.gov.ph"
        ],
        [
            "Capiz, officially the Province of Capiz (Capiznon/Hiligaynon: Kapuoran sang Capiz; Tagalog: Lalawigan ng Capiz), is a province in the Philippines located in the central section of Western Visayas region.",
            "Its capital is the city of Roxas.",
            "It is located at the northeastern portion of Panay Island, bordering Aklan to the north, Antique to the west, and Iloilo to the south.",
            "Capiz faces the Sibuyan Sea to the north."
        ],
        [
            "Capiz is known for the Placuna placenta oyster shell that has the same name locally and is used for decoration and making lampshades, trays, window and doors.",
            "Likewise, the province is known as the \"Seafood Capital of the Philippines\" Capiz is the site of the famous coral-stone Santa Mónica Church in the town of Panay, home to the largest Catholic Church bell in Asia.",
            "The bell was made from 70 sacks of gold and silver coins donated by the townsfolk.",
            "Measuring seven feet in diameter, five feet in height and weighing 10,400 kilograms or just over 10 metric tons, the Panay bell is popular among tourists visiting Capiz."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Capiz\" – news · newspapers · books · scholar · JSTOR (July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The account of early Spanish explorers about Capiz and its people was traced back in 1566 when the Spaniards set foot in the mouth of Banica river."
        ],
        [
            "Early settlements were seen in the town of Panay.",
            "The town was originally called Bamban.",
            "The name was changed by the early Spaniards to Panay, a word which means \"mouth of the river.\"",
            "This is also the location of a fortress built by Juan de la Isla"
        ],
        [
            "When the Spaniards led by Miguel López de Legazpi came to Panay from Cebu in 1569, after sailing from Mexico, they found people with tattoos, and so they called the island Isla de los Pintados."
        ],
        [
            "How the island itself came to be called Panay is uncertain.",
            "The Aeta (Negritos) called it Aninipay, after a plant that abounded in the island.",
            "Legend has it that López de Legazpi and his men, in search of food, exclaimed upon the island, pan hay en esta isla!",
            "\"There is bread in this island\"!",
            "and the island of Panay closely resembles the shape of a heart and the heart of Jesus Christ is considered present in the Eucharistic Bread.",
            "The Spanish then came and established their first settlement on the island at the mouth of the Banica River and called it Panay.",
            "This was the second Spanish settlement in the Philippines, following San Miguel, Cebu.",
            "Unknown to many, Calle Revolución in Panay is the second oldest street in the Philippines after Calle Colón in Cebu City, Central Visayas."
        ],
        [
            "Later in 1569, Captain Diego de Artieda, who was sent by López de Legazpi, landed in the town of Panay and proclaimed it as the capital of the province.",
            "Later, the Spaniards moved the capital to its present site upon founding the town of Capiz (not the province, and now Roxas City) which was near the sea and provided docking facilities."
        ],
        [
            "In 1716, the province was created a separate encomienda and was later organized into a politico-military unit.",
            "By the end of the 1700s, Capiz had 11,459 native families and 89 Spanish Filipino families.",
            ": 31, 54, 113"
        ],
        [
            "The Panayanon's noble character and royal blood shone out in later centuries when fellow people from Panay island, at Iloilo City was given by the Queen of Spain, the Royal Title of \"Most Loyal and Noble City\" for being the most ardent and faithful city in the Spanish Empire and had remained loyal to Spain while the entire empire collapsed."
        ],
        [
            "Although Capiz joined the Tagalog-led Philippine Revolution, the Spaniards didn't surrender to the Tagalogs but they did surrender to the people of Iloilo and eventually Iloilo and Capiz were part of the same Federal Republic of the Visayas a substate which was formed within the First Philippine Republic, the first capital of which was in Cavite while the United States of America had betrayed the Philippine Revolution which they initially supported and influential American officers swore allegiance to.",
            "These American officers betrayed their oaths and occupied Manila."
        ],
        [
            "American invasion era"
        ],
        [
            "The American takeover of the Philippines resulted in the establishment of a civil government in Capiz on April 15, 1901, by virtue of Act 115."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "On April 16, 1942, Imperial Japanese forces landed on Capiz City and occupied the rest of the province.",
            "However, on December 20, 1944, Capizanon guerrillas, whose forces already occupied most of the province, liberated the capital from Japanese hands, leading to the full liberation of the province."
        ],
        [
            "Philippine independence"
        ],
        [
            "Capiz and Aklan were united under one province until 25 April 1956, when President Ramon Magsaysay signed into law Republic Act 1414 separating the two entities."
        ],
        [
            "Geography"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Panay River in Roxas City"
        ],
        [
            "Capiz covers a total area of 2,594.64 square kilometres (1,001.80 sq mi) occupying the northeastern portion of Panay Island, and is one of the five provinces that compose the Western Visayas region.",
            "Mount Nangtud, is the highest mountain in Capiz with an elevation of 6,804 ft (2,074 m) located in the Capiz-Antique border.",
            "Other peaks are Mount Tigas 4,760 ft (1,451 m), Mount Agudo 2,736 ft (834 m).",
            "The province comprises 473 barangays, 16 municipalities and a city.",
            "Roxas City, the provincial capital, is only 45 minutes away by plane from Manila and is within the routes of major shipping lines.",
            "The Panay River used to be famous for the great number of crocodiles thriving there.",
            "Capiz is bounded by the Sibuyan Sea and the Panay, Loctugan and Ivisan rivers."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Capiz comprises 1 city (Roxas) and 16 municipalities, further subdivided into 473 barangays, with 2 congressional districts."
        ],
        [
            "Administrative divisions of Capiz"
        ],
        [
            " †  Provincial capital and component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Cuartero"
        ],
        [
            "2nd"
        ],
        [
            "3.5%"
        ],
        [
            "27,993"
        ],
        [
            "27,408"
        ],
        [
            "+0.40%"
        ],
        [
            "106.58"
        ],
        [
            "41.15"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "22"
        ],
        [
            "11°20′28″N 122°40′10″E﻿ / ﻿11.3411°N 122.6694°E﻿ / 11.3411; 122.6694﻿ (Cuartero)"
        ],
        [
            "Dao"
        ],
        [
            "2nd"
        ],
        [
            "4.2%"
        ],
        [
            "33,842"
        ],
        [
            "32,496"
        ],
        [
            "+0.78%"
        ],
        [
            "88.64"
        ],
        [
            "34.22"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "20"
        ],
        [
            "11°23′38″N 122°41′07″E﻿ / ﻿11.3938°N 122.6852°E﻿ / 11.3938; 122.6852﻿ (Dao)"
        ],
        [
            "Dumalag"
        ],
        [
            "2nd"
        ],
        [
            "3.7%"
        ],
        [
            "30,098"
        ],
        [
            "29,466"
        ],
        [
            "+0.40%"
        ],
        [
            "109.18"
        ],
        [
            "42.15"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "19"
        ],
        [
            "11°18′15″N 122°37′17″E﻿ / ﻿11.3042°N 122.6214°E﻿ / 11.3042; 122.6214﻿ (Dumalag)"
        ],
        [
            "Dumarao"
        ],
        [
            "2nd"
        ],
        [
            "6.2%"
        ],
        [
            "49,506"
        ],
        [
            "46,157"
        ],
        [
            "+1.34%"
        ],
        [
            "232.56"
        ],
        [
            "89.79"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "33"
        ],
        [
            "11°15′48″N 122°41′14″E﻿ / ﻿11.2632°N 122.6872°E﻿ / 11.2632; 122.6872﻿ (Dumarao)"
        ],
        [
            "Ivisan"
        ],
        [
            "2nd"
        ],
        [
            "3.9%"
        ],
        [
            "31,278"
        ],
        [
            "29,055"
        ],
        [
            "+1.41%"
        ],
        [
            "54.20"
        ],
        [
            "20.93"
        ],
        [
            "580"
        ],
        [
            "1,500"
        ],
        [
            "15"
        ],
        [
            "11°31′18″N 122°41′27″E﻿ / ﻿11.5216°N 122.6908°E﻿ / 11.5216; 122.6908﻿ (Ivisan)"
        ],
        [
            "Jamindan"
        ],
        [
            "2nd"
        ],
        [
            "4.8%"
        ],
        [
            "38,670"
        ],
        [
            "36,677"
        ],
        [
            "+1.01%"
        ],
        [
            "412.03"
        ],
        [
            "159.09"
        ],
        [
            "94"
        ],
        [
            "240"
        ],
        [
            "30"
        ],
        [
            "11°24′32″N 122°30′38″E﻿ / ﻿11.4089°N 122.5105°E﻿ / 11.4089; 122.5105﻿ (Jamindan)"
        ],
        [
            "Maayon"
        ],
        [
            "1st"
        ],
        [
            "5.1%"
        ],
        [
            "41,226"
        ],
        [
            "38,416"
        ],
        [
            "+1.35%"
        ],
        [
            "142.32"
        ],
        [
            "54.95"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "32"
        ],
        [
            "11°23′15″N 122°46′52″E﻿ / ﻿11.3874°N 122.7811°E﻿ / 11.3874; 122.7811﻿ (Ma-ayon)"
        ],
        [
            "Mambusao"
        ],
        [
            "2nd"
        ],
        [
            "5.1%"
        ],
        [
            "40,690"
        ],
        [
            "39,644"
        ],
        [
            "+0.50%"
        ],
        [
            "136.91"
        ],
        [
            "52.86"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "26"
        ],
        [
            "11°25′36″N 122°35′39″E﻿ / ﻿11.4266°N 122.5942°E﻿ / 11.4266; 122.5942﻿ (Mambusao)"
        ],
        [
            "Panay"
        ],
        [
            "1st"
        ],
        [
            "6.1%"
        ],
        [
            "48,890"
        ],
        [
            "46,114"
        ],
        [
            "+1.12%"
        ],
        [
            "116.37"
        ],
        [
            "44.93"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "42"
        ],
        [
            "11°33′16″N 122°47′27″E﻿ / ﻿11.5544°N 122.7909°E﻿ / 11.5544; 122.7909﻿ (Panay)"
        ],
        [
            "Panitan"
        ],
        [
            "1st"
        ],
        [
            "5.3%"
        ],
        [
            "42,565"
        ],
        [
            "40,289"
        ],
        [
            "+1.05%"
        ],
        [
            "89.88"
        ],
        [
            "34.70"
        ],
        [
            "470"
        ],
        [
            "1,200"
        ],
        [
            "26"
        ],
        [
            "11°27′47″N 122°46′07″E﻿ / ﻿11.4631°N 122.7687°E﻿ / 11.4631; 122.7687﻿ (Panitan)"
        ],
        [
            "Pilar"
        ],
        [
            "1st"
        ],
        [
            "5.9%"
        ],
        [
            "47,100"
        ],
        [
            "45,287"
        ],
        [
            "+0.75%"
        ],
        [
            "77.99"
        ],
        [
            "30.11"
        ],
        [
            "600"
        ],
        [
            "1,600"
        ],
        [
            "24"
        ],
        [
            "11°29′10″N 122°59′47″E﻿ / ﻿11.4861°N 122.9963°E﻿ / 11.4861; 122.9963﻿ (Pilar)"
        ],
        [
            "Pontevedra"
        ],
        [
            "1st"
        ],
        [
            "6.2%"
        ],
        [
            "49,725"
        ],
        [
            "46,428"
        ],
        [
            "+1.31%"
        ],
        [
            "130.90"
        ],
        [
            "50.54"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "26"
        ],
        [
            "11°28′54″N 122°49′58″E﻿ / ﻿11.4818°N 122.8327°E﻿ / 11.4818; 122.8327﻿ (Pontevedra)"
        ],
        [
            "President Roxas"
        ],
        [
            "1st"
        ],
        [
            "3.9%"
        ],
        [
            "31,269"
        ],
        [
            "29,676"
        ],
        [
            "+1.00%"
        ],
        [
            "77.88"
        ],
        [
            "30.07"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "22"
        ],
        [
            "11°25′51″N 122°55′35″E﻿ / ﻿11.4307°N 122.9264°E﻿ / 11.4307; 122.9264﻿ (President Roxas)"
        ],
        [
            "Roxas City"
        ],
        [
            "†"
        ],
        [
            "1st"
        ],
        [
            "22.3%"
        ],
        [
            "179,292"
        ],
        [
            "167,003"
        ],
        [
            "+1.36%"
        ],
        [
            "95.07"
        ],
        [
            "36.71"
        ],
        [
            "1,900"
        ],
        [
            "4,900"
        ],
        [
            "47"
        ],
        [
            "11°35′22″N 122°45′00″E﻿ / ﻿11.5895°N 122.7500°E﻿ / 11.5895; 122.7500﻿ (Roxas City)"
        ],
        [
            "Sapian"
        ],
        [
            "2nd"
        ],
        [
            "3.3%"
        ],
        [
            "26,697"
        ],
        [
            "25,821"
        ],
        [
            "+0.64%"
        ],
        [
            "105.24"
        ],
        [
            "40.63"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "10"
        ],
        [
            "11°29′39″N 122°36′14″E﻿ / ﻿11.4941°N 122.6039°E﻿ / 11.4941; 122.6039﻿ (Sapian)"
        ],
        [
            "Sigma"
        ],
        [
            "2nd"
        ],
        [
            "3.9%"
        ],
        [
            "31,688"
        ],
        [
            "30,134"
        ],
        [
            "+0.96%"
        ],
        [
            "101.71"
        ],
        [
            "39.27"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "21"
        ],
        [
            "11°25′16″N 122°39′57″E﻿ / ﻿11.4211°N 122.6658°E﻿ / 11.4211; 122.6658﻿ (Sigma)"
        ],
        [
            "Tapaz"
        ],
        [
            "2nd"
        ],
        [
            "6.8%"
        ],
        [
            "54,423"
        ],
        [
            "51,313"
        ],
        [
            "+1.13%"
        ],
        [
            "517.18"
        ],
        [
            "199.68"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "58"
        ],
        [
            "11°15′41″N 122°32′15″E﻿ / ﻿11.2615°N 122.5374°E﻿ / 11.2615; 122.5374﻿ (Tapaz)"
        ],
        [
            "Total"
        ],
        [
            "804,952"
        ],
        [
            "761,384"
        ],
        [
            "+1.07%"
        ],
        [
            "2,594.64"
        ],
        [
            "1,001.80"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "473"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CapizYearPop.±% p.a.1903 119,948—    1918 155,342+1.74%1939 228,660+1.86%1948 244,889+0.76%1960 315,079+2.12%1970 394,041+2.26%1975 445,716+2.50%1980 492,231+2.00%1990 584,091+1.73%1995 624,469+1.26%2000 654,156+1.00%2007 701,664+0.97%2010 719,685+0.93%2015 761,384+1.08%2020 804,952+1.10%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Capiz in the 2020 census was 804,952 people, with a density of 310 inhabitants per square kilometre or 800 inhabitants per square mile."
        ],
        [
            "Inhabitants"
        ],
        [
            "Historians and ethnologists narrowed down to three types of people known to have inhabited Capiz: Atis/Aetas, popularly known as Negritos; Indonesian descendants of the Mundo tribe in central Panay; and the Malays."
        ],
        [
            "Sulod tribe"
        ],
        [
            "Located in Tapaz, Suludnon also known as the Tumandok, Panay-Bukidnon, or Panayanon Sulud, are culturally indigenous Visayan group of people who reside in the Capiz-Lambunao mountainous area and the Antique-Iloilo mountain area of Panay in the Visayan islands of the Philippines.",
            "They speak the Igbok language (also known as Ligbok or Sulod language), a member of the West Bisayan subdivision of the Bisayan languages within the Austronesian language family."
        ],
        [
            "Religion"
        ],
        [
            "Roman Catholicism remains influential in the lives of most people living in Capiz especially in the fields of politics, education and even in their daily personal decisions.",
            "Roman Catholics are predominant with 70 percent."
        ],
        [
            "Other groups include Members Church of God International (MCGI), Born Again Christians, Iglesia ni Cristo, Methodists, The Church of Jesus Christ of Latter-day Saints, Baptists, Jehovah's Witnesses, and Seventh-day Adventists among others."
        ],
        [
            "Languages"
        ],
        [
            "There are two main local languages: Capiznon and Hiligaynon.",
            "Filipino and English are also used and understood as administrative and business languages and are widely spoken as second languages.",
            "Aklanon is spoken in towns near Aklan such as Sapian, Jamindan, and Mambusao."
        ],
        [
            "Capiznon is concentrated in the province of Capiz in the northeast of Panay.",
            "It is a member of the Visayan language family and the people using it are part of the wider Visayan ethnolinguistic group, who constitute the largest Filipino ethnolinguistic group.",
            "It is related but often confused with Hiligaynon/Ilonggo, yet it has its own unique vocabulary and accent, as well as a handful of words unique to the language itself."
        ],
        [
            "Government"
        ],
        [
            "Provincial Government"
        ],
        [
            "The governor serves as the chief executive of the province while the vice governor serves as the presiding officer of the Sangguniang Panlalawigan (lit.",
            "'Provincial Council' popularly known as 'Provincial Board')."
        ],
        [
            "The Sangguniang Panlalawigan is composed of ten members (known as 'board members' or 'BM') from the two legislative districts of the province elected through popular vote.",
            "They are joined by  three ex-officio members - the presidents of the province's councilors league, Liga ng mga Barangay, and Sangguniang Kabataan."
        ],
        [
            "The term of office of the incumbent officials, except for the ex-officio members of the Sangguniang Panlalawigan, began at noon of June 30, 2022, and will expire at noon of June 30, 2025."
        ],
        [
            "Capiz Provincial Capitol in Roxas City, the seat of the provincial government"
        ],
        [
            "Governor"
        ],
        [
            "Fredenil H. Castro"
        ],
        [
            "Vice Governor"
        ],
        [
            "Jaime O. Magbanua"
        ],
        [
            "Sangguniang Panlalawigan ng Capiz"
        ],
        [
            "Members from the First District"
        ],
        [
            "Members from the Second District"
        ],
        [
            "Jose Fulgencio del Rosario"
        ],
        [
            "Jonathan B. Besa"
        ],
        [
            "Blesilda Almalbis"
        ],
        [
            "Thea Faith Reyes"
        ],
        [
            "Trina Marie Ignacio"
        ],
        [
            "Elmer Arevalo"
        ],
        [
            "Gilbert Ardivilla"
        ],
        [
            "Aldwin Cruz-am"
        ],
        [
            "Neriza Joy San Felix"
        ],
        [
            "Cecilio Fecundo"
        ],
        [
            "Ex-officio Members"
        ],
        [
            "PresidentPhilippine Councilors League"
        ],
        [
            "Mitchelle John B. Patricio"
        ],
        [
            "PresidentLiga ng mga Barangay"
        ],
        [
            "Querubin P. Pamplona"
        ],
        [
            "PresidentSangguniang Kabataan Federation"
        ],
        [
            "Renzo B. Teves"
        ],
        [
            "District Representatives"
        ],
        [
            "Further information: Legislative districts of Capiz"
        ],
        [
            "Representatives to the Lower House of Congress"
        ],
        [
            "First District"
        ],
        [
            "Second District"
        ],
        [
            "Emmanuel A. Billones"
        ],
        [
            "Jane T. Castro"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Capiz"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  29.92"
        ],
        [
            "2009  28.96"
        ],
        [
            "2012  27.76"
        ],
        [
            "2015  11.72"
        ],
        [
            "2018  6.16"
        ],
        [
            "2021  6.10"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "With its 80-kilometer coastline and wide expanse of swampy lands easily converted into fishponds, Capiz is dubbed as the \"Seafood Capital of the Philippines\".",
            "It holds one of the richest fishing grounds and is a major contributor in the aquamarine industry of the Philippines.",
            "Farming and fishing are the primary sources of income for the people.",
            "The combined natural bounty of land and sea sustain a vibrant food industry.",
            "Primary agricultural raw products are rice, corn, coconut, sugarcane, banana and cut flower."
        ],
        [
            "Apart from a surplus of agricultural products, Capiz is also a major supplier of prawn and milkfish (bangus).",
            "Other agro-industrial harvests include blue marlin, squid, oysters, shrimp, seaweed, and angel wings.",
            "Rich fish ponds attract investors to venture into prawn culture, prawn feed manufacture, seaweed farming and the distribution and processing of other marine products.",
            "A robust workforce of 445,246 operates with a literacy rate of 92.04%.",
            "Its relatively unexplored caves are said to have high deposits of mineral resources such as limestone, gold and metal."
        ],
        [
            "Robinsons Place Roxas"
        ],
        [
            "Telecommunications"
        ],
        [
            "Four big telecommunication companies offer telegraph, telex and telephone services.",
            "Communication facilities are catered by the Philippine Long Distance Telephone Company (PLDT), Bureau of Telecommunications (BUTEL), PT&T, RCPI-Bayantel, Globelines-Islacom and cellular phone companies: Smart, Globe, Dito, Touch Mobile & Sun Cellular.",
            "Internet services are also available like PLDT Vibe."
        ],
        [
            "Broadcast communications"
        ],
        [
            "Broadcast media is catered by 3 AM radio stations namely: AM - IBC DYJJ, DYOW - Bombo Radyo, DYVR - RMN Roxas."
        ],
        [
            "FM stations.",
            "like Star FM, Love Radio, Radyo Todo, Baskog Radyo, Radyo Badera, Brigada News FM, IFM Roxas, DABIG C Radio and minor FM Stations like CAP Rhythm, Spirit FM Roxas and recently XFm Roxas."
        ],
        [
            "Television facilities reach the city through Iloilo.",
            "There are two cable television providers, Wesfardell Cable Services and Filvision, Inc. (Altocable)."
        ],
        [
            "GMA Network and SMNI are two Television relay station is now operating in the city."
        ],
        [
            "Publishing"
        ],
        [
            "Capiz is also home to digital news publishing platforms."
        ],
        [
            "Capiz News is a digital news site based in Dumalag, Capiz as per Google Maps and Google My Business."
        ],
        [
            "A newsletter, named The Capiz Brew is also digitally published in Capiz."
        ],
        [
            "Banks"
        ],
        [
            "There are more than 60 banking institutions and 116 intermediaries operating in the province."
        ],
        [
            "Capiz products"
        ],
        [
            "Some popular Capiz shell chips decorating design include gift items, indoor decoration and outdoor decoration ornaments.",
            "Capiz chip-made products range from lanterns, lamp shades, window pane, chandeliers, curtains, picture panels and frames, Capiz shell balls, plates, decorative bowls, candle holders, tiles, flower vase, door hanging chime, soapdish, pendant, globelight, necklace decor, beads, bird cage, floor lamp holders, faux chandelier, gift boxes, collection item rack and many more."
        ],
        [
            "Bulad or dried fish is a major product.",
            "There are several varieties of dried fishes that can be found in Capiz."
        ],
        [
            "Business Process Outsourcing"
        ],
        [
            "This section contains content that is written like an advertisement.",
            "Please help improve it by removing promotional content and inappropriate external links, and by adding encyclopedic content written from a neutral point of view.",
            "(July 2023) (Learn how and when to remove this message)"
        ],
        [
            "PETRA Academy is a non-voice outsourcing company that serves Korean nationals for an online English tutorial.",
            "The company is located in 3/F JC TIU Building, Corner Burgos Street and Inzo Arnaldo, Roxas City."
        ],
        [
            "ePerformax Contact Center and BPO is the largest BPO company in Capiz and Northern Panay, ePerformax Contact Center and BPO - Roxas City opened last June 15, 2018, with over 1,000 employees as of 2020 and is targeting to reach 3,000 employees by 2022.",
            "It is located in PEZA-approved 7.4 hectares Pueblo de Panay Technopark inside 769 hectares Pueblo de Panay township.",
            "ePerformax Contact Center and BPO has also branches in Metro Manila and Cebu."
        ],
        [
            "Xilium is located in Capiz Government and Business Center.",
            "It is a home-grown BPO company from Iloilo City, Philippines.",
            "It was founded in 2011 by an Ilongga, Vanessa Belleza and an American partner, Don Wickelgren.",
            "The company has grown steadily from a 5-person startup to a full-scale organization with more than 100 employees and a second branch in Roxas City, Capiz.",
            "Xilium is hiring Virtual Medical Assistants (VMAs) for US Healthcare Account."
        ],
        [
            "Culture"
        ],
        [
            "Capiz is known for its trademark product, the brilliant Capiz shell,  used in windows, lanterns, decorations, vases, etc.",
            "The Capiz shell has a luster similar to mother of pearl shells."
        ],
        [
            "Hymn"
        ],
        [
            "Main article: O, Capiz"
        ],
        [
            "The official hymn of Capiz, O, Capiz was adopted in June 2006 by ordinance of the Sangguniang Panlalawigan.",
            "Vicente Bermejo, former province governor stated \"we need a melody that will inspire us and forge our efforts together to achieve our dream for a better Capiz,\" in support of the hymn's incorporation."
        ],
        [
            "Folk dances"
        ],
        [
            "Capiz is one of the places in the Philippines that contributed a lot in Philippine folk dancing.",
            "The province alone has 19 Visayan folk dances such as \"Tinolabong\", \"Gayong-gayong\", \"Timawa\", Dagit-dagit\", \"Beneracion\", \"Tatay Meroy Cariñosa\", \"Pukol\", \"Habanera Capiceña\", \"Cabatingan\", \"Saad\", \"Pitik Mingaw\", \"Kuratsa Capiceña\", and \"Palomita Coquitana\" to name a few."
        ],
        [
            "Festivals"
        ],
        [
            "Saot Capiz – A cultural presentation – The First Capiz Dance Season held every Saturday at the Capiz Provincial Park, Roxas City."
        ],
        [
            "Sinadya sa Halaran – Is a merging of the Roxas City Fiesta \"Sinadya\" and the Province celebration of \"Halaran\".",
            "\"Sinadya sa Halaran\" is a commemoration of the feast of the patroness of Roxas City, which is the Immaculate Conception and a thanksgiving.",
            "It literally means \"Joy in Sharing and Thanksgiving\".",
            "Rituals and festivities include fireworks, grand parades, fluvial processions, fair and food festivals, street dancing, and exhibits.",
            "Later, the festival was renamed \"Sinadya sa Inmaculada Concepcion\" with the dissolution of the Halaran Festival and the re-direction of the city's celebration to its patron, the Immaculate Concepcion.",
            "The City of Roxas, to celebrate the organization of its government, now also celebrates \"Sugilanon Festival\" in May of every year, usually in the week leading to or after May 12, which is the charter day of the city."
        ],
        [
            "Pangahaw Festival – A thanksgiving for a bountiful harvest by the Indigenous Peoples of Jamindan."
        ],
        [
            "Guyum-Guyuman Festival – \"Caguyuman\" the old name of Pontevedra, meaning anthill, a name distinct for ants' house was once a part of the municipality of Pan-ay mainly because of its abundant natural resources both from the coastal and upland areas.",
            "People from the nearby municipalities of Panay, Panitan, Maayon and President Roxas, would thrive in the market place like swarm of ants for trading.",
            "This rich tradition is now a celebration of life and thanksgiving for all Caguyumanons."
        ],
        [
            "Talahong Festival – Talaba and tahong is very rich in production in these areas.",
            "More than a hundred fisherfolk live along the coast.",
            "Since Sapian is abundant with seafoods, it was the initiative of the Local Government Unit to organize a Talahong Festival (Talaba-Tahong) every 2nd Friday and 2nd Saturday of May that promotes the local products."
        ],
        [
            "Tagbuan Festival – It was conceptualized during the Pre-Spanish time, wherein there were aetas in the upland barangay."
        ],
        [
            "Transportation"
        ],
        [
            "Air"
        ],
        [
            "Roxas Airport is an airport serving the general area of Roxas City, the provincial capital.",
            "The airport is classified as a Class 1 principal airport, by the Civil Aviation Authority of the Philippines.",
            "Roxas Airport has 3 flights daily and 4 flights on selected days courtesy of Philippine Airlines, Cebu Pacific and AirAsia Philippines."
        ],
        [
            "Land"
        ],
        [
            "The primary transportation vehicle used in Roxas City and other municipalities in Capiz is the tricycle.",
            "Travel between municipalities is typically by jeepney, vans and Ceres operated buses.",
            "\"Capiz Cab\", the city's taxi that plies Roxas City and the 16 municipalities of the Capiz.",
            "Capiz Cabs are the first receipt-issuing taxis in the Philippines apart from those operating out of Ninoy Aquino International Airport."
        ],
        [
            "Sea"
        ],
        [
            "Inter and provincial mobility of residents and their cargo is serviced by vans, buses and jeepneys.",
            "Sea transportation (cargo vessel) is served by Moreta Lines plying the route of Roxas to Manila.",
            "Roll On-Roll Off (Ro-Ro) are served by two shipping companies namely Super Shuttle Roro 2 and 2GO to fetch passengers from Roxas City to Batangas City via Odiongan, Romblon."
        ],
        [
            "Inter-island shipping is also served from Roxas City to the following locations such as: Balud, Masbate; Mandaon, Masbate; Sibuyan Island, Romblon; Cadiz, Negros Occidental; Guimaras Island; and Estancia, Iloilo."
        ],
        [
            "Notable people"
        ],
        [
            "This list is only for people born or residing in Capiz."
        ],
        [
            "Politics"
        ],
        [
            "Manuel Roxas, the first president of an independent Philippines, served as governor of Capiz from 1919 until 1922 and represented the province's first district in the House of Representatives from 1922 until 1938."
        ],
        [
            "Manuel Roxas, first President of the independent Republic of the Philippines."
        ],
        [
            "Gerardo Roxas, Philippine Senator and son of President Manuel Roxas."
        ],
        [
            "Pedro Gil, was a physician, journalist, and legislator.",
            "He was elected representative for the south district of Manila on the Democrata party ticket.",
            "He became Minority Floor Leader in the House of Representatives of the Philippines."
        ],
        [
            "Cornelio Villareal, 11th Speaker of the House of Representatives of the Philippines"
        ],
        [
            "Fredenil Castro, former deputy speaker of the House of the Representatives of the Philippines."
        ],
        [
            "Roy Señeres, Filipino statesman and diplomat."
        ],
        [
            "Jocelyn Bolante, politician who formerly served as an Undersecretary of the Department of Agriculture of the Philippines."
        ],
        [
            "Entertainment"
        ],
        [
            "Jovita Fuentes, Dubbed the First Lady of Philippine Music.",
            "The first female recipient of the National Artist Award."
        ],
        [
            "Daisy Avellana, actress, National Artist of the Philippines for Theater."
        ],
        [
            "Gina Alajar, actress and director.",
            "She was born in Lanot, Roxas City, Capiz."
        ],
        [
            "Barbie Almabis-Honasan, singer, former lead singer of Hungry Young Poets and Barbie's Cradle."
        ],
        [
            "Mikoy Morales, actor, finalist of Protege: The Battle For The Big Artista Break"
        ],
        [
            "Other"
        ],
        [
            "Josepha Abiertas, feminist and lawyer was born and raised in Capiz."
        ],
        [
            "Jose Advincula - Filipino Cardinal and the 33rd Archbishop of the Archdiocese of Manila, served as the 3rd Archbishop of the Archdiocese of Capiz and 2nd Bishop of the Diocese of San Carlos."
        ],
        [
            "Jeckster Apinan, a professional basketball player"
        ],
        [
            "Paolo Bediones is a Filipino commercial model, television host, journalist, newscaster and radio announcer"
        ],
        [
            "Eugenio \"Toto\" Villareal - lawyer, law professor, and former Chairman, Movie and Television Review and Classification Board (MTRCB)."
        ],
        [
            "See also"
        ],
        [
            "Capiznon people"
        ],
        [
            "Capiznon language"
        ],
        [
            "Suludnon people"
        ],
        [
            "Igbok language"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 11 January 2013.",
            "Retrieved 11 February 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ \"Welcome to Roxas City, Capiz, Philippines\".",
            "www.roxascity.gov.ph.",
            "Archived from the original on 2020-11-26.",
            "Retrieved 2019-04-07."
        ],
        [
            "^ \"More tourists visiting Capiz\".",
            "Archived from the original on 10 August 2014.",
            "Retrieved 10 January 2014."
        ],
        [
            "^ \"Iloilo History Part 1 - Research Center for Iloilo\".",
            "Archived from the original on 2016-03-04.",
            "Retrieved 2016-06-29."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ \"Capiz now 109 years old\".",
            "Philippine Information Agency.",
            "14 April 2010.",
            "Retrieved 16 April 2010."
        ],
        [
            "^ \"Events occurring on Thursday, April 16, 1942\", WW2Timelines.com, March 11, 2016.",
            "Retrieved January 7, 2021."
        ],
        [
            "^ \"Republic Act No.",
            "1414 - An Act to Create the Province of Aklan\".",
            "Chan Robles Virtual Law Library.",
            "Retrieved 14 December 2015."
        ],
        [
            "^ a b c \"Province: Capiz\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"A Joyous Celebration: Bro.",
            "Daniel Razon Visits Brethren in Capiz, Aklan, and Antique\".",
            "MCGI Cares.",
            "July 26, 2023.",
            "Retrieved May 8, 2024.",
            "{{cite news}}:  CS1 maint: url-status (link)"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Order of National Artists: Jovita Fuentes\".",
            "National Commission for Culture and the Arts.",
            "Archived from the original on November 28, 2020.",
            "Retrieved October 26, 2021."
        ],
        [
            "^ Cadiz, Gibbs (May 13, 2013).",
            "\"National Artist for Theater Daisy Avellana dies; 96\".",
            "Philippine Daily Inquirer.",
            "Retrieved May 19, 2013."
        ],
        [
            "^ \"A\".",
            "Women of History.",
            "Retrieved 6 January 2013."
        ],
        [
            "^ \"APINAN, Jeckster - PBA on INQUIRER.net\".",
            "pba.inquirer.net."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Capiz at Wikimedia Commons"
        ],
        [
            " Geographic data related to Capiz at OpenStreetMap"
        ],
        [
            "Capiz Provincial Government Website"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Capiz News"
        ],
        [
            "Places adjacent to Capiz"
        ],
        [
            "Aklan"
        ],
        [
            "Sibuyan Sea"
        ],
        [
            "MasbateJintotolo Channel"
        ],
        [
            "Antique"
        ],
        [
            "Capiz"
        ],
        [
            "Iloilo"
        ],
        [
            "Iloilo"
        ],
        [
            "vte Province of CapizRoxas (capital and largest city)Municipalities"
        ],
        [
            "Cuartero"
        ],
        [
            "Dao"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumarao"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Mambusao"
        ],
        [
            "Panay"
        ],
        [
            "Panitan"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "President Roxas"
        ],
        [
            "Sapian"
        ],
        [
            "Sigma"
        ],
        [
            "Tapaz"
        ],
        [
            "Component city"
        ],
        [
            "Roxas"
        ],
        [
            "Articles related to Capiz"
        ],
        [
            "vteWestern Visayas (Region VI)Regional center"
        ],
        [
            "Iloilo City"
        ],
        [
            "Provinces"
        ],
        [
            "Aklan"
        ],
        [
            "Antique"
        ],
        [
            "Capiz"
        ],
        [
            "Guimaras"
        ],
        [
            "Iloilo"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Iloilo–Guimaras"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City"
        ],
        [
            "Component cities"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Iloilo City"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Roxas"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Altavas"
        ],
        [
            "Anilao"
        ],
        [
            "Anini-y"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Balete"
        ],
        [
            "Banate"
        ],
        [
            "Banga"
        ],
        [
            "Barbaza"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Batan"
        ],
        [
            "Belison"
        ],
        [
            "Bingawan"
        ],
        [
            "Buenavista"
        ],
        [
            "Bugasong"
        ],
        [
            "Buruanga"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Caluya"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuartero"
        ],
        [
            "Culasi"
        ],
        [
            "Dao"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumangas"
        ],
        [
            "Dumarao"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Hamtic"
        ],
        [
            "Ibajay"
        ],
        [
            "Igbaras"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Janiuay"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Lambunao"
        ],
        [
            "Laua-an"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Libertad"
        ],
        [
            "Maasin"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Mambusao"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "Nabas"
        ],
        [
            "New Lucena"
        ],
        [
            "New Washington"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "Numancia"
        ],
        [
            "Oton"
        ],
        [
            "Panay"
        ],
        [
            "Pandan"
        ],
        [
            "Panitan"
        ],
        [
            "Patnongon"
        ],
        [
            "Pavia"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pototan"
        ],
        [
            "President Roxas"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sapian"
        ],
        [
            "Sara"
        ],
        [
            "Sebaste"
        ],
        [
            "Sibalom"
        ],
        [
            "Sibunag"
        ],
        [
            "Sigma"
        ],
        [
            "Tangalan"
        ],
        [
            "Tapaz"
        ],
        [
            "Tibiao"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tobias Fornier"
        ],
        [
            "Tubungan"
        ],
        [
            "Valderrama"
        ],
        [
            "Zarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Czech Republic"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Capiz&oldid=1229670853\""
        ],
        [
            "Categories: CapizProvinces of the PhilippinesProvinces of Western VisayasStates and territories established in 17161716 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: url-statusArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Tagalog-language textArticles needing additional references from July 2022All articles needing additional referencesAll articles with unsourced statementsArticles with unsourced statements from July 2022All articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from July 2022Articles with unsourced statements from June 2016Articles with a promotional tone from July 2023All articles with a promotional toneLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with NKC identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}