{
    "name": "Catanduanes",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Catanduanes"
        ],
        [
            "50 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralБългарскиCebuanoČeštinaChavacano de ZamboangaDeutschEspañolفارسیFrançaisGalego한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიКырык марыLatinaLatviešuLietuviųМакедонскиMalagasyമലയാളംBahasa MelayuNederlands日本語Norsk bokmålOccitanPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்Татарча / tatarçaไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°50′N 124°15′E﻿ / ﻿13.83°N 124.25°E﻿ / 13.83; 124.25"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Bicol, Philippines"
        ],
        [
            "This article is about the Philippine province.",
            "For other uses, see Catanduanes (disambiguation)."
        ],
        [
            "Province in Bicol Region, PhilippinesCatanduanesProvinceProvince of Catanduanes(clockwise from top) Port of Virac, Beach in Gigmoto, Catanduanes island satellite image in 2016, and Downtown Virac"
        ],
        [
            "FlagSealNicknames:"
        ],
        [
            "The Happy Island"
        ],
        [
            "Abaca Capital of the Philippines"
        ],
        [
            "Abaca Capital of the World"
        ],
        [
            "Land of the Howling Winds"
        ],
        [
            "Isle of the Eastern Seas"
        ],
        [
            "World's Leading Abaca Producer"
        ],
        [
            "Anthem: \"Inang Catandungan\" (Catanduanes Beloved)Location in the PhilippinesOpenStreetMapCoordinates: 13°50′N 124°15′E﻿ / ﻿13.83°N 124.25°E﻿ / 13.83; 124.25CountryPhilippinesRegionBicol RegionFoundedSeptember 26, 1945Capitaland largest municipalityViracGovernment • TypeSangguniang Panlalawigan • GovernorJoseph C. Cua (NPC) • Vice GovernorPeter C. Cua (PDP–Laban) • RepresentativeEulogio R. Rodriguez (Independent) • LegislatureCatanduanes Provincial BoardArea • Total271,879 • Rank67th out of 81 • Density180/km2 (470/sq mi)  • Rank50th out of 81Divisions • Independent cities0 • Component cities0 • Municipalities"
        ],
        [
            "11"
        ],
        [
            " BagamanocBarasBatoCaramoranGigmotoPandanPanganibanSan AndresSan MiguelVigaVirac"
        ],
        [
            " • Barangays315 • DistrictsLegislative district of CatanduanesTime zoneUTC+8 (PST)IDD : area code +63 (0)52ISO 3166 codePH-CATSpoken languagesCentral BikolNorthern CatanduanesSouthern CatanduanesTagalogEnglishDemonymCatandunganonHighway routes   Websitecatanduanes.gov.ph"
        ],
        [
            "Catanduanes (/ˌkɑːtɑːnˈdwɑːnɛs/; Tagalog pronunciation:"
        ],
        [
            "The province comprises Catanduanes (mainland or main island), Panay Island, Lete Island, the Palumbanes group of islands (Porongpong, Tignob and Calabagio), and a few other small, surrounding islets and rocks.",
            "The province is also home to various mollusk fossil sites, notably the second-oldest ammonite site in the Philippines.",
            "These sites have certain species of ammonites that are found nowhere else in Southeast Asia.",
            "Because of the province's importance and rich geologic history, various scholars have suggested that, if the province would take the initiative to put its name forward in nomination, it would stand a good chance of being named as a UNESCO Geopark Reserve."
        ],
        [
            "In the early 1900s, Catanduanes was a sub-province of Ambos Camarines.",
            "Later, it was a sub-province of Albay.",
            "It became an autonomous province in 1945.",
            "Congressman Francisco Perfecto filed House Bill No.",
            "301, which separated the province from Albay; the bill was approved on September 26, 1945, and signed into law by President Sergio Osmeña on October 24, 1945.",
            "Remigio Socito, previously the Lieutenant Governor, was appointed the first Provincial Governor.",
            "When elections were held in 1947, Alfonso V. Usero became the first elected Governor."
        ],
        [
            "On April 15, 2022, President Rodrigo Duterte signed the Republic Act No.",
            "11700 declaring Catanduanes province as the Philippines Abacá Capital."
        ],
        [
            "Etymology"
        ],
        [
            "Catanduanes' earliest recorded name was Isla de Cobos.",
            "This was the name given to it by Spanish conquistadores, early in 1573, when they came upon several tribes on the island who were living in the thatched huts that the tribal people called cobos."
        ],
        [
            "“Catanduanes” comes from the words tandu, a native beetle, and samdong, a native species of tree, both were found throughout the island.",
            "People often referred to the island as katanduan or kasamdongan, meaning ‘a place where the tandu and the samdong tree thrive in abundance.’ The pronunciation of this word by Spanish-speaking people led to the coining of the Hispanicized version, Catanduanes."
        ],
        [
            "History"
        ],
        [
            "This section relies largely or entirely on a single source.",
            "Relevant discussion may be found on the talk page.",
            "Please help improve this article by introducing  citations to additional sources.Find sources: \"Catanduanes\" – news · newspapers · books · scholar · JSTOR (August 2022)"
        ],
        [
            "Early history"
        ],
        [
            "Rulers (datus) from Borneo settled on the island of Panay.",
            "Their descendants then migrated throughout the archipelago and became the first settlers in Catanduanes."
        ],
        [
            "The island was raided more than once by the Moros, who lived on the island of Mindanao.",
            "As a result of these destructive raids, many records of the past were destroyed or lost."
        ],
        [
            "Spanish period"
        ],
        [
            "In 1573, Juan de Salcedo arrived in Catanduanes while hunting for pirates and conquered the natives.",
            "Three years later, a galleon expedition from Acapulco was shipwrecked near the island, and the survivors were either killed or enslaved.",
            "This event is commemorated at the Batalay Church in Bato, a few kilometers outside the capital town of Virac."
        ],
        [
            "Evangelization and Christianization"
        ],
        [
            "The evangelization of the island started twenty years later, when the Spanish soldiers, after subjugating the Bicol mainland, came back with Franciscan missionaries.",
            "The missionaries, armed with the cross and backed by the sword of the conquistadors, evangelized the entire population, beginning with the southern tribes, without meeting much resistance."
        ],
        [
            "From 1600 to 1857, the colonizers established nine local centers of government through the establishment of parishes: Caramoran (1601); Pandan (1650); Viga (1661); Panganiban (1663); Virac (1775); Bato (1830); and San Andres (1853)."
        ],
        [
            "American invasion era"
        ],
        [
            "During the period of American rule, Bagamanoc, which had been a thriving municipality during the Spanish period, was reduced to a mere barrio of Viga and later of Panganiban."
        ],
        [
            "During the American Regime, some locals refused to recognize the sovereignty of the United States, and most of them fled to the mountains.",
            "The American occupation did not last long.",
            "By 1934, the Americans had withdrawn from control of the island."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "During World War II, Catanduanes was not spared from Japanese invasion.",
            "The Japanese erected garrisons in different parts of the island and heavily fortified it."
        ],
        [
            "Philippine independence"
        ],
        [
            "Three months after the Philippine independence from the Americans, Catanduanes was finally recognized as a separate and independent province from Albay through Commonwealth Act No.",
            "687 authored by then Representative Francisco Perfecto.",
            "The independence was approved by Congress on September 26, 1945, signed into law by President Sergio Osmena Sr. on October 24, 1945, and took effect on October 26, 1945."
        ],
        [
            "Catanduanes became the sixth province of the Bicol Region with the signing of the Act.",
            "Remigio Socito, Catanduanes's last Lieutenant Governor was appointed as the first Provincial Governor.",
            "When elections were held in 1947, Alfonso V. Usero became the first elected Governor."
        ],
        [
            "On September 26, 1945, Catanduanes was recognized as a separate and independent province.",
            "By Republic Act No.",
            "159, dated June 26, 1947, the municipality of Caramoran was recreated out of the Municipality of Pandan; under R.A. No.",
            "491, dated June 12, 1950, the Municipality of Bagamanoc was also created."
        ],
        [
            "Gigmoto formally became a municipality again in 1951, as did San Miguel in 1952.",
            "Also in the early 1950s, another center of government, Baras, was created.",
            "It was during this period that the island saw economic development and growth.",
            "Interlinking roads were built and trading centers were created."
        ],
        [
            "Geography"
        ],
        [
            "Catanduanes is situated on the easternmost edge of Luzon: 13.3 to 14.1 degrees north latitudes and between 124.1 and 124.3 degrees east longitudes.",
            "The island bounded on the west by the Maqueda Channel, on the south by Lagonoy Gulf, and on the north and east by the Philippine Sea.",
            "Several small islands comprise the province.",
            "Its aggregate land area totals approximately 1,492.16 square kilometres (576.13 sq mi).",
            "The coastlines, that stretch to almost 400 km (249 mi), are jagged with many bays."
        ],
        [
            "The topography of Catanduanes Island is rugged and mountainous, becoming more pronounced towards the central portion of the island.",
            "Less than 10 percent of the land area has a slope gradient under 8 percent, mostly fractured and narrow strips of plains located along the coastal areas where most of the inhabitants are settled.",
            "The highest mountain peak is in Boctot, located between the municipalities of Virac and San Miguel with an elevation of 803 metres (2,635 ft) above sea level.",
            "It is the premier mountain range with broadly spread old-growth forests and watershed which exerts widespread influence over its immediate environs that include the municipalities of Virac, Bato, and San Miguel.",
            "Other prominent mountain forms include the ranges: Obi in Caramoran, Cagmasoso in San Andres, and the Summit and Magsumoso ranges within the Viga and Gigmoto areas."
        ],
        [
            "The lowlands include the Virac Plain, Viga Plain, San Andres Plain and the Bato River Flood Plain.",
            "The coastal municipalities with limited lowland agricultural areas are Pandan and Caramoran.",
            "The more extensive lowlands are found in the southern parts of the province.",
            "The largest coastal plain is the contiguous wetlands of Viga, Panganiban and Bagamanoc over which lies the widest area of rice paddies and nipa mangroves."
        ],
        [
            "The province is mostly rugged and mountainous terrain.",
            "Its slope characteristics are 13% gently sloping to undulating, 1% classified rolling to hilly, 2% very hills and mountains, 47% level to very gently sloping, 32% steep hills and mountainous, and 5% undulating to rolling.",
            "Ten of the eleven municipalities of the province is situated along the coastal fringes, over which locate its mostly fractured plains.",
            "The only landlocked municipality is San Miguel with its poblacion (town center) sitting in a location entirely devoid of flatlands.",
            "The majority of the built-up areas occupy zones that are classified as flat to rolling."
        ],
        [
            "Flora and Fauna"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(August 2016) (Learn how and when to remove this message)"
        ],
        [
            "The island is a biodiversity hotspot.",
            "Its rainforests are home to the Philippine brown deer, flying foxes, and other endemic bat species, warty pigs, civets, cobras, giant pythons, monitor lizards, sailfin lizards and other endemic animals.",
            "Exotic bird species such as the Philippine hornbill, rail, parrot, bittern, egret, pheasant, coot, lapwing, plover, Philippine duck, quail, owl, oriole, kingfisher, swiftlets and many more are also found.",
            "A record of \"Philippines Birding Trip Reports\" has found out massive bird species in several parts of the island such as the watershed and timberland forests reserve in Gigmoto where scattered deer populations are also usually reported."
        ],
        [
            "The Catanduanes bleeding-heart (Gallicolumba luzonica rubiventris) had experienced over-exploitation in the late 20th century.",
            "Although most forests are still intact, this species has suffered over-hunting, making it very rare and is believed to be near extinction or already extinct as its last reported specimen was collected in 1971."
        ],
        [
            "The southern giant slender-tailed cloud rat (budkon/bugkon), which is found only in Catanduanes and the southern half of Luzon Island, is still widely reported.",
            "It is critically endangered as humans hunt them for food and to some extent, as pets.",
            "In mainland Luzon, sightings of the creature are already rare while in Marinduque, it is generally considered extinct."
        ],
        [
            "Inventory of the entomological fauna in the island has been conducted by various scientific institutions.",
            "A survey which was submitted to the national museum has revealed interesting species in the forest reserve of Gigmoto and Pandan.",
            "A total of 2,000 entomological specimens and its allies were collected compromising 323 species under 45 genera and 50 families."
        ],
        [
            "The Catanduanes narrow-mouthed frog (Kaloula kokacii), an arboreal amphibian found only in Catanduanes and some parts of Bicol, enjoys"
        ],
        [
            "One of the very recent species found in Catanduanes and portions of Bicol region is the new loam-swimming skink, a legless reptile with its assigned scientific name Brachymeles makusog."
        ],
        [
            "The dipterocarp forest also harbor numerous tropical plant species including the threatened species of pitcher plants and rafflesia as well as endemic banana varieties.",
            "Many highly economical hardwood trees such as yakal, apitong, palosapis, and molave are still found in the central forests through local reports indicate that these species are already threatened.",
            "Mangrove forests exist in several coastal areas but the largest locations are in Banquerohan (Viga-Panganiban), Agoho in San Andres and Batalay in Bato."
        ],
        [
            "The Catanduanes reefs harbor many endangered and threatened types of mollusks such as giant Triton, cowries, abalone, cone snails, conches, octopuses, squids, and nautiluses.",
            "Marine mammals are also reported to frequent on its eastern coasts such as species of dolphins and whales, which appear from March to June.",
            "Many edible marine algae such as caulerpa, valonia, and turbellaria also grow abundantly on its rough coasts."
        ],
        [
            "The island is nestled in the very beginning of the Kuroshio Current, a sea current that runs through the eastern Philippines, Taiwan, and Japan.",
            "Tuna migration, which is at its peak in the months of April and May, can be seen in the Maqueda channel.",
            "Dugongs were once known to swim on Catanduanes coasts, but this event is already becoming extremely rare."
        ],
        [
            "The Catanduanes coast is one of the best spots for flying fish population; a flying fish can attain its fullest size in Catanduanes which may weigh 300 grams (11 oz).",
            "Rabbitfish Siganus sp., a kind of reef fish is one of the most heavily exploited marine tropical fish in Catanduanes.",
            "Its fry that comes out in shallow coasts during the breeding season (March–May) are fished in large volumes.",
            "Approximately 10 million rabbitfish fries are caught annually.",
            "That natural event supplies food for many people but its ecological impact can be devastating.",
            "Nature advocates started to strengthen their campaign for an eco-dialogue for this matter.",
            "Sea cucumbers are also abundant in many islets of the eastern coasts facing the Philippine Sea."
        ],
        [
            "Palumbanes (province satellite group of islands) has beaches with fine yellowish-white sand.",
            "It is also one of the most biodiverse marine zones of the island.",
            "However, coral reef exploitation has severely inflicted for the last 10 years on its waters.",
            "The local government and some sectors are already undergoing efforts to revive Palumbanes Island through building artificial reefs and employing fishing regulations."
        ],
        [
            "Rivers"
        ],
        [
            "Maygñaway River, drains into the Philippine Sea"
        ],
        [
            "Weather and climate"
        ],
        [
            "Climate data for Catanduanes"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Record high °C (°F)"
        ],
        [
            "36(97)"
        ],
        [
            "36(97)"
        ],
        [
            "38(100)"
        ],
        [
            "38(100)"
        ],
        [
            "38(100)"
        ],
        [
            "38(100)"
        ],
        [
            "38(100)"
        ],
        [
            "39(102)"
        ],
        [
            "39(102)"
        ],
        [
            "41(106)"
        ],
        [
            "38(100)"
        ],
        [
            "32(90)"
        ],
        [
            "41(106)"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29(84)"
        ],
        [
            "29(84)"
        ],
        [
            "30(86)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "32(90)"
        ],
        [
            "31(88)"
        ],
        [
            "31(88)"
        ],
        [
            "30(86)"
        ],
        [
            "29(84)"
        ],
        [
            "32(90)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22(72)"
        ],
        [
            "23(73)"
        ],
        [
            "23(73)"
        ],
        [
            "24(75)"
        ],
        [
            "25(77)"
        ],
        [
            "25(77)"
        ],
        [
            "22(72)"
        ],
        [
            "25(77)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "24(75)"
        ],
        [
            "22(72)"
        ],
        [
            "22(72)"
        ],
        [
            "Record low °C (°F)"
        ],
        [
            "13(55)"
        ],
        [
            "14(57)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "20(68)"
        ],
        [
            "18(64)"
        ],
        [
            "19(66)"
        ],
        [
            "17(63)"
        ],
        [
            "17(63)"
        ],
        [
            "18(64)"
        ],
        [
            "16(61)"
        ],
        [
            "18(64)"
        ],
        [
            "13(55)"
        ],
        [
            "Average precipitation mm (inches)"
        ],
        [
            "265(10.4)"
        ],
        [
            "175(6.9)"
        ],
        [
            "143(5.6)"
        ],
        [
            "119(4.7)"
        ],
        [
            "157(6.2)"
        ],
        [
            "221(8.7)"
        ],
        [
            "188(7.4)"
        ],
        [
            "178(7.0)"
        ],
        [
            "189(7.4)"
        ],
        [
            "288(11.3)"
        ],
        [
            "369(14.5)"
        ],
        [
            "327(12.9)"
        ],
        [
            "2,619(103.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "10"
        ],
        [
            "8"
        ],
        [
            "7"
        ],
        [
            "6"
        ],
        [
            "5"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "13"
        ],
        [
            "14"
        ],
        [
            "15"
        ],
        [
            "112"
        ],
        [
            "Source: http://www.myweather2.com/City-Town/Philippines/Catanduanes/climate-profile.aspx?month=1"
        ],
        [
            "Without a pronounced dry season, precipitation is distributed fairly well throughout the year becoming wetter in the last quarter into the early months of the first quarter, when tropical disturbances and monsoon winds especially the Northeast Monsoon (Amihan) bring in heavy rains.",
            "Other months are characterized by short periods of dryer days and fine weather, except in July and August when the dry and gusty southwest monsoon winds intensify."
        ],
        [
            "Catanduanes' geographical position has it lying completely exposed to the Philippine Sea.",
            "Therefore, it is known as \"Land of the Howling Winds\" because it is frequently visited by tropical cyclones."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Catanduanes comprises 11 municipalities, all encompassed by the lone district."
        ],
        [
            "Political map of Catanduanes"
        ],
        [
            "Municipality"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "13°56′25″N 124°17′11″E﻿ / ﻿13.9402°N 124.2865°E﻿ / 13.9402; 124.2865﻿ (Bagamanoc)"
        ],
        [
            "Bagamanoc"
        ],
        [
            "4.1%"
        ],
        [
            "11,086"
        ],
        [
            "11,551"
        ],
        [
            "−0.78%"
        ],
        [
            "80.74"
        ],
        [
            "31.17"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "18"
        ],
        [
            "13°39′33″N 124°22′13″E﻿ / ﻿13.6591°N 124.3704°E﻿ / 13.6591; 124.3704﻿ (Baras)"
        ],
        [
            "Baras"
        ],
        [
            "5.0%"
        ],
        [
            "13,484"
        ],
        [
            "12,848"
        ],
        [
            "+0.92%"
        ],
        [
            "109.50"
        ],
        [
            "42.28"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "29"
        ],
        [
            "13°36′28″N 124°17′49″E﻿ / ﻿13.6079°N 124.2970°E﻿ / 13.6079; 124.2970﻿ (Bato)"
        ],
        [
            "Bato"
        ],
        [
            "8.0%"
        ],
        [
            "21,748"
        ],
        [
            "21,279"
        ],
        [
            "+0.42%"
        ],
        [
            "48.62"
        ],
        [
            "18.77"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "27"
        ],
        [
            "13°59′02″N 124°08′01″E﻿ / ﻿13.9839°N 124.1337°E﻿ / 13.9839; 124.1337﻿ (Caramoran)"
        ],
        [
            "Caramoran"
        ],
        [
            "11.8%"
        ],
        [
            "32,114"
        ],
        [
            "30,056"
        ],
        [
            "+1.27%"
        ],
        [
            "263.74"
        ],
        [
            "101.83"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "27"
        ],
        [
            "13°46′44″N 124°23′32″E﻿ / ﻿13.7789°N 124.3921°E﻿ / 13.7789; 124.3921﻿ (Gigmoto)"
        ],
        [
            "Gigmoto"
        ],
        [
            "3.2%"
        ],
        [
            "8,712"
        ],
        [
            "8,368"
        ],
        [
            "+0.77%"
        ],
        [
            "181.82"
        ],
        [
            "70.20"
        ],
        [
            "48"
        ],
        [
            "120"
        ],
        [
            "9"
        ],
        [
            "14°02′57″N 124°10′13″E﻿ / ﻿14.0492°N 124.1702°E﻿ / 14.0492; 124.1702﻿ (Pandan)"
        ],
        [
            "Pandan"
        ],
        [
            "7.9%"
        ],
        [
            "21,473"
        ],
        [
            "20,516"
        ],
        [
            "+0.87%"
        ],
        [
            "119.90"
        ],
        [
            "46.29"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "26"
        ],
        [
            "13°54′29″N 124°18′04″E﻿ / ﻿13.9081°N 124.3010°E﻿ / 13.9081; 124.3010﻿ (Panganiban)"
        ],
        [
            "Panganiban"
        ],
        [
            "3.6%"
        ],
        [
            "9,713"
        ],
        [
            "9,287"
        ],
        [
            "+0.86%"
        ],
        [
            "79.96"
        ],
        [
            "30.87"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "23"
        ],
        [
            "13°35′52″N 124°05′48″E﻿ / ﻿13.5979°N 124.0968°E﻿ / 13.5979; 124.0968﻿ (San Andres)"
        ],
        [
            "San Andres"
        ],
        [
            "14.2%"
        ],
        [
            "38,480"
        ],
        [
            "36,779"
        ],
        [
            "+0.86%"
        ],
        [
            "167.31"
        ],
        [
            "64.60"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "38"
        ],
        [
            "13°38′32″N 124°18′11″E﻿ / ﻿13.6421°N 124.3031°E﻿ / 13.6421; 124.3031﻿ (San Miguel)"
        ],
        [
            "San Miguel"
        ],
        [
            "5.8%"
        ],
        [
            "15,680"
        ],
        [
            "15,006"
        ],
        [
            "+0.84%"
        ],
        [
            "129.94"
        ],
        [
            "50.17"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "24"
        ],
        [
            "13°52′21″N 124°18′33″E﻿ / ﻿13.8726°N 124.3093°E﻿ / 13.8726; 124.3093﻿ (Viga)"
        ],
        [
            "Viga"
        ],
        [
            "8.4%"
        ],
        [
            "22,869"
        ],
        [
            "21,624"
        ],
        [
            "+1.07%"
        ],
        [
            "158.23"
        ],
        [
            "61.09"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "31"
        ],
        [
            "13°34′51″N 124°13′52″E﻿ / ﻿13.5808°N 124.2310°E﻿ / 13.5808; 124.2310﻿ (Virac)"
        ],
        [
            "Virac"
        ],
        [
            "†"
        ],
        [
            "28.1%"
        ],
        [
            "76,520"
        ],
        [
            "73,650"
        ],
        [
            "+0.73%"
        ],
        [
            "152.40"
        ],
        [
            "58.84"
        ],
        [
            "500"
        ],
        [
            "1,300"
        ],
        [
            "63"
        ],
        [
            "Catanduanes"
        ],
        [
            "271,879"
        ],
        [
            "260,964"
        ],
        [
            "+0.78%"
        ],
        [
            "1,492.16"
        ],
        [
            "576.13"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "315"
        ],
        [
            " †  Provincial capital"
        ],
        [
            "  Municipality"
        ],
        [
            "^ The globe  icon marks the town center."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of CatanduanesYearPop.±% p.a.1903 39,410—    1918 63,530+3.23%1939 98,545+2.11%1948 112,121+1.44%1960 156,329+2.81%1970 162,302+0.38%1975 172,780+1.26%1980 175,247+0.28%1990 187,000+0.65%1995 202,464+1.50%2000 215,356+1.33%2007 232,757+1.08%2010 246,300+2.08%2015 260,964+1.11%2020 271,879+0.81%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Catanduanes in the 2020 census was 271,879 people, with a density of 180 inhabitants per square kilometre or 470 inhabitants per square mile."
        ],
        [
            "In May 2000, its total population was 215,356 with an annual growth rate of 1.42% from 1990 to 2000, and a population density of 142 per km2.",
            "Over the following 10 years, the average annual growth rate was 1.35%, increasing the population to 246,300 persons in the May 2010 census."
        ],
        [
            "The number of households totaled 41,019 with an average household size of 5.25."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Prior to colonization, the region had a complex religious system which involved various deities.",
            "Among these deities include: Gugurang, the supreme god who dwells inside of Mount Mayon where he guards and protects the sacred fire in which Aswang, his brother was trying to steal.",
            "Whenever people disobey his orders, wishes and commit numerous sins, he would cause Mount Mayon to burst lava as a sign of warning for people to mend their crooked ways.",
            "Ancient Bikolanos had a rite performed for him called Atang.",
            ";"
        ],
        [
            "Catholicism"
        ],
        [
            "Further information: Roman Catholic Diocese of Virac"
        ],
        [
            "Roman Catholicism is the religion of the vast majority, comprising 97% of Catanduanes' population."
        ],
        [
            "Others"
        ],
        [
            "The remaining faith of the inhabitants is divided into the various groups such as Aglipayan Church, Baptists, Methodists, and other evangelical Christians, as well as Mormons, Jehovah's Witnesses, Iglesia ni Cristo, Seventh-day Adventists as well as Muslims."
        ],
        [
            "Languages"
        ],
        [
            "There are two variants of the Bikol languages native to this island province: Northern Catanduanes Bicolano and Southern Catanduanes Bicolano.",
            "The northern accent has a very pronounced letter \"R\" that becomes a diphthong of non-vowel letters \"L\" and \"R\" in the southern towns.",
            "In written form, the conventional mainland language like Central Bikol is used.",
            "Filipino, by virtue of being officially taught in schools and the affinity of most Bicolanos to it, is the second most common language and easily the most understood by most people.",
            "English is the normal medium used in primary communications.",
            "The use of the Spanish language as a local language seems to have vanished after the turn of the early 21st century."
        ],
        [
            "Sociolinguistics"
        ],
        [
            "When the Spaniards came to the Philippines, Catanduanes, being on the Pacific Ocean side and on the"
        ],
        [
            "very route of the galleon ships, was one of the first places they penetrated to propagate Christianity.",
            "The Spanish priests founded churches in every town.",
            "People from mainland Bicol also traveled to Catanduanes, specifically Caramoran, which is directly across from Albay."
        ],
        [
            "The research of McFarland on the year 1974, the dialects of Bicol area, stated that until the advent of the twentieth century and the development brought about by modernization, Northern Catanduanes was quite isolated from mainland Bicol and Southern Catanduanes, resulting in less opportunity for contact between different groups.",
            "One probable reason why the Northern Catanduanes language variety is distinct from the Southern Catanduanes variety is that the mountainous terrain separating the north from the south acts as a barrier to community interaction.",
            "The lack of good roads and transportation arising from the terrain contributed to the present situation.",
            "Since the seaport is in Virac, Northern Catanduanes remained in isolation from other subgroups for quite some time.",
            "Furthermore, the inhabitants of Northern Catanduanes were the first occupants of the island to have been pushed northwards when immigrants from the mainland occupied the southern part of the island.",
            "This supports the closeness of the Southern Catanduanes variety to other Bicol subgroups while the Northern Catanduanes variety has more distinct features."
        ],
        [
            "Ethnic groups"
        ],
        [
            "The predominant ethnic group is the Bicolano people.",
            "Migrants from other parts of Luzon, as well as Visayas and Mindanao,  make up a minority as well.",
            "Few, who are of Chinese, Australian, American, and Spanish descent also live in the province."
        ],
        [
            "Government"
        ],
        [
            "Representatives of the Legislative District of Catanduanes"
        ],
        [
            "1st Congress - Francisco Perfecto"
        ],
        [
            "1946–1949"
        ],
        [
            "2nd Congress - Severiano De Leon"
        ],
        [
            "1949–1953"
        ],
        [
            "3rd Congress - Francisco Perfecto"
        ],
        [
            "1953–1957"
        ],
        [
            "4th-7th Congress - Jose Alberto"
        ],
        [
            "1957–1972"
        ],
        [
            "Regular Batasang Pambansa"
        ],
        [
            "1984–1986"
        ],
        [
            "8th Congress - Moises Tapia"
        ],
        [
            "1987–1992"
        ],
        [
            "9th-11th Congress - Leandro Verceles, Jr."
        ],
        [
            "1992–2001"
        ],
        [
            "12th-14th Congress - Joseph Santiago"
        ],
        [
            "2001–2010"
        ],
        [
            "15th-17th Congress - Cesar Sarmiento"
        ],
        [
            "2010–2019"
        ],
        [
            "18th Congress - Hector Sanchez"
        ],
        [
            "2019–2022"
        ],
        [
            "Catanduanes was historically a part of the Albay province.",
            "On October 26, 1945, it was separated from Albay and was declared an island-province through Commonwealth Act No.",
            "687."
        ],
        [
            "When the island was still in transition to becoming a full-pledge province, it was headed by Lt.",
            "Governor Felipe Olesco Usero."
        ],
        [
            "Gubernatorial elections for Catanduanes started in 1948.",
            "The People Power Revolution in February 1986 ushered in new leadership.",
            "Former Ambassador Leandro I. Verceles Sr. was appointed Governor of the province.",
            "In 1988, Governor Leandro I. Verceles Sr. ran for Governor and won the election.",
            "His term ended in 1992 when lost to Governor Rosalie A. Estacio.",
            "After Governor Estacio, Governor Severo C. Alcantara became the governor of the province in 1995.",
            "Gov.",
            "Alcantara did not run for re-election due to failing health.",
            "In 1998 Governor Hector S. Sanchez won the election.",
            "Governor Sanchez ran for re-election but lost to Governor Leandro B. Verceles Jr who became governor for two successive terms."
        ],
        [
            "In the 2007 elections, Gov.",
            "Verceles ran again for his third and last term for governor but lost to Governor Joseph C. Cua, who became governor from 2007 to 2013 for two successive terms but lost to Gov.",
            "Araceli B. Wong in the May 2013 election.",
            "In the May 2016 election, Gov.",
            "Cely Wong's son Jardin Brian Wong lost to Governor Joseph Cua in his reelection bid as governor of the province."
        ],
        [
            "Governor: Joseph  Cua (United Nationalist Alliance (UNA))"
        ],
        [
            "Vice Governor: Shirley Abundo (Nationalist People's Coalition (NPC))"
        ],
        [
            "List of then-governors"
        ],
        [
            "Alfonso Vera Usero (1948–1951)"
        ],
        [
            "Jorge Vera Almojuela (1952–1959)"
        ],
        [
            "Juan Molina Alberto (1960–1967)"
        ],
        [
            "Vicente Molina Alberto (1968–1986)"
        ],
        [
            "Leandro I. Verceles Sr. (1987–1992)"
        ],
        [
            "Rosalie Alberto-Estacio (1992–1995)"
        ],
        [
            "Severo Alcantara (1995–1998)"
        ],
        [
            "Hector Sanchez (1998–2001)"
        ],
        [
            "Leandro B. Verceles Jr. (2001–2007)"
        ],
        [
            "Joseph Chua Cua (2007–2013)"
        ],
        [
            "Araceli Wong (2013–2016)"
        ],
        [
            "Joseph Chua Cua (2016–2019)"
        ],
        [
            "Provincial board members"
        ],
        [
            "West District (1st District)"
        ],
        [
            "Jan Ferdinand A. Alberto (Independent)"
        ],
        [
            "Santos V. Zafe (Lakas–CMD)"
        ],
        [
            "Rafael C. Zuniega (NPC)"
        ],
        [
            "Romeo R. Francisco (Lakas–CMD)"
        ],
        [
            "East District (2nd District)"
        ],
        [
            "Robert A. Fernandez (PDR)"
        ],
        [
            "Josevan A. Balidoy (PDP–Laban)"
        ],
        [
            "Dean T. Vergara (Lakas–CMD)"
        ],
        [
            "Edwin T. Tanael (Lakas–CMD)"
        ],
        [
            "Capitol building of Catanduanes"
        ],
        [
            "Congressional district(s)"
        ],
        [
            "See also: Legislative district of Catanduanes"
        ],
        [
            "The lone Legislative District of Catanduanes is the representation of the Province of Catanduanes in the Philippine House of Representatives.",
            "Catanduanes was represented as part of Albay's second district from 1907 to 1931, and fully comprised that province's fourth district from 1931 to 1946.",
            "It started electing its own representative in 1946, after becoming a full-fledged province in 1945.",
            "From 1978 to 1984 it was part of the representation of Region V."
        ],
        [
            "Rep. Eulogio R. Rodriguez (IND)"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Catanduanes"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  41.41"
        ],
        [
            "2009  29.10"
        ],
        [
            "2012  33.80"
        ],
        [
            "2015  43.36"
        ],
        [
            "2018  20.30"
        ],
        [
            "2021  16.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The province recorded just a little −0.3 in the HDI National Average, although it has the highest HDI in the Bicol Region.",
            "The 2009 report of HDN (Human Development Network), which is a branch of the United Nations HDI (Human Development Index), listed the province as ranked 1st in the region or rank 20th at 0.630 HDI value (excluding Metro Manila) among Philippine Provinces HDI's.",
            "For reference, the province of Albay ranked 2nd in the region or ranked 41st among Philippine Provinces HDIs (excluding Metro Manila) at 0.518 HDI value."
        ],
        [
            "Agriculture, fishing, and tourism are some of the other main sources of employment on the island.",
            "Several handicrafts such as jewelry manufacturing and other small-scale industries also contribute to the province's economy.",
            "The province is rich in natural resources such as forests, waterfalls, rivers, mineral deposits and productive soil made fertile by volcanic ashes of distant Mayon Volcano.",
            "Rattancraft, fishing, buri hat and mat making, and abaca fiber craft are among the important industries of the island.",
            "Bananatex, a natural cellulosic biodegradable \"technical\" canvas fabric, manufactured by QWSTION, is made of abacá banana plant fibres and grown as a sustainable forestry industry."
        ],
        [
            "Virac, the capital town of the island was among the top in terms of infrastructure in 2012 Most Competitive Municipality category according to the National Competitiveness Council (NCC)."
        ],
        [
            "Industry"
        ],
        [
            "The five major income sources of Catanduanes are the services, agriculture, and fishing, tourism, housing, and manufacturing industries."
        ],
        [
            "Cottage industry and manufacturing"
        ],
        [
            "From 2001 through 2010, the Philippines production of abaca fiber (Manila hemp) averaged 65,701 mt per year and was decreasing at a rate of at least 0.8% per annum.",
            "The decrease was caused by the devastating typhoons in 2006, abaca viral diseases that continued to affect the plantations, and the dampened foreign demand brought about by the global economic recession beginning in the latter part of 2008, the most severe downturn since the Great Depression in the 1930s.",
            "Production reached its peak in 2008 at 77,387 mt as outputs of all producing regions, particularly Bicol, Davao Region and Caraga, substantially increased during the period.",
            "This was primarily the effect of the incremental production from the abaca plantations established in 2005 and 2006 under FIDA's program Goal I \"Development of New Agri-Business Lands\" and the continued strong demand and attractive prices offered for the fiber by local traders, processors/manufacturers, and exporters.",
            "The abaca industry, however, suffered a setback in 2009 when fiber yield slumped to its lowest level of 54,584 mt due to the weakened market demand and falling prices as a consequence of the worldwide financial crisis.",
            "Catanduanes Island is the native habitat of the endemic abaca plant (a banana relative), which is globally renowned for its strong fiber.",
            "In fact, the Philippines FIDA (Fiber Industry Development Authority) declared the island as the highest abaca-producing province in 2010."
        ],
        [
            "In 2009–2013, The Philippine Rural Development Program (PRDP) and the Department of Agriculture, Bicol Region had 39% share of Philippine Abaca production, emerged as the biggest produce while overwhelming 92% comes from Catanduanes the biggest abaca-producing province in the country.",
            "The home of the finest grade of abaca fiber.",
            "Lately, the indigenous abaca fiber, commonly called \"pinukpok,\" produced and woven by the locals of Baras, Catanduanes, has now found its niche in the local and international fashion industry.",
            "This indigenous fabric has shown its versatility in the globally appealing designs and creations of famous fashion designer Dita Sandico-Ong.",
            "Until now wild type of abaca can still be found in the interior forests of the province which is often not cultivated."
        ],
        [
            "World's Abaca Top Producer"
        ],
        [
            "Despite having been ravaged by three super typhoons in the last two decades, Catanduanes has maintained its \"abaca country\" status as the top abaca fiber-producing province in the Philippines.",
            "In 2015 alone, the island's 12,789 abaca farmers produced 23,550 metric tons of raw fiber, comprising 40 percent of the total abaca fiber production nationwide.",
            "The local fiber harvest is even higher than the production of Ecuador, the second-biggest abaca producer in the world after the Philippines."
        ],
        [
            "Agriculture and fishing"
        ],
        [
            "Catanduanes mud crab industry is being supported by the Bureau of Fisheries and Aquatic Resources, Department of Science and Technology, Department of Environment and Natural Resources, Department of Labor and Employment and Catanduanes State University."
        ],
        [
            "The provincial government is maintaining the Catanduanes Crab Center (CCC) which serves as a source of crablets for grow-out and fattening by fishpond operators.",
            "It carries out a special program for \"queen\" or \"gravid\" crabs designed to ensure the sustainability of the industry in the province, which originally owned the \"crab capital of the Philippines\" title.",
            "The province's mud crab industry is focusing on the production of female crabs that play an important role in marketing, particularly in Asian countries such as Japan, Taiwan, Hong Kong and Singapore."
        ],
        [
            "Income"
        ],
        [
            "Commonwealth Act No.",
            "687, created Catanduanes as an independent province; however, it was Republic Act 7160 that gave the Local Government Unit (LGU) total independence in managing its administrative, fiscal, and development affairs in conformity with the national government thrust for sustainable social and economic growth."
        ],
        [
            "City/Municipality"
        ],
        [
            "Income (₱) - Annual Audit Report"
        ],
        [
            "%"
        ],
        [
            "2017"
        ],
        [
            "2016"
        ],
        [
            "2015"
        ],
        [
            "Bagamanoc"
        ],
        [
            " 10.44%"
        ],
        [
            "58,975,644.35"
        ],
        [
            "53,398,518.58"
        ],
        [
            "48,182,700.71"
        ],
        [
            "Baras"
        ],
        [
            " 11.9%"
        ],
        [
            "63,503,475.34"
        ],
        [
            "56,752,088.44"
        ],
        [
            "51,274,551.38"
        ],
        [
            "Bato"
        ],
        [
            " 11.67%"
        ],
        [
            "69,500,968.30"
        ],
        [
            "62,236,498.59"
        ],
        [
            "56,138,194.29"
        ],
        [
            "Caramoran"
        ],
        [
            " 12.28%"
        ],
        [
            "110,097,505.71"
        ],
        [
            "98,055,390.00"
        ],
        [
            "88,452,458.75"
        ],
        [
            "Gigmoto"
        ],
        [
            " 12.71%"
        ],
        [
            "66,574,740.50"
        ],
        [
            "59,065,645.59"
        ],
        [
            "53,523,021.94"
        ],
        [
            "Pandan"
        ],
        [
            " 11.96%"
        ],
        [
            "77,091,350.54"
        ],
        [
            "68,854,349.29"
        ],
        [
            "62,253,452.90"
        ],
        [
            "Panganiban"
        ],
        [
            " 70.66%"
        ],
        [
            "88,573,029.13"
        ],
        [
            "51,899,257.58"
        ],
        [
            "52,858,777.12"
        ],
        [
            "San Andress"
        ],
        [
            " 10.35%"
        ],
        [
            "111,788,532.40"
        ],
        [
            "101,307,641.44"
        ],
        [
            "92,035,068.69"
        ],
        [
            "San Miguel"
        ],
        [
            " 10.9%"
        ],
        [
            "70,934,178.83"
        ],
        [
            "63,963,111.70"
        ],
        [
            "53,469,734.94"
        ],
        [
            "Viga"
        ],
        [
            " 12.04%"
        ],
        [
            "85,522,880.27"
        ],
        [
            "76,329,204.85"
        ],
        [
            "68,903,426.34"
        ],
        [
            "Virac †"
        ],
        [
            " 12.25%"
        ],
        [
            "207,779,852.29"
        ],
        [
            "185,097,730.28"
        ],
        [
            "166,472,690.60"
        ],
        [
            " †  Provincial capital"
        ],
        [
            "  Municipality"
        ],
        [
            "Tourism"
        ],
        [
            "Puraran Beach"
        ],
        [
            "The tourism industry in the province is growing relatively quickly despite the fact that the island experiences almost year-round typhoons, labeling the province as a \"Typhoon Capital of the Philippines\" with the tagline \"The Land of the Howling Winds\".",
            "Catanduanes is known for its beaches, prehistoric caves, quaint stone chapels and massive churches.",
            "Despite the typhoons, safe anchorage is provided by its many bays and coves notably Kalapalan, Gigmoto, Soboc, and Cabugao.",
            "Its Pacific coastline attracts surfers, particularly at Baras.",
            "The province features beaches with fine sand and coral formations and several caves which include the Luyang Cave.",
            "The PAGASA Weather Radar Station offers panoramic views of the environs, while the Museo de Catanduanes has a fine collection of artifacts."
        ],
        [
            "The ideal time of the year to visit Catanduanes is from the months of March to August when the weather turns dry.",
            "It is coolest and rainiest from October to the early part of January, hottest from March to May."
        ],
        [
            "The tourism industry in Catanduanes continues to receive a positive response from foreign and domestic travelers, with the Provincial Tourism Office recording an increase in tourist arrivals by 15.89% in 2014 compared to the previous year."
        ],
        [
            "Based on the comparative data of travelers, 151,550 foreign and domestic tourists visited the island last year, or about 21,000 greater than the 2013 arrivals of only 130,766 visitors."
        ],
        [
            "Tourist attractions"
        ],
        [
            "Puraran Majestic Wave Beach - One of the top surfing destinations in the Philippines today.",
            "It is home to “The Majestic Wave” that top surfers from all over the world visit during the surfing season, July to October."
        ],
        [
            "Binurong Point - It is one of the newest attractions the island of Catanduanes can offer.",
            "A Batanes/Ireland hills & cliffs look and feel."
        ],
        [
            "Saint John the Baptist Catholic Church – located in Poblacion, Bato near the Bato River.",
            "It is the only remaining structure of its kind in the entire island.",
            "The church is of interest not only as a mid-colonization Filipino-Spanish architecture but as a historical landmark.",
            "It was built under the polo system of forced labor for a total of 53 years under six different parish administrators.",
            "Started in 1830 and finished in 1883, Bato Church has withstood wars, calamities, and ravages of time."
        ],
        [
            "Holy Cross of Batalay Shrine – located in Batalay, Bato.",
            "It is the site where the first Catholic Cross was planted in Catanduanes and was built over the burial place of Augustinian priest Fray Diego de Herrera in 1576 who died in Batalay, Bato.",
            "Legend says that a spring water sprouted near the cross believed to have healing powers.",
            "It is a common belief that the cross presently enshrined in the Batalay Chapel is still the original cross planted more than 420 years ago.",
            "Batalay has been the center of annual religious pilgrimages from people of different places.",
            "The Holy Cross of Batalay is a Diocesan shrine with the right to hold a liturgical celebration on the last Friday of April every year."
        ],
        [
            "Our Lady of Sorrows Shrine – located in Batong Paloway, San Andres.",
            "The thumbnail-sized river stone bearing the mystical face of the Virgin Mary found on a river bank is believed to have grown in size over the years.",
            "At present, one can view the image with the bare eyes unlike before, when one had to use a magnifying lens.",
            "The image has drawn many devotees throughout the years and mass is heard every Friday afternoon as devotees flock the chapel regularly to pray the rosary and novenas.",
            "Every Lenten week celebration, people on Holy Thursday walk from Virac and as far as Batalay, Bato on a penitentiary pilgrimage to visit and pray to the Lady of Sorrows."
        ],
        [
            "San Miguel River Park - is the largest fresh-water stream in Catanduanes, stretching from the middle of the island all the way to the south.",
            "It's best explored while on an inflatable tube or a kayak for a refreshing ride.",
            "The jump off station is located at Bgy.",
            "Kilikilihan, San Miguel."
        ],
        [
            "Amenia Beach Resort – Palawig, San Andres"
        ],
        [
            "Balite Beach Resort – Balite, Virac"
        ],
        [
            "Cathy's Spring Resort – Sagrada, Viga"
        ],
        [
            "Hiyop Point – Hiyop, Pandan"
        ],
        [
            "Loran Ruins – Panay Island, Bagamanoc"
        ],
        [
            "Luyang Cave Park – Lictin, San Andres"
        ],
        [
            "Maribina Falls – Marinawa-Binanuahan, Bato"
        ],
        [
            "Museo de Catanduanes – Santa Elena, Virac"
        ],
        [
            "Nahulugan Falls – San Pedro, Gigmoto"
        ],
        [
            "PAG-ASA Weather Radar Station – Buenavista, Bato"
        ],
        [
            "Palumbanes Group of Islands – Palumbanes, Caramoran"
        ],
        [
            "Soboc Cove – Soboc, Viga"
        ],
        [
            "Twin Rock Beach Resort – Igang, Virac"
        ],
        [
            "Culture"
        ],
        [
            "Festivals and celebrations"
        ],
        [
            "Catandungan Festival"
        ],
        [
            "Catandungan Festival is an annual celebration of the island province.",
            "It is the anniversary celebration and tribute to its founders, to commemorate the provinces' independence from Albay.",
            "The main features of the festival are Street Dancing – Pantomina Dance, Beauty Pageant, Agro-Trade Fair, Sports Fest, Guided Tour, Surfing Cup, and Art/Photo Exhibits.",
            "It occurs every October 24–26."
        ],
        [
            "Abaka Festival"
        ],
        [
            "Abaka Festival is an annual cultural celebration of the province to recognize the importance of abaca in the local economy and to showcase its versatility as a major source of livelihood.",
            "Highlights of the festival are Padadyaw Ginamlangan or Padadyaw kan Abaka, Pinukpok Fashion Show, Urag Catandungan sports competitions, Kantang Catandungan or Musika kan Isla, Festival Dance Competition, Binibini and Ginoong Bikol, Hagyan sa Kabitoonan and Jobs Fair.",
            "It occurs every 4th week of May."
        ],
        [
            "Folk festivals"
        ],
        [
            "The folk festivals celebrated as part of the local religious rituals are with unique traces of the Spanish colonization.",
            "Among these festivals include:"
        ],
        [
            "Burak/Burac Festival is a Viracnons’ celebration in honor of their patroness Nuestra Señora de Immaculada Concepcion.",
            "The capital town Virac is believed to have its name originated from “Burac”, a local term for a flower."
        ],
        [
            "Dinahit Festival is a prime festival in the municipality of Pandan celebrated every April.",
            "The word Dinahit is a native sailing vessel used by the Austronesians to travel across the ocean to reach Pandan, the northernmost municipality of the province.",
            "Festival activities include street dancing, beauty pageant, trade fair, and different contests such as carabao race and boat race."
        ],
        [
            "Manok-Manok Festival held annually as a town fiesta every 12th-13 June, a celebration of the Bagamanocnon character, culture and way of life centered on the peculiarities of “manok” (chicken), the very word from where the name of the municipality was taken.",
            "Street dancing depicting the salient characteristics and movements of the chicken highlights the festival."
        ],
        [
            "Sugbo Festival is celebrated by the seven barangays of Hitoma in Caramoran that produces sugbo or tiger grass, a bamboo-like perennial grass used to make brooms.",
            "Celebrated every month of May coinciding with the Hitoma barangay fiesta, it is being institutionalized with the support of the provincial government, LGU of Caramoran and national line agencies to promote the commercial development of the local lasa or tiger grass industry and to create signature products from tiger grass."
        ],
        [
            "Badas Festival happened every year 10 August.",
            "The festival captures the heroic character of the people of Baras.",
            "“Badas”, local term for wild rattan, was made into spears in olden times to ward of Moro raiders thus, emerging as an apt description of the indomitable spirit of the Barasnons.",
            "During the war they were the first in Catanduanes to resist the invading Japanese forces."
        ],
        [
            "Abacaco Festival is an annual celebration in the 10th of June.",
            "It is about the nature's beauty and agricultural abundance of the municipality.",
            "Abaca became a prime industry.",
            "The cacao gave sweetness to a family's dining table.",
            "The coconut, which is the tree life, became part of their everyday life gave strength to the copra industry."
        ],
        [
            "Umasilhag Festival Gigmoto's town festival of merrymaking and thanksgiving, happen every 14th-15th of the month of May."
        ],
        [
            "Kinis Festival the Crab's capital Festival.",
            "The town of Panganiban was considered as Catanduanes Crab Capital for its 218.47 hectares of fishpond and its vast mangrove areas producing abundant supply of delicious and palatable mud crab well-liked for its taste, texture and nutritive value and even branded as the tastiest crab in Bicol.",
            "Highlighted with float parade with their princess of crab, exotic street-dance in their crab costumes and eat-all-you-can promo of their seafood menu especially steamed or cooked crab.",
            "It happen annually every 25 July."
        ],
        [
            "Burunyogan Festival “Burunyog” is an old Bikolano word for being united.",
            "Combining this to “Niyog” or coconut a unique name for our celebration was created.",
            "“Buruniyogan” gives importance to the benefits of coconut in the town of San Andres."
        ],
        [
            "Himuluan Festival depicting the joys and hardships of the common traditional way of planting, harvesting, threshing, drying, airing and the like, himuloan festival gives the clear picture of how Viganons face hardships and bear uncertainties, how they survived and go on, with life despite the weather disturbances aggravated by the visit of amihan and even floods."
        ],
        [
            "Kagharong is a native depiction of The Nativity scene held annually during Christmas season."
        ],
        [
            "Pantomina is a native dance, popular on occasions of importance and mostly practiced in rural areas.",
            "It is a dance interpretation (pantomime) of a rooster courting a hen."
        ],
        [
            "Kalbaryo or Calvary, commonly staged during Holy Week, is a reenactment of the passion of Christ's way of the cross annually celebrated in the Municipality of San Andres during Holy Wednesday and Good Friday."
        ],
        [
            "Padadyao sa Tinampo is native cultural presentation of street dancing held every October 24 to commemorate the province's founding anniversary."
        ],
        [
            "Fishermen from Catanduanes have always been linked to Benham Rise.",
            "Catandunganon people have been calling it Kalipung-awan (loneliness in an isolated place).",
            "Benham Rise is an integral part of Catandunganon culture.",
            "Rich marine resources are given by this marine biodiverse zone to Catandunganons.",
            "In fact, Catandunganons have long been celebrating this place even in their ancient folksongs, stories and poetry."
        ],
        [
            "Education"
        ],
        [
            "Virac, the capital town, is the educational center in the province, hosting a number of schools specializing in various degrees.",
            "The most notable include the Catanduanes State University (CatSU) with a campus in the northern town of Panganiban.",
            "It was established on June 19, 1971, through Republic Act 6341, authored by Catanduanes Congressman Jose M. Alberto, which converted the Virac National Agricultural and Trade School into the Catanduanes State College.",
            "The college was elevated to university status in October 2012."
        ],
        [
            "Other notable schools include the Catanduanes Colleges (CC), Catanduanes Institute of Technology Foundation (CITFI), and Christian Polytechnic Institute of Catanduanes (CPIC)."
        ],
        [
            "Senior High School"
        ],
        [
            "The table below contains the list of public senior high schools published by the Department of Education or DepEd.",
            "Included on the list are the municipalities, school ID, school names, and program offerings."
        ],
        [
            "School ID"
        ],
        [
            "Name of School"
        ],
        [
            "Year Est."
        ],
        [
            "Location"
        ],
        [
            "District"
        ],
        [
            "Education"
        ],
        [
            "Programs"
        ],
        [
            "Specialization"
        ],
        [
            "302072"
        ],
        [
            "Bagamanoc Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "Magsaysay St. Bagamanoc"
        ],
        [
            "Bagamanoc South"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Cookery, Bread and Pastry Production, Food and Beverage Services, Dressmaking, Computer Hardware Servicing, Animation, Electrical Installation and Maintenance"
        ],
        [
            "302076"
        ],
        [
            "Bugao National High School"
        ],
        [
            "1988"
        ],
        [
            "Magsaysay St. Bagamanoc"
        ],
        [
            "Bagamanoc North"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Aquaculture"
        ],
        [
            "302070"
        ],
        [
            "Agban National High School"
        ],
        [
            "1979"
        ],
        [
            "Agban"
        ],
        [
            "Baras North"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "302073"
        ],
        [
            "Baras Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "Osmena St., Baras"
        ],
        [
            "Baras South"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Animal Production, Artificial Insemination- Ruminants, Computer Hardware Servicing, Computer Hardware Servicing, Computer Programming, Cookery, Food and Beverage Services, Bread and Pastry Production, Electrical Installation and Maintenance"
        ],
        [
            "302074"
        ],
        [
            "Bato Rural Development High School"
        ],
        [
            "1974"
        ],
        [
            "Banawang St. Bato"
        ],
        [
            "Bato East"
        ],
        [
            "Senior High"
        ],
        [
            "STEM, GAS & TVL"
        ],
        [
            "Bread and Pastry Production, Cookery, Food and Beverage Services, Carpentry, Electrical Installation and Maintenance"
        ],
        [
            "500032"
        ],
        [
            "Cabugao Integrated School"
        ],
        [
            "2001"
        ],
        [
            "Cabugao"
        ],
        [
            "Bato West"
        ],
        [
            "Senior High"
        ],
        [
            "TVL"
        ],
        [
            "Animal Production, Artificial Insemination- Ruminants, Bread and Pastry Production, Wellness Massage, Food and Beverage Services, Housekeeping, Computer Hardware Servicing, Computer Programming, Electrical Installation and Maintenance"
        ],
        [
            "302081"
        ],
        [
            "Caramoran Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "Toytoy St., Caramoran"
        ],
        [
            "Caramoran North"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Bread and Pastry Production, Cookery, Food and Beverage Services, Dressmaking, Tailoring, Electrical Installation and Maintenance, Technical Drafting, Computer Hardware Servicing"
        ],
        [
            "302082"
        ],
        [
            "Caramoran School of Fisheries"
        ],
        [
            "1969"
        ],
        [
            "Zone6 - Inansagan"
        ],
        [
            "Caramoran South"
        ],
        [
            "Senior High"
        ],
        [
            "GAs & TVL"
        ],
        [
            "Aquaculture, Electrical Installation and Maintenance, Food (Fish) Processing, Horticulture, EPAS, SMAW, CSS, Dress Making"
        ],
        [
            "302102"
        ],
        [
            "Supang-Datag National High School"
        ],
        [
            "1967"
        ],
        [
            "Supang Datag"
        ],
        [
            "Caramoran South"
        ],
        [
            "Senior High"
        ],
        [
            "GAs & TVL"
        ],
        [
            "Bread and Pastry Production, Food and Beverage Services, Housekeeping, Wellness Massage, Carpentry, Plumbing, Shielded Metal Arc Welding"
        ],
        [
            "302106"
        ],
        [
            "Tubli National High School"
        ],
        [
            "1962"
        ],
        [
            "Sabangan, Tubli"
        ],
        [
            "Caramoran North"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Computer Hardware Servicing, Animation, Cookery, Bread and Pastry Production, Food and Beverage Services, Electrical Installation and Maintenance"
        ],
        [
            "302088"
        ],
        [
            "Gigmoto Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "Gigmoto"
        ],
        [
            "Gigmoto"
        ],
        [
            "Senior High"
        ],
        [
            "GAs & TVL"
        ],
        [
            "Bread and Pastry Production, Cookery, Food and Beverage Services, Carpentry, Computer Hardware Servicing, Technical Drafting"
        ],
        [
            "500033"
        ],
        [
            "Sicmil Integrated School"
        ],
        [
            "1938"
        ],
        [
            "Sicmil"
        ],
        [
            "Gigmoto"
        ],
        [
            "Senior High"
        ],
        [
            "GAS"
        ],
        [
            "302094"
        ],
        [
            "Pandan School of Arts and Trade"
        ],
        [
            "1962"
        ],
        [
            "Pandan"
        ],
        [
            "Pandan West"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Animation, Technical Drafting, Beauty/ Nail Care, Hairdressing, Bread and Pastry Production, Carpentry, Electrical Installation and Maintenance, Shielded Metal Arc Welding"
        ],
        [
            "302094"
        ],
        [
            "Tabugoc National High School"
        ],
        [
            "1967"
        ],
        [
            "Panlilibon, Tabugoc"
        ],
        [
            "Pandan East"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Bread and Pastry Production, Food and Beverage Services, Bartending, Carpentry, Horticulture"
        ],
        [
            "309802"
        ],
        [
            "Cobo Integrated School"
        ],
        [
            "2009"
        ],
        [
            "San Juan, Cobo"
        ],
        [
            "Pandan West"
        ],
        [
            "Senior High"
        ],
        [
            "TVL"
        ],
        [
            "Agricultural Crops Production, Organic Agriculture, Dressmaking, Tailoring, Electrical Installation and Maintenance"
        ],
        [
            "302095"
        ],
        [
            "Panganiban National High School"
        ],
        [
            "1967"
        ],
        [
            "San Nicolas"
        ],
        [
            "Panganiban"
        ],
        [
            "Senior High"
        ],
        [
            "GAS"
        ],
        [
            "309801"
        ],
        [
            "Panganiban NHS - CSU Campus"
        ],
        [
            "2001"
        ],
        [
            "Santa Ana"
        ],
        [
            "Panganiban"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Agricultural Crops Production, Organic Agriculture, Animation, Technical Drafting"
        ],
        [
            "302078"
        ],
        [
            "Cabcab National High School"
        ],
        [
            "1989"
        ],
        [
            "Cabcab"
        ],
        [
            "San Andres West"
        ],
        [
            "Senior High"
        ],
        [
            "GAs & TVL"
        ],
        [
            "Bread and Pastry Production, Cookery, Food and Beverage Services"
        ],
        [
            "302091"
        ],
        [
            "Manambrag National High School"
        ],
        [
            "1977"
        ],
        [
            "Santa Lourdes, Manambrag"
        ],
        [
            "San Andres West"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Carpentry, Horticulture"
        ],
        [
            "302092"
        ],
        [
            "Mayngaway National High School"
        ],
        [
            "1976"
        ],
        [
            "Mayngaway"
        ],
        [
            "San Andres West"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Bread and Pastry Production, Dressmaking, Beauty/ Nail Care, Computer Hardware Servicing, Broadband Installation- Fixed Wireless Systems, Horticulture"
        ],
        [
            "302096"
        ],
        [
            "San Andres Vocational School"
        ],
        [
            "1970"
        ],
        [
            "San Andress"
        ],
        [
            "San Andres East"
        ],
        [
            "Senior High"
        ],
        [
            "STEM, ABM,  GAS, HUMSS & TVL"
        ],
        [
            "Computer Hardware Servicing, Technical Drafting, Hairdressing, Housekeeping, Bread and Pastry Production, Shielded Metal Arc Welding, Tailoring, Dressmaking"
        ],
        [
            "302098"
        ],
        [
            "San Miguel Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "District 1"
        ],
        [
            "San Miguel South"
        ],
        [
            "Senior High"
        ],
        [
            "STEM, GAS & TVL"
        ],
        [
            "Animal Production, Artificial Insemination- Ruminants, Computer Hardware Servicing, Technical Drafting"
        ],
        [
            "302097"
        ],
        [
            "San Jose (Oco) National High School"
        ],
        [
            "1967"
        ],
        [
            "San Jose (Oco)"
        ],
        [
            "Viga West"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Cookery, Bread and Pastry Production, Food and Beverage Services"
        ],
        [
            "302104"
        ],
        [
            "Tambognon National High School"
        ],
        [
            "1988"
        ],
        [
            "Tambongon"
        ],
        [
            "Viga East"
        ],
        [
            "Senior High"
        ],
        [
            "GAS & TVL"
        ],
        [
            "Bread and Pastry Production, Cookery, Housekeeping, Carpentry"
        ],
        [
            "302107"
        ],
        [
            "Viga Rural Development High School"
        ],
        [
            "1972"
        ],
        [
            "San Vicente Pob."
        ],
        [
            "Viga West"
        ],
        [
            "Senior High"
        ],
        [
            "STEM,  ABM & TVL"
        ],
        [
            "Electrical Installation and Maintenance, Hairdressing, Bread and Pastry Production, Beauty/ Nail Care"
        ],
        [
            "Services"
        ],
        [
            "Police services"
        ],
        [
            "The Philippine National Police in the province is composed of the local police force and the fire brigade's services.",
            "The province crime rate is 6.39 in 2006.",
            "Crime volume over the same period was 191."
        ],
        [
            "Media/Entertainment"
        ],
        [
            "Local cable companies operate in most towns.",
            "TV repeaters allow access to Manila broadcast stations.",
            "Satellite dish is a common site in rooftops of houses in remote areas."
        ],
        [
            "Power supply"
        ],
        [
            "Electrical Power is supplied by power plants, a mix of diesel powered generators and hydroelectric turbines.",
            "Electricity is served on 24-hour basis to all the eleven (11) municipalities.",
            "Catanduanes has a 220-volt multi ground electrical system, Power distribution system run by FICELCO ( First Catanduanes Electric Cooperative ).",
            "The power company engage in power distribution in this island are NAPOCOR and SUNWEST."
        ],
        [
            "Transportation"
        ],
        [
            "Air"
        ],
        [
            "Virac Airport is the primary airport serving Catanduanes with scheduled flights to Manila."
        ],
        [
            "Sea"
        ],
        [
            "From the seaport of Tabaco, M/V Regina Calixta V or VI travels to the port of San Andres.",
            "MV Eugene Elson and fast-craft service MV Silangan can travel in just one hour and a half which docks in the port of Virac."
        ],
        [
            "Land"
        ],
        [
            "Overland, a 12-hour bus ride from Manila to Tabaco, Albay, is needed to cover the 580 km (360 mi) distance.",
            "Several ferry services in the Port of Tabaco offer connections to San Andres, which takes about 2½ hours, or to Virac Seaport, at 3½ hours, or at least 1½ hours for fast-craft service.",
            "Numerous bus lines operate air-conditioned and ordinary buses and coaches travel from Manila to Tabaco in Albay.",
            "Some of these buses are loaded to the Ferry for its final stop in the town of Virac."
        ],
        [
            "Transportation around the Island is provided by jeepneys, vans and bus for inter-town travel, while tricycles and pedicabs will take you around the towns.",
            "Private vehicles are also available for hire, which can take you to any point of the Island."
        ],
        [
            "Notable people"
        ],
        [
            "Carmen Camacho –  1960s Philippine Kundiman Diva"
        ],
        [
            "Bernabe Concepcion – a native of Rizal, Viga.",
            "Is a Filipino featherweight boxer."
        ],
        [
            "Jose Tomas Sanchez – Roman Catholic Prefect Emeritus of the Congregation for the Clergy and Cardinal Priest from Pandan"
        ],
        [
            "Shalani Soledad – Politician and TV personality"
        ],
        [
            "Francisco Tatad – former Senator of the Philippines (1992–2001) from Gigmoto."
        ],
        [
            "Mike Velarde – Tele-evangelist, Founder and Servant-Leader of El Shaddai DWXI-PPFI.",
            "A native of Caramoran"
        ],
        [
            "Salvador A. Rodolfo Sr. – a Filipino soldier who helped liberate the Island Province of Catanduanes in the Philippines from the Japanese Imperial Army during World War II.",
            "He was known in Catanduanes as \"Phantom\" or the \"Man who Never Dies\", based on the comic book hero The Phantom created by Lee Falk in 1936."
        ],
        [
            "Don Trollano – a native from Gigmoto.",
            "He is a Filipino professional basketball player for the San Miguel Beermen in the Philippine Basketball Association (PBA)."
        ],
        [
            "Reil Cervantes – a native from Virac.",
            "He is a Filipino professional basketball player for Blackwater Elite in the Philippine Basketball Association (PBA).",
            "He was drafted 9th by Barangay Ginebra Kings in the 2011 PBA draft."
        ],
        [
            "Leandro I. Verceles - Former Ambassador and Immigration Commissioner.",
            "The first Bicolano career diplomat."
        ],
        [
            "Joseph Santiago – then Congressman for 2 terms 2004 and 2007.",
            "He is a former executive of Pilipino Telephone Corporation.",
            "Serves as Commissioner of the National Telecommunications Commission, and From 1997 to 1998, he served as team manager of the Mobiline Cellulars professional basketball team in the Philippine Basketball Association."
        ],
        [
            "Gina Vera-Perez de Venecia – She is the daughter of the famed star-builder and owner of Sampaguita Pictures, then Doc Jose Perez and Azucena Vera, President of the said movie production company.",
            "She is the wife of Jose de Venecia, Jr., Speaker of the House of Representatives of the Philippines from 1992 to 1998 and 2001 to 2008."
        ],
        [
            "Noemi Tesorero - known professionally as Mahal.",
            "She was an actress, comedian and vlogger from Virac."
        ],
        [
            "John Arcilla – multi-awarded Filipino movie actor and environmentalist."
        ],
        [
            "Kyla – born Melanie Hernandez Calumpad.",
            "A Filipino R&B singer-songwriter, producer, occasional actress and presenter dubbed as the Philippines' \"Queen of R&B\"."
        ],
        [
            "Paolo Gumabao - born Paul Chen, is a Filipino actor and model.",
            "He is from Virac."
        ],
        [
            "Linda Estrella – a native from Pandan.",
            "Is a Filipina actress, one of the players of Sampaguita Pictures."
        ],
        [
            "Larry Que – was a publisher and journalist killed after he had written an article linking government officials to a major drug seizure of methamphetamine."
        ],
        [
            "Dindo Fernando - one of the most respected actors in Philippine cinema, is from Virac"
        ],
        [
            "Noel Cabangon - esteemed guitarist, singer and songwriter, from Panganiban"
        ],
        [
            "See also"
        ],
        [
            "Islands portalPhilippines portal"
        ],
        [
            "List of islands of the Philippines"
        ],
        [
            "Notes"
        ],
        [
            "^ Medenilla, Vina (April 28, 2022).",
            "\"Duterte signs two laws declaring the egg basket and abaca capitals of the Philippines\".",
            "Manila Bulletin.",
            "Archived from the original on April 29, 2022.",
            "Retrieved April 29, 2022."
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved January 22, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b c Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"100M year-old ammonite found in Catanduanes\".",
            "balita.ph - Online Filipino News.",
            "March 29, 2010.",
            "Archived from the original on June 19, 2018.",
            "Retrieved April 19, 2018."
        ],
        [
            "^ \"Duterte signs law naming Catanduanes as Philippines' abaca capital\".",
            "Retrieved April 26, 2022."
        ],
        [
            "^ \"Brief Historical Background\".",
            "Catandungan; The Official Website of Catanduanes.",
            "Provincial Government of Catanduanes.",
            "Archived from the original on June 8, 2012.",
            "Retrieved July 24, 2016."
        ],
        [
            "^ a b DeCuatro, Rodrigo (March 2, 2018).",
            "\"Catanduanes Doctors Hospital, fully operational na – Bicol Peryodiko\"."
        ],
        [
            "^ a b c \"Province: Catanduanes\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Census 2000; Population and Housing; Region V\" (PDF).",
            "Philippine Statistics Authority (Philippine Statistics Authority – Region V).",
            "Archived from the original (PDF) on March 4, 2016.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Statictics; Catanduanes Demographics\".",
            "Philippine Information Agency (PIA).",
            "Archived from the original on April 29, 2017.",
            "Retrieved January 10, 2015."
        ],
        [
            "^ a b \"Asuang Steals Fire from Gugurang by Damiana L. Eugenio\".",
            "Archived from the original on May 26, 2009.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ a b Clark, Jordan (2011) The Aswang Phenomenon Animation https://www.youtube.com/watch?v=goLgDpSStmc"
        ],
        [
            "^ \"Inquirer NewsInfo: Bicol Artist protest Natl.",
            "Artist awardees\".",
            "Archived from the original on September 11, 2009.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ \"GMANews: Eclipse; Bakunawa eats the sun behind a curtain of clouds\".",
            "January 15, 2010.",
            "Retrieved April 3, 2010."
        ],
        [
            "^ \"Statictics; Religion in Catanduanes\".",
            "Philippine Statistics Agency (PSA).",
            "Archived from the original on April 29, 2017.",
            "Retrieved January 10, 2015."
        ],
        [
            "^ (October 6, 2016)Past Governors of Bicol.",
            "Retrieved from: https://biklish.com/2010/08/19/past-governors-of-bicol-catanduanes/"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Ranking 2009; Human Development Index (HDI); Region V\".",
            "Philippine Statistics Authority (Philippine Statistics Authority – Region V).",
            "Retrieved January 14, 2013."
        ],
        [
            "^ \"Ranking 2012; Most Competitive Municipality; Philippines\".",
            "National Competitiveness Council (NCC).",
            "Retrieved August 1, 2013."
        ],
        [
            "^ \"Statistics 2009; Top Producer of Abaca Fiber; Philippines\".",
            "Fiber Industry Development Authority (FIDA).",
            "Retrieved August 5, 2009."
        ],
        [
            "^ \"Statistics 2015; Abaca Fiber Production; Philippines\".",
            "Fiber Industry Development Authority (FIDA).",
            "Retrieved June 29, 2015."
        ],
        [
            "^ \"Statistics 2014; Bicol Region Tourist Arrival; Catanduanes\".",
            "Department of Tourism (DOT).",
            "Retrieved January 5, 2015."
        ],
        [
            "^ \"Statistics 2015; Increase in Tourist Arrival; Catanduanes\".",
            "Department of Tourism (DOT).",
            "Retrieved March 12, 2015."
        ],
        [
            "^ \"Dinahit Festival (Pandan)\".",
            "Catandungan; The Official Website of Catanduanes.",
            "Provincial Government of Catanduanes.",
            "Archived from the original on January 7, 2013.",
            "Retrieved July 24, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "6341 – an Act Converting the Virac National Agricultural and Trade School in the Municipality of Virac, Province of Catanduanes, to a State College to be Known as the Catanduanes State Colleges, and Appropriating Funds Therefore\".",
            "Chan Robles Virtual Law Library.",
            "June 19, 1971.",
            "Retrieved July 24, 2016."
        ],
        [
            "^ \"Reaching Catanduanes\".",
            "Catanduanes Island Promotion.",
            "Archived from the original on February 19, 2009.",
            "Retrieved July 24, 2016."
        ],
        [
            "^ \"Reil Cervantes Player Profile :: PBA-Online!\".",
            "Archived from the original on November 15, 2016.",
            "Retrieved January 5, 2017."
        ],
        [
            "^ Bracher, Jane (July 18, 2014).",
            "\"Ildefonso, Cervantes lead PBA expansion draft picks\".",
            "Rappler."
        ],
        [
            "^ Salamat, Marya (March 2, 2012).",
            "\"John Arcilla, actor, environmentalist attends Peoples' Mining Conference\".",
            "Bulatlat.com.",
            "Archived from the original on February 23, 2016.",
            "Retrieved July 24, 2016."
        ],
        [
            "References"
        ],
        [
            "NSCB-RD5"
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Catanduanes at Wikimedia Commons"
        ],
        [
            " Geographic data related to Catanduanes at OpenStreetMap"
        ],
        [
            "Official website of the Provincial Government of Catanduanes"
        ],
        [
            "DILG Regional Office No.",
            "5 (Bicol Region)"
        ],
        [
            "Places adjacent to Catanduanes"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Camarines Sur / Maqueda Channel"
        ],
        [
            "Catanduanes"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Albay / Lagonoy Gulf"
        ],
        [
            "Philippine Sea"
        ],
        [
            "vte Province of CatanduanesVirac (capital and largest municipality)Municipalities"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Baras"
        ],
        [
            "Bato"
        ],
        [
            "Caramoran"
        ],
        [
            "Gigmoto"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "San Andres"
        ],
        [
            "San Miguel"
        ],
        [
            "Viga"
        ],
        [
            "Virac"
        ],
        [
            "Articles related to Catanduanes"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vteThe 40 largest islands of the Philippines"
        ],
        [
            "Alabat"
        ],
        [
            "Balabac"
        ],
        [
            "Basilan"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bucas Grande"
        ],
        [
            "Bugsuk"
        ],
        [
            "Burias"
        ],
        [
            "Busuanga"
        ],
        [
            "Calayan"
        ],
        [
            "Camiguin"
        ],
        [
            "Camiguin de Babuyanes"
        ],
        [
            "Cebu"
        ],
        [
            "Catanduanes"
        ],
        [
            "Culion"
        ],
        [
            "Dinagat"
        ],
        [
            "Dumaran"
        ],
        [
            "Guimaras"
        ],
        [
            "Jolo"
        ],
        [
            "Leyte"
        ],
        [
            "Lubang"
        ],
        [
            "Luzon"
        ],
        [
            "Masbate"
        ],
        [
            "Marinduque"
        ],
        [
            "Mindanao"
        ],
        [
            "Mindoro"
        ],
        [
            "Negros"
        ],
        [
            "Olutanga"
        ],
        [
            "Palawan"
        ],
        [
            "Panaon"
        ],
        [
            "Panay"
        ],
        [
            "Polillo"
        ],
        [
            "Samal"
        ],
        [
            "Samar"
        ],
        [
            "Siargao"
        ],
        [
            "Sibuyan"
        ],
        [
            "Siquijor"
        ],
        [
            "Tablas"
        ],
        [
            "Tawitawi"
        ],
        [
            "Ticao"
        ],
        [
            "Islands portal"
        ],
        [
            "See also"
        ],
        [
            "Geography of the Philippines"
        ],
        [
            "Island groups of the Philippines"
        ],
        [
            "List of islands"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "2"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Catanduanes&oldid=1232919350\""
        ],
        [
            "Categories: CatanduanesProvinces of the PhilippinesProvinces of the Bicol RegionIsland provinces of the PhilippinesIslands of LuzonStates and territories established in 19451945 establishments in the PhilippinesFormer sub-provinces of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasArticles with short descriptionShort description is different from WikidataUse mdy dates from May 2017Coordinates on WikidataPages with Tagalog IPAArticles containing Filipino-language textArticles needing additional references from August 2022All articles needing additional referencesWikipedia articles needing clarification from December 2022Articles needing additional references from August 2016All articles with unsourced statementsArticles with unsourced statements from July 2016Wikipedia articles needing clarification from July 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with GND identifiersArticles with J9U identifiersPages using the Kartographer extension"
        ]
    ]
}