{
    "name": "Cebu",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Cebu"
        ],
        [
            "58 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralBrezhonegCatalàCebuanoČeštinaChavacano de ZamboangaDanskDeutschEspañolEsperantoفارسیFrançaisGalego한국어हिन्दीIlokanoBahasa IndonesiaInterlinguaИронItalianoעבריתKapampanganქართულიLatinaLatviešuLietuviųМакедонскиMalagasyമലയാളംBahasa MelayuNederlands日本語Norsk bokmålNorsk nynorskPangasinanPolskiPortuguêsРусскийSimple EnglishСрпски / srpskiSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوVènetoTiếng ViệtWinaray吴语ייִדיש中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°19′N 123°45′E﻿ / ﻿10.32°N 123.75°E﻿ / 10.32; 123.75"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Central Visayas, Philippines"
        ],
        [
            "This article is about the province in the Philippines.",
            "For its capital city, see Cebu City.",
            "For the city in Malaysia, see Sibu."
        ],
        [
            "For other uses, see Cebu (disambiguation)."
        ],
        [
            "This article or section may need to be rewritten to comply with Wikipedia's quality standards, as it uses Bisaya Patronymesis Sri Visjaya, Aginid, Bayok sa Atong Tawarik, and History of Panay from the first inhabitants and the Bornean immigrants from which the Bisayans are descended to the Arrival of the Spaniards as sources—all three have been proven hoaxes, as well as Macachor and Montebon's works, which greatly source from the former three.",
            "The page is possibly written with propaganda intent or advertisement.. You can help.",
            "The talk page may contain suggestions.",
            "(November 2021)"
        ],
        [
            "Province in Visayas, PhilippinesCebu"
        ],
        [
            "SugboProvinceClockwise from the top: Osmeña Peak, Kawasan Falls, Cebu Metropolitan Cathedral, Malapascua Island, Campinsa Hills, Cantabugon, Aloguinsan, Magellan Monument"
        ],
        [
            "FlagSealNickname: The Gateway to a Thousand JourneysAnthem: Sugbo (Cebu)Location in the PhilippinesOpenStreetMapCoordinates: 10°19′N 123°45′E﻿ / ﻿10.32°N 123.75°E﻿ / 10.32; 123.75CountryPhilippinesIsland GroupVisayasRegionCentral VisayasFounded6 August 1569Capitaland largest cityCebu CityGovernment • TypeSangguniang Panlalawigan • GovernorGwendolyn F. Garcia (1Cebu) • Vice GovernorHilario R. Davide III (LP) • LegislatureCebu Provincial Board"
        ],
        [
            "Members"
        ],
        [
            "1st ProvDistYolanda DaanRaul Bacaltos2nd ProvDistEdsel GaleosJose Mari Salvador3rd ProvDistVictoria CorominasJohn Ismael Borgonia4th ProvDistKerrie Keane ShimuraHoracio Franco5th ProvDistMiguel MagpaleAndrei Duterte6th ProvDistGlenn SocoThadeo Ouano7th ProvDistJerome LibrandoChristopher Baricuatro"
        ],
        [
            "Area 3,082,621 • LanguageCebuano Forohanon Bantayanon Population data excludes independent citiesDivisions • Independent cities"
        ],
        [
            "3"
        ],
        [
            "Highly urbanized cities of:  Cebu CityLapu-LapuMandaue"
        ],
        [
            " • Component cities"
        ],
        [
            "6"
        ],
        [
            "Bogo"
        ],
        [
            "Carcar"
        ],
        [
            "Danao"
        ],
        [
            "Naga"
        ],
        [
            "Talisay"
        ],
        [
            "Toledo"
        ],
        [
            " • Municipalities"
        ],
        [
            "44"
        ],
        [
            " AlcantaraAlcoyAlegriaAloguinsanArgaoAsturiasBadianBalambanBantayanBariliBogoBoljoonBorbonCarcarCarmenCatmonCompostelaConsolacionCordovaDaanbantayanDalagueteDanaoDumanjugGinatilanLiloanMadridejosMalabuyocMedellinMinglanillaMoalboalNagaOslobPilarPinamungajanPoroRondaSamboanSan FernandoSan FranciscoSan RemigioSanta FeSantanderSibongaSogodTabogonTabuelanTalisayToledoTuburanTudela"
        ],
        [
            " • Barangay"
        ],
        [
            "1,066"
        ],
        [
            "+  137"
        ],
        [
            "including independent cities"
        ],
        [
            "1,203"
        ],
        [
            " • DistrictsLegislative districts of CebuLegislative districts of Cebu CityLegislative district of Lapu-LapuLegislative district of MandaueTime zoneUTC+8 (PST)ZIP code6000–6053IDD : area code +63 (0)32ISO 3166 codePH-CEBIncome class1st classPSGC072200000PatronSanto Niño de CebuWebsitewww.cebu.gov.ph"
        ],
        [
            "Cebu (/sɛˈbuː/ seb-OO; Cebuano: Sugbo), officially the Province of Cebu (Cebuano: Lalawigan sa Sugbo; Hiligaynon: Kapuoran sang Cebu; Filipino: Lalawigan ng Cebu), is a province of the Philippines located in the Central Visayas (Region VII) region, and consists of a main island and 167 surrounding islands and islets.",
            "The coastal zone of Cebu is identified as a site of highest marine biodiversity importance in the Coral Triangle."
        ],
        [
            "Its capital and largest city is Cebu City, nicknamed \"the Queen (Catholic) City of the South\" having the Second Cardinal, the oldest city and first capital of the Philippines, which is politically independent from the provincial government along with Mandaue and Lapu-Lapu City.",
            "The Cebu Metropolitan Area or Metro Cebu is the third largest metropolitan area in the Philippines (after Metro Manila and Metro Davao) with Cebu City as the main center of commerce, trade, education and industry in the Visayas.",
            "Being one of the most developed provinces in the Philippines, in a decade it has transformed into a global hub for business processing services, tourism, shipping, furniture-making, and heavy industry.",
            "Mactan–Cebu International Airport, located on Mactan Island, is the second busiest airport in the Philippines."
        ],
        [
            "Cebu has the most combined cities and municipalities of any province in the Philippines, with 53 in total."
        ],
        [
            "Etymology"
        ],
        [
            "It is unclear whether the island was named sugbó or the settlement where Ferdinand Magellan's crew arrived in 1521.",
            "The capital city of the province is also named Cebu City."
        ],
        [
            "The name is possibly derived from a hypothetical Proto-Philippine word *sug(e)bu meaning \"to bathe\" or \"to wade into the water\".",
            "In fact, there is also another municipality in Batangas, Philippines called Nasugbu, which may also share the same etymological root with the said province."
        ],
        [
            "The modern name is most likely how the first Europeans heard of the name of the place in the 16th-17th centuries, as it was first recorded as Zubu or Çubu, and then eventually it became Cebu.",
            "The reason of the spelling change is because Visayans were mostly illiterate in the 16th and 17th centuries."
        ],
        [
            "History"
        ],
        [
            "See also: History of the Philippines"
        ],
        [
            "Early history: Cebu Rajahnate"
        ],
        [
            "This article may require cleanup to meet Wikipedia's quality standards.",
            "The specific problem is: Citing sources from hoaxes, this entire section needs to be re-examined and rewritten.",
            "Note that there are no records, chronicles, or even archaeological evidence that this claim exists.",
            "Please help improve this article if you can.",
            "(March 2024) (Learn how and when to remove this message)A map of Cebu Island in 1521, with the historical polity of Cebu colored in blue."
        ],
        [
            "The Rajahnate of Cebu was a native kingdom that existed in Cebu prior to the arrival of the Spaniards.",
            "It was founded by Sri Lumay otherwise known as Rajamuda Lumaya,"
        ],
        [
            "Spanish Colonial Period"
        ],
        [
            "This article may require cleanup to meet Wikipedia's quality standards.",
            "The specific problem is: History section needs to be re-examined.",
            "There are lots of paragraphs here that needed citation and some of which do not come from journals and researchers.",
            "Please help improve this article if you can.",
            "(March 2024) (Learn how and when to remove this message)A map showing the route of the Magellan expedition circumnavigating the world."
        ],
        [
            "Report from the Magellan expedition"
        ],
        [
            "The arrival of Portuguese explorer Ferdinand Magellan in 1521 began a period of Spanish exploration and colonization."
        ],
        [
            "Losing the favor of King Manuel I of Portugal for his plan of reaching the Spice Islands by sailing west from Europe, Magellan offered his services to King Charles I of Spain (Charles V, Holy Roman Emperor).",
            "On September 20, 1519, Magellan led five ships with a total complement of 250 people from the Spanish fort of Sanlúcar de Barrameda en route to southeast Asia via the Americas and the Pacific Ocean.",
            "They reached the Philippines on March 16, 1521.",
            "Rajah Kolambu the king of Mazaua told them to sail for Cebu, where they could trade and obtain provisions."
        ],
        [
            "Arriving in Cebu City, Magellan, with Enrique of Malacca as a translator, befriended Rajah Humabon a chief of a village in Cebu, and persuaded the natives to ally themselves with the Spanish.",
            "On April 14 Magellan erected a large wooden cross on the shores of Cebu.",
            "Afterward, Humabon was baptized along with about 400 islanders."
        ],
        [
            "Magellan soon heard of Datu Lapu-Lapu, a native chief in nearby Mactan Island, a rival of a chief in Cebu.",
            "It was thought that Humabon and Lapu–Lapu had been fighting for control of the flourishing trade in the area.",
            "On April 27 the Battle of Mactan occurred, where the Spaniards were defeated and Magellan was killed by the natives of Mactan in Mactan Island.",
            "According to Italian historian and chronicler Antonio Pigafetta, Magellan's body was never recovered despite efforts to trade for it with spice and jewels.",
            "Magellan's second-in-command, Juan Sebastián Elcano, took his place as captain of the expedition and sailed the fleet back to Spain, circumnavigating the world."
        ],
        [
            "Depiction of the Bisayan tattooed men, known then as timawa in the Boxer Codex (c. 1590).",
            "Cebu was one of the islands referred where \"painted people\" (referring to the tattoos) resided."
        ],
        [
            "Survivors of the Magellan expedition returned to Spain with tales of a savage island in the East Indies.",
            "Consequently, several Spanish expeditions were sent to the islands but all ended in failure."
        ],
        [
            "Report from the Legazpi expedition"
        ],
        [
            "On April 27,1565 Miguel López de Legazpi arrived on the island (some sources say on 1564 CE), though he also intended to make peace, he was also prepared for a war since these were the same people that killed Magellan 44 years prior.",
            "According to the report, a messenger went to the Spanish ship and informed them that Tupas and \"along with 10 other chiefs\" would be out to either make negotiations or as a warning to prepare for an upcoming battle.",
            "Despite trying to assure the natives that the Spanish were there with good intentions, the natives already armed themselves, both parties were reported to have taunted each other offshore.",
            "Legazpi aimed the artillery on the proas which briefly confused the opposing natives causing them to run into the woods thus making the shore clear for the Spanish to land.",
            "Salvaging any valuable item that could be found, Juan de Camuz came across an image of the Child Jesus, which was probably the one Magellan presented to the consort of the chief in 1521.",
            "From then on, a church was built on the site which would later become the Minor Basilica of the Holy Child.",
            "Twelve days later, on May 8, a fort was established and while the construction was ongoing, the natives frequently launched attacks but were always repulsed until eventually they give in as soon as they realized the superior armament of the Europeans.",
            "Legazpi dealt only with Tupas, after a brief \"trial\" on grounds of apostasy and Magellan's murder, the Europeans pardoned the natives' chief and included the natives.",
            "After the exchange, the two parties then discussed the terms and conditions including confirmation of titles, who receives tax exemptions, land grants, authority and recognition of officials.",
            "The crew then left Cebu on June 1, 1565.: 113"
        ],
        [
            "American Colonial Period"
        ],
        [
            "In 1898, the island was ceded to the United States after the Spanish–American War and Philippine–American War.",
            "In 1901, Cebu was governed by the United States for a brief period, however, it became a chartered city on February 24, 1937, and was governed independently by Filipino politicians."
        ],
        [
            "Japanese Occupation Period"
        ],
        [
            "Cebu, being one of the most densely populated islands in the Philippines, served as a Japanese base during their occupation in World War II which began with the landing of Japanese soldiers in April 1942.",
            "A Japanese businessman established Cebu's first \"comfort station\" during the war, where Japanese soldiers routinely gang-raped, humiliated, and murdered kidnapped girls and teenagers who they forced into sexual slavery under the brutal \"comfort women\" system.",
            "which is said to have changed the American plans to retake the Philippines from Japanese occupation in 1944, by helping the combined United States and the Philippine Commonwealth Army forces enter Cebu in 1945.",
            "The following year the island achieved independence from colonial rule in 1946."
        ],
        [
            "Philippine independence"
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Cebu became a key center of resistance against the Marcos dictatorship,"
        ],
        [
            "Among the Cebuanos immediately arrested by the Marcos dictatorship when Martial law was announced on September 23, 1972, were columnist and future National Artist Resil Mojares and human rights lawyer and Carcar Vice Mayor Democrito Barcenas, who were both detained at Camp Sergio Osmeña."
        ],
        [
            "One of the Marcos Martial Law Desaparecidos from Cebu was Redemptorist Priest Fr.",
            "Rudy Romano,"
        ],
        [
            "Role in the People Power Revolution"
        ],
        [
            "Later, Cebu would play a key role in the days leading up to the 1986 People Power revolution and the ouster of Marcos.",
            "It was from Fuente Osmeña circle in Cebu City that the opposition forces relaunched the Civil Disobedience Campaign against the Marcos regime and its cronies on February 22, 1986.",
            "After that, the Carmelite Monastery in Barangay Mabolo, Cebu City, served as a refuge for opposition candidates Corazon Aquino and Salvador Laurel during the first day of the People Power revolution, because it was not yet safe to go back to Manila."
        ],
        [
            "Contemporary"
        ],
        [
            "In 2007, the municipalities of Bogo, Carcar, and Naga became component cities.",
            "Their respective cityhood laws were ratified in the same year.",
            "However, their cityhood status were lost twice in the years 2008 and 2010 after the LCP questioned the validity of the cityhood laws.",
            "Their cityhood status were reaffirmed after the court finalized its ruling on February 15, 2011 declared their respective cityhood laws constitutional."
        ],
        [
            "In February 2012 Cebu island experienced the effects of magnitude 6.7 earthquake on the neighboring island of Negros and was the largest quake in the area for 90 years.",
            "The tremor shook buildings but there were no reports of major building damage or loss of life on Cebu Island itself.",
            "This tremor was caused by a previously unrecorded fault."
        ],
        [
            "In October 2013, Cebu and Bohol were hit by record-setting 7.2 magnitude earthquake which left 222 dead and collapsed some buildings, including 5 historical churches."
        ],
        [
            "In December 2021, Typhoon Rai wreaked havoc across the province,"
        ],
        [
            "Geography"
        ],
        [
            "Cebu IslandSugboGeographyLocationVisayasArchipelagoPhilippinesAdjacent toCamotes SeaVisayan SeaCebu StraitTañon StraitArea4,467.5 km2 (1,724.9 sq mi)Pop.",
            "density980/km2 (2540/sq mi)Ethnic groupsVisayans (Cebuanos)"
        ],
        [
            "Cebu is located to the east of Negros, to the west of Leyte and Bohol islands.",
            "The province consists of Cebu Island, as well as 167 smaller islands, which include Mactan, Bantayan, Malapascua, Olango and the Camotes Islands.",
            "But the highly urbanized cities of Cebu, Lapu-Lapu and Mandaue are independent cities not under provincial supervision, yet are often grouped with the province for geographical and statistical purposes."
        ],
        [
            "The province's land area is 4,944 square kilometers (1,909 sq mi), or when the three independent cities (Cebu City, Lapu-Lapu and Mandaue) are included for geographical purposes, the total area is 5,342 square kilometers (2,063 sq mi)."
        ],
        [
            "Cebu's central location, proximity to an unusually exotic tourist destination, ready access to a diversity of plant, animal and geological wonders within the island, and remoteness from earthquake and typhoon activity are some of the special attributes of Cebu."
        ],
        [
            "Cebu Island"
        ],
        [
            "Cebu island satellite image captured by Sentinel-2 in 2016"
        ],
        [
            "Cebu Island is the 126th largest island in the world.",
            "Cebu Island itself is long and narrow, stretching 196 kilometers (122 mi) from north to south and 32 kilometers (20 mi) across at its widest point.",
            "It has narrow coastlines, limestone plateaus, and coastal plains.",
            "It also has rolling hills and rugged mountain ranges traversing the northern and southern lengths of the island."
        ],
        [
            "Cebu's highest mountains are over 1,000 metres (3,300 ft) high.",
            "Flat tracts of land can be found in the city of Bogo and in the towns of San Remigio, Medellin and Daanbantayan at the northern region of the province."
        ],
        [
            "The island's area is 4,468 square kilometres (1,725 sq mi),"
        ],
        [
            "Beaches, coral atolls, islands, and rich fishing grounds surround Cebu."
        ],
        [
            "Coal was first discovered in Cebu about 1837.",
            "There were 15 localities over the whole island, on both coasts; some desultory mining had been carried out Naga near Mount Uling, but most serious operations were at Licos and Camansi west of Compostela and Danao.",
            "The Compostela-Danao coalfield contained about six million workable tons.",
            "The tramroads, one from Danao to Camansi, one from Compostela to Mount Licos, were undertaken in 1895, together with a wagon road built in 1877, from Cotcot to Dapdap."
        ],
        [
            "Climate"
        ],
        [
            "Main article: Climate of Cebu"
        ],
        [
            "The climate of Cebu is tropical.",
            "There are 2 seasons in Cebu − the dry and wet season.",
            "It is dry and sunny most of the year with some occasional rains during the months of June to December.",
            "The province of Cebu normally gets typhoons once a year or none."
        ],
        [
            "Northern Cebu gets more rainfall and typhoons than southern Cebu because it has a different climate.",
            "Typhoon Haiyan (Yolanda) hit Northern Cebu in 2013 killing 73 people and injuring 348 others.",
            "Though most typhoons hit only the northern part of Cebu, the urban areas in central Cebu are sometimes hit, such as when Typhoon Mike (Ruping), one of the worst to hit Cebu lashed the central Cebu area in 1990.",
            "31 years later, Typhoon Rai struck the central and southern portions of the province."
        ],
        [
            "Cebu's temperatures can reach a high of 36 °C (97 °F) from March to May, and as low as 18 °C (64 °F) in the mountains during the wet season.",
            "The average temperature is around 24 to 34 °C (75 to 93 °F), and does not fluctuate much except during the month of May, which is the hottest month.",
            "Cebu averages 70–80% humidity."
        ],
        [
            "Fauna"
        ],
        [
            "See also: List of amphibians and reptiles of CebuCopsychus cebuensis, the Black Shama (locally called Siloy), is a species of Shama bird that is only found in the island of Cebu.",
            "It is currently endangered.",
            "It has been observed as far in urban areas as Cebu City, but is mainly abundant in the species' last stronghold, the Nug-as rainforest of Alcoy.",
            "It can also be found in Casili, Consolacion and the mountainous areas of the Trans Central Highway.",
            "The bird was once featured on the official stamp of Cebu of 1992.Endemic species in Cebu include the Cebu Flowerpecker (Dicaeum quadricolor), Cebu Slender Skink (Brachymeles cebuensis), Uling Goby (Sicyopus cebuensis), and Black Shama (Copsychus cebuensis)."
        ],
        [
            "There is also a subspecies of Idea leuconoe that is only endemic to Cebu.",
            "I. l. jumaloni is endemic to the area of Kawasan Falls in Badian, hence its common name, the Kawasan Paper Kite Butterfly.",
            "The subspecies is also named after Julian Jumalon, a Cebuano Lepidopterist and butterfly artist.",
            "The butterfly can also be observed in the Nug-as rainforest."
        ],
        [
            "Flora"
        ],
        [
            "Cebu has little remaining forest cover.",
            "The remaining forest patches in Cebu are composed primarily of the following tree species."
        ],
        [
            "Mount Lantoy: Carallia brachiata and introduced species Tectona grandis, Swietenia macrophylla, Gmelina arborea, and Casuarina equisetifolia"
        ],
        [
            "Palinipinon Mountains: Carallia brachiata and introduced species Swietenia macrophylla"
        ],
        [
            "Nug-as forest: Ficus spp., Artocarpus blancoi, Macaranga grandifolia, and Cinnamomum cebuense"
        ],
        [
            "Mount Lanaya: Carallia brachiata"
        ],
        [
            "Mount Tabunan: Trevesia burckii, Voacanga globosa, Heptapleurum actinophyllum, Pouteria villamilii, and Palaquium luzoniense"
        ],
        [
            "Administrative divisions"
        ],
        [
            "The province of Cebu has 3 highly urbanized cities (Cebu, Lapu-Lapu, and Mandaue), 6 component cities (Bogo, Carcar, Danao, Naga, Talisay, and Toledo), and 44 municipalities for a total of 53 units as listed below:"
        ],
        [
            "PSGC"
        ],
        [
            "City or Municipality"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "PD 2020"
        ],
        [
            "2020"
        ],
        [
            "2010"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "072201000"
        ],
        [
            "Alcantara"
        ],
        [
            "0.5%"
        ],
        [
            "16,910"
        ],
        [
            "13,556"
        ],
        [
            " ▴"
        ],
        [
            "2.23%"
        ],
        [
            "35.20"
        ],
        [
            "13.59"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "072202000"
        ],
        [
            "Alcoy"
        ],
        [
            "0.6%"
        ],
        [
            "19,186"
        ],
        [
            "14,757"
        ],
        [
            " ▴"
        ],
        [
            "2.66%"
        ],
        [
            "61.63"
        ],
        [
            "23.80"
        ],
        [
            "310"
        ],
        [
            "810"
        ],
        [
            "072203000"
        ],
        [
            "Alegria"
        ],
        [
            "0.8%"
        ],
        [
            "25,620"
        ],
        [
            "22,072"
        ],
        [
            " ▴"
        ],
        [
            "1.50%"
        ],
        [
            "89.49"
        ],
        [
            "34.55"
        ],
        [
            "290"
        ],
        [
            "740"
        ],
        [
            "072204000"
        ],
        [
            "Aloguinsan"
        ],
        [
            "1.0%"
        ],
        [
            "34,466"
        ],
        [
            "27,650"
        ],
        [
            " ▴"
        ],
        [
            "2.23%"
        ],
        [
            "61.92"
        ],
        [
            "23.91"
        ],
        [
            "560"
        ],
        [
            "1,400"
        ],
        [
            "072205000"
        ],
        [
            "Argao"
        ],
        [
            "2.4%"
        ],
        [
            "78,187"
        ],
        [
            "69,503"
        ],
        [
            " ▴"
        ],
        [
            "1.18%"
        ],
        [
            "191.50"
        ],
        [
            "73.94"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "072206000"
        ],
        [
            "Asturias"
        ],
        [
            "1.7%"
        ],
        [
            "55,397"
        ],
        [
            "44,732"
        ],
        [
            " ▴"
        ],
        [
            "2.16%"
        ],
        [
            "190.45"
        ],
        [
            "73.53"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "072207000"
        ],
        [
            "Badian"
        ],
        [
            "1.3%"
        ],
        [
            "43,735"
        ],
        [
            "37,699"
        ],
        [
            " ▴"
        ],
        [
            "1.50%"
        ],
        [
            "110.07"
        ],
        [
            "42.50"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "072208000"
        ],
        [
            "Balamban"
        ],
        [
            "2.9%"
        ],
        [
            "95,136"
        ],
        [
            "71,237"
        ],
        [
            " ▴"
        ],
        [
            "2.93%"
        ],
        [
            "333.56"
        ],
        [
            "128.79"
        ],
        [
            "290"
        ],
        [
            "740"
        ],
        [
            "072209000"
        ],
        [
            "Bantayan"
        ],
        [
            "2.6%"
        ],
        [
            "86,247"
        ],
        [
            "74,785"
        ],
        [
            " ▴"
        ],
        [
            "1.44%"
        ],
        [
            "81.68"
        ],
        [
            "31.54"
        ],
        [
            "1,100"
        ],
        [
            "2,700"
        ],
        [
            "072210000"
        ],
        [
            "Barili"
        ],
        [
            "2.4%"
        ],
        [
            "80,715"
        ],
        [
            "65,524"
        ],
        [
            " ▴"
        ],
        [
            "2.11%"
        ],
        [
            "122.21"
        ],
        [
            "47.19"
        ],
        [
            "660"
        ],
        [
            "1,700"
        ],
        [
            "072211000"
        ],
        [
            "Bogo"
        ],
        [
            "2.7%"
        ],
        [
            "88,867"
        ],
        [
            "69,911"
        ],
        [
            " ▴"
        ],
        [
            "2.43%"
        ],
        [
            "103.52"
        ],
        [
            "39.97"
        ],
        [
            "860"
        ],
        [
            "2,200"
        ],
        [
            "072212000"
        ],
        [
            "Boljoon"
        ],
        [
            "0.5%"
        ],
        [
            "17,525"
        ],
        [
            "14,877"
        ],
        [
            " ▴"
        ],
        [
            "1.65%"
        ],
        [
            "117.00"
        ],
        [
            "45.17"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "072213000"
        ],
        [
            "Borbon"
        ],
        [
            "1.1%"
        ],
        [
            "38,187"
        ],
        [
            "32,278"
        ],
        [
            " ▴"
        ],
        [
            "1.69%"
        ],
        [
            "120.94"
        ],
        [
            "46.70"
        ],
        [
            "320"
        ],
        [
            "820"
        ],
        [
            "072214000"
        ],
        [
            "Carcar"
        ],
        [
            "4.1%"
        ],
        [
            "136,453"
        ],
        [
            "100,632"
        ],
        [
            " ▴"
        ],
        [
            "3.09%"
        ],
        [
            "116.78"
        ],
        [
            "45.09"
        ],
        [
            "1,200"
        ],
        [
            "3,000"
        ],
        [
            "072215000"
        ],
        [
            "Carmen"
        ],
        [
            "1.7%"
        ],
        [
            "57,897"
        ],
        [
            "41,279"
        ],
        [
            " ▴"
        ],
        [
            "3.44%"
        ],
        [
            "84.78"
        ],
        [
            "32.73"
        ],
        [
            "680"
        ],
        [
            "1,800"
        ],
        [
            "072216000"
        ],
        [
            "Catmon"
        ],
        [
            "1.0%"
        ],
        [
            "33,745"
        ],
        [
            "27,330"
        ],
        [
            " ▴"
        ],
        [
            "2.13%"
        ],
        [
            "109.64"
        ],
        [
            "42.33"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "072217000"
        ],
        [
            "Cebu City  †"
        ],
        [
            "29.0%"
        ],
        [
            "964,169"
        ],
        [
            "866,171"
        ],
        [
            " ▴"
        ],
        [
            "1.08%"
        ],
        [
            "315.00"
        ],
        [
            "121.62"
        ],
        [
            "3,100"
        ],
        [
            "7,900"
        ],
        [
            "072218000"
        ],
        [
            "Compostela"
        ],
        [
            "1.7%"
        ],
        [
            "55,874"
        ],
        [
            "39,167"
        ],
        [
            " ▴"
        ],
        [
            "3.62%"
        ],
        [
            "53.90"
        ],
        [
            "20.81"
        ],
        [
            "1,000"
        ],
        [
            "2,700"
        ],
        [
            "072219000"
        ],
        [
            "Consolacion"
        ],
        [
            "4.5%"
        ],
        [
            "148,012"
        ],
        [
            "106,649"
        ],
        [
            " ▴"
        ],
        [
            "3.33%"
        ],
        [
            "37.03"
        ],
        [
            "14.30"
        ],
        [
            "4,000"
        ],
        [
            "10,000"
        ],
        [
            "072220000"
        ],
        [
            "Cordova"
        ],
        [
            "2.1%"
        ],
        [
            "70,595"
        ],
        [
            "50,353"
        ],
        [
            " ▴"
        ],
        [
            "3.44%"
        ],
        [
            "17.15"
        ],
        [
            "6.62"
        ],
        [
            "4,100"
        ],
        [
            "11,000"
        ],
        [
            "072221000"
        ],
        [
            "Daanbantayan"
        ],
        [
            "2.8%"
        ],
        [
            "93,502"
        ],
        [
            "74,897"
        ],
        [
            " ▴"
        ],
        [
            "2.24%"
        ],
        [
            "92.27"
        ],
        [
            "35.63"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "072222000"
        ],
        [
            "Dalaguete"
        ],
        [
            "2.2%"
        ],
        [
            "74,596"
        ],
        [
            "63,239"
        ],
        [
            " ▴"
        ],
        [
            "1.67%"
        ],
        [
            "154.96"
        ],
        [
            "59.83"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "072223000"
        ],
        [
            "Danao"
        ],
        [
            "4.7%"
        ],
        [
            "156,321"
        ],
        [
            "119,252"
        ],
        [
            " ▴"
        ],
        [
            "2.74%"
        ],
        [
            "107.30"
        ],
        [
            "41.43"
        ],
        [
            "1,500"
        ],
        [
            "3,800"
        ],
        [
            "072224000"
        ],
        [
            "Dumanjug"
        ],
        [
            "1.7%"
        ],
        [
            "57,823"
        ],
        [
            "46,754"
        ],
        [
            " ▴"
        ],
        [
            "2.15%"
        ],
        [
            "85.53"
        ],
        [
            "33.02"
        ],
        [
            "680"
        ],
        [
            "1,800"
        ],
        [
            "072225000"
        ],
        [
            "Ginatilan"
        ],
        [
            "0.5%"
        ],
        [
            "16,906"
        ],
        [
            "15,327"
        ],
        [
            " ▴"
        ],
        [
            "0.99%"
        ],
        [
            "70.10"
        ],
        [
            "27.07"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "072226000"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "15.0%"
        ],
        [
            "497,604"
        ],
        [
            "350,467"
        ],
        [
            " ▴"
        ],
        [
            "3.57%"
        ],
        [
            "58.10"
        ],
        [
            "22.43"
        ],
        [
            "8,600"
        ],
        [
            "22,000"
        ],
        [
            "072227000"
        ],
        [
            "Liloan"
        ],
        [
            "4.6%"
        ],
        [
            "153,197"
        ],
        [
            "100,500"
        ],
        [
            " ▴"
        ],
        [
            "4.30%"
        ],
        [
            "45.92"
        ],
        [
            "17.73"
        ],
        [
            "3,300"
        ],
        [
            "8,600"
        ],
        [
            "072228000"
        ],
        [
            "Madridejos"
        ],
        [
            "1.3%"
        ],
        [
            "42,039"
        ],
        [
            "34,905"
        ],
        [
            " ▴"
        ],
        [
            "1.88%"
        ],
        [
            "23.95"
        ],
        [
            "9.25"
        ],
        [
            "1,800"
        ],
        [
            "4,500"
        ],
        [
            "072229000"
        ],
        [
            "Malabuyoc"
        ],
        [
            "0.6%"
        ],
        [
            "19,770"
        ],
        [
            "18,426"
        ],
        [
            " ▴"
        ],
        [
            "0.71%"
        ],
        [
            "69.27"
        ],
        [
            "26.75"
        ],
        [
            "290"
        ],
        [
            "740"
        ],
        [
            "072230000"
        ],
        [
            "Mandaue"
        ],
        [
            "10.9%"
        ],
        [
            "364,116"
        ],
        [
            "331,320"
        ],
        [
            " ▴"
        ],
        [
            "0.95%"
        ],
        [
            "34.87"
        ],
        [
            "13.46"
        ],
        [
            "10,000"
        ],
        [
            "27,000"
        ],
        [
            "072231000"
        ],
        [
            "Medellin"
        ],
        [
            "1.8%"
        ],
        [
            "59,605"
        ],
        [
            "50,047"
        ],
        [
            " ▴"
        ],
        [
            "1.76%"
        ],
        [
            "73.19"
        ],
        [
            "28.26"
        ],
        [
            "810"
        ],
        [
            "2,100"
        ],
        [
            "072232000"
        ],
        [
            "Minglanilla"
        ],
        [
            "4.5%"
        ],
        [
            "151,002"
        ],
        [
            "113,178"
        ],
        [
            " ▴"
        ],
        [
            "2.92%"
        ],
        [
            "65.60"
        ],
        [
            "25.33"
        ],
        [
            "2,300"
        ],
        [
            "6,000"
        ],
        [
            "072233000"
        ],
        [
            "Moalboal"
        ],
        [
            "1.1%"
        ],
        [
            "36,930"
        ],
        [
            "27,676"
        ],
        [
            " ▴"
        ],
        [
            "2.93%"
        ],
        [
            "124.86"
        ],
        [
            "48.21"
        ],
        [
            "300"
        ],
        [
            "770"
        ],
        [
            "072234000"
        ],
        [
            "Naga"
        ],
        [
            "4.0%"
        ],
        [
            "133,184"
        ],
        [
            "101,571"
        ],
        [
            " ▴"
        ],
        [
            "2.75%"
        ],
        [
            "101.97"
        ],
        [
            "39.37"
        ],
        [
            "1,300"
        ],
        [
            "3,400"
        ],
        [
            "072235000"
        ],
        [
            "Oslob"
        ],
        [
            "0.9%"
        ],
        [
            "29,264"
        ],
        [
            "26,116"
        ],
        [
            " ▴"
        ],
        [
            "1.14%"
        ],
        [
            "134.75"
        ],
        [
            "52.03"
        ],
        [
            "220"
        ],
        [
            "560"
        ],
        [
            "072236000"
        ],
        [
            "Pilar"
        ],
        [
            "0.4%"
        ],
        [
            "12,506"
        ],
        [
            "11,564"
        ],
        [
            " ▴"
        ],
        [
            "0.79%"
        ],
        [
            "32.42"
        ],
        [
            "12.52"
        ],
        [
            "390"
        ],
        [
            "1,000"
        ],
        [
            "072237000"
        ],
        [
            "Pinamungajan"
        ],
        [
            "2.3%"
        ],
        [
            "75,131"
        ],
        [
            "57,997"
        ],
        [
            " ▴"
        ],
        [
            "2.62%"
        ],
        [
            "109.16"
        ],
        [
            "42.15"
        ],
        [
            "690"
        ],
        [
            "1,800"
        ],
        [
            "072238000"
        ],
        [
            "Poro"
        ],
        [
            "0.8%"
        ],
        [
            "26,232"
        ],
        [
            "23,498"
        ],
        [
            " ▴"
        ],
        [
            "1.11%"
        ],
        [
            "63.59"
        ],
        [
            "24.55"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "072239000"
        ],
        [
            "Ronda"
        ],
        [
            "0.6%"
        ],
        [
            "21,005"
        ],
        [
            "18,582"
        ],
        [
            " ▴"
        ],
        [
            "1.23%"
        ],
        [
            "57.10"
        ],
        [
            "22.05"
        ],
        [
            "370"
        ],
        [
            "950"
        ],
        [
            "072240000"
        ],
        [
            "Samboan"
        ],
        [
            "0.6%"
        ],
        [
            "20,373"
        ],
        [
            "18,613"
        ],
        [
            " ▴"
        ],
        [
            "0.91%"
        ],
        [
            "45.16"
        ],
        [
            "17.44"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "072241000"
        ],
        [
            "San Fernando"
        ],
        [
            "2.2%"
        ],
        [
            "72,224"
        ],
        [
            "60,970"
        ],
        [
            " ▴"
        ],
        [
            "1.71%"
        ],
        [
            "69.39"
        ],
        [
            "26.79"
        ],
        [
            "1,000"
        ],
        [
            "2,700"
        ],
        [
            "072242000"
        ],
        [
            "San Francisco"
        ],
        [
            "1.8%"
        ],
        [
            "59,236"
        ],
        [
            "47,357"
        ],
        [
            " ▴"
        ],
        [
            "2.26%"
        ],
        [
            "106.93"
        ],
        [
            "41.29"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "072243000"
        ],
        [
            "San Remigio"
        ],
        [
            "2.0%"
        ],
        [
            "65,744"
        ],
        [
            "51,394"
        ],
        [
            " ▴"
        ],
        [
            "2.49%"
        ],
        [
            "95.27"
        ],
        [
            "36.78"
        ],
        [
            "690"
        ],
        [
            "1,800"
        ],
        [
            "072244000"
        ],
        [
            "Santa Fe"
        ],
        [
            "1.0%"
        ],
        [
            "34,471"
        ],
        [
            "27,270"
        ],
        [
            " ▴"
        ],
        [
            "2.37%"
        ],
        [
            "28.05"
        ],
        [
            "10.83"
        ],
        [
            "1,200"
        ],
        [
            "3,200"
        ],
        [
            "072245000"
        ],
        [
            "Santander"
        ],
        [
            "0.6%"
        ],
        [
            "18,527"
        ],
        [
            "16,105"
        ],
        [
            " ▴"
        ],
        [
            "1.41%"
        ],
        [
            "35.67"
        ],
        [
            "13.77"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "072246000"
        ],
        [
            "Sibonga"
        ],
        [
            "1.6%"
        ],
        [
            "53,424"
        ],
        [
            "43,641"
        ],
        [
            " ▴"
        ],
        [
            "2.04%"
        ],
        [
            "133.45"
        ],
        [
            "51.53"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "072247000"
        ],
        [
            "Sogod"
        ],
        [
            "1.2%"
        ],
        [
            "39,447"
        ],
        [
            "30,626"
        ],
        [
            " ▴"
        ],
        [
            "2.56%"
        ],
        [
            "119.23"
        ],
        [
            "46.03"
        ],
        [
            "330"
        ],
        [
            "860"
        ],
        [
            "072248000"
        ],
        [
            "Tabogon"
        ],
        [
            "1.2%"
        ],
        [
            "41,432"
        ],
        [
            "33,024"
        ],
        [
            " ▴"
        ],
        [
            "2.29%"
        ],
        [
            "101.35"
        ],
        [
            "39.13"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "072249000"
        ],
        [
            "Tabuelan"
        ],
        [
            "0.9%"
        ],
        [
            "28,907"
        ],
        [
            "22,292"
        ],
        [
            " ▴"
        ],
        [
            "2.63%"
        ],
        [
            "141.13"
        ],
        [
            "54.49"
        ],
        [
            "200"
        ],
        [
            "530"
        ],
        [
            "072250000"
        ],
        [
            "Talisay"
        ],
        [
            "7.9%"
        ],
        [
            "263,048"
        ],
        [
            "200,772"
        ],
        [
            " ▴"
        ],
        [
            "2.74%"
        ],
        [
            "39.87"
        ],
        [
            "15.39"
        ],
        [
            "6,600"
        ],
        [
            "17,000"
        ],
        [
            "072251000"
        ],
        [
            "Toledo"
        ],
        [
            "6.2%"
        ],
        [
            "207,314"
        ],
        [
            "157,078"
        ],
        [
            " ▴"
        ],
        [
            "2.81%"
        ],
        [
            "216.28"
        ],
        [
            "83.51"
        ],
        [
            "960"
        ],
        [
            "2,500"
        ],
        [
            "072252000"
        ],
        [
            "Tuburan"
        ],
        [
            "2.0%"
        ],
        [
            "68,167"
        ],
        [
            "58,914"
        ],
        [
            " ▴"
        ],
        [
            "1.47%"
        ],
        [
            "224.50"
        ],
        [
            "86.68"
        ],
        [
            "300"
        ],
        [
            "790"
        ],
        [
            "072253000"
        ],
        [
            "Tudela"
        ],
        [
            "0.3%"
        ],
        [
            "11,304"
        ],
        [
            "9,859"
        ],
        [
            " ▴"
        ],
        [
            "1.38%"
        ],
        [
            "33.02"
        ],
        [
            "12.75"
        ],
        [
            "340"
        ],
        [
            "890"
        ],
        [
            "TOTAL"
        ],
        [
            "3,325,385"
        ],
        [
            "2,619,362"
        ],
        [
            " ▴"
        ],
        [
            "2.41%"
        ],
        [
            "4,943.72"
        ],
        [
            "1,908.80"
        ],
        [
            "670"
        ],
        [
            "1,700"
        ],
        [
            "† Provincial capital     Highly Urbanized City     Municipality     Component city"
        ],
        [
            "Demographics"
        ],
        [
            "See also: Cebuano people and List of people from Cebu"
        ],
        [
            "Population census of CebuYearPop.±% p.a.1903 653,727—    1918 855,065+1.81%1939 1,068,078+1.06%1948 1,123,107+0.56%1960 1,332,847+1.44%YearPop.±% p.a.1970 1,170,386−1.29%1975 1,264,357+1.56%1980 1,410,346+2.21%1990 1,732,386+2.08%1995 1,890,357+1.65%YearPop.±% p.a.2000 2,160,569+2.91%2007 2,440,120+1.69%2010 2,619,362+2.61%2015 2,938,982+2.22%2020 3,325,385+2.46%Excludes independent citiesSource: Philippine Statistics Authority"
        ],
        [
            "The Basílica Minore del Santo Niño in Cebu, the first church built in the Philippines.",
            "Named by the Holy See as the \"Mother and Head... of all Churches of the Philippine Islands\"."
        ],
        [
            "The population of Cebu province, according to the 2020 Philippine census, was 3,325,385 with a density of 670 inhabitants per square kilometre or 1,700 inhabitants per square mile) – are included for geographical purposes, the total population is 5,151,274 people, with a population density of 964 inhabitants per square kilometre (2,498/sq mi)."
        ],
        [
            "The population of the Central Visayas is predominantly young with about 37 percent of its population below 10 years old.",
            "This is very evident in the very broad base of the population pyramid in the region which has prevailed since 1970 but at a declining rate.",
            "A decline of 2.29 percentage points in the proportion of household population below 15 years old was noted from 1980 to 1995.",
            "Conversely, an increase of 3.06 percentage points was observed in the 15–64 age group during the same period.",
            "The population of the region is evenly distributed between males and females.",
            "However, the male population in the region has been increasing at a faster rate compared to the female population."
        ],
        [
            "In 2010, the median age of the population of the province was 23.0 years, which means that half of the population was younger than 23.0 years.",
            "This is higher than the median age of 20.8 years that was recorded in 2000."
        ],
        [
            "Languages"
        ],
        [
            "See also: Cebuano language"
        ],
        [
            "Spoken Languages in Cebu Province"
        ],
        [
            "Languages"
        ],
        [
            "percentage"
        ],
        [
            "Cebuano/Bisaya/Binisaya/Boholano"
        ],
        [
            "98.8%"
        ],
        [
            "Hiligaynon"
        ],
        [
            "0.2%"
        ],
        [
            "Tagalog"
        ],
        [
            "0.2%"
        ],
        [
            "Others"
        ],
        [
            "0.8%"
        ],
        [
            "The Cebuano language is spoken in Cebu, which is also spoken in the rest of Central Visayas and most parts of Eastern Visayas, as well as most provinces of Mindanao."
        ],
        [
            "In the Camotes Islands, especially in Poro, people there speak their own Visayan language called Porohanon, which has Masbateño and Waray-Waray influences.",
            "Some of the residents in Bantayan islands also speak Bantayanon, a Visayan language related to Waray-Waray."
        ],
        [
            "Chinese Filipinos also speak Philippine Hokkien privately amongst fellow speakers in Cebu, while Mandarin (Standard Chinese) is also taught in Chinese class of Chinese Filipino schools."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Catholicism"
        ],
        [
            "The original image of Santo Niño de Cebú, an image of the Child Jesus given by Ferdinand Magellan to Queen Juana and to the Cebuanos after the First Baptism, now enshrined at the Minor Basilica."
        ],
        [
            "The majority of its population are Roman Catholic There are also followers of Iglesia Filipina Independiente, Islam, Buddhism and Hinduism."
        ],
        [
            "Cebu is the capital of the Catholic faith"
        ],
        [
            "The image of Santo Niño de Cebú (Holy Child of Cebu), the oldest Christian image in the Philippines, is enshrined and venerated at the Basilica Minore del Santo Niño.",
            "According to Philippine historical documents, the statue of the Santo Niño (Holy Child) was given to Queen Humamay (also referred to as Hara Amihan and Queen Juana), the wife of Rajah Humabon (also referred to as Rajah Carlos), the Rajah of Cebu by the Portuguese explorer Ferdinand Magellan.",
            "The Cebuanos' acceptance of Christianity is depicted in Cebu's cultural event, the Sinulog where street parades and loud drum beats preceded by a Christian Mass is celebrated every third Sunday of January.",
            "Cebu has a Roman Catholic Archdiocese and has several major churches, including the Basilica Minor del Santo Niño de Cebu, Cebu Metropolitan Cathedral, Santo Rosario Parish Church, San José–Recoletos Church, Sacred Heart Church, Archdiocesan Shrine of Our Lady of Lourdes, National Shrine of Our Lady of the Rule, National Shrine of Saint Joseph of Mandaue, Archdiocesan Shrine of Our Lady of Guadalupe of Cebu, San Nicolas de Tolentino Church, Archdiocesan Shrine of Patrocinio de Maria Santissima of Boljoon, and other Christian churches, as well as several other non-Catholic churches, mosques and temples."
        ],
        [
            "Government"
        ],
        [
            "Cebu Provincial Capitol is the government seat of province of Cebu."
        ],
        [
            "Gov.",
            "Gwen Garcia in 2011"
        ],
        [
            "Vice Gov.",
            "Hilario Davide in 2013"
        ],
        [
            "Governor: Gwendolyn Garcia (PDP–Laban/One Cebu/HNP)"
        ],
        [
            "Vice Governor: Hilario P. Davide III (LP/BAKUD)"
        ],
        [
            "Former governors of Cebu:"
        ],
        [
            "Julio Llorente  1900–1901"
        ],
        [
            "Juan Climaco  1902–1903"
        ],
        [
            "Sergio Osmeña 1904–1905"
        ],
        [
            "Dionisio Jakosalem  1907–1912"
        ],
        [
            "Manuel Roa 1912–1922"
        ],
        [
            "Arsenio Climaco  1923–1930"
        ],
        [
            "Mariano Jesus Cuenco  1931–1933"
        ],
        [
            "Sotero Cabahug  1934–1937"
        ],
        [
            "Buenaventura Rodriguez  1937–1940"
        ],
        [
            "Hilario Abellana 1941–1943"
        ],
        [
            "Jose Delgado 1943–1944"
        ],
        [
            "Jose Leyson 1944–1945"
        ],
        [
            "Fructuoso Cabahug 1945–1946"
        ],
        [
            "Manuel Cuenco 1946–1951"
        ],
        [
            "Sergio Osmeña, Jr.  1952–1955"
        ],
        [
            "Jose Briones 1956–1961"
        ],
        [
            "Francisco Remotigue 1961–1963"
        ],
        [
            "Rene Espina 1964–1969"
        ],
        [
            "Osmundo Rama 1969–1976, 1986–1988"
        ],
        [
            "Eduardo Gullas  1976–1986"
        ],
        [
            "Lito Osmeña  1988–1992"
        ],
        [
            "Vicente de la Serna 1992–1995"
        ],
        [
            "Pablo Garcia  1995–2004"
        ],
        [
            "Gwendolyn Garcia  2004–2013, 2019–"
        ],
        [
            "Hilario Davide III  2013–2019"
        ],
        [
            "^ a b c d Appointed"
        ],
        [
            "Congress"
        ],
        [
            "Main articles: Legislative districts of Cebu and 19th Congress of the Philippines § Membership"
        ],
        [
            "District"
        ],
        [
            "Representative"
        ],
        [
            "Party"
        ],
        [
            "Term"
        ],
        [
            "Bloc"
        ],
        [
            "1st"
        ],
        [
            "Rhea Mae Gullas"
        ],
        [
            "Nacionalista"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "2nd"
        ],
        [
            "Edsel Galeos"
        ],
        [
            "Lakas"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "3rd"
        ],
        [
            "Pablo John Garcia"
        ],
        [
            "NUP"
        ],
        [
            "2"
        ],
        [
            "Majority"
        ],
        [
            "4th"
        ],
        [
            "Janice Salimbangon"
        ],
        [
            "NUP"
        ],
        [
            "2"
        ],
        [
            "Majority"
        ],
        [
            "5th"
        ],
        [
            "Duke Frasco"
        ],
        [
            "NUP/1-Cebu"
        ],
        [
            "2"
        ],
        [
            "Majority"
        ],
        [
            "6th"
        ],
        [
            "Daphne Lagon"
        ],
        [
            "Lakas"
        ],
        [
            "1"
        ],
        [
            "Majority"
        ],
        [
            "7th"
        ],
        [
            "Peter John Calderon"
        ],
        [
            "NPC"
        ],
        [
            "2"
        ],
        [
            "Majority"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Cebu"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  30.41"
        ],
        [
            "2009  26.78"
        ],
        [
            "2012  22.69"
        ],
        [
            "2015  23.86"
        ],
        [
            "2018  14.76"
        ],
        [
            "2021  22.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "See also: Economy of the Philippines"
        ],
        [
            "Cebu City, although independent from Cebu Province (together with Mandaue and Lapu-Lapu City), is the largest city and economic hub of the island."
        ],
        [
            "\"Ceboom\", a combination of Cebu and boom, has been used to describe the province's economic development.",
            "With many beautiful islands, white sand beaches, luxury hotels and resorts, diving locations and heritage sites, high domestic and foreign tourist arrivals have fueled the tourism industry of Cebu.",
            "Cebu consistently gets a big share of tourist arrivals in the Philippines and has become the tourist gateway to Central and Southern Philippines due to its central geographic location, accessibility, and natural resources.",
            "The province also hosts various national and international conferences every year."
        ],
        [
            "About 80% of domestic and international shipping operators and shipbuilders in the Philippines are located in Cebu.",
            "Shipbuilding companies in Cebu have manufactured bulk carriers of up to 70,000 tonnes deadweight (DWT), and double-hulled fastcraft as well.",
            "Cebu's industry helps make the Philippines the 5th largest shipbuilding country in the world."
        ],
        [
            "Cebu's extensive port facilities and its proximity to intra-Asian shipping and air routes are major factors which led multinational companies to establish offices or factories on the main island, as well as in the island of Mactan, where they are clustered in special economic zones known as the Mactan Economic Processing Zone 1 (MEPZ-1) and the Mactan Economic Processing Zone 2 (MEPZ-2).",
            "Due to its burgeoning furniture-making industry, Cebu has been named as the furniture capital of the Philippines.",
            "Cebu's other exports include: fashion accessories, guitars, coconut, coconut oil, dried mangoes, carrageenan, gifts, toys, watches, cameras, electronic components, and housewares."
        ],
        [
            "With a revenue growth rate of 18.8 percent in 2012, the real estate industry is the fastest-growing sector in Cebu.",
            "With the strong economic indicators and high investors' confidence level, more condominium projects and hypermarkets are being developed in the locality.",
            "An additional 100 commercial and residential buildings would be completed by 2015 and another 170 to 200 buildings are expected to be finished by 2017.",
            "64 new hypermarkets will be developed in Cebu."
        ],
        [
            "In 2013, Cebu ranked 8th worldwide in the \"Top 100 BPO Destinations Report\" by global advisory firm, Tholons."
        ],
        [
            "Cebu's economy is also driven by the mining and quarrying areas in Toledo, Naga, Alcoy, and Danao."
        ],
        [
            "Cebu even boasts being a subsidiary of one of the leading ice rink manufacturers in the world.",
            "These rinks are engineered and fabricated in Cebu by Ice Rink Supply and shipped worldwide"
        ],
        [
            "Tourism is an important industry for the province.",
            "In 2019, Cebu welcomed 1.4 million foreign tourists, and is one of the most visited in the country by both domestic and foreign visitors.",
            "Cebu Island has also entered the list of Condé Nast Traveler's World's Best Islands rankings thrice: 2016, 2017 and 2019.",
            "Cebu City and Cebu Province, despite being administratively separated from each other, are often marketed as a single tourist destination, combining natural countryside scenery with urban attractions including cultural-historical sites and developing infrastructure."
        ],
        [
            "Infrastructure"
        ],
        [
            "Terminal 2 building of the Mactan–Cebu International Airport."
        ],
        [
            "The CCLEX Bridge, completed in 2022, is the longest sea-crossing bridge in the Philippines"
        ],
        [
            "Mactan–Cebu International Airport (MCIA) on the island of Mactan serves as the main gateway to domestic and international routes to or from Cebu City and other islands in the Visayas region.",
            "In the last 15 years, MCIA's passenger traffic has grown at an annual average of 21% for international passenger traffic.",
            "The airport is the second busiest airport in the Philippines in passenger and cargo traffic.",
            "The plan for a new terminal expansion of the airport is underway and estimated to cost $240 million under a public-private partnership program of the Philippine government.",
            "The new terminal will host international flights while the old terminal will host domestic flights."
        ],
        [
            "In addition, MCIA Authority (MCIAA) General Manager Nigel Paul Villarete also proposed to establish a Bus Rapid Transit (BRT) line to transport airport passengers to and from MCIAA and different parts of Cebu.",
            "This will be integrated into the proposed Bus Rapid Transit (BRT) System being planned in Metro Cebu."
        ],
        [
            "The Port of Cebu is the largest shipping hub in the Visayas region."
        ],
        [
            "Cebu Pacific Air is an airline owned by Cebu-based Gokongwei family.",
            "On May 28, 2008, Cebu Pacific was named as the world's number one airline in terms of growth.",
            "The airline carried a total of almost 5.5 million passengers in 2007, up 57.4% from 2006.",
            "Cebu Pacific commenced international long-haul flights to Middle East and Australia, flight to Guam starting Q1 2016."
        ],
        [
            "Notable business districts are the Cebu Business Park and the Cebu IT Park.",
            "This area hosts industries related to the information technology industry such as software development, telecommunications, engineering research and development centers, and business process outsourcing.",
            "In 2013, Ayala Corporation's affiliate, Ayala Land Inc., announced that it is looking at introducing another business park development within the Cebu City area to optimize the high performance of real estate investments in Cebu."
        ],
        [
            "The city's 300-hectare (740-acre; 3.0 km2; 3,000,000 m2) reclamation forms South Road Properties – a mixed-use development south of the city which features entertainment, leisure, residential and business-processing industries."
        ],
        [
            "and the University of the Philippines – Cebu campus."
        ],
        [
            "In Mactan Island, Megaworld Corporation's Mactan Newtown is a 25-hectare business park near Shangri-La's Mactan Resort and Spa.",
            "The project will be home to high-tech offices, a retail center, residential towers and villages, leisure facilities with a beach resort frontage."
        ],
        [
            "Mactan Island is linked to mainland Cebu via Mactan-Mandaue Bridge and Marcelo Fernan Bridge."
        ],
        [
            "Media"
        ],
        [
            "Cebu is home to a local television station, Cebu Catholic Television Network (CCTN)."
        ],
        [
            "Despite having their own local stations, Cebuanos prefer to watch the Philippines's several dominant television networks, namely: ABS-CBN, People's Television Network, IBC, TV5, CNN Philippines and GMA Network."
        ],
        [
            "While national newspapers have a presence on the island, Cebu has English-language local newspapers – The Freeman (under the Star Group), SunStar Cebu and Cebu Daily News (under the Inquirer Group): and Cebuano-language newspapers – SunStar SuperBalita owned by SunStar, and Banat News owned by The Freeman.",
            "Each of the local newspapers sell cheaper than their national counterparts."
        ],
        [
            "Education"
        ],
        [
            "Main article: List of colleges and universities in Metro Cebu"
        ],
        [
            "The Philippine elementary school begins from Grades 1 to 6.",
            "The high school program takes six years, from Grades 7 through to 12, taken after graduating from elementary school.",
            "Cebu is considered as the main education hub in the Visayas.",
            "It has eleven large universities each with a number of college branches mostly throughout the capital, Cebu City, and more than a dozen other schools and universities specializing in various courses such as Medicine, Engineering, Nautical courses, Nursing, Law, Commerce, Education, Computer and IT and other professions."
        ],
        [
            "The most prominent of these universities are (in alphabetical order):"
        ],
        [
            "Cebu Doctors University"
        ],
        [
            "Cebu Institute of Technology–University"
        ],
        [
            "Cebu Normal University"
        ],
        [
            "Cebu Technological University"
        ],
        [
            "Southwestern University"
        ],
        [
            "University of Cebu"
        ],
        [
            "University of San Carlos"
        ],
        [
            "University of San Jose–Recoletos"
        ],
        [
            "University of Southern Philippines Foundation"
        ],
        [
            "University of the Philippines Cebu"
        ],
        [
            "University of the Visayas"
        ],
        [
            "UV Gullas College of Medicine"
        ],
        [
            "Other notable institutions include: Asian College of Technology in Cebu City and Talisay, Benedicto College, Cebu Eastern College, Cebu Institute of Medicine, a medical school in affiliation with Velez College, The International Academy of Film and Television, established in Mactan in 2004 and Cebu's first film school, Matias H. Aznar Memorial College of Medicine,  Salazar Colleges of Science and Institute of Technology, among others."
        ],
        [
            "Cebu is home to one fully accredited international school, Cebu International School, a K–12 school established in 1924."
        ],
        [
            "Cebu is considered to be a hub of medical education, with many international students coming to study medicine in Cebu's medical schools.",
            "Some of Cebu's well-known medical schools are in Cebu Doctors University and Cebu Institute of Medicine."
        ],
        [
            "Tourism"
        ],
        [
            "Attractions"
        ],
        [
            "See also: Cebu City § Tourism"
        ],
        [
            "Cebu City is a significant cultural centre in the Philippines.",
            "The imprint of Spanish and Roman Catholic culture is evident.",
            "There are also many historically important sights all over the province."
        ],
        [
            "Magellan's Cross, Cebu City"
        ],
        [
            "Bagacay Point Lighthouse, Liloan"
        ],
        [
            "Bounty Beach, Malapascua Island, Daanbantayan"
        ],
        [
            "Boljoon Church, Boljoon"
        ],
        [
            "Carcar Museum (formerly Carcar Dispensary), Carcar"
        ],
        [
            "Cuisine"
        ],
        [
            "Cebu also has a great number of delicacies from every town.",
            "Much of the delicacies are either Precolonial or influenced by Spanish or Chinese cuisines."
        ],
        [
            "Cebu Lechon is one of the two types of lechon in the Philippines.",
            "It is served primarily around the Metro Cebu Area, particularly Talisay City, but is served throughout the island and other parts of the Visayas."
        ],
        [
            "Liempo is a variation of lechon that contains only the pork belly rather than a whole pig.",
            "In Cebu, it is served primarily in Balamban."
        ],
        [
            "Rosquillos are Philippine cookies that originate from Liloan."
        ],
        [
            "The Corazon Rosquillos, a special variety of Rosquillos from Titay's that has a heart-shaped hole instead of a circular one."
        ],
        [
            "Chicharon is a common Filipino Food that is made up of crispy fried pork rinds.",
            "In Cebu, it is commonly found in Carcar."
        ],
        [
            "Ampaw is a Cebuano snack made from fried white rice coated in syrup, usually with Peanuts inside.",
            "It originates from Carcar."
        ],
        [
            "Pusô is rice boiled in a woven pouch made from palm leaves.",
            "It is common all throughout the Visayas."
        ],
        [
            "Humbà is a braised pork dish from the Visayas.",
            "In Cebu, it is primarily served in Ronda."
        ],
        [
            "Otap is an oval-shaped puff pastry cookie that originates from Cebu."
        ],
        [
            "Masareal is a Cebuano delicacy that is made from a mixture of finely-ground boiled peanuts, coconut syrup (latík), and water.",
            "It originates from Mandaue."
        ],
        [
            "Pintos, also known as Binaki, is a Philippine steamed corn sweet tamales that is served in both Bukidnon and Cebu, particularly in Bogo."
        ],
        [
            "Tubâ, is a type of Philippine Coconut wine or \"toddy\" found in the Visayas.",
            "In Cebu, it is found in both Borbon and Argao."
        ],
        [
            "Significant dates"
        ],
        [
            "One of the Passus of the Good Friday procession of the Semana Santa of Bantayan showing St. Longinus piercing the side of the Body of Christ.",
            "Bantayan's Holy Week processions and practices are said to be the grandest in the Visayas.",
            "Bantayan is also the only town in the Philippines where fasting is not strictly observed during Holy Week."
        ],
        [
            "Cebu Provincial Charter Day"
        ],
        [
            "The province celebrates its charterhood August 6th each year.",
            "It is considered a special non-working holiday throughout the entire province, including the three independent city states."
        ],
        [
            "During the monthly celebration of Cebu's provincial charterhood, the province hosts a variety of events in line with the aim for unity among all Cebuanos.",
            "As part of the Founding Anniversary Celebration of the province, the capitol hosts the Tabo sa Kapitolyo, a provincial trade fair that features all the products, delicacies, and other specialties from each City and Municipality in the province.",
            "The province also hosts the Pasigarbo sa Sugbo Festival of Festivals, a celebration that showcases all festivals from every town of Cebu and is meant to highlight the culture, history, traditions, and way of life of all Cebuanos."
        ],
        [
            "Semana Santa sa Bantayan"
        ],
        [
            "The Semana Santa of Bantayan is the local Holy Week celebration in the town of Bantayan.",
            "It is largely considered the grandest celebration of Holy Week in the Visayas.",
            "The celebration features lifelike Passus depicting the Passion and Death of Jesus on top of intricate caroes that are paraded throughout the entire town."
        ],
        [
            "One thing that makes the Holy Week and Lenten Celebration of Bantayan unique from other Holy Week observations of other parts of Cebu and the Philippines (and, quite possibly, the world) is that traditional Lenten Fast is not strictly observed during Holy Week.",
            "This is because the town of Bantayan has received an exemption from the traditional Lenten fast directly from the Vatican.",
            "The exemption or special permission dated July 27, 1824, which is formally known as “Bantayan Indult”, was signed by Pope Leo XII himself.",
            "The Bantayan Indult was given through Padre Doroteo Andrada Del Rosario and allows the consumption of meat on days of fasting and obligation.",
            "The original document is being kept at the Bantayan Museum in Bantayan Island."
        ],
        [
            "There are several speculations as to why the town made the request for an indult.",
            "The most probable reason for having this indult is because people in the town would usually avoid fishing during Holy Week.",
            "This is likely because, at the time, all forms of work was prohibited, including fishing and aquaculture.",
            "Without anyone supplying fish, the only allowed meat for fasting, to the town, the Bantayanons were left with no choice but to eat the meat that is normally prohibited in Lent.",
            "There is also another reason for this based on folk beliefs.",
            "Because of the local belief that evil powers and malignant entities are stronger during Good Friday, the day of the death of Jesus, the fishermen of the town would deem it too unsafe to fish, in fear that an evil presence will come upon them at sea."
        ],
        [
            "In truth, the indult has long expired and is no longer valid, however, Bantayanons today still practice eating the usually forbidden meat during Holy Week as it has already become part of their Lenten traditions."
        ],
        [
            "Gabii sa Kabilin"
        ],
        [
            "Translating to \"Heritage Night\", it is a program initiated by the Ramon Aboitiz Foundation Incorporated in 2007.",
            "Gabii sa Kabilin is an event that aims to help preserve Cebu's rich history, culture and heritage, by encouraging the public to visit the different museums and heritage structures of Cebu.",
            "For one night, all the museums and heritage structures of Cebu all open their doors for all people in order for them to learn about the history of Cebu, as well as its heritage and cultural legacy.",
            "Although most of the heritage locations that participate in the heritage night are from Cebu City, there are also other locations that are from the other parts of the province.",
            "Museo Sugbo, the provincial museum, and the National Museum of the Philippines of Cebu are among the participating museums of Gabii sa Kabilin."
        ],
        [
            "Festivals"
        ],
        [
            "Sinulog"
        ],
        [
            "Main article: Sinulog"
        ],
        [
            "Sinulog's annual maritime procession."
        ],
        [
            "A typical Sinulog Festival Queen with the image of the Child Jesus, locally known as Santo Niño, dancing with her contingent from Plaridel, Misamis Occidental during the festival in Cebu."
        ],
        [
            "A Sinulog Festival Queen with the Child Jesus, together with her contingent from Toledo City."
        ],
        [
            "The Sinulog Festival is the largest fiesta (festival) in the Philippines.",
            "Held every third Sunday of January, it commemorates the Child Jesus (Santo Niño), the Lord and Protector of Cebu.",
            "The Sinulog is a dance ritual of pre-Hispanic indigenous origin.",
            "The dancer moves two steps forward and one step backward to the rhythmic sound of drums.",
            "This movement resembles the current (sulog) of what was then known as Cebu's Pahina River.",
            "Thus the name Sinulog."
        ],
        [
            "The Sinulog Festival celebration lasts for nine days, culminating on the final day with the Sinulog Grand Parade.",
            "The day before the parade, the Fluvial Procession is held at dawn with a statue of the Santo Niño carried on a pump boat from Mandaue City to Cebu City, decked with hundreds of flowers and candles.",
            "The procession ends at the Basilica where a re-enactment of the Christianization of the Philippines on the island of Cebu is performed.",
            "In the afternoon, a more solemn procession takes place along the major streets of the city, which last for hours due to large crowds participating in the event."
        ],
        [
            "When the Spaniards arrived in Cebu, the Italian chronicler, Antonio Pigafetta, sailing under convoy with the Magellan expedition, offered the wooden figure of the Santo Niño as a baptismal gift to Hara Amihan, wife of Rajah Humabon who was named Juana after her baptism together with the Rajah, who was also renamed, Carlos.",
            "Juana, together with the natives, according to tradition, danced and worshipped the Santo Niño de Cebu in their indigenous Sinulog dance ritual.."
        ],
        [
            "In the province, the festival is shared by both Cebu City and Carmen.",
            "The festival is said to have originated in Carmen and was once a localized version of the Ati-atihan Festival introduced by Jose Motos, the then rector of the Parish of St. Augustine, the town parish of Carmen, but was then changed to \"Sinulog sa Carmen\" after Sinulog became an established Cebuano festival.",
            "The Sinulog dance was first introduced to Cebu City by a woman named Estelita Diola, who would otherwise be referred to as \"Titang Diola\".",
            "Her family was skilled with the original form of the dance of Sinulog and the tradition was eventually passed on to her by her father.",
            "Because of her great contribution and propagation of the Sinulog dance of Cebu, she was referred to as the \"Heritage Keeper\".",
            "The original Sinulog dance and her legacy of devotion to the Child Jesus through dancing continues today even after her death and is still continued through her former students who now teach the youth of Cebu the original dance moves of Sinulog.",
            "Sinulog had since very much diversified from the original dance of Titang Diola.",
            "Today we can see the Sinulog danced every day at the Basilica Minore del Santo Niño performed by the candle vendors.",
            "The version they perform is called \"Sinug\" and is only for worship and prayer to bless the candles for prayers to the Holy Child.",
            "The Sinulog Festival dance performed by contingents in the City Sports Center is still religious and devotional since dancers often include personal supplications, petitions, thanksgivings, intercessions, or any other prayers in their dance for the Child Jesus and their dance performances in street dance and ritual showdown are still centered on the Holy Child.",
            "There are mainly two types of Sinulog dances performed in the festival, namely the \"Sinulog-Based Category\" and the \"Free Interpretation Category\".",
            "The Sinulog-Based Category refers to the Sinulog dance based on the Church Sinulog performed by candle vendors while the Free Interpretation Category refers to the Sinulog dance interpreted in any way, outside Church Sinulog, for as long as it is acceptable in the festival.",
            "In recent years, the festival gained commercialization which made the festival and Cebu popular, but unfortunately lessened the religious nature of the festival.",
            "Despite the extreme commercialization of the festival, Sinulog still remains to be a religious festival for the faithful.",
            "Sinulog still remains to be a dance of prayer.",
            "The festival is officially governed by the Sinulog Foundation Incorporated (SFI).",
            "The foundation maintains that, although Sinulog has largely become mainstream, it remains a religious festival because at the heart of the Sinulog is the Santo Niño.",
            "The foundation has made this point clear in many instances, such as the correction of the wrongful term \"Sinulog Grand Mardi Gras\" to \"Sinulog Grand Parade\" as the focus was not on the fanfare but the worship to the Child Jesus."
        ],
        [
            "In the 1980s and 2000s, the city authorities of Cebu added the religious feast of Santo Niño de Cebu during the Sinulog Festival to its cultural event.",
            "Despite being a religious festival and a Christian festival, Sinulog has come to be a celebration for all Cebuanos and Filipinos regardless of their faith and practices.",
            "Aside from its religious nature, Sinulog has also become renowned for its street parties.",
            "In 2012, Cebu introduced Life Dance, the biggest outdoor dance party in the Philippines.",
            "The Sinulog street parties are considered a major attraction for youth individuals but, in most cases for most people, particularly the faithful, a growing problem that threatens the religiosity and solemnity of the festival.",
            "In 2016, the festival had the worst recorded case of a stampede wherein large groups of people, both worshippers and drunken party-goers, were congested in the uptown area, with no passable exit routes and virtually no crowd control up until midnight and with one recorded case of a teenage woman losing consciousness because of cramped spaces.",
            "Due to this incident, the then Cebu City Mayor Tomas Osmeña enforced a strict liquor ban in the following festivals during his term to ensure the safety of the worshippers and spectators and to maintain the solemnity of the celebration."
        ],
        [
            "The festival was halted for two years (2021 - 2022).",
            "In 2021, the main reason for halting the festival was because of the COVID-19 pandemic.",
            "The Vice Mayor of Cebu at the time, Michael Rama, who was the-then chairperson of the SFI, insisted on having a Sinulog Festival that year, despite health concerns from health experts and the police from Cebu City.",
            "This came shortly after Cebu City's then Mayor, the late Edgardo Labella, dissolving the Sinulog Governing Body (SGB), which Rama protested against through his resignation from the foundation, and reinstating him as chairperson of the SFI.",
            "Rama cited that the venue of that year's supposed festival was at the parking lot of SM Seaside City Cebu and would be in a \"bubble environment\" without a live audience.",
            "He even went as far as to limit the number of dancers and the propsmen.",
            "He continued to insist on holding the festival, largely against the behest of the Cebuanos.",
            "Various health workers and police officials stated that even though the dancers were isolated, the fact that there were multiple individuals gathering in a closed environment, and in close contact with each other, was already a \"direct violation of the health protocols\".",
            "This also included the gathering of dancers during their practices.",
            "As a result, several dancers from various contingents in Cebu City tested positive for COVID-19 and most of the infected individuals showed the common symptoms.",
            "This led to Rama officially retracting his movement for Sinulog 2021.",
            "However, the other minor related competitions of the Sinulog, such as the Search for the Sinulog Festival Queen were still pushed through.",
            "The festival was slated for a comeback in 2022, but was again cancelled due to the aftermath of Super Typhoon Odette, which ravaged Cebu and nearby islands.",
            "Sinulog eventually was celebrated again in 2023, but was met with controversy.",
            "Rama, who is currently the mayor of Cebu City, decided to move the festival from its usual venue at the Cebu City Sports Complex to Citi di Mare at the South Road Properties.",
            "This was met with flak by the Cebuanos as, not only was the Sports Complex the established venue of the festival, but also because the festival was to be moved to a major road that is an important passageway for travellers going from the North to the South and back.",
            "Initially, the provincial governor, Gwendolyn Garcia, was not against the move to change the venue of the Sinulog, but immediately changed her mind after she had seen pictures from a newspaper photographer of provincial Sinulog contingents having blockings for their dances in the new venue for the Sinulog which was deeply covered in mud and was completely unfinished.",
            "Feeling pity for the dancers, she made the decision to remove the provincial contingents from the grand parade, unless Rama would return the festival to the old venue.",
            "Unfortunately, Rama continued insisting on having the Sinulog in SRP and the festival was indeed pushed through in the new venue without the provincial contingents.",
            "Not only was the quality of the festival much more lack-luster than it usually was, but there was also heavy traffic during and immediately after the festival as the North and Southbound travelers had to go through the much tighter roads of the city.",
            "The provincial contingents, however, did perform in the Sinulog Festival in Carmen that year, which was also the 50th anniversary of the festival in their town.",
            "The festival, for the first time, had two major parades in 2024.",
            "The \"Sinulog sa Lalawigan\", which was originally the preliminary competition \"Sinulog sa Kabataan sa Lalawigan\", was transformed into a Sinulog parade for provincial contingents since they could not, once again, dance in SRP.",
            "The Sinulog sa Lalawigan was held in the CCSC, the old venue of Sinulog.",
            "The other contingents from Cebu City and out-of-town danced in the Sinulog parade on the 3rd Sunday of January in SRP."
        ],
        [
            "Kadaugan sa Mactan"
        ],
        [
            "Literally translates to the \"Victory in Mactan\", this is a historical festival reenactment of the Battle of Mactan.",
            "Celebrated canonically on April 27, it depicts the events before, during, and immediately after the defeat of Portuguese Navigator Ferdinand Magellan at the hands of Lapu-lapu and his men.",
            "Much of the historical activities take place in Mactan Shrine, the site of the Battle of Mactan.",
            "Usually, in the Kadaugan sa Mactan, Filipino celebrities, especially celebrities of Cebuano origin, are chosen to portray the key characters of the events of the Battle of Mactan (specifically Lapu-lapu, his wife Reyna Bulakna, and Magellan).",
            "This is typically a week-long celebration and culminates with the Rampada Festival, a stylized contemporary reenactment of the victory celebration after the battle in Mactan, incorporating Latin and ballroom dances and steps.",
            "Despite the Sinulog Festival being more popular by comparison, the Kadaugan had already been established as a festival of Cebu and its culture and history long before Sinulog was an established festival."
        ],
        [
            "Pasigarbo sa Sugbo"
        ],
        [
            "Literally translates to the \"Celebration in Cebu\", this Festival is a relatively new festival in Cebu, conceptualized in 2008.",
            "This festival was the \"Brainchild\" of Cebu's first female governor, Gwendolyn Garcia.",
            "This festival was a program and a major tourism endeavor initiated by the governor in order to promote Cebu as an entire province and to celebrate Cebu in its culture, faith, history, and continuous advancement.",
            "In this festival, each individual town in Cebu is encouraged to showcase a theme, a product, a festival, or something unique from their place.",
            "Despite, in itself, not being a religious festival, praise, thanksgiving, and worship to God, as well as devotion to the patron saints of each town of Cebu is also given emphasis in the festival (as hinted in the category for portable processional platforms for patron saints or Best in Andas category).",
            "Unlike the Sinulog Festival, which is limited to two major categories (Sinulog-based and Free Interpretation), Participants of Pasigarbo are given more freedom in the interpretation of the culture, faith, history, and products of their hometowns.",
            "Ever since its conception, the festival had been celebrated yearly at the Cebu International Convention Center (CICC) in Mandaue, around the date of the Provincial Charter Day of Cebu, which is celebrated every August 6, however, was ceased after 2012.",
            "This was largely due to the 2013 Bohol earthquake, which also heavily affected Cebu, as well as the lack of support from the provincial government for both the repair of the CICC and the festival itself.",
            "This was mainly because Garcia was no longer in position as governor at the time.",
            "Fortunately, the festival was recently relaunched in 2019, less than a month after Garcia's return to the provincial seat.",
            "Unlike previous celebrations, the 2019 Pasigarbo, due to the abandoned state of the CICC, was celebrated, much like the Sinulog Festival, in the Cebu City Sports Complex.",
            "As per its return, it has established itself once more as a provincial festival and a new addition to Cebu's prime festivals and significant dates, together with the Sinulog Festival and the Kadaugan sa Mactan.",
            "The festival was also halted in 2021 because of the COVID-19 pandemic but returned the following year in 2022.",
            "In 2022, the festival was the grandest it had ever been and was even participated by the festivals of all three independent city states (Sinulog Festival of Cebu City, Panagtagbo Festival of Mandaue City, and the Garbo Festival of Lapu-lapu City), with cities Cebu and Lapu-lapu being guest performers.",
            "The festival was again moved to the Carcar City Sports Complex that year.",
            "This was due to the ongoing renovation of the Cebu City Sports Complex, its usual venue.",
            "The move to Carcar City, was initially a very openly accepted one, however, the festival was marred by various technical difficulties on the day of the Pasigarbo sa Sugbo.",
            "Among the major problems during the festival proper was the sound glitches in certain festival jingles and in the Mayor's introductory videos, which was a new feature in this particular festival celebration.",
            "The sound glitches consisted mostly of sudden stops of the music of each festival performance, either as just a random audio cut or a complete loss of music.",
            "Governor Garcia publicly accused the sounds and lights provider for allegedly \"sabotaging\" the festival in most of the occurrences of a sound glitch.",
            "This accusation of a sabotage from the sounds and lights company head was largely due to the alleged nondisclosure that his daughter was a contestant for festival queen, who was also originally hailed as the Pasigarbo sa Sugbo Festival queen that year, with her contingent being the original champion.",
            "Though his daughter was chosen to be festival queen by the Carcar City Government for being the reigning Kabkaban Festival Queen at that time, the governor still insisted that this was a sabotage on his part under the reason that he had not fully disclosed his daughter's participation in the festival.",
            "This resulted in the postponement of the awarding ceremonies for that year's festival and a re-tabulation of the scoresheets of each festival.",
            "This further resulted in the candidate from Carcar losing her crown and the Kabkaban Festival contingent from Carcar losing their championship and being demoted to 6th place.",
            "The new festival queen was the candidate from Cordova and the new champion was the Sugat Kabanhawan Festival contingent from Minglanilla.",
            "The awarding ceremonies were held two months after the actual festival in the Cebu Technological University-Dumanjug Campus.",
            "The festival will be moved back to CCSC this year."
        ],
        [
            "Red Lantern Festival"
        ],
        [
            "Another festival in Cebu City which annual celebration of Chinese New Year ."
        ],
        [
            "Other Festivals"
        ],
        [
            "It has been suggested that this section be split out  into another article titled Festivals of Cebu.",
            "(Discuss) (April 2023)"
        ],
        [
            "Panagtagbo sa Mandaue"
        ],
        [
            "This is a religious festival from Mandaue City that is in honor of the Holy Family and is greatly inspired from and is associated directly with the religious activities of the Sinulog Festival.",
            "The name of the festival is the Cebuano term for \"gathering\".",
            "This is because the festival celebrates the Translacion (Transfer of Relic) of the Santo Niño de Cebu and Our Lady of Guadalupe to the National Shrine of St. Joseph, the patron saint of Mandaue.",
            "It replaced the Mantawi Festival as the festival of Mandaue.",
            "The Festival is celebrated on the Thursday before the Sinulog Festival or the day before the Translacion which marks the start of the Triduum of the \"Fiesta Señor\" activities."
        ],
        [
            "Sugat Kabanhawan"
        ],
        [
            "Sugat Kabanhawan Festival dancers performing their street dance on Easter Sunday, 2019."
        ],
        [
            "This is the Easter Festival of Minglanilla.",
            "It is held in honor of Jesus Christ as the \"Risen Lord\".",
            "It celebrates the mystery of the Resurrection of Jesus and the traditional belief of the faithful in Christ's apparition to the Blessed Virgin Mary in a private revelation in order to reveal to her that He had risen from the dead and is truly God.",
            "The festival's name is taken from the term Sugat (Cebuano) or Salubong (Filipino) which is a traditional practice during Easter Vigils wherein an image of Christ is shown before an image of the Virgin Mary that is covered in a black veil to show her mourning and sadness, which is then lifted by angels, exposing the Virgin Mary with unspeakable joy at the Resurrection of Jesus.",
            "The second part of the name is the Cebuano word for \"resurrection\", which is timely for the religious celebration.",
            "The festival is centered on the life of Jesus, as well as Christian Morals and Values, with both themes being heavily incorporated in the performances of the dancers in the festival.",
            "This festival has gained Minglanilla the title as the \"Easter Capital of Cebu\"."
        ],
        [
            "Kabkaban"
        ],
        [
            "The Kabkaban Festival is the local religious festival of the City of Carcar in honor of St. Catherine of Alexandria.",
            "The festival's name was the old name of Carcar, which was taken from Kabkab (\"Kabkaban\" for plural), the local term for the Oakleaf Fern (Aglaomorpha quercifolia).",
            "The festival celebrates Carcar, as well as the Carcaranon way of life and the town's culture, faith, and musical history.",
            "Much of the dance steps used in the Kabkaban dance were taken and inspired directly from the dance moves used in the Sinulog Festival and other Sinulog dance offerings by the Sandiego Family with their company, the \"Sandiego Dance Company\", headed by Val Sandiego, a native of Carcar who is also considered as the \"Father of Kabkaban\".",
            "The inspiration from the dance company is also evident in the costumes used by the dancers of the Kabkaban Festival, as well as dancers representing Carcar in the Sinulog Festival or other festivals like the Pasigarbo sa Sugbo Festival of Festivals.",
            "The Kabkaban festival is celebrated from the 23rd until November 25, in line with the feast day of the town's patron saint."
        ],
        [
            "La Torta"
        ],
        [
            "The La Torta Festival is Argao's food festival.",
            "It is in honor of St. Michael the Archangel.",
            "It replaced Argao's former festival, the \"Pitlagong Festival\" in 2011.",
            "It celebrates the Torta, a Cebuano tart-like cake that is reminiscent of the Spanish cake, but distinct in its recipe as it uses Tubâ or coconut wine as a rising agent instead of yeast.",
            "Because Argao is one of Cebu's Spanish Towns (the other being Liloan), dancers in the La Torta Festival wear Spanish inspired costumes that usually have a red motif to them and dance Spanish dance steps or Spanish-inspired dance steps.",
            "It is celebrated on September 28 to 29 to coincide with the feast of the archangels."
        ],
        [
            "Dagitab"
        ],
        [
            "The Dagitab Festival is Naga's Christmas Festival.",
            "It is in honor of St. Francis of Assisi.",
            "The name of the festival means \"electric light\" which is what Naga is known for, particularly during the Holidays.",
            "During December, Naga's streets, parks, and buildings are lit with all sorts of bright lights of different colors to mark the Holiday Season.",
            "But these bright lights come at a cost, power outages.",
            "To resolve this problem, Gov.",
            "Gwen Garcia, together with the province of Cebu, set up another electric company to supply electricity in the town.",
            "The onset of electric advancements and greater connection initiated the start of the industrialization of Naga.",
            "The industrial movement is also one of the focuses of the festival.",
            "Dancers in the Dagitab Festival wear and incorporate LED lights/lamps in their lively performances to bring the Holiday Spirit to everyone and to celebrate the advancement of the city.",
            "This festival has gained Naga the titles of being the \"Christmas Capital of Cebu\" and the \"Industrial Hub of the South\".",
            "Despite being in honor of St. Francis, whose feast day is on October 4, the festival is celebrated on December 23 which is two days before Christmas Day."
        ],
        [
            "Halad Inasal"
        ],
        [
            "Halad Inasal Festival dancers performing their street dance in 2019."
        ],
        [
            "The Halad Inasal Festival is Talisay's food festival.",
            "It is in honor of St. Teresa of Avila.",
            "The name of the festival is taken from the Cebuano words Halad, which means offering, and Inasal, which refers to the local term for Lechon or Philippine Roasted Pig.",
            "Cebu is well known for producing Lechon Inasal and has two towns that are dedicated \"Lechon Towns\" with one being Talisay (the other being Carcar).",
            "The festival was formerly called simply the \"Inasal Festival\", but was renamed as \"Halad Inasal Festival\" to highlight the religiosity of the festival.",
            "In the Halad Inasal Festival, dancers and participants parade freshly roasted and crunchy Inasal in the streets of Talisay while they perform their dance offerings and bring them even while they perform their ritual showdown.",
            "It is celebrated around, but never directly on October 15, the feast of St. Teresa, so as not to interfere with the religious activities of the town feast."
        ],
        [
            "Bonga"
        ],
        [
            "The Bonga Festival is the Harvest Festival of Sibonga.",
            "It is in honor of the town's two patron saints, St. Philomena and Our Lady of the Pillar.",
            "The name of the festival is the Cebuano word for \"fruit\".",
            "It is a festival of thanksgiving for the bountiful fruit harvest during the harvest season of the town.",
            "It is celebrated on October 12, in line with the feast of the original patroness of the town, the Blessed Virgin.",
            "The festival has given the town its very own title as the \"Fruit Basket of Cebu\"."
        ],
        [
            "Rosquillos (Festival)"
        ],
        [
            "Rosquillos Festival dancers as they perform their street dance in Pasigarbo sa Sugbo 2019."
        ],
        [
            "The Rosquillos festival is the food festival of Liloan.",
            "It is in honor of St. Ferdinand of Castille.",
            "It celebrates the Rosquillos, a Philippine ring type cookie that originated from Liloan.",
            "The cookie was conceptualized and conceived by a woman named Titay Frasco, who was the founder of Titay's, the largest chain company of Rosquillos in the Philippines.",
            "It is celebrated on May 30."
        ],
        [
            "Kagasangan"
        ],
        [
            "This is the sea festival of Moalboal.",
            "It is in honor of St. John of Nepomuk.",
            "The name of the festival is taken from the Cebuano term for \"coral reefs\".",
            "It is a nature-tourism project initiated by the local government made to preserve the reefs of the town, which are viable sources of livelihood and eco-tourism.",
            "This is one of the known sea festivals in the province of Cebu.",
            "It is celebrated on May 16."
        ],
        [
            "Utanon"
        ],
        [
            "Utanon Festival dancers in Pasigarbo sa Sugbo 2019."
        ],
        [
            "The Utanon Festival of Dalaguete, is the town's harvest festival.",
            "It is in honor of St. William the Hermit.",
            "The name of the festival is the Cebuano word for \"vegetables\".",
            "It is a festival about showing thanksgiving for the bountiful harvest of vegetables in the town, all year round.",
            "It is celebrated on February 10.",
            "The festival has helped acknowledge the town as a producer of grain and vegetable crops, giving the town the title as the \"Salad Bowl of Cebu\"."
        ],
        [
            "Siloy"
        ],
        [
            "The Siloy Festival is Alcoy's nature festival and eco-tourism project.",
            "It is in honor of St. Rose of Lima.",
            "The festival takes its name from the local term of the Black Shama Bird (Copsychus Cebuensis), a local species of song bird only found in Cebu, with its last stronghold in Alcoy's rainforest and woody areas.",
            "The festival is a project meant to promote awareness of the Black Shama and its endangered nature and to help preserve Cebu's endemic Shama species of birds, as well to help save Mother Earth.",
            "It is celebrated on August 23 every year."
        ],
        [
            "Palawod"
        ],
        [
            "The Palawod Festival Queen representing Bantayan together with her contingent in Pasigarbo sa Sugbo 2019."
        ],
        [
            "The Palawod Festival is the sea festival of Bantayan.",
            "It is in honor of Sts.",
            "Peter and Paul, who are both the town's patron saints.",
            "The festival's name means \"to voyage into deep waters\".",
            "The Palawod dance has four basic steps, namely, Sulo (Torch), Bugsay (Paddle), Silik (Fins), and Isda (Fish).",
            "These are all a mimesis of the fishing practices of the Bantayanons.",
            "This is a festival of thanksgiving for the bountiful catch and for the abundance of the sea and its bounty.",
            "It is celebrated on the 29th of the month of June to be connected with the Solemnity of Sts.",
            "Peter and Paul."
        ],
        [
            "Tostado"
        ],
        [
            "The Tostado festival is the food festival of Santander.",
            "It is in honor of St. Gabriel the Archangel.",
            "It celebrates the Tostado, a Cebuano shortbread cookie that is shaped like a flower.",
            "The local economy had been heavily boosted thanks to the Tostado cookie, which had provided job opportunities for many people.",
            "This festival also celebrates the resources of the town.",
            "It is celebrated on the 3rd Sunday of April."
        ],
        [
            "Isda"
        ],
        [
            "This is the sea festival and town fiesta of Madridejos.",
            "It is in honor of the Immaculate Conception.",
            "The name of the festival is the Cebuano word for \"fish\".",
            "It celebrates the bountiful catch and the abundance of fish species and other marine life in the area.",
            "It is celebrated on December 8, which is also the Solemnity of the Immaculate Conception of the Blessed Virgin Mary."
        ],
        [
            "Banig"
        ],
        [
            "This is the weaving festival of Badian.",
            "It is in honor of St. James the Great.",
            "It celebrates the Banig, a hand-woven Philippine mat made from Pandanus leaves that is commonly sold, in the province, in Badian.",
            "It is celebrated on the 25th of the month of April."
        ],
        [
            "Hinulawan"
        ],
        [
            "This is the town fiesta of Toledo.",
            "It is in honor of St. John of Sahagun.",
            "The name of this festival is an amalgamation of two Cebuano words, Hinaguan, which means \"fruits of labor\", and Bulawan, which means \"bright\" or \"golden\".",
            "This was, historically, the old name of the town.",
            "Currently, it is the name of a river that is found in the town.",
            "Hinulawan Festival celebrates the rich culture and history of the town, as well as the golden hearts and the shining and welcoming personality of the Toledohanons.",
            "It falls on June 12, which coincides with the Philippine Independence Day celebration."
        ],
        [
            "Toslob"
        ],
        [
            "Originally called the \"Sadsad Festival\", this is the local festival of Oslob.",
            "Like the Isda Festival, It is in honor of the Immaculate Conception.",
            "The name of the festival is the Cebuano term for the act of \"dipping\".",
            "The name of the festival is a reference to the etymology of the name of the town wherein two Spanish soldiers mistakenly identified the town after asking a couple who, due to misinterpretation, thought they were referring to what they were doing.",
            "The couple did not understand that the soldiers were asking for the name of the town and simply thought they were referring to the boiled bananas they were dipping in salted vinegar so all they could utter was \"Toslob\".",
            "The soldiers seemingly also misheard them and thought they said \"Oslob\".",
            "Ever since then, the town was referred to by that name which the Spanish Soldiers heard.",
            "The Toslob festival is a celebration of thanksgiving for the graces received as a town community.",
            "It is celebrated on December 8, which is also the Solemnity of the Immaculate Conception of the Blessed Virgin Mary."
        ],
        [
            "Pamuhuan/Pinamuohan"
        ],
        [
            "This is the harvest festival of Pinamungajan.",
            "It is in honor of St. Monica.",
            "The name of the festival came from the Cebuano word, Pinamuhuan, which means \"a worker's share of the harvest\".",
            "It is a celebration of thanksgiving for the bountiful harvest in the town.",
            "It is celebrated on August 27."
        ],
        [
            "Lalin"
        ],
        [
            "This is the town fiesta of Asturias.",
            "It is in honor of St. Roch.",
            "The name of the festival comes from the Cebuano word which refers to the combination of cultures of different people.",
            "The festival's name was taken from the old name of the town, which was Naghalin.",
            "The town was called \"Naghalin\" because it was a place where migrants settled and formed a neighborhood.",
            "The neighborhood soon flourished into a community and a town of Cebu.",
            "This festival is a celebration of thanksgiving for the graces received by the town and the community.",
            "It is celebrated on August 16."
        ],
        [
            "Panagsogod"
        ],
        [
            "This is the town fiesta of Sogod.",
            "It is in honor of St. James the Great.",
            "The name of the festival is taken from the Cebuano word for \"Beginning\" and is a reference to the town being the \"place of origin of the North and the South\" or \"where the North and the South meet\".",
            "This is because the shoreline of Sogod is composed of half white sand from the North of Cebu and half black sand from the South.",
            "It is a celebration of happy endings and new beginnings every year.",
            "It is celebrated on the 25th of the month of April."
        ],
        [
            "Sarok (Festival)"
        ],
        [
            "Sarok Festival dancers performing their street dance together with their Sarok hats in 2024."
        ],
        [
            "The Sarok Festival is the town fiesta of Consolacion.",
            "It is in honor of St. Narcissus.",
            "It celebrates the Sarok, a Cebuano variant of the Salakot that is made of woven Stalks from the Nito plant (Lygodium Circinnatum) and/or dried leaves or Bamboo, creating a patterned net-like structure, with a signature six-petal flower design made from lighter leaves or thin Bamboo wood plates secured at the very top of the hat.",
            "It is celebrated every February 14 (coinciding with Valentines Day), in commemoration of Consolacion's Founding Anniversary."
        ],
        [
            "Tagbo"
        ],
        [
            "This festival is the town fiesta of Poro.",
            "The festival is patterned after Sinulog and is also in honor of the Santo Niño.",
            "The name of the festival is the Cebuano word for the act of \"meeting\", or \"to meet\".",
            "This is taken from the history of the town of Poro, wherein two warring tribes met together on one spot to make a community, eventually forming the town of Poro.",
            "It is celebrated on January 19."
        ],
        [
            "Tubod"
        ],
        [
            "This is the town fiesta of Tuburan.",
            "It is in honor of St. Anthony of Padua.",
            "The name of the festival is the Cebuano word for \"Spring\".",
            "It celebrates the 7 springs of Tuburan, which are said to be the tears of fairies who continue to cry today, yearning and waiting for their lovers to return.",
            "The springs have become the main tourist attractions of Tuburan and have placed the town on the map.",
            "It is celebrated on June 13"
        ],
        [
            "Katubhan"
        ],
        [
            "This is the harvest festival Medellin.",
            "It was formerly Medellin's Sinulog Festival, but was changed to its own festival to make it distinct from Sinulog and to focus on the main products of the town, Sugarcane and Sugar.",
            "However, it is still in honor of Santo Niño.",
            "The name of the festival is taken from the Cebuano term for \"sugarcane plantation\".",
            "It is a festival meant to be a thanksgiving to the Child Jesus for the bountiful harvest of sugarcane all year round.",
            "The sugarcane has become so abundant in the town that Medellin has received the title as \"The Sugar Bowl of Cebu\".",
            "It is celebrated every April 27."
        ],
        [
            "Panuhog"
        ],
        [
            "This is the sea festival of Santa Fe.",
            "It replaced the \"Puting Baybay\" Festival as the official town fiesta.",
            "It was also formerly the Sinulog festival of the town, but was changed to its own distinct festival.",
            "Like Sinulog, it is in honor of Santo Niño.",
            "The name of the festival is taken from the Cebuano word for \"stringing things together\".",
            "This refers to the act of stringing shells found on the shorelines to form various crafts and ornaments, from chandeliers, to wind chimes, bracelets, keychains, tourism giftshop items, etc.",
            "It celebrates the shell craft industry, which is one of the main industries of the town (the others being fishing and beach resort management).",
            "It is meant to be a thanksgiving to the Child Jesus for blessing the town with beautiful beaches and bountiful marine life.",
            "It is celebrated every October 2."
        ],
        [
            "Lingaw-sadya"
        ],
        [
            "This is the town fiesta of Balamban.",
            "It is in honor of St. Francis of Assisi.",
            "The name of the festival is derived from 2 Cebuano words, namely lingaw, which means \"enjoyment\", and sadya, which means \"happiness\".",
            "It is a celebration that celebrates Balamban as a center for mountain climbing and merry-making.",
            "It is meant to be a celebration of happy moments and all the good times each year.",
            "It is celebrated on the October 3 to 4, around the feast of the town's patron saint."
        ],
        [
            "Garbo"
        ],
        [
            "Garbo Festival dancers performing their street dance in 2022."
        ],
        [
            "This is the town fiesta of Lapu-lapu.",
            "It is in honor of Our Lady of the Rule, the Virgin Mary depicted as a Black Madonna.",
            "The name of the festival is the Cebuano word for \"pride\".",
            "It is a celebration of all things proudly Oponganon and a thanksgiving to the Blessed Virgin for her intercession and for all graces received every year.",
            "It is celebrated around the feast day of the Virgin Mary which is every November 21."
        ],
        [
            "Karansa"
        ],
        [
            "A Karansa Festival queen together with dancers from her contingent holding pots, in their street dancing performance."
        ],
        [
            "This is the pottery festival of Danao.",
            "It is in honor of St. Thomas of Villanova.",
            "The name of the festival is a Cebuano term that refers to an \"expression of joy and happiness among potters after a hard day's work\".",
            "The festival is primarily a happy and playful dancing and prancing activity in coordination with the rhythm of music, beating of the drums and occasional loud shouts.",
            "The dance has four basic steps, namely, swaying (kiay), shaking (karag and kurug) and juddering (karahay).",
            "It is celebrated annually every 3rd Sunday of September."
        ],
        [
            "Soli-soli"
        ],
        [
            "This is the weaving festival of San Francisco.",
            "It is in honor of St. Joseph.",
            "The festival's name refers to the local name for the Common Bulrush (Typha latifolia), a plant that is common in the town around Lake Danao and all throughout Pacijan Island.",
            "The Festival showcases the livelihood of the San Franciscohanons, which is weaving the Soli-soli grass into mats, decorations, handbags, pouches, and other handicrafts.",
            "There are three basic dance steps of the festival dance, namely, hands and arms sideward swaying, harvesting and cutting movement, and finally a weaving motion, which are all a mimesis of the process of weaving Soli-soli.",
            "It is celebrated every third Sunday of March, in line with the solemnity of St. Joseph, husband of Mary."
        ],
        [
            "Kinsan"
        ],
        [
            "This is the sea festival of Aloguinsan.",
            "It is in honor of St. Raphael the Archangel.",
            "It celebrates the Dotted Grouper (Epinephelus epistictus), known locally as Kinsan, which is an abundant fish in the town and an important source of livelihood for the town's fishermen.",
            "The festival is celebrated through lively dancing in the street and in the grandstand, as well as cooking contests for the best Kinsan dish in town.",
            "It is celebrated every 2nd Sunday of June."
        ],
        [
            "Binuyocan/Buyoc"
        ],
        [
            "This is the town fiesta of Malabuyoc.",
            "It is in honor of St. Nicholas of Tolentino.",
            "The name of the festival is derived from the Cebuano buyoc, which means to \"bend down\" or \"bend over.",
            "According to a popular story, long ago, Malabuyoc grew plenty of fruit trees such as Mangoes, Lanzones, Cacaos, and many others.",
            "The fruit of the tree branches grew so big and plentiful that the trees bent down under their weight.",
            "Because of practically all the branches of the fruit trees bending over due to the over-abundance of fruit, the place came to be called \"Buyoc\", and eventually \"Malabuyoc\".",
            "The municipality of Malabuyoc launched the Binuyocan Festival on September 10, 2004.",
            "The festival is a celebration of the bountiful harvest of fruit in the town.",
            "It continues to be celebrated every September 10 every year."
        ],
        [
            "Humba (Festival)"
        ],
        [
            "The Humba Festival is the food festival of Ronda."
        ],
        [
            "It is in honor of Our Lady of Sorrows.",
            "It replaced the Panginabuhi Festival as the official festival of the town.",
            "The festival celebrates the Humba dish, a Visayan braised pork dish that is the iconic delicacy of the town.",
            "During the Humba festival, dancers incorporate the Humba dish, as well as the ingredients of Humba in their dances.",
            "There are also Humba cooking contests to promote Humba and to determine the best Humba every year.",
            "It is celebrated around the September 14 or 15, in line with the feast of the Virgin Mary."
        ],
        [
            "Haladaya"
        ],
        [
            "This is the historical festival of Daanbantayan.",
            "It celebrates Datu Daya, the precolonial chieftain of the kingdom known as \"Kandaya\", which is now present-day Daanbantayan.",
            "The name of the festival is an exaltation to Datu Daya, translating to \"all hail Daya\".",
            "It is meant to be a celebration of the leadership and bravery of Datu Daya.",
            "Despite being a historical festival, it is also considered a religious festival in honor of St. Rose of Lima.",
            "It is celebrated every August 30, in line with the feast of the town's patron saint."
        ],
        [
            "Bahandi"
        ],
        [
            "This is the town fiesta of"
        ],
        [
            "Alcantara.",
            "It is in honor of St. Augustine of Hippo.",
            "The name of the festival is the Cebuano word for \"treasure\".",
            "It is meant to be a thanksgiving for the treasures of Alcantara, which are its natural resources.",
            "It is celebrated on the August 27 to 28 in line with the feast of the patron saint of the town."
        ],
        [
            "Lapyahan"
        ],
        [
            "This is the sea festival of San Remigio.",
            "It is in honor of St. John of Nepomuk.",
            "The name of the festival is taken from the Cebuano term for \"shorelines\".",
            "It is a thanksgiving for the shoreline of the town, which is the longest in the province of Cebu, as well as the bounty of the sea.",
            "It is celebrated on May 16."
        ],
        [
            "Hinatdan"
        ],
        [
            "This is the town fiesta of Ginatilan.",
            "It is in honor of St. Gregory the Great.",
            "The festival's name Hinatdan is the Cebuano term for \"getting things done\".",
            "It is a celebration of the hardwork, faith, and resiliency of the Ginatilanons.",
            "It is celebrated around the 2nd week of March."
        ],
        [
            "Dinagat"
        ],
        [
            "This is the sea festival of Cordova.",
            "It is in honor of St. Roch.",
            "The name of the festival is a Cebuano word \"gathering from the sea\" and is reference to a method of fishing by means of picking sea life from the shoreline for food.",
            "The festival celebrates the rich and bountiful sea life of Cordova.",
            "Dancers in the Dinagat festival incorporate sea life in their dances, especially moray eels, locally known as Bakasi, which are considered a delicacy in Cordova.",
            "This is also why the Dinagat festival is also referred to as the \"Dinagat-Bakasi festival\".",
            "It is celebrated on August 16."
        ],
        [
            "Pintos (Festival)"
        ],
        [
            "This is the food festival of Bogo.",
            "It celebrates the Pintos, a sweet Philippine tamales that is the main delicacy of Bogo.",
            "It is in honor of St. Vincent Ferrer.",
            "The festival is a thanksgiving for the Pintos as the town's major source of livelihood and tourism for many people.",
            "The Pintos is also incorporated in the dances of the festival.",
            "It is celebrated every May 26."
        ],
        [
            "Tuba (Festival)"
        ],
        [
            "This is the town fiesta of Borbon.",
            "It is in honor of St. Sebastian.",
            "It celebrates the Tubâ, a Visayan coconut wine (also called coconut toddy) commonly found in the town.",
            "The festival is a thanksgiving for Tuba as a source of livelihood, as well as the local toddy industry.",
            "It is celebrated every January 20."
        ],
        [
            "Budbod Kabog"
        ],
        [
            "This is the food festival of Catmon.",
            "It is in honor of St. William the Hermit.",
            "The name of the festival is derived from Budbod, a type of rice cake or grain cake, made with Millet (known locally as Kabog) instead of the usual ingredient, rice.",
            "It is a festival about showing thanksgiving for the Budbod industry in the town.",
            "It is celebrated on February 10."
        ],
        [
            "Bisnok"
        ],
        [
            "This is the food festival of Dumanjug.",
            "It is in honor of St. Francis of Assisi.",
            "The festival's name is a portmanteau of the words Bisayang Manok, which is tradition Visayan roasted chicken, the local delicacy of the town.",
            "The dance of the festival is a mimesis of the process of chicken roasting, from the preparation to the actual cooking process.",
            "It is a celebration of thanksgiving for the roasted chicken industry in the town, which has helped put it on the map.",
            "It is celebrated on October 4."
        ],
        [
            "Cassava (Festival)"
        ],
        [
            "This is the harvest festival of Tudela.",
            "It is in honor of the Immaculate Conception.",
            "It is a celebration of thanksgiving for the bountiful harvest of Cassava, the main produce of the town.",
            "It is celebrated on the first two weeks of June."
        ],
        [
            "Kawayan"
        ],
        [
            "This is the town fiesta of Alegria.",
            "It is in honor of St. Francis Xavier.",
            "The festival's name is the Cebuano word for \"Bamboo\".",
            "It is a celebration of thanksgiving for the abundance of bamboo in the town and its many uses and applications.",
            "It is celebrated annually on December 2–3."
        ],
        [
            "Pausbaw"
        ],
        [
            "This is the harvest festival of Tabogon.",
            "It is in honor of St. Isidore the Farmer.",
            "It replaced the Sanggi Festival as the official festival of the town.",
            "The festival's name Pausbaw is the Cebuano term for \"achieving progress for farmers with the help of carabaos\".",
            "The festival is a dedication to the hard work of farmers that plow the field with the help of water buffalos.",
            "It is a celebration of thanksgiving for the bountiful harvest of the town.",
            "It is celebrated on May 20."
        ],
        [
            "Dagayday"
        ],
        [
            "This is the town fiesta of"
        ],
        [
            "Samboan.",
            "It is in honor of St. Michael the Archangel.",
            "It replaced the Sak-sak Festival as the official festival of the town.",
            "The name of the festival is the Cebuano word for \"Waterfalls\".",
            "It is a thanksgiving for the natural resources of the town, which are its waterfalls.",
            "It is celebrated on September 28 to 29 to coincide with the feast of the archangels."
        ],
        [
            "Ani-anihan"
        ],
        [
            "This is the harvest festival of Tabuelan.",
            "It is in honor of St. John the Baptist.",
            "The festival's name is a Cebuano term that is a reference to the act of \"harvesting\".",
            "It is a celebration of thanksgiving for the bountiful harvest of the town.",
            "It is celebrated on June 24."
        ],
        [
            "Pamugsay"
        ],
        [
            "This is the sea festival of Pilar.",
            "It is in honor of St. Francis Xavier.",
            "The name of the festival is a Cebuano term for \"the act of paddling\".",
            "The festival celebrates the rich and bountiful sea life of Pilar.",
            "It is celebrated annually on December 2."
        ],
        [
            "Queseo"
        ],
        [
            "This is the food festival of Compostela.",
            "It is in honor of St. James the Great.",
            "The name of the festival is the Cebuano word for \"Carabao White Cheese\".",
            "There are seven main dance steps in the festival dance.",
            "These dance steps are all a mimesis of the process of making the Queseo.",
            "The dance steps are Limpyo (cleaning the carabao teat),"
        ],
        [
            "Puga sa Gatas (milking the carabao), Sa-an (screening the milk with a mesh), Init kaldero (heating of the cauldron), Huwad suka (pouring vinegar to milk and stirring it in), Hulma (molding the cheese), and finally, Putos (wrapping the cheese with banana leaf strips).",
            "It is a celebration of the cheese-making livelihood of the town.",
            "It is celebrated on July 25."
        ],
        [
            "Panumod"
        ],
        [
            "This is the farm animal festival of Barili.",
            "It is in honor of St. Anne.",
            "It replaced the Kaumahan Festival as the official festival of the town.",
            "The festival's name is a Cebuano term for \"livestock\".",
            "Barili is considered to be the largest producer of livestock in the province.",
            "The town's public market, the Mantalongon Public Market is where most of the town's livestock and domestic animals are sold.",
            "It is a celebration of thanksgiving for the bountiful livestock of the town.",
            "It is celebrated on July 26."
        ],
        [
            "Sikoy-sikoy"
        ],
        [
            "This is the sea festival of San Fernando.",
            "It is in honor of St. Isidore the Farmer.",
            "The name of the festival is a Cebuano word Sikoy, which is a fishing method using nets done during rough tides.",
            "The festival celebrates the rich and bountiful sea life of San Fernando, which are considered blessings of God's love to the town.",
            "It is celebrated every November 17–21."
        ],
        [
            "Bolho"
        ],
        [
            "This is the town fiesta of"
        ],
        [
            "Boljoon.",
            "It is in honor of Our Lady of the Patronage.",
            "The name of the festival is a reference to the origin of the name of the town which is a Cebuano term referring to a large land mass cavity surrounded by mountains.",
            "This valley is believed to have been brought about by the sudden collapse of a mountain range.",
            "It is a celebration of the way of life of the Boljo-anons.",
            "It is celebrated around November 13, in line with the feast of the Virgin Mary."
        ],
        [
            "International relations and sisterhood agreements"
        ],
        [
            "Cebu hosted two major Information and Communications Technology (ICT) and telecom events, the 12th ASEAN Telecommunications and IT Ministers Meeting (TELMIN) and the 13th ASEAN Telecommunications and IT Senior Officials Meeting (TELSOM) in 2012."
        ],
        [
            "Cebu hosted the international 4th Dance Xchange, a project organized by the National Dance Committee of the National Commission for Culture and the Arts in 2012."
        ],
        [
            "Cebu as member hosted the 11th East Asia Inter-Regional Tourism Forum in 2011"
        ],
        [
            "Cebu join as a participating member of Inter–Island Tourism Policy Forum in 2011 (ITOP Forum)"
        ],
        [
            "Cebu hosted the 12th ASEAN Summit in 2007."
        ],
        [
            " Sichuan, China (2006)"
        ],
        [
            " Vladimir, Russia (2008)"
        ],
        [
            " Ljubljana, Slovenia (2008)"
        ],
        [
            " Gangwon, South Korea (2008)"
        ],
        [
            " Guam, United States of America (2008)"
        ],
        [
            " Rishon LeZion, Israel (2009)"
        ],
        [
            " Saint Petersburg, Russia (2009)"
        ],
        [
            " Guangdong, China (2009)"
        ],
        [
            " Guangxi, China (2010)"
        ],
        [
            " Barcelona, Spain (2010)"
        ],
        [
            " Autonomous Republic of Crimea, Ukraine (2010)"
        ],
        [
            " Busan, South Korea (2011)"
        ],
        [
            " Ninawa, Iraq (2011)"
        ],
        [
            " Valparaíso, Chile (2011)"
        ],
        [
            " Fujian, People's Republic of China (2018)"
        ],
        [
            "Existing sisterhood agreements"
        ],
        [
            " Hainan, China"
        ],
        [
            " Hawaii, United States of America"
        ],
        [
            "Domestic sisterhood agreements"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Antique"
        ],
        [
            "Aklan"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Iloilo"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Bohol"
        ],
        [
            "South Cotabato"
        ],
        [
            "Bukidnon"
        ],
        [
            "Masbate"
        ],
        [
            "Laguna"
        ],
        [
            "Tagaytay"
        ],
        [
            "Quezon"
        ],
        [
            "Parañaque"
        ],
        [
            "Pangasinan"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Philippines portal"
        ],
        [
            "Notes"
        ],
        [
            "^ a religious station partly owned and endorsed by the Archdiocese of Cebu"
        ],
        [
            "References"
        ],
        [
            "^ \"What To Know About Cebu, Philippines\".",
            "The Philippines Tourism Board.",
            "Retrieved August 21, 2016."
        ],
        [
            "^ a b \"Province: Cebu\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Number of Registered Voters by Sex : 2019 National and Local Elections\" (PDF).",
            "Commission on Elections.",
            "2019."
        ],
        [
            "^ Asaad, Irawan; Lundquist, Carolyn J.; Erdmann, Mark V.; Costello, Mark J.",
            "(June 2018).",
            "\"Delineating priority areas for marine biodiversity conservation in the Coral Triangle\".",
            "Biological Conservation.",
            "222 (2): 198–211.",
            "doi:10.1016/j.biocon.2018.03.037."
        ],
        [
            "^ a b \"ACD - Austronesian Comparative Dictionary - Cognate Sets - s\".",
            "www.trussel2.com.",
            "Retrieved March 16, 2024."
        ],
        [
            "^ a b Benitez, Jiolito Luzano (September 14, 2017).",
            "\"Historicity of City and Town Names in the Province of Cebu\".",
            "Cebu Normal University-Journal of Higher Education.",
            "11: 4."
        ],
        [
            "^ Stanley, Henry Edward John (1874).",
            "The First Voyage Around the World by Magellan.",
            "The Hakluyt Society.",
            "pp.",
            "84–105."
        ],
        [
            "^ a b c d Santarita, J.",
            "B.",
            "(2018).",
            "Panyupayana: The Emergence of Hindu Polities in the Pre-Islamic Philippines.",
            "Cultural and Civilisational Links Between India and Southeast Asia, 93–105."
        ],
        [
            "^ THE GENEALOGY OF HARI' TUPAS: AN ETHNOHISTORY OF CHIEFLY POWER AND HIERARCHY IN SUGBU AS A PROTOSTATE Astrid Sala-Boza Page 280."
        ],
        [
            "^ 5 other places in Asia which are also called Singapura By Joshua Lee"
        ],
        [
            "^ \"The First Voyage Round the World, by Magellan\" Written By Antonio Pigafetta"
        ],
        [
            "^ \"Philippine History – Spanish Colonization\".",
            "Archived from the original on January 8, 2011."
        ],
        [
            "^ information.ph 2009a."
        ],
        [
            "^ \"Cebu – History\".",
            "Cebu Provincial Government."
        ],
        [
            "^ Cushner, Nicholas P. (1965).",
            "\"Legazpi 1564-1572\".",
            "Philippine Studies.",
            "13 (2): 183–187.",
            "ISSN 0031-7837.",
            "JSTOR 42720592.",
            "In the ruins one of Legazpi's men, Juan de Camuz, made what was considered a miraculous find.",
            "He came across an image of the Child Jesus, probably the one which Pigafetta had presented to the Queen of Cebu in 1521.  about whether he should pardon the Cebuans' past offenses against Magellan's men and their apostasy from the faith they had embraced."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ Oaminal, Clarence Paul (September 7, 2016).",
            "\"Guests at the inauguration of Cebu City Charter\".",
            "The Freeman.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"Philippine Survivor Recounts Her Struggle As A 'Comfort Woman' For Wartime Japan\".",
            "NPR.org.",
            "NPR.",
            "Retrieved August 15, 2021."
        ],
        [
            "^ The Other Empire: Literary Views of Japan from the Philippines, Singapore, and Malaysia.",
            "The University of the Philippines Press.",
            "2008.",
            "ISBN 9789715425629.",
            "Retrieved August 15, 2021."
        ],
        [
            "^ \"Women made to be Comfort Women - Philippines\"."
        ],
        [
            "^ de Viana 2005."
        ],
        [
            "^ Mayol, Ador Vincent S. (December 1, 2016).",
            "\"Cebuanos honor 7 martyrs, 8 survivors of martial law\".",
            "The Philippine Daily Inquirer.",
            "Retrieved March 3, 2021."
        ],
        [
            "^ Almendras, Ruben (May 14, 2019).",
            "\"The Pusyon Bisaya phenomenon\".",
            "The Freeman.",
            "Retrieved March 3, 2021."
        ],
        [
            "^ Manticajon, Atty Ian Vincent.",
            "\"Never forget\".",
            "The Philippine Star.",
            "Archived from the original on February 12, 2019.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ Barcenas, Democrito (October 4, 2014).",
            "\"Cebu's first martial law detainees\".",
            "Retrieved October 15, 2021."
        ],
        [
            "^ Mongaya, Karlo Mikhail I.",
            "(2019).",
            "\"Militant Struggles and Anti-Imperialism in Resil Mojares's The Freeman Columns during the Early 1970s\".",
            "Philippine Studies: Historical and Ethnographic Viewpoints.",
            "67 (3–4): 557–594.",
            "doi:10.1353/phs.2019.0026.",
            "ISSN 2244-1638.",
            "S2CID 213742855."
        ],
        [
            "^ Mongaya, Anol (September 2, 2017).",
            "\"Mongaya: Inday Nita, Serging, ug Fr.",
            "Rudy\".",
            "SunStar Philippines.",
            "Archived from the original on October 15, 2021.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ Mayol, Ador Vincent (July 11, 2020).",
            "\"Cebuanos remember Fr.",
            "Rudy Romano on 35th year of disappearance\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on April 14, 2021.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ \"Martyrs and Heroes: ROMANO, Rosaleo B.\"",
            "Bantayog ng mga Bayani.",
            "July 13, 2016.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ Mongaya, Anol (November 27, 2016).",
            "\"Mongaya: To honor Cebu heroes on Nov. 30\".",
            "SunStar Philippines.",
            "Archived from the original on October 15, 2021.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ \"Heroes and Martyrs: YBAÑEZ, Rolan Ylagan\".",
            "Bantayog ng mga Bayani.",
            "August 19, 2015.",
            "Retrieved October 15, 2021."
        ],
        [
            "^ \"Holganza – prominent leader of Cebu's anti-Marcos forces – passes away\".",
            "INQUIRER.net.",
            "January 26, 2015.",
            "Retrieved September 9, 2022."
        ],
        [
            "^ Erram, Morexette Marie B.",
            "(February 25, 2021).",
            "\"Cebu and the days leading to February 25, 1986\".",
            "Cebu Daily News.",
            "Retrieved March 3, 2021."
        ],
        [
            "^ \"REMINISCENCE OF THE 2012 Ms6.9 NEGROS ORIENTAL QUAKE\".",
            "Philippine Institute of Volcanology and Seismology.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"\"Blind\" Fault Line Caused Negros Earthquake, Philippine Experts Say\".",
            "Asian Scientist.",
            "February 21, 2021.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"Bohol Earthquake: One year on\".",
            "World Health Organization.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ Johnson, M. Alex (October 15, 2013).",
            "\"At least 82 dead, churches destroyed as 7.2 earthquake hits Philippines\".",
            "NBC News.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"Aftermath Photos of Cebu in the Wake of Typhoon Yolanda\".",
            "Asia Society.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"Philippines: Super Typhoon Rai (Odette) Humanitarian Needs and Priorities Revision (Dec 2021 - Jun 2022) (2 Feb 2022)\".",
            "ReliefWeb.",
            "February 2, 2022.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ McCarthy, Julie (December 21, 2021).",
            "\"Desperation grows in the Philippines in the aftermath of Typhoon Rai\".",
            "NPR.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ a b c d UNEP 1998."
        ],
        [
            "^ a b c d Encyclopædia Britannica 2016."
        ],
        [
            "^ \"Cebu\".",
            "Britannica.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ \"Philippines: Metro Cebu Intelligent Transportation System Master Plan Technical Assistance\".",
            "US Trade and Development Agency.",
            "Retrieved February 10, 2024."
        ],
        [
            "^ Abella y Casariego 1886."
        ],
        [
            "^ Smith 1907."
        ],
        [
            "^ \"Weather\".",
            "Archived from the original on May 25, 2013.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"Weather in Cebu\".",
            "Guide to Cebu.",
            "Archived from the original on August 26, 2010.",
            "Retrieved July 30, 2010."
        ],
        [
            "^ Supsup, Christian & Puna, Nevong & Asis, Augusto & Redoblado, Bernard & Fatima Panaguinit, Maria & Guinto, Faith & Rico, Edmund & Diesmos, Arvin & Brown, Rafe & Mallari, Neil.",
            "(2016).",
            "Amphibians and Reptiles of Cebu, Philippines: The Poorly Understood Herpetofauna of an Island with Very Little Remaining Natural Habitat.",
            "Asian Herpetological Research.",
            "7.",
            "151–179.",
            "10.16373/j.cnki.ahr.150049."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VII (Central Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population (2015).",
            "\"Region VII (Central Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Censuses of Population (1903–2007).",
            "\"Region VII (Central Visayas)\".",
            "Table 1.",
            "Population Enumerated in Various Censuses by Province/Highly Urbanized City: 1903 to 2007.",
            "National Statistics Office.",
            "{{cite encyclopedia}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Basilica del Santo Niño is named by the Vatican as \"mother and head of all churches in the Philippines\" (mater et caput... omnium ecclesiarum Insularum Philippinarum).",
            "See Ut clarificetur"
        ],
        [
            "^ a b c \"Press release\".",
            "psa.gov.ph."
        ],
        [
            "^ \"More on demographics\".",
            "The Commission on Population of the Philippines.",
            "Archived from the original on October 5, 2011.",
            "Retrieved August 27, 2011."
        ],
        [
            "^ \"Table 11.",
            "Household Population by Ethnicity and Sex: 2010\" (PDF)."
        ],
        [
            "^ \"Cebu – Paradise: Culture and Lifestyle\".",
            "Cebu Provincial Government.",
            "Archived from the original on July 19, 2018.",
            "Retrieved December 10, 2009."
        ],
        [
            "^ a b \"Religious Affiliation in the Philippines (2020 Census of Population and Housing) | Philippine Statistics Authority | Republic of the Philippines\".",
            "psa.gov.ph.",
            "Retrieved September 28, 2023."
        ],
        [
            "^ Bautista 2006."
        ],
        [
            "^ Blair, Robertson & Vol 2, p. 121."
        ],
        [
            "^ \"19 February 1981: Mass for families, Cebu City, Philippines – John Paul II\".",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"Halalan 2019 Philippine Election Results | ABS-CBN News\".",
            "Archived from the original on July 27, 2020.",
            "Retrieved September 26, 2019."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Real estate sector fastest growing industry in Cebu\".",
            "SunStar Cebu.",
            "January 3, 2013.",
            "Retrieved June 25, 2013."
        ],
        [
            "^ \"Cebu rises to 8th best site for BPOs\".",
            "SunStar Cebu.",
            "February 12, 2013.",
            "Archived from the original on March 17, 2013.",
            "Retrieved March 18, 2013."
        ],
        [
            "^ \"Metro Manila, Cebu among top global BPO destinations\".",
            "Yahoo!",
            "Philippines.",
            "Retrieved March 18, 2013."
        ],
        [
            "^ \"Non-voice overtakes voice operation in Cebu\".",
            "SunStar Cebu.",
            "May 16, 2013.",
            "Archived from the original on June 5, 2013.",
            "Retrieved June 25, 2013."
        ],
        [
            "^ \"Cebu Park District, Cebu Holdings\".",
            "Archived from the original on January 1, 2013.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"Ice Rink Supply, Banilad, Cebu\".",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"Freeze Point – Ice Rink Supplier, Mandaue, Cebu\".",
            "Retrieved April 26, 2017."
        ],
        [
            "^ Erram, Morexette Marie B.",
            "(January 25, 2020).",
            "\"DOT: Cebu was 2nd top foreign tourists' destination in 2019\".",
            "Cebu Daily News.",
            "Retrieved August 31, 2022."
        ],
        [
            "^ \"Philippine PPPs queue up investors\".",
            "InvestVine.com.",
            "April 3, 2013."
        ],
        [
            "^ \"Cebu Pacific is world's No.",
            "1 in growth\".",
            "Archived from the original on October 16, 2015.",
            "Retrieved August 26, 2015."
        ],
        [
            "^ \"Cebu Pacific Reaches 50 Million Passengers Mark\".",
            "Airline-philippines.com.",
            "Archived from the original on March 16, 2012.",
            "Retrieved June 26, 2013."
        ],
        [
            "^ Sun.Star (April 22, 2013).",
            "\"Cebu Holdings Inc. planning new business district\".",
            "SunStar.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ \"About South Road Properties\".",
            "City Government of Cebu.",
            "Archived from the original on March 1, 2013.",
            "Retrieved February 20, 2013."
        ],
        [
            "^ \"City di Mare\".",
            "Retrieved April 26, 2017."
        ],
        [
            "^ Libotero, Sinjin Pineda (June 7, 2013).",
            "\"Filinvest's Il Corso mall rises at SRP-Cebu\".",
            "Archived from the original on August 31, 2015.",
            "Retrieved February 17, 2016."
        ],
        [
            "^ \"University of the Philippines Cebu\".",
            "University of the Philippines Cebu."
        ],
        [
            "^ Mactan Oceantown – Mactan, Cebu City, http://www.megaworldcorp.com/Projects/Office.aspx"
        ],
        [
            "^ sparksph (October 2, 2021).",
            "\"Cebu Lechon: The best in the country\".",
            "Suroy.ph.",
            "Retrieved July 20, 2022."
        ],
        [
            "^ \"Cebu City to celebrate Chinese new year with a Red Lantern Festival at Plaza Sugbo\".",
            "INQUIRER.net.",
            "January 20, 2023.",
            "Retrieved February 12, 2024."
        ],
        [
            "^ \"11th East-Asia Tourism Forum (EATOF) Integrated Academic, Tourism and Business Forum Business Matching | Cebu Chamber of Commerce and Industry\".",
            "Cebuchamber.org.",
            "September 12, 2011.",
            "Archived from the original on July 4, 2013.",
            "Retrieved April 16, 2013."
        ],
        [
            "^ Manila Bulletin 2011."
        ],
        [
            "^ \"ASEAN Leaders Sign Five Agreements at the 12th ASEAN Summit, Cebu, the Philippines, 13 January 2007\" (Press release).",
            "ASEAN Secretariat.",
            "January 13, 2007.",
            "Archived from the original on January 28, 2007.",
            "Retrieved January 28, 2007.",
            "12th ASEAN Summit, five."
        ],
        [
            "Bibliography"
        ],
        [
            "Abellana, Jovito (1952).",
            "Aginid, Bayok sa Atong Tawarik (in Cebuano)."
        ],
        [
            "Abella y Casariego, Enrique (1886).",
            "Rápida descripcion física, geológica y minera de la Isla de Cebú (in Spanish).",
            "Madrid: Tello."
        ],
        [
            "Bautista, Julius (2006).",
            "\"The Rebellion and the Icon: Holy Revolutions in the Philippines\".",
            "Asian Journal of Social Science.",
            "34 (2): 291–310.",
            "doi:10.1163/156853106777371166."
        ],
        [
            "Blair, Emma Helen & Robertson, James Alexander, eds.",
            "(1903).",
            "The Philippine Islands, 1493–1803.",
            "Vol.",
            "2 of 55 (1521–1569).",
            "Historical introduction and additional notes by Edward Gaylord Bourne.",
            "Cleveland, Ohio: Arthur H. Clark Company.",
            "Explorations by early navigators, descriptions of the islands and their peoples, their history and records of the catholic missions, as related in contemporaneous books and manuscripts, showing the political, economic, commercial and religious conditions of those islands from their earliest relations with European nations to the beginning of the nineteenth century."
        ],
        [
            "Cebu Daily News (2011).",
            "\"Revamp, BRT setup eyed for Mactan airport\".",
            "Archived from the original on September 9, 2012.",
            "Retrieved June 26, 2013."
        ],
        [
            "Encyclopædia Britannica (2016).",
            "\"Cebu\".",
            "www.britannica.com.",
            "Retrieved February 10, 2016."
        ],
        [
            "information.ph (2009a).",
            "\"Part 2: The first Spanish expedition of 1521\".",
            "Philippine History.",
            "Archived from the original on January 31, 2009."
        ],
        [
            "information.ph (2009b).",
            "\"Part 3: The Spanish colonization\".",
            "Philippine History.",
            "Archived from the original on January 31, 2009."
        ],
        [
            "Macachor, Celestino C. (2011).",
            "\"Searching for Kali in the Indigenous Chronicles of Jovito Abellana\".",
            "Rapid Journal.",
            "10 (2).",
            "Archived from the original on July 3, 2012."
        ],
        [
            "Manila Bulletin, Mars W. Mosqueda (October 4, 2011).",
            "\"Cebu joins elite ITOP Forum\".",
            "Archived from the original on October 23, 2011.",
            "Retrieved February 11, 2016."
        ],
        [
            "Manila Bulletin, Jonas Reyes (January 13, 2015).",
            "\"PH ranks 5th among world's shipbuilders\".",
            "Archived from the original on October 15, 2015.",
            "Retrieved February 11, 2016."
        ],
        [
            "Montebon, Marivir R. (2000).",
            "A Tribute to Two Centenarians.",
            "Minglanilla, Cebu: ED Villaver Publishing.",
            "pp. 89–90.",
            "{{cite book}}: |work= ignored (help)"
        ],
        [
            "Segura, Manuel F. (1992).",
            "The Koga papers : stories of WW II.",
            "Cebu City: MF Segura Publications."
        ],
        [
            "Smith, Warren Du Pré (1907).",
            "Freer, Paul C.; Strong, Richard D.; Merrill, E. D.",
            "(eds.).",
            "\"The geology of the Compostela-Danao coal field\".",
            "Philippine Journal of Science.",
            "2A (6): 377 ff."
        ],
        [
            "Tribune of India (December 3, 2014).",
            "\"Seechewal inaugurates Punjabi school in Philippines\".",
            "Jalandhar.",
            "Archived from the original on December 8, 2014."
        ],
        [
            "UNEP, Arthur Lyon Dahl (1998).",
            "\"Islands of Philippines: Cebu\".",
            "Island Directory.",
            "United Nations Environment Programme.",
            "Retrieved February 11, 2016."
        ],
        [
            "de Viana, Augusto V. (2005).",
            "\"The capture of the Koga Papers and its effect on the plan to retake the Philippines in 1944\" (PDF).",
            "Micronesian: Journal of the Humanities and Social Sciences.",
            "4 (2).",
            "National Historical Institute in the Philippines."
        ],
        [
            "Wernstedt, Frederick L. (1957).",
            "The role and importance of Philippine interisland shipping and trade.",
            "Southeast Asia Program, Dept.",
            "of Far Eastern Studies, Cornell University.",
            "ISBN 9780598547866."
        ],
        [
            "External links"
        ],
        [
            "Wikimedia Commons has media related to Cebu (province)."
        ],
        [
            "Wikivoyage has a travel guide for Cebu Province."
        ],
        [
            " Geographic data related to Cebu at OpenStreetMap"
        ],
        [
            "Official website of the Provincial Government of Cebu"
        ],
        [
            "The Official Government Portal of the Republic of the Philippines – Cebu"
        ],
        [
            "Places adjacent to Cebu"
        ],
        [
            "MasbateVisayan Sea"
        ],
        [
            "Negros Occidental  Negros Oriental  |  Tañon Strait"
        ],
        [
            "Cebu"
        ],
        [
            "Camotes Sea  |  Leyte"
        ],
        [
            "Bohol SeaSiquijor"
        ],
        [
            "Cebu Strait  |  Bohol"
        ],
        [
            "Articles related to Cebu province"
        ],
        [
            "vte Province of CebuCebu City (capital and largest city)Municipalities"
        ],
        [
            "Alcantara"
        ],
        [
            "Alcoy"
        ],
        [
            "Alegria"
        ],
        [
            "Aloguinsan"
        ],
        [
            "Argao"
        ],
        [
            "Asturias"
        ],
        [
            "Badian"
        ],
        [
            "Balamban"
        ],
        [
            "Bantayan"
        ],
        [
            "Barili"
        ],
        [
            "Boljoon"
        ],
        [
            "Borbon"
        ],
        [
            "Carmen"
        ],
        [
            "Catmon"
        ],
        [
            "Compostela"
        ],
        [
            "Consolacion"
        ],
        [
            "Cordova"
        ],
        [
            "Daanbantayan"
        ],
        [
            "Dalaguete"
        ],
        [
            "Dumanjug"
        ],
        [
            "Ginatilan"
        ],
        [
            "Liloan"
        ],
        [
            "Madridejos"
        ],
        [
            "Malabuyoc"
        ],
        [
            "Medellin"
        ],
        [
            "Minglanilla"
        ],
        [
            "Moalboal"
        ],
        [
            "Oslob"
        ],
        [
            "Pilar"
        ],
        [
            "Pinamungajan"
        ],
        [
            "Poro"
        ],
        [
            "Ronda"
        ],
        [
            "Samboan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santander"
        ],
        [
            "Sibonga"
        ],
        [
            "Sogod"
        ],
        [
            "Tabogon"
        ],
        [
            "Tabuelan"
        ],
        [
            "Tuburan"
        ],
        [
            "Tudela"
        ],
        [
            "Component cities"
        ],
        [
            "Bogo"
        ],
        [
            "Carcar"
        ],
        [
            "Danao"
        ],
        [
            "Naga"
        ],
        [
            "Talisay"
        ],
        [
            "Toledo"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cebu City"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "Mandaue"
        ],
        [
            "(Administratively independent from the province but grouped under Cebu by the Philippine Statistics Authority.",
            "However, qualified voters in Mandaue are allowed to vote in elections for Cebu provincial officials by virtue of Republic Act No.",
            "6641, in accordance with Section 452-c of the Local Government Code of 1991.)"
        ],
        [
            "vteCentral Visayas (Region VII)Regional center"
        ],
        [
            "Cebu City"
        ],
        [
            "Provinces"
        ],
        [
            "Bohol"
        ],
        [
            "Cebu"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Cebu"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Cebu City"
        ],
        [
            "Lapu-Lapu"
        ],
        [
            "Mandaue"
        ],
        [
            "Component cities"
        ],
        [
            "Bogo"
        ],
        [
            "Carcar"
        ],
        [
            "Danao"
        ],
        [
            "Naga"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Talisay"
        ],
        [
            "Toledo"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cebu City"
        ],
        [
            "Tagbilaran"
        ],
        [
            "Municipalities"
        ],
        [
            "Alburquerque"
        ],
        [
            "Alcantara"
        ],
        [
            "Alcoy"
        ],
        [
            "Alegria"
        ],
        [
            "Alicia"
        ],
        [
            "Aloguinsan"
        ],
        [
            "Anda"
        ],
        [
            "Antequera"
        ],
        [
            "Argao"
        ],
        [
            "Asturias"
        ],
        [
            "Baclayon"
        ],
        [
            "Badian"
        ],
        [
            "Balamban"
        ],
        [
            "Balilihan"
        ],
        [
            "Bantayan"
        ],
        [
            "Barili"
        ],
        [
            "Batuan"
        ],
        [
            "Bien Unido"
        ],
        [
            "Bilar"
        ],
        [
            "Boljoon"
        ],
        [
            "Borbon"
        ],
        [
            "Buenavista"
        ],
        [
            "Calape"
        ],
        [
            "Candijay"
        ],
        [
            "Carmen (Bohol)"
        ],
        [
            "Carmen (Cebu)"
        ],
        [
            "Catigbian"
        ],
        [
            "Catmon"
        ],
        [
            "Clarin"
        ],
        [
            "Compostela"
        ],
        [
            "Consolacion"
        ],
        [
            "Cordova"
        ],
        [
            "Corella"
        ],
        [
            "Cortes"
        ],
        [
            "Daanbantayan"
        ],
        [
            "Dagohoy"
        ],
        [
            "Dalaguete"
        ],
        [
            "Danao (Bohol)"
        ],
        [
            "Dauis"
        ],
        [
            "Dimiao"
        ],
        [
            "Duero"
        ],
        [
            "Dumanjug"
        ],
        [
            "Garcia Hernandez"
        ],
        [
            "Getafe"
        ],
        [
            "Ginatilan"
        ],
        [
            "Guindulman"
        ],
        [
            "Inabanga"
        ],
        [
            "Jagna"
        ],
        [
            "Lila"
        ],
        [
            "Liloan"
        ],
        [
            "Loay"
        ],
        [
            "Loboc"
        ],
        [
            "Loon"
        ],
        [
            "Mabini"
        ],
        [
            "Madridejos"
        ],
        [
            "Malabuyoc"
        ],
        [
            "Maribojoc"
        ],
        [
            "Medellin"
        ],
        [
            "Minglanilla"
        ],
        [
            "Moalboal"
        ],
        [
            "Oslob"
        ],
        [
            "Panglao"
        ],
        [
            "Pilar (Bohol)"
        ],
        [
            "Pilar (Cebu)"
        ],
        [
            "Pinamungajan"
        ],
        [
            "Poro"
        ],
        [
            "President Carlos P. Garcia"
        ],
        [
            "Ronda"
        ],
        [
            "Sagbayan"
        ],
        [
            "Samboan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santander"
        ],
        [
            "Sevilla"
        ],
        [
            "Sibonga"
        ],
        [
            "Sierra Bullones"
        ],
        [
            "Sikatuna"
        ],
        [
            "Sogod"
        ],
        [
            "Tabogon"
        ],
        [
            "Tabuelan"
        ],
        [
            "Talibon"
        ],
        [
            "Trinidad"
        ],
        [
            "Tubigon"
        ],
        [
            "Tuburan"
        ],
        [
            "Tudela"
        ],
        [
            "Ubay"
        ],
        [
            "Valencia"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vteThe 40 largest islands of the Philippines"
        ],
        [
            "Alabat"
        ],
        [
            "Balabac"
        ],
        [
            "Basilan"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bucas Grande"
        ],
        [
            "Bugsuk"
        ],
        [
            "Burias"
        ],
        [
            "Busuanga"
        ],
        [
            "Calayan"
        ],
        [
            "Camiguin"
        ],
        [
            "Camiguin de Babuyanes"
        ],
        [
            "Cebu"
        ],
        [
            "Catanduanes"
        ],
        [
            "Culion"
        ],
        [
            "Dinagat"
        ],
        [
            "Dumaran"
        ],
        [
            "Guimaras"
        ],
        [
            "Jolo"
        ],
        [
            "Leyte"
        ],
        [
            "Lubang"
        ],
        [
            "Luzon"
        ],
        [
            "Masbate"
        ],
        [
            "Marinduque"
        ],
        [
            "Mindanao"
        ],
        [
            "Mindoro"
        ],
        [
            "Negros"
        ],
        [
            "Olutanga"
        ],
        [
            "Palawan"
        ],
        [
            "Panaon"
        ],
        [
            "Panay"
        ],
        [
            "Polillo"
        ],
        [
            "Samal"
        ],
        [
            "Samar"
        ],
        [
            "Siargao"
        ],
        [
            "Sibuyan"
        ],
        [
            "Siquijor"
        ],
        [
            "Tablas"
        ],
        [
            "Tawitawi"
        ],
        [
            "Ticao"
        ],
        [
            "Islands portal"
        ],
        [
            "See also"
        ],
        [
            "Geography of the Philippines"
        ],
        [
            "Island groups of the Philippines"
        ],
        [
            "List of islands"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Spain"
        ],
        [
            "France"
        ],
        [
            "BnF data"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Other"
        ],
        [
            "NARA"
        ],
        [
            "IdRef"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Cebu&oldid=1233935862\""
        ],
        [
            "Categories: CebuProvinces of the PhilippinesProvinces of Central VisayasIsland provinces of the PhilippinesStates and territories established in 15651565 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: numeric names: authors listArticles with short descriptionShort description is different from WikidataWikipedia indefinitely move-protected pagesWikipedia articles needing rewrite from November 2021All articles needing rewriteUse Philippine English from September 2022All Wikipedia articles written in Philippine EnglishUse mdy dates from December 2022Pages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Cebuano-language textArticles containing Hiligaynon-language textArticles containing Filipino-language textArticles needing cleanup from March 2024All pages needing cleanupCleanup tagged articles with a reason field from March 2024Wikipedia pages needing cleanup from March 2024Wikipedia articles needing clarification from June 2024All articles with unsourced statementsArticles with unsourced statements from October 2021Articles with unsourced statements from June 2011Articles to be split from April 2023All articles to be splitCS1 foreign language sources (ISO 639-2)CS1 Spanish-language sources (es)CS1: long volume valueCS1 errors: periodical ignoredCommons category link from WikidataAll articles with dead external linksArticles with dead external links from November 2023Articles with permanently dead external linksArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with BNE identifiersArticles with BNF identifiersArticles with BNFdata identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersArticles with NARA identifiersArticles with SUDOC identifiersPages using the Kartographer extension"
        ]
    ]
}