{
    "name": "Ilocos Sur",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "45 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoעבריתKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålOccitanPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 17°20′N 120°35′E﻿ / ﻿17.33°N 120.58°E﻿ / 17.33; 120.58"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Ilocos Region, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Ilocos Sur\" – news · newspapers · books · scholar · JSTOR (September 2013) (Learn how and when to remove this message)"
        ],
        [
            "Province in Ilocos Region, PhilippinesIlocos SurProvinceProvince of Ilocos Sur"
        ],
        [
            "Clockwise from the top: Santa Maria Church, Vigan City, Bantay Church, Mount Tuwato, Bantay Church Belltower"
        ],
        [
            "FlagSealNickname: The Heritage Haven of the NorthLocation in the PhilippinesOpenStreetMapCoordinates: 17°20′N 120°35′E﻿ / ﻿17.33°N 120.58°E﻿ / 17.33; 120.58CountryPhilippinesRegionIlocos RegionFoundedJune 13, 1572CapitalViganLargest cityCandonGovernment • GovernorJeremias C. Singson (NPC/Bileg) • Vice GovernorRyan Luis V. Singson (Lakas/Bileg) • LegislatureIlocos Sur Provincial BoardArea • Total706,009 • Rank43rd out of 81 • Density270/km2 (700/sq mi)  • Rank33rd out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "2"
        ],
        [
            " Candon"
        ],
        [
            " Vigan"
        ],
        [
            " • Municipalities"
        ],
        [
            "32"
        ],
        [
            " Alilem"
        ],
        [
            " Banayoyo"
        ],
        [
            " Bantay"
        ],
        [
            " Burgos"
        ],
        [
            " Cabugao"
        ],
        [
            " Caoayan"
        ],
        [
            " Cervantes"
        ],
        [
            " Galimuyod"
        ],
        [
            " Gregorio del Pilar"
        ],
        [
            " Lidlidda"
        ],
        [
            " Magsingal"
        ],
        [
            " Nagbukel"
        ],
        [
            " Narvacan"
        ],
        [
            " Quirino"
        ],
        [
            " Salcedo"
        ],
        [
            " San Emilio"
        ],
        [
            " San Esteban"
        ],
        [
            " San Ildefonso"
        ],
        [
            " San Juan"
        ],
        [
            " San Vicente"
        ],
        [
            " Santa"
        ],
        [
            " Santa Catalina"
        ],
        [
            " Santa Cruz"
        ],
        [
            " Santa Lucia"
        ],
        [
            " Santa Maria"
        ],
        [
            " Santiago"
        ],
        [
            " Santo Domingo"
        ],
        [
            " Sigay"
        ],
        [
            " Sinait"
        ],
        [
            " Sugpon"
        ],
        [
            " Suyo"
        ],
        [
            " Tagudin"
        ],
        [
            " • Barangays768 • DistrictsLegislative districts of Ilocos SurTime zoneUTC+8 (PST)ZIP code2700–2733IDD : area code PH-ILSSpoken languagesIlocanoKankana-eyFilipinoEnglishHDI 0.70 (High)HDI rank19th (2019)Websitemis.ilocossur.gov.ph"
        ],
        [
            "Ilocos Sur, officially the Province of Ilocos Sur (Ilocano: Probinsia ti Ilocos Sur; Tagalog: Lalawigan ng Ilocos Sur), is a province in the Philippines located in the Ilocos Region in Luzon.",
            "Located on the mouth of the Mestizo River is the capital of Vigan.",
            "Ilocos Sur is bordered by Ilocos Norte and Abra to the north, Mountain Province to the east, La Union and Benguet to the south and the South China Sea to the west."
        ],
        [
            "Ilocos Sur was founded by the Spanish conquistador Juan de Salcedo in 1572.",
            "It was formed when the north (now Ilocos Norte) split from the south (Ilocos Sur).",
            "At that time, it included parts of Abra and the upper half of present-day La Unión.",
            "The current boundary of the province was permanently defined through Act No.",
            "2683 signed in March 1917."
        ],
        [
            "The province is home to two UNESCO World Heritage Sites, namely, the Heritage City of Vigan and the Baroque Church of Santa Maria."
        ],
        [
            "History"
        ],
        [
            "This section possibly contains original research.",
            "Please improve it by verifying the claims made and adding inline citations.",
            "Statements consisting only of original research should be removed.",
            "(February 2015) (Learn how and when to remove this message)"
        ],
        [
            "Early history"
        ],
        [
            "Before the arrival of the Spanish, the coastal plains in northwest Luzón from Bangui in the north to Namacpacan in the south were a region called the Ylokos.",
            "It lies between the South China Sea in the west and the Northern Cordilleras in the east.",
            "On the western side, the land is sandy.",
            "On the eastern side (near the mountains that separate the region from the Mountain Province) the land is rocky, leaving a narrow strip of plain for cultivation.",
            "The mountains come so close to the sea that the highway is carved into them.",
            "The pressure of increasing population and the need for land made the people thrifty, and they built their villages near small bays and coves called looc in the local dialect.",
            "These coastal inhabitants were known as Ylocos, which means \"from the lowlands\".",
            "The region was then called by the ancient name Samtoy, from sao mi ditoy (\"our language\" in Ilocano)."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The Ilocos region was a thriving and fairly-advanced cluster of towns and settlements familiar to Chinese, Japanese, and Malay traders when the Spanish explorer Juan de Salcedo arrived in Vigan on June 13, 1572.",
            "The Spanish made Cabigbigaan their headquarters, which Salcedo called Villa Fernandina and which became known as the Intramuros de Ilocandia.",
            "Salcedo declared all of Northern Luzón an encomienda (land grant).",
            "He was the encomendero of Vigan and lieutenant governor of Ylokos until his death in July 1574."
        ],
        [
            "Augustinian missionaries evangelized the region, establishing parishes and building churches that still stand.",
            "Three centuries later, Vigan became the seat of the Archdiocese of Nueva Segovia."
        ],
        [
            "The coast of Samtoy was known to the Spanish colonizers in 1572, when Juan de Salcedo traveled along it.",
            "Sent by Miguel López de Legazpi to explore the island of Luzón, Salcedo founded Ciudad Fernandina in 1574 in Bigan, in present-day Ilocos Sur.",
            "It became the center of Spanish rule and influence, including the evangelization and pacification movements.",
            "Due to Salcedo's efforts, the settlements in Tagurín, Santa Lucía, Nalbacán, Bantay, Candón and Sinayt were pacified and paid tribute to the King of Spain."
        ],
        [
            "Conversions"
        ],
        [
            "According to the Spanish chronicler Pigafetta, \"The Ilocos are all Christians and are the humblest and most tractable\".",
            "The Augustinians established parishes in Santa in 1576, Tagurín in 1586, Santa Lucía in 1586, Nalbacán in 1587, Candón in 1591, and Bantay in 1590.",
            "They built a church in Bigan in 1641 which, 117 years later, become the cathedral of the episcopal see of Nueva Segovia."
        ],
        [
            "Partition of Ylokos"
        ],
        [
            "Ylokos consisted of the present-day provinces of Ilocos Norte, Ilocos Sur, Abra and part of Mountain Province.",
            "A royal decree of February 2, 1818 separated Ilocos Norte from Ilocos Sur, the latter including northern La Union (as far as Namacpacan, present-day Luna) and present-day Abra.",
            "The sub-provinces of Lepanto and Amburayan in Mountain Province were annexed by Ilocos Sur.",
            "The passage of Act No.",
            "2683 by the Philippine Legislature in March 1917 defined the province's geographical boundaries."
        ],
        [
            "Vigan"
        ],
        [
            "Vigan, almost four centuries old, was once known as Kabigbigaan (from biga, a coarse, erect plant with large, ornate leaves that grows on riverbanks).",
            "Bigan was later changed to Vigan.",
            "To the Spanish it was Villa Fernandina, in honor of King Ferdinand."
        ],
        [
            "Vigan was founded in 1574 by Spanish conquistador Juan de Salcedo as the capital of Ylocos.",
            "The town, with a population of 8,000 (greater than that of Manila at the time), was the center of Malayan civilization before Salcedo's arrival.",
            "It was somewhat prosperous, trading with the Chinese and Japanese who brought jars, silk and crockery through the nearby port of Pandan, Caoayan."
        ],
        [
            "In the 19th century, Vigan traded with Europe; ships loaded with indigo went to textile mills.",
            "The invention of chemical dyes in Germany eliminated this industry.",
            "Affluent citizens of Vigan stocked their homes with statuettes of brass and iron, dinnerware, and other artifacts of European civilization, including fine ivory, inlaid furniture, and Chinese wares."
        ],
        [
            "Social institutions"
        ],
        [
            "Salcedo bequeathed his encomienda to a select group who continued the tenancy system which developed into the practice of caciquism, landlordism and usury.",
            "The kaillanes revolted against the aristocracy in 1762.",
            "Vigan's two sections during the mid-19th-century indigo boom—one for the meztizos and the other for the naturales—remain distinct."
        ],
        [
            "Migration"
        ],
        [
            "Spanish colonizers used free labor in the development of Ilocos Sur.",
            "Resentment of free labor triggered sporadic revolts, and those who refused to be slaves or tenants left the region for Abra and the Cagayan Valley.",
            "From 1898 to the first decade of the 20th century, covered oxcarts moved to the rich plains of Pangasinan, Nueva Ecija and Tarlac.",
            "Children were told tales of Lam-ang, Angalo, Aran, Juan Sadot and other legendary Ilocano characters.",
            "Folk songs such as \"Pamulinawen\", \"Manang Biday\", and \"Dungdungwen Kanto Unay, Unay\" became popular."
        ],
        [
            "During the second phase of Ilocano migration, from 1908 to 1946, surplus labor migrated to the plantations of Hawaii and the U.S. West Coast.",
            "Ilocos Sur's population density was 492 per square mile at the height of migration, which made it the most densely-populated region in the Philippines except for Manila.",
            "The last group of labor migrants to Hawaii was in 1946, when 7,365 men were recruited by the United States Department of Labor.",
            "Vigan was the recruiting center.",
            "More than eighty percent of Filipinos in Hawaii are of Ilocano origin."
        ],
        [
            "Economic prosperity"
        ],
        [
            "The first half of the 19th century was an economic boom for Ilocos Sur.",
            "During this period, the cotton, tobacco and indigo industries were encouraged by the government.",
            "With the operations of the Royal Company of the Philippines (Real Compañía de Filipinas), the textile industry was developed on a large scale and the abolition of the tobacco monopoly accelerated economic progress."
        ],
        [
            "Revolts"
        ],
        [
            "The beginning of Spanish rule to the first decade of the nineteenth century was characterized by revolts against tribute, forced labor and monopolies.",
            "The Ilocos revolt (1762–1763), better known as Silang's Revolt, was aimed at the babaknangs and the alcalde-mayor of Vigan.",
            "After Diego Silang's assassination on May 28, 1763, his wife Maria Josefa Gabriela continued the fight until she was captured and hanged on September 20, 1763."
        ],
        [
            "On March 25, 1898, Isabelo Abaya began an uprising in Candón and raised a red flag in the town plaza as a response to Spanish abuses and oppression.",
            "A revolutionary government was established, and several other revolts followed.",
            "The Spanish sent shock troops to re-occupy Candon, and most of the leaders and participants in the uprising who surrendered were arrested and executed."
        ],
        [
            "Philippine Revolution and Philippine-American War"
        ],
        [
            "Ilocos Sur, like other Philippine provinces, rallied behind Emilio Aguinaldo in the 1896 Philippine Revolution.",
            "When Vigan was captured, the rebels made Bishop's Palace their headquarters.",
            "On March 21, 1898, Mariano Acosta of Candón established a provincial revolutionary government.",
            "When General Aguinaldo returned from exile in Hong Kong, he sent Manuel Tinio to wage guerilla warfare on the Americans.",
            "Vigan was Tinio's headquarters until it was occupied by the U.S. 45th Infantry Division under James Parker on December 4, 1899.",
            "Gregorio del Pilar died on December 2, 1899, in the Battle of Tirad Pass."
        ],
        [
            "American invasion"
        ],
        [
            "Under the Americans, a civil government was established in Ilocos Sur on September 1, 1901.",
            "Mena Crisólogo, a delegate to the Malolos Congress, was the first provincial governor."
        ],
        [
            "Japanese occupation"
        ],
        [
            "On December 10, 1941, a contingent of Japanese Imperial forces landed in Mindoro, Vigan, Santa, Pandan and Caoayan.",
            "In Cervantes, the Battle of Bessang Pass was fought between Tomoyuki Yamashita's forces and the U.S. 21st Infantry; it was the greatest victory by Filipino guerrillas over the Japanese Imperial Army in World War II.",
            "The guerrillas mounted a series of attacks that lasted for almost six months in early 1945."
        ],
        [
            "Marcos era"
        ],
        [
            "Much of the history of Ilocos Sur during the 21 years of the Marcos dictatorship are not well-documented, with the most prominent portrayals of Ilocos Sur history preferring to skip from the years immediately after Philippine independence in the 1940s, jumping straight to contemporary times."
        ],
        [
            "But the most prominent protests and incidents of the period actually took place before 1972, and involved the Marcos administration's support for local strongmen: \"50\""
        ],
        [
            "Bantay incident"
        ],
        [
            "Marcos' victory in the 1965 Presidential Elections had required that he gain political control of the north as a solid voting block, which meant forming alliances with the most prominent local \"warlords\" of the time"
        ],
        [
            "But a turning point took place in May 1970 with the so-called \"Bantay Incident.\"",
            "The saka-saka assassinated a former mayor of Bantay, the town next to Vigan, in 1969, and then in May 1970, burned the villages of Ora Este and Ora Centro in retaliation for their residents' support for Crisologo's opponent Chavit Singson during the 1996 elections.",
            ": \"51\""
        ],
        [
            "Assassination of Floro Crisologo"
        ],
        [
            "Main article: Floro Crisologo"
        ],
        [
            "Shortly after his reported meeting with Marcos,"
        ],
        [
            "No special election was called to replace him in Congress,"
        ],
        [
            "Contemporary history"
        ],
        [
            "1986-87 Jose Burgos Jr provisional revolutionary governorship"
        ],
        [
            "See also: Provisional Government of the Philippines (1986–1987)"
        ],
        [
            "When the People Power Revolution which ended on February 25, 1986 deposed Ferdinand Marcos from power, and installed Corazon Aquino as the new president of the Philippines,"
        ],
        [
            "2020 COVID-19 pandemic"
        ],
        [
            "Main article: COVID-19 pandemic in the Ilocos Region"
        ],
        [
            "Executive Order No.",
            "12"
        ],
        [
            "After the approval of \"uniform travel protocols for land, air, and sea of the Department of the Interior and Local Government, crafted in close coordination with the Union of Local Authorities of the Philippines, League of Provinces of the Philippines, League of Municipalities of the Philippines, and the League of Cities of the Philippines,\" in Resolution No.",
            "101, Series of 2021, mandating the travel protocols for implementation in the province.",
            "The resolution institutionalized the use of the System Safe, Swift, and Smart Passage (S-PaSS) Travel Management System, and the executive order eliminated the mandatory testing requirement for persons in specific traveler classifications who seek to enter or pass through the province."
        ],
        [
            "2022 Luzon earthquake"
        ],
        [
            "Main article: 2022 Luzon earthquake"
        ],
        [
            "Ilocos Sur was severely affected by the 2022 Luzon earthquake, which was felt strongly in Ilocos Sur for 30 seconds or longer."
        ],
        [
            "Geography"
        ],
        [
            "Coastline of Vigan"
        ],
        [
            "Ilocos Sur occupies the central section of the Ilocos Region in northern Luzon.",
            "It is bordered by Ilocos Norte to the north, Abra to the northeast, Mountain Province to the east, Benguet to the southeast, La Union to the south, and the South China Sea to the west.",
            "Its area of 2,596.00 square kilometres (1,002.32 sq mi) occupies about 20% of the total land area of Region 1.",
            "The topography of Ilocos Sur ranges from 10 to 1,700 metres (33 to 5,577 ft) above sea level."
        ],
        [
            "Climate"
        ],
        [
            "The climate is generally dry as defined by the Hernandez climate classification—the dry months are from October to May.",
            "The southernmost portion in Cervantes is wet with rain evenly distributed throughout the year while the southeastern part of Sugpon receives less precipitation.",
            "The rainy season arrives in August while January and February have the lowest precipitation.",
            "The mean temperature in the province is 27 °C (81 °F).",
            "January is the coldest."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Ilocos Sur comprises 32 municipalities and 2 component cities, which are organized into two legislative districts."
        ],
        [
            "Political map of Ilocos Sur"
        ],
        [
            " †  Provincial capital and component city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Alilem"
        ],
        [
            "2nd"
        ],
        [
            "1.1%"
        ],
        [
            "7,361"
        ],
        [
            "6,695"
        ],
        [
            "1.82%"
        ],
        [
            "119.33"
        ],
        [
            "46.07"
        ],
        [
            "62"
        ],
        [
            "160"
        ],
        [
            "9"
        ],
        [
            "16°53′13″N 120°31′48″E﻿ / ﻿16.8870°N 120.5299°E﻿ / 16.8870; 120.5299﻿ (Alilem)"
        ],
        [
            "Banayoyo"
        ],
        [
            "2nd"
        ],
        [
            "1.1%"
        ],
        [
            "7,931"
        ],
        [
            "7,748"
        ],
        [
            "0.45%"
        ],
        [
            "24.63"
        ],
        [
            "9.51"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "14"
        ],
        [
            "17°14′09″N 120°28′47″E﻿ / ﻿17.2358°N 120.4797°E﻿ / 17.2358; 120.4797﻿ (Banayoyo)"
        ],
        [
            "Bantay"
        ],
        [
            "1st"
        ],
        [
            "5.4%"
        ],
        [
            "37,118"
        ],
        [
            "35,731"
        ],
        [
            "0.73%"
        ],
        [
            "76.60"
        ],
        [
            "29.58"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "34"
        ],
        [
            "17°34′54″N 120°23′11″E﻿ / ﻿17.5818°N 120.3865°E﻿ / 17.5818; 120.3865﻿ (Bantay)"
        ],
        [
            "Burgos"
        ],
        [
            "2nd"
        ],
        [
            "1.9%"
        ],
        [
            "12,793"
        ],
        [
            "12,224"
        ],
        [
            "0.87%"
        ],
        [
            "44.38"
        ],
        [
            "17.14"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "26"
        ],
        [
            "17°18′58″N 120°30′33″E﻿ / ﻿17.3160°N 120.5093°E﻿ / 17.3160; 120.5093﻿ (Burgos)"
        ],
        [
            "Cabugao"
        ],
        [
            "1st"
        ],
        [
            "5.6%"
        ],
        [
            "38,884"
        ],
        [
            "37,501"
        ],
        [
            "0.69%"
        ],
        [
            "95.56"
        ],
        [
            "36.90"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "33"
        ],
        [
            "17°47′33″N 120°27′21″E﻿ / ﻿17.7926°N 120.4559°E﻿ / 17.7926; 120.4559﻿ (Cabugao)"
        ],
        [
            "Candon"
        ],
        [
            "∗"
        ],
        [
            "2nd"
        ],
        [
            "8.9%"
        ],
        [
            "61,432"
        ],
        [
            "60,623"
        ],
        [
            "0.25%"
        ],
        [
            "103.28"
        ],
        [
            "39.88"
        ],
        [
            "590"
        ],
        [
            "1,500"
        ],
        [
            "42"
        ],
        [
            "17°11′22″N 120°26′51″E﻿ / ﻿17.1895°N 120.4474°E﻿ / 17.1895; 120.4474﻿ (Candon)"
        ],
        [
            "Caoayan"
        ],
        [
            "1st"
        ],
        [
            "2.8%"
        ],
        [
            "19,574"
        ],
        [
            "19,861"
        ],
        [
            "−0.28%"
        ],
        [
            "17.42"
        ],
        [
            "6.73"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "17"
        ],
        [
            "17°32′52″N 120°23′00″E﻿ / ﻿17.5477°N 120.3833°E﻿ / 17.5477; 120.3833﻿ (Caoayan)"
        ],
        [
            "Cervantes"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "19,449"
        ],
        [
            "17,211"
        ],
        [
            "2.35%"
        ],
        [
            "234.70"
        ],
        [
            "90.62"
        ],
        [
            "83"
        ],
        [
            "210"
        ],
        [
            "13"
        ],
        [
            "16°59′24″N 120°44′07″E﻿ / ﻿16.9899°N 120.7354°E﻿ / 16.9899; 120.7354﻿ (Cervantes)"
        ],
        [
            "Galimuyod"
        ],
        [
            "2nd"
        ],
        [
            "1.5%"
        ],
        [
            "10,244"
        ],
        [
            "10,748"
        ],
        [
            "−0.91%"
        ],
        [
            "34.40"
        ],
        [
            "13.28"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "24"
        ],
        [
            "17°10′59″N 120°28′07″E﻿ / ﻿17.1830°N 120.4687°E﻿ / 17.1830; 120.4687﻿ (Galimuyod)"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "2nd"
        ],
        [
            "0.6%"
        ],
        [
            "4,472"
        ],
        [
            "4,875"
        ],
        [
            "−1.63%"
        ],
        [
            "41.66"
        ],
        [
            "16.09"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "7"
        ],
        [
            "17°08′53″N 120°36′39″E﻿ / ﻿17.1481°N 120.6109°E﻿ / 17.1481; 120.6109﻿ (Gregorio del Pilar)"
        ],
        [
            "Lidlidda"
        ],
        [
            "2nd"
        ],
        [
            "0.7%"
        ],
        [
            "4,705"
        ],
        [
            "4,647"
        ],
        [
            "0.24%"
        ],
        [
            "33.84"
        ],
        [
            "13.07"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "11"
        ],
        [
            "17°15′07″N 120°31′15″E﻿ / ﻿17.2519°N 120.5207°E﻿ / 17.2519; 120.5207﻿ (Lidlidda)"
        ],
        [
            "Magsingal"
        ],
        [
            "1st"
        ],
        [
            "4.5%"
        ],
        [
            "31,308"
        ],
        [
            "30,792"
        ],
        [
            "0.32%"
        ],
        [
            "84.98"
        ],
        [
            "32.81"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "30"
        ],
        [
            "17°41′06″N 120°25′33″E﻿ / ﻿17.6851°N 120.4257°E﻿ / 17.6851; 120.4257﻿ (Magsingal)"
        ],
        [
            "Nagbukel"
        ],
        [
            "2nd"
        ],
        [
            "0.8%"
        ],
        [
            "5,465"
        ],
        [
            "5,259"
        ],
        [
            "0.73%"
        ],
        [
            "43.12"
        ],
        [
            "16.65"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "12"
        ],
        [
            "17°26′48″N 120°31′34″E﻿ / ﻿17.4466°N 120.5260°E﻿ / 17.4466; 120.5260﻿ (Nagbukel)"
        ],
        [
            "Narvacan"
        ],
        [
            "2nd"
        ],
        [
            "6.7%"
        ],
        [
            "46,234"
        ],
        [
            "44,006"
        ],
        [
            "0.94%"
        ],
        [
            "122.21"
        ],
        [
            "47.19"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "34"
        ],
        [
            "17°25′10″N 120°28′37″E﻿ / ﻿17.4194°N 120.4769°E﻿ / 17.4194; 120.4769﻿ (Narvacan)"
        ],
        [
            "Quirino"
        ],
        [
            "2nd"
        ],
        [
            "1.3%"
        ],
        [
            "9,306"
        ],
        [
            "8,573"
        ],
        [
            "1.57%"
        ],
        [
            "240.10"
        ],
        [
            "92.70"
        ],
        [
            "39"
        ],
        [
            "100"
        ],
        [
            "9"
        ],
        [
            "17°08′12″N 120°40′35″E﻿ / ﻿17.1367°N 120.6765°E﻿ / 17.1367; 120.6765﻿ (Quirino)"
        ],
        [
            "Salcedo"
        ],
        [
            "2nd"
        ],
        [
            "1.6%"
        ],
        [
            "11,110"
        ],
        [
            "11,288"
        ],
        [
            "−0.30%"
        ],
        [
            "103.44"
        ],
        [
            "39.94"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "21"
        ],
        [
            "17°09′03″N 120°32′10″E﻿ / ﻿17.1507°N 120.5361°E﻿ / 17.1507; 120.5361﻿ (Salcedo)"
        ],
        [
            "San Emilio"
        ],
        [
            "2nd"
        ],
        [
            "1.0%"
        ],
        [
            "7,206"
        ],
        [
            "7,407"
        ],
        [
            "−0.52%"
        ],
        [
            "141.44"
        ],
        [
            "54.61"
        ],
        [
            "51"
        ],
        [
            "130"
        ],
        [
            "8"
        ],
        [
            "17°14′19″N 120°34′44″E﻿ / ﻿17.2386°N 120.5789°E﻿ / 17.2386; 120.5789﻿ (San Emilio)"
        ],
        [
            "San Esteban"
        ],
        [
            "2nd"
        ],
        [
            "1.2%"
        ],
        [
            "8,381"
        ],
        [
            "8,349"
        ],
        [
            "0.07%"
        ],
        [
            "19.62"
        ],
        [
            "7.58"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "10"
        ],
        [
            "17°19′47″N 120°26′42″E﻿ / ﻿17.3297°N 120.4451°E﻿ / 17.3297; 120.4451﻿ (San Esteban)"
        ],
        [
            "San Ildefonso"
        ],
        [
            "1st"
        ],
        [
            "1.2%"
        ],
        [
            "8,190"
        ],
        [
            "7,787"
        ],
        [
            "0.97%"
        ],
        [
            "11.35"
        ],
        [
            "4.38"
        ],
        [
            "720"
        ],
        [
            "1,900"
        ],
        [
            "15"
        ],
        [
            "17°37′30″N 120°23′35″E﻿ / ﻿17.6249°N 120.3931°E﻿ / 17.6249; 120.3931﻿ (San Ildefonso)"
        ],
        [
            "San Juan"
        ],
        [
            "1st"
        ],
        [
            "3.9%"
        ],
        [
            "26,674"
        ],
        [
            "26,411"
        ],
        [
            "0.19%"
        ],
        [
            "64.37"
        ],
        [
            "24.85"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "32"
        ],
        [
            "17°44′32″N 120°27′30″E﻿ / ﻿17.7422°N 120.4583°E﻿ / 17.7422; 120.4583﻿ (San Juan)"
        ],
        [
            "San Vicente"
        ],
        [
            "1st"
        ],
        [
            "1.9%"
        ],
        [
            "13,118"
        ],
        [
            "12,758"
        ],
        [
            "0.53%"
        ],
        [
            "12.60"
        ],
        [
            "4.86"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "7"
        ],
        [
            "17°35′39″N 120°22′22″E﻿ / ﻿17.5941°N 120.3729°E﻿ / 17.5941; 120.3729﻿ (San Vicente)"
        ],
        [
            "Santa"
        ],
        [
            "2nd"
        ],
        [
            "2.2%"
        ],
        [
            "14,992"
        ],
        [
            "15,340"
        ],
        [
            "−0.44%"
        ],
        [
            "109.10"
        ],
        [
            "42.12"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "26"
        ],
        [
            "17°29′10″N 120°26′04″E﻿ / ﻿17.4860°N 120.4344°E﻿ / 17.4860; 120.4344﻿ (Santa)"
        ],
        [
            "Santa Catalina"
        ],
        [
            "1st"
        ],
        [
            "2.1%"
        ],
        [
            "14,493"
        ],
        [
            "13,945"
        ],
        [
            "0.74%"
        ],
        [
            "9.68"
        ],
        [
            "3.74"
        ],
        [
            "1,500"
        ],
        [
            "3,900"
        ],
        [
            "9"
        ],
        [
            "17°35′20″N 120°21′48″E﻿ / ﻿17.5888°N 120.3634°E﻿ / 17.5888; 120.3634﻿ (Santa Catalina)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "2nd"
        ],
        [
            "6.0%"
        ],
        [
            "41,366"
        ],
        [
            "39,868"
        ],
        [
            "0.70%"
        ],
        [
            "88.78"
        ],
        [
            "34.28"
        ],
        [
            "470"
        ],
        [
            "1,200"
        ],
        [
            "49"
        ],
        [
            "17°05′04″N 120°27′07″E﻿ / ﻿17.0844°N 120.4520°E﻿ / 17.0844; 120.4520﻿ (Santa Cruz)"
        ],
        [
            "Santa Lucia"
        ],
        [
            "2nd"
        ],
        [
            "3.8%"
        ],
        [
            "25,966"
        ],
        [
            "25,402"
        ],
        [
            "0.42%"
        ],
        [
            "49.72"
        ],
        [
            "19.20"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "36"
        ],
        [
            "17°07′02″N 120°26′53″E﻿ / ﻿17.1173°N 120.4480°E﻿ / 17.1173; 120.4480﻿ (Santa Lucia)"
        ],
        [
            "Santa Maria"
        ],
        [
            "2nd"
        ],
        [
            "4.4%"
        ],
        [
            "30,006"
        ],
        [
            "30,321"
        ],
        [
            "−0.20%"
        ],
        [
            "63.31"
        ],
        [
            "24.44"
        ],
        [
            "470"
        ],
        [
            "1,200"
        ],
        [
            "33"
        ],
        [
            "17°22′03″N 120°28′51″E﻿ / ﻿17.3676°N 120.4807°E﻿ / 17.3676; 120.4807﻿ (Santa Maria)"
        ],
        [
            "Santiago"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "19,471"
        ],
        [
            "18,759"
        ],
        [
            "0.71%"
        ],
        [
            "46.36"
        ],
        [
            "17.90"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "24"
        ],
        [
            "17°17′38″N 120°26′43″E﻿ / ﻿17.2940°N 120.4453°E﻿ / 17.2940; 120.4453﻿ (Santiago)"
        ],
        [
            "Santo Domingo"
        ],
        [
            "1st"
        ],
        [
            "4.2%"
        ],
        [
            "29,041"
        ],
        [
            "27,975"
        ],
        [
            "0.71%"
        ],
        [
            "55.49"
        ],
        [
            "21.42"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "36"
        ],
        [
            "17°38′16″N 120°24′36″E﻿ / ﻿17.6378°N 120.4101°E﻿ / 17.6378; 120.4101﻿ (Santo Domingo)"
        ],
        [
            "Sigay"
        ],
        [
            "2nd"
        ],
        [
            "0.4%"
        ],
        [
            "2,552"
        ],
        [
            "2,737"
        ],
        [
            "−1.32%"
        ],
        [
            "81.55"
        ],
        [
            "31.49"
        ],
        [
            "31"
        ],
        [
            "80"
        ],
        [
            "7"
        ],
        [
            "17°02′34″N 120°34′46″E﻿ / ﻿17.0429°N 120.5795°E﻿ / 17.0429; 120.5795﻿ (Sigay)"
        ],
        [
            "Sinait"
        ],
        [
            "1st"
        ],
        [
            "3.8%"
        ],
        [
            "25,998"
        ],
        [
            "25,640"
        ],
        [
            "0.26%"
        ],
        [
            "65.56"
        ],
        [
            "25.31"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "44"
        ],
        [
            "17°51′59″N 120°27′22″E﻿ / ﻿17.8664°N 120.4561°E﻿ / 17.8664; 120.4561﻿ (Sinait)"
        ],
        [
            "Sugpon"
        ],
        [
            "2nd"
        ],
        [
            "0.7%"
        ],
        [
            "4,930"
        ],
        [
            "4,585"
        ],
        [
            "1.39%"
        ],
        [
            "57.11"
        ],
        [
            "22.05"
        ],
        [
            "86"
        ],
        [
            "220"
        ],
        [
            "6"
        ],
        [
            "16°49′38″N 120°29′45″E﻿ / ﻿16.8272°N 120.4959°E﻿ / 16.8272; 120.4959﻿ (Sugpon)"
        ],
        [
            "Suyo"
        ],
        [
            "2nd"
        ],
        [
            "1.6%"
        ],
        [
            "10,766"
        ],
        [
            "11,446"
        ],
        [
            "−1.16%"
        ],
        [
            "124.00"
        ],
        [
            "47.88"
        ],
        [
            "87"
        ],
        [
            "230"
        ],
        [
            "8"
        ],
        [
            "16°58′33″N 120°31′30″E﻿ / ﻿16.9758°N 120.5249°E﻿ / 16.9758; 120.5249﻿ (Suyo)"
        ],
        [
            "Tagudin"
        ],
        [
            "2nd"
        ],
        [
            "6.0%"
        ],
        [
            "41,538"
        ],
        [
            "39,277"
        ],
        [
            "1.07%"
        ],
        [
            "151.19"
        ],
        [
            "58.37"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "43"
        ],
        [
            "16°56′04″N 120°26′42″E﻿ / ﻿16.9345°N 120.4450°E﻿ / 16.9345; 120.4450﻿ (Tagudin)"
        ],
        [
            "Vigan City"
        ],
        [
            "†"
        ],
        [
            "1st"
        ],
        [
            "7.8%"
        ],
        [
            "53,935"
        ],
        [
            "53,879"
        ],
        [
            "0.02%"
        ],
        [
            "25.12"
        ],
        [
            "9.70"
        ],
        [
            "2,100"
        ],
        [
            "5,400"
        ],
        [
            "39"
        ],
        [
            "17°34′22″N 120°23′12″E﻿ / ﻿17.5729°N 120.3867°E﻿ / 17.5729; 120.3867﻿ (Vigan)"
        ],
        [
            "Total"
        ],
        [
            "706,009"
        ],
        [
            "689,668"
        ],
        [
            "0.45%"
        ],
        [
            "2,596.00"
        ],
        [
            "1,002.32"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "768"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Barangays"
        ],
        [
            "The 32 municipalities and 2 cities of the province comprise a total of 768 barangays, with Puro in Magsingal as the most populous in 2010, and Montero in Banayoyo as the least."
        ],
        [
            "Further information: List of barangays in Ilocos Sur"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Ilocos SurYearPop.±% p.a.1903 189,572—    1918 247,458+1.79%1939 271,532+0.44%1948 276,278+0.19%1960 338,058+1.70%1970 385,139+1.31%1975 419,776+1.74%1980 443,591+1.11%1990 519,966+1.60%1995 545,385+0.90%2000 594,206+1.85%2007 633,138+0.88%2010 658,587+1.44%2015 689,668+0.88%2020 706,009+0.46%Source: Philippine Statistics Authority"
        ],
        [
            "According to the 2020 census, it has a population of 706,009 people, with a density of 270 inhabitants per square kilometre or 700 inhabitants per square mile."
        ],
        [
            "The 1960 census lists 338,058 people; 64,446 dwelling units of which 2,974 are lighted with electricity; 3227 provided with radio; 7379 served with pipe water; 25,137 served with artesian and pumped water; and 310 using electricity, kerosene and gas for cooking."
        ],
        [
            "Inhabitants"
        ],
        [
            "Main article: Ilocano people"
        ],
        [
            "Ilocos Sur is inhabited mostly by Ilocanos belonging to the third largest ethnic group of Austronesian origin.",
            "A Spanish chronicler"
        ],
        [
            "Miguel de Loarca records around 1582 that the Ilocanos are intelligent as the Zambaleños for they are farmers.",
            "The main occupation of the people is agriculture."
        ],
        [
            "Father Juan de Medina noted in 1630 that the natives are ‘the humblest and most tractable known and lived in nest and large settlements'."
        ],
        [
            "Language"
        ],
        [
            "Main article: Ilocano language"
        ],
        [
            "Ilocano is the main language of the native majority in the province, with neighboring La Union recognized it as an official language since 2012.",
            "Filipino/Tagalog and English are also spoken and understood in the region, utilized in business, education and media."
        ],
        [
            "Religion"
        ],
        [
            "The province is predominantly Roman Catholic with 75% of population adherence.",
            "Aglipayan Church is also a considerable large minority with a 20% adherence.",
            "Other religious beliefs are represented by other Christian Churches such as Baptist and Iglesia ni Cristo wherein the largest minority has 80 plus lokal or kapilyas and barangay chapels built in the province.",
            "Denominations with 1–2% adherence include the Methodist, Seventh-day Adventist, and other Evangelical Christians, as well as Muslims."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Ilocos Sur"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  20.81"
        ],
        [
            "2009  18.06"
        ],
        [
            "2012  17.29"
        ],
        [
            "2015  13.89"
        ],
        [
            "2018  7.50"
        ],
        [
            "2021  11.50"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Sinait Public Market"
        ],
        [
            "This section is missing information about economic indicators (e.g.",
            "per capita income, unemployment, etc).",
            "Please expand the section to include this information.",
            "Further details may exist on the talk page.",
            "(October 2021)"
        ],
        [
            "Products and industries"
        ],
        [
            "The people are engaged in farming, producing food crops, mostly rice, corn, vegetable, root crops, and fruits.",
            "Non-food crops include tobacco, cotton, and tigergrass.",
            "Cottage industries include loom weaving, furniture making, jewelry making, ceramics, blacksmithing, and food processing."
        ],
        [
            "Agriculture"
        ],
        [
            "Rice grains being dried on a road in San Esteban."
        ],
        [
            "Ilocos Sur's economy is agrarian, but its 2,647 square kilometres (1,022 sq mi) of unfertile land is not enough to support a population of 338,579."
        ],
        [
            "Agricultural crops such as rice, corn tobacco and fruit trees dominate their farm industries.",
            "Secondary crops are camote and cassava, sugar cane and onions."
        ],
        [
            "The rapidly growing population, the decreasing fertility of the soil, and the long period between the planting and harvesting season, have forced the people to turn to manufacture and trade.",
            "Many Ilocanos go to the Cagayán valley, Central Plains and Mindanao to sell Ilocano woven cloth."
        ],
        [
            "Virginia leaf tobacco is still a premier cash crop, after a windfall brought about by the Tobacco Subsidy Law authored by Congressman Floro Crisologo in 1964,"
        ],
        [
            "Weaving is the most extensive handicraft, once bolstered by the installation of the NDC Textile Mills in Narvacan which supplied the weavers with yarn."
        ],
        [
            "Other industries are burnay and slipper making in Vigan, furniture, cabinet, and statue making in San Vicente, mortar and pestle making in San Esteban, and bolo making in Santa."
        ],
        [
            "Infrastructure"
        ],
        [
            "Electricity"
        ],
        [
            "All municipalities in Ilocos Sur are electrified, courtesy of the Ilocos Sur Electric Cooperative (ISECO)."
        ],
        [
            "Education"
        ],
        [
            "Ilocos Sur has 547 public schools including five general high schools, one university, one agricultural college and 56 private schools, 16 of which are Catholic."
        ],
        [
            "Culture"
        ],
        [
            "The Ilocos Sur Museum, founded on August 22, 1970, has a collection of cultural treasures which include art include paintings, centuries-old sculptures, pieces of carved furniture, and relics of Spanish European and Chinese cultures that had influenced Ilocano life for centuries."
        ],
        [
            "Chapters of Philippine history and religion are found in the Crisólogo collections which includes family heirlooms, centuries –old \"santos\" (religious statuettes made of wood or ivory), other ivory images, Vienna furniture, marble-topped tables, ancient-carved beds, rare Chinese porcelains, jars and jarlettes, lamps, Muslim brass wares, and Spanish and Mexican coins."
        ],
        [
            "The Syquia collections, including then President Elpidio Quirino's memorabilia, vie in quality with the Crisólogo collections.",
            "But in the midst of a fire scare in Vigan in the late 1908s and 1990s, the relics in the Syquia Mansion were transferred to Manila for safekeeping."
        ],
        [
            "UNESCO Recognitions in Ilocos Sur"
        ],
        [
            "UNESCO has inscribed two Ilocos Sur sites in the World Heritage List."
        ],
        [
            "Heritage City of Vigan"
        ],
        [
            "In 1999, the Heritage City of Vigan was inscribed in the World Heritage List.",
            "UNESCO describes the site as:"
        ],
        [
            "\"Established in the 16th century, Vigan is the best-preserved example of a planned Spanish colonial town in Asia.",
            "Its architecture reflects the coming together of cultural elements from elsewhere in the Philippines, from China and from Europe, resulting in a culture and townscape that have no parallel anywhere in East and South-East Asia.\""
        ],
        [
            "Santa Maria Church"
        ],
        [
            "In 1993, the Baroque Churches of the Philippines, containing 4 properties, was inscribed in the World Heritage List.",
            "One of the properties was the Santa Maria Church of Ilocos Sur.",
            "UNESCO describes, \""
        ],
        [
            "Notable people from Ilocos Sur"
        ],
        [
            "José Burgos — priest and one of the martyrs of Gomburza"
        ],
        [
            "Gabriela Silang — revolutionary leader, best known as the first female leader of a Filipino movement for independence from Spain"
        ],
        [
            "Leona Florentino — feminist, poet, and dramatist, the \"mother of Philippine women's literature\""
        ],
        [
            "Isabelo de los Reyes — prominent Filipino patriot, politician, writer and labor activist, founder of the Philippine Independent Church (an independent Philippine nationalist church).",
            "He is known as the \"Father of Philippine Folklore\", the \"Father of the Philippine Labor Movement\","
        ],
        [
            "Elpidio Quirino — 6th President of the Philippines, 2nd Vice President of the Philippines"
        ],
        [
            "William Dar — 45th Secretary of Agriculture, and horticulturist"
        ],
        [
            "Sixto Brillantes — 21st chairman of Commission on Elections"
        ],
        [
            "Marcelino Crisólogo - Filipino politician, poet, writer, and playwright."
        ],
        [
            "Jose Ping-ay - Filipino politician and founder of Ilocos Sur Cooperative Bank"
        ],
        [
            "Abraham Sarmiento - 119th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Alan Purisima - 17th Chief of the Philippine National Police"
        ],
        [
            "Alfredo Verzosa -  Filipino Catholic bishop and was venerated as a Servant of God in the Catholic Church"
        ],
        [
            "Leopoldo Jaucian - Filipino Catholic bishop"
        ],
        [
            "Pedro Bucaneg — poet and the \"Father of Ilocano literature\""
        ],
        [
            "Leon C. Pichay - writer and poet, \"King of Ilocano Poets\" during the 50s."
        ],
        [
            "Jose L. de Ocampo - Filipino architect and artist."
        ],
        [
            "Nestor Redondo -  Filipino comics artist"
        ],
        [
            "Virgilio Redondo - Filipino comics artist"
        ],
        [
            "Philip Vera Cruz - Filipino American labor leader, farmworker, and leader in the Asian American movement"
        ],
        [
            "Jose Maria Sison - Founding chairman of the Communist Party of the Philippines"
        ],
        [
            "Krishnah Gravidez – Resigned Miss Charm Philippines 2024, from Santiago, Ilocos Sur"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved September 19, 2013."
        ],
        [
            "^ \"Mount Camingingel\".",
            "PeakVisor.",
            "Retrieved June 8, 2021."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Gender and Special Population Groups; Provincial Human Development Index\".",
            "Philippine Statistics Authority.",
            "Archived from the original on June 17, 2020.",
            "Retrieved January 12, 2021."
        ],
        [
            "^ \"Purchase and Delivery of a Delivery van for the Botika ti Probinsya ti Ilocos Sur Office\".",
            "Archived from the original on September 24, 2015.",
            "Retrieved July 7, 2010."
        ],
        [
            "^ \"Purchase and Delivery of Materials for the Construction of New Steel Bleachers and Repair of Existing Steel Bleachers\".",
            "Archived from the original on March 3, 2016.",
            "Retrieved July 7, 2010."
        ],
        [
            "^ Ranada, Pia (October 16, 2019).",
            "\"Bringing home the Pigafetta manuscripts\".",
            "RAPPLER.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"History of Ilocos Sur | Province of Ilocos Sur\".",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"The Countryside in Figures Ilocos Sur\" (PDF).",
            "rsso01.psa.gov.ph.",
            "Archived from the original (PDF) on January 7, 2022.",
            "Retrieved April 8, 2024."
        ],
        [
            "^ Aquino, Belinda.",
            "\"The Politics of Ethnicity among Ilokanos in Hawaii\".",
            "www.hawaii.edu.",
            "Retrieved June 20, 2023."
        ],
        [
            "^ \"Diego Silang and Maria Josefa Gabriela Silang | Vigan.ph\".",
            "June 14, 2015.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"Basi Revolt Of September 16, 1807 - The Philippines Today\".",
            "December 18, 2018.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"History - Candon City Official Website\".",
            "November 28, 2022.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ a b c d e f g h i j k l Pawilen, Reidan M. (January–December 2020).",
            "\"The Solid North Myth: An Investigation the Status of Dissent and Human Rights during the Marcos regime in Regions 1 and 2, (1969-1986)\".",
            "UP los Baños Journal.",
            "XVIII (1).",
            "Archived from the original on November 13, 2021."
        ],
        [
            "^ \"Ilocanos remember dark days of martial law, vow to continue fight\".",
            "October 2, 2012."
        ],
        [
            "^ McCoy, A.",
            "“Dark Legacy: Human Rights Under the Marcos Regime” in Memory, Truth Telling, and the Pursuit of Justice: A Conference on the Legacies of the Marcos Dictatorship.",
            "Quezon City: Ateneo De Manila University Press, 2001."
        ],
        [
            "^ \"About Us | Police Regional Office 1\".",
            "Archived from the original on October 4, 2022."
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/zacarias-agatep/"
        ],
        [
            "^ a b Davis, Leonard.",
            "Revolutionary Struggle in the Philippines.",
            "London: Palgrave Macmillan, 1989"
        ],
        [
            "^ a b c d e f g McCoy, A.",
            "“Global Populism: A Lineage of Filipino Strongmen from Quezon to Marcos and Duterte,” in Kasarinlan (Quezon City) 32, Issue nos.",
            "1-2, 2017."
        ],
        [
            "^ a b c d e f g h i https://thebaguiochronicle.com/literature/solid-north-not-gold-and-honey-but-blood-and-money-2/"
        ],
        [
            "^ Cimatu, Frank (June 26, 2022).",
            "\"Blood and money, not gold and honey, birthed Solid North\".",
            "Rappler.",
            "Retrieved June 30, 2023."
        ],
        [
            "^ \"Tobacco enriches, corrupts northern Philippines\".",
            "Arab News.",
            "June 23, 2013.",
            "Retrieved June 30, 2023."
        ],
        [
            "^ \"CLOSE MARCOS AIDE SLAIN IN PHILIPPINES\".",
            "New York Times.",
            "June 23, 2013.",
            "Retrieved June 30, 2023."
        ],
        [
            "^ \"ROSTER of Philippine Legislators (from 1907 to 2019)\" (PDF).",
            "House of Representatives of the Philippines.",
            "Retrieved September 23, 2022."
        ],
        [
            "^ Clines, Francis X.",
            "(March 26, 1986).",
            "\"Aquino Proclaims Interim Government\".",
            "The New York Times.",
            "Retrieved August 17, 2021."
        ],
        [
            "^ Cawley, Janet (March 26, 1986).",
            "\"'Freedom Constitution' Gives Aquino Free Reign\".",
            "Chicago Tribune.",
            "Retrieved August 17, 2021."
        ],
        [
            "^ A Changeless Land: Continuity and Change in Philippine Politics ISBN 9789814379625"
        ],
        [
            "^ \"Executive Order No.",
            "12, Series of 2020, Office of the Governor, Province of Ilocos Sur\".",
            "Facebook.",
            "March 12, 2020.",
            "Retrieved March 13, 2020."
        ],
        [
            "^ \"Executive Order No.",
            "13, Series of 2020, Office of the Governor, Province of Ilocos Sur\".",
            "Facebook.",
            "March 13, 2020.",
            "Retrieved March 13, 2020."
        ],
        [
            "^ Quimoyog, Joyah Mae (March 13, 2020).",
            "\"Classes suspended in Ilocos Sur until April 12 due to COVID-19\".",
            "Philippine Information Agency.",
            "Retrieved March 30, 2020."
        ],
        [
            "^ \"Executive Order No.",
            "14, Series of 2020, Office of the Governor, Province of Ilocos Sur\".",
            "Facebook.",
            "March 16, 2020.",
            "Retrieved March 16, 2020."
        ],
        [
            "^ \"Resolution No.",
            "101 Series of 2021, Inter-Agency task Force for the Management of Emerging Infectious Diseases\" (PDF).",
            "Official Gazette of the Republic of the Philippines.",
            "February 26, 2021.",
            "Retrieved March 17, 2021."
        ],
        [
            "^ \"Executive Order No.",
            "22, Series of 2021, Office of the Governor, Province of Ilocos Sur\".",
            "Facebook.",
            "March 9, 2021.",
            "Retrieved March 17, 2021."
        ],
        [
            "^ \"Powerful 7.1 magnitude earthquake strikes northern Philippines, strongly felt in Manila\".",
            "Reuters.",
            "July 27, 2022.",
            "Archived from the original on July 27, 2022.",
            "Retrieved July 27, 2022."
        ],
        [
            "^ a b \"100 bahay sa Ilocos Sur, totally damaged sa magnitude 7 na lindol; restoration sa heritage sites, aabutin pa ng isang taon\" .",
            "RadyoMaN Manila (in Tagalog).",
            "August 1, 2022.",
            "Archived from the original on August 1, 2022.",
            "Retrieved August 2, 2022."
        ],
        [
            "^ \"Look: State of Vigan City roads, buildings after magnitude 7.3 earthquake\".",
            "Top Gear Philippines.",
            "July 27, 2022.",
            "Archived from the original on July 27, 2022.",
            "Retrieved July 27, 2022."
        ],
        [
            "^ \"Heritage structures, churches damaged by 7.3 quake\".",
            "Inquirer.",
            "July 27, 2022.",
            "Archived from the original on July 27, 2022.",
            "Retrieved July 27, 2022."
        ],
        [
            "^ Sadongdong, Martin (July 27, 2022).",
            "\"Strong Abra quake damages Vigan Cathedral, Bantay Bell Tower in Ilocos Sur\".",
            "Manila Bulletin.",
            "Archived from the original on July 27, 2022.",
            "Retrieved July 27, 2022."
        ],
        [
            "^ a b c d \"Province: Ilocos Sur\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Philippines Census Of Population of all LGUs 1903-2007\".",
            "archive.org.",
            "Philippine Statistics Authority.",
            "Retrieved February 14, 2017."
        ],
        [
            "^ Elias, Jun.",
            "\"Iloko La Union's official language\".",
            "Philstar.com.",
            "Retrieved September 23, 2023."
        ],
        [
            "^ Webster (April 30, 2022).",
            "\"Language of the Month April 2022: Ilocano\".",
            "The National Museum of Language.",
            "Retrieved September 23, 2023."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"A Review of the Agriculture Sector in Ilocos Region | Philippine Statistics Authority | Republic of the Philippines\".",
            "psa.gov.ph.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"Statistical Tables | Philippine Statistics Authority | Republic of the Philippines\".",
            "psa.gov.ph.",
            "Retrieved September 4, 2023."
        ],
        [
            "^ \"Republic Act No.",
            "4155\".",
            "lawphil.net."
        ],
        [
            "^ \"Republic Act No.",
            "7171 : REPUBLIC ACTS - PHILIPPINE LAWS STATUTES and CODES\".",
            "laws.chanrobles.com."
        ],
        [
            "^ Centre, UNESCO World Heritage.",
            "\"Historic City of Vigan\".",
            "UNESCO World Heritage Centre."
        ],
        [
            "^ Centre, UNESCO World Heritage.",
            "\"Baroque Churches of the Philippines\".",
            "UNESCO World Heritage Centre."
        ],
        [
            "^ Bragado, Erlinda (2002).",
            "\"\"Sukimátem\": Isabelo de los Reyes Revisited\" (PDF).",
            "Philippine Studies.",
            "50 (1): 50–75.",
            "Retrieved February 20, 2019."
        ],
        [
            "^ Saulo, Alfredo (2002).",
            "Communism in the Philippines : An Introduction (Enlarged ed.).",
            "Manila, Philippines: Ateneo de Manila University Press.",
            "ISBN 9715504035.",
            "OCLC 969406494."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Ilocos Sur at Wikimedia Commons"
        ],
        [
            " Geographic data related to Ilocos Sur at OpenStreetMap"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Ilocos Sur"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "South China Sea"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "AbraMountain Province"
        ],
        [
            "La Union"
        ],
        [
            "Benguet"
        ],
        [
            "vte Province of Ilocos SurVigan (capital)  Candon (largest city)Municipalities"
        ],
        [
            "Alilem"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bantay"
        ],
        [
            "Burgos"
        ],
        [
            "Cabugao"
        ],
        [
            "Caoayan"
        ],
        [
            "Cervantes"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Lidlidda"
        ],
        [
            "Magsingal"
        ],
        [
            "Nagbukel"
        ],
        [
            "Narvacan"
        ],
        [
            "Quirino"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Juan"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Component cities"
        ],
        [
            "Candon"
        ],
        [
            "Vigan"
        ],
        [
            "BarangaysSee: List of barangays in Ilocos Sur"
        ],
        [
            "Articles related to Ilocos Sur"
        ],
        [
            "vteIlocos Region (Region I)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "La Union"
        ],
        [
            "Pangasinan"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Batac"
        ],
        [
            "Candon"
        ],
        [
            "Laoag"
        ],
        [
            "San Carlos"
        ],
        [
            "San Fernando"
        ],
        [
            "Urdaneta"
        ],
        [
            "Vigan"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Laoag"
        ],
        [
            "Lingayen"
        ],
        [
            "San Fernando"
        ],
        [
            "Vigan"
        ],
        [
            "Municipalities"
        ],
        [
            "Adams"
        ],
        [
            "Agno"
        ],
        [
            "Agoo"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Alilem"
        ],
        [
            "Anda"
        ],
        [
            "Aringay"
        ],
        [
            "Asingan"
        ],
        [
            "Bacarra"
        ],
        [
            "Bacnotan"
        ],
        [
            "Badoc"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Balungao"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bangar"
        ],
        [
            "Bangui"
        ],
        [
            "Bani"
        ],
        [
            "Banna"
        ],
        [
            "Bantay"
        ],
        [
            "Basista"
        ],
        [
            "Bauang"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos (Ilocos Norte)"
        ],
        [
            "Burgos (Ilocos Sur)"
        ],
        [
            "Burgos (La Union)"
        ],
        [
            "Burgos (Pangasinan)"
        ],
        [
            "Caba"
        ],
        [
            "Cabugao"
        ],
        [
            "Calasiao"
        ],
        [
            "Caoayan"
        ],
        [
            "Carasi"
        ],
        [
            "Cervantes"
        ],
        [
            "Currimao"
        ],
        [
            "Dasol"
        ],
        [
            "Dingras"
        ],
        [
            "Dumalneg"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lidlidda"
        ],
        [
            "Lingayen"
        ],
        [
            "Luna"
        ],
        [
            "Mabini"
        ],
        [
            "Magsingal"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Marcos"
        ],
        [
            "Nagbukel"
        ],
        [
            "Naguilian"
        ],
        [
            "Narvacan"
        ],
        [
            "Natividad"
        ],
        [
            "Nueva Era"
        ],
        [
            "Pagudpud"
        ],
        [
            "Paoay"
        ],
        [
            "Pasuquin"
        ],
        [
            "Piddig"
        ],
        [
            "Pinili"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Pugo"
        ],
        [
            "Quirino"
        ],
        [
            "Rosales"
        ],
        [
            "Rosario"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Fabian"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Juan (Ilocos Sur)"
        ],
        [
            "San Juan (La Union)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas (Ilocos Norte)"
        ],
        [
            "San Nicolas (Pangasinan)"
        ],
        [
            "San Quintin"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria (Ilocos Sur)"
        ],
        [
            "Santa Maria (Pangasinan)"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas (La Union)"
        ],
        [
            "Santo Tomas (Pangasinan)"
        ],
        [
            "Santol"
        ],
        [
            "Sarrat"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sison"
        ],
        [
            "Solsona"
        ],
        [
            "Sual"
        ],
        [
            "Sudipen"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Tayug"
        ],
        [
            "Tubao"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Vintar"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Ilocos_Sur&oldid=1233752306\""
        ],
        [
            "Categories: Ilocos SurProvinces of the PhilippinesProvinces of the Ilocos RegionStates and territories established in 18181818 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 Tagalog-language sources (tl)Articles with short descriptionShort description is different from WikidataArticles needing additional references from September 2013All articles needing additional referencesUse Philippine English from March 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from July 2022Pages using multiple image with auto scaled imagesCoordinates on WikidataArticles containing Ilocano-language textArticles containing Tagalog-language textArticles that may contain original research from February 2015All articles that may contain original researchArticles containing Spanish-language textAll articles with unsourced statementsArticles with unsourced statements from April 2024All Wikipedia articles needing clarificationWikipedia articles needing clarification from April 2016Articles with unsourced statements from June 2016All articles with specifically marked weasel-worded phrasesArticles with specifically marked weasel-worded phrases from April 2016Articles with unsourced statements from April 2016Articles with unsourced statements from February 2015Articles to be expanded from October 2021Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}