{
    "name": "Iloilo",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Iloilo"
        ],
        [
            "43 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوVènetoTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°00′N 122°40′E﻿ / ﻿11°N 122.67°E﻿ / 11; 122.67"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "This article is about the Philippine province.",
            "For its capital city, see Iloilo City.",
            "For other uses, see Iloilo (disambiguation)."
        ],
        [
            "Province in Western Visayas, PhilippinesIloiloProvinceClockwise from top-left: Miag-ao Church, Islas de Gigantes, San Joaquin Campo Santo, Santa Barbara Church, Cabugao Island, Sicogon Island, Bucari Pine Forest"
        ],
        [
            "FlagSealNickname: Heart of the PhilippinesAnthem: Himno sang Probinsya sang Iloilo (Iloilo Provincial Hymn)Location in the PhilippinesOpenStreetMapCoordinates: 11°00′N 122°40′E﻿ / ﻿11°N 122.67°E﻿ / 11; 122.67CountryPhilippinesRegionWestern VisayasFounded1566Capitaland largest cityIloilo CityGovernment • TypeSangguniang Panlalawigan • GovernorArthur R. Defensor Jr. (PFP) • Vice GovernorChristine S. Garin (NP) • LegislatureIloilo Provincial BoardArea • Total2,051,899 • Rank12th out of 81 • Density410/km2 (1,100/sq mi)  • Rank14th out of 81 (excluding Iloilo City)DemonymIlonggoDivisions • Independent cities"
        ],
        [
            "1"
        ],
        [
            " Iloilo City(Highly urbanized city)"
        ],
        [
            " • Component cities"
        ],
        [
            "1"
        ],
        [
            " Passi"
        ],
        [
            " • Municipalities"
        ],
        [
            "42"
        ],
        [
            " Ajuy"
        ],
        [
            " Alimodian"
        ],
        [
            " Anilao"
        ],
        [
            " Badiangan"
        ],
        [
            " Balasan"
        ],
        [
            " Banate"
        ],
        [
            " Barotac Nuevo"
        ],
        [
            " Barotac Viejo"
        ],
        [
            " Batad"
        ],
        [
            " Bingawan"
        ],
        [
            " Cabatuan"
        ],
        [
            " Calinog"
        ],
        [
            " Carles"
        ],
        [
            " Concepcion"
        ],
        [
            " Dingle"
        ],
        [
            " Dueñas"
        ],
        [
            " Dumangas"
        ],
        [
            " Estancia"
        ],
        [
            " Guimbal"
        ],
        [
            " Igbaras"
        ],
        [
            " Janiuay"
        ],
        [
            " Lambunao"
        ],
        [
            " Leganes"
        ],
        [
            " Lemery"
        ],
        [
            " Leon"
        ],
        [
            " Maasin"
        ],
        [
            " Miagao"
        ],
        [
            " Mina"
        ],
        [
            " New Lucena"
        ],
        [
            " Oton"
        ],
        [
            " Pavia"
        ],
        [
            " Pototan"
        ],
        [
            " San Dionisio"
        ],
        [
            " San Enrique"
        ],
        [
            " San Joaquin"
        ],
        [
            " San Miguel"
        ],
        [
            " San Rafael"
        ],
        [
            " Santa Barbara"
        ],
        [
            " Sara"
        ],
        [
            " Tigbauan"
        ],
        [
            " Tubungan"
        ],
        [
            " Zarraga"
        ],
        [
            " • Barangays1,721including independent cities: 1,901 • Districts"
        ],
        [
            "Legislative districts of Iloilo"
        ],
        [
            "Legislative district of Iloilo City"
        ],
        [
            "Time zoneUTC+8 (PST)ZIP code5000–5043IDD : area code +63 (0)33ISO 3166 codePH-ILIHDI 0.800 (Very High)HDI rank4th in Philippines (2019)GDP (2022)₱351.05 billion $5.98 billion Growth rate 8.5%LanguagesHiligaynonKinaray-aCapiznonAtiFilipinoEnglishWebsiteiloilo.gov.ph"
        ],
        [
            "Iloilo  (), officially the Province of Iloilo (Hiligaynon: Kapuoran sang Iloilo; Kinaray-a: Kapuoran kang Iloilo; Cebuano: Lalawigan sa Iloilo; Filipino: Lalawigan ng Iloilo; Spanish: Província de Iloílo),  is a province in the Philippines located in the Western Visayas region.",
            "Its capital and largest city is Iloilo City, the regional center of Western Visayas.",
            "Iloilo occupies the southeast portion of the Visayan island of Panay and is bordered by the province of Antique to the west, Capiz to the north, the Jintotolo Channel to the northeast, the Guimaras Strait to the east, and the Iloilo Strait and Panay Gulf to the southwest."
        ],
        [
            "Just off Iloilo's southeast coast is the island province of Guimaras, once part of Iloilo but now an independent province.",
            "Across Panay Gulf and Guimaras Strait is Negros Occidental, occupying the northwestern half of the larger island of Negros.",
            "Iloilo City, its capital, is the center of the Iloilo–Guimaras Metropolitan Area or Metro Iloilo–Guimaras, and is geographically located in the province and grouped under it by the Philippine Statistics Authority, but remains politically independent from the provincial government.",
            "According to the 2020 census, the population of the province (excluding Iloilo City) is 2,051,899.",
            "If Iloilo City is included, the population is 2,509,525 in total."
        ],
        [
            "Iloilo is known for its rich history and cultural heritage.",
            "It is home to many Spanish-era historic sites, including the Miag-ao Church, a UNESCO World Heritage Site in the Philippines.",
            "The province is also home to several other prominent structures, including the San Joaquin Campo Santo, San Joaquin Church, and Santa Barbara Church, all recognized as National Cultural Treasures by the National Museum of the Philippines."
        ],
        [
            "The province offers diverse attractions, from well-preserved colonial structures in the south to pristine beaches and islands in the north, namely the Bantigue Sand Bar, the Tangke Lagoon, Cabugao Island, and Antonia Island, all part of the Islas de Gigantes.",
            "Additionally, Sicogon Island, situated south of the group of islands, has gained popularity as a luxury tourist destination."
        ],
        [
            "Etymology"
        ],
        [
            "The name of the province is derived from Iloilo City, which in turn is derived from the older name \"Ilong-ilong\" (Philippine Spanish: Ilong̃-ílong̃) meaning \"nose-like\", in English referring to the promontory between two rivers (Iloilo and Batiano) where the Fort San Pedro and the 17th-century Spanish port were located."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "See also: Maragtas, Madja-as, Early historic coastal city-states and polities of Philippines, Indian cultural influences in early Philippine polities, Greater India, and Indosphere"
        ],
        [
            "No pre-Hispanic written accounts of Iloilo and Panay island exist today.",
            "Oral tradition, in the form of recited epics like the Hinilawod, has survived to a small degree.",
            "A few recordings of these epic poems exist.",
            "The most notable are the works of noted Filipino Anthropologist Felipe Jocano."
        ],
        [
            "While no current archaeological evidence exist describing pre-Hispanic Iloilo, an original work by Pedro Alcantara Monteclaro published in 1907 called Maragtas details the alleged accounts of the founding of the various pre-Hispanic polities on Panay Island.",
            "The book is based on oral and written accounts available to the author at the time."
        ],
        [
            "According to Maragtas, Madja-as was founded after ten datus fled Borneo and landed on Panay Island.",
            "The book then goes on to detail their subsequent purchase of the coastal lands in which they settled from the native Ati people."
        ],
        [
            "Datu Paiburong, one of the ten fleeing datus, established a settlement and named it Irong-Irong after an islet of the same name on the Batiano River."
        ],
        [
            "Left to right: Images from the Boxer Codex illustrating an ancient kadatuan or tumao of the Visayans of Panay wearing the distinctive colors of their social status:  a royal couple.",
            "The wealth and prestige of these Visayans from Panay are clearly demonstrated vis-a-vis their loincloth-wearing Cebuano neighbors which the Spaniards called \"Pintados\" or \"Tattooed Ones\""
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Spain eventually succeeded on conquering of the island of Panay when Spanish conquistador Miguel López de Legazpi moved his headquarters from the island of Cebu and creating the first Spanish settlement in the island in Ogtong in 1566.",
            "This is mainly due in part to the rivalries between the Bisaya and the Moro, of which the former found an ally in Spanish against the latter.",
            "The Bisayas accepted alliances with Spain, to defend themselves against the enslaving Moros.",
            "To this end, Iloilo contributed troops in the Castille War against the Sultanate of Brunei."
        ],
        [
            "In 1581, the encomienda in Ogtong was moved to La Villa Rica de Arevalo, because of frequent coastal raids by the Dutch privateers.",
            "Furthermore, an attack in the year 1600 (Part of the Spanish–Moro conflict) where there was a large Muslim armada to destroy Iloilo City, led by two Moros named Sirungan and Salikala who lead the Muslim force of 70 ships and 4,000 warriors that had raided and attacked several Visayan islands in order to abduct slaves to sell to their allies in the Sultanate of Demak and the Sultanate of Malacca, eventually caused the move of the city center further on to the mouth of the Irong-Irong river founding what is now Iloilo City and constructing Fort San Pedro to defend it in 1616."
        ],
        [
            "Nevertheless, when the 4,000 Moros led by Sirungan and Salikala tried to attack Iloilo City they were repulsed with heavy losses in the town of Arevalo by a force of 1,000 Hiligaynon warriors and 70 Mexican arquebusiers under the command of Juan García de Sierra, the Spanish officer who died in the battle.",
            "The Spanish Christianized the area."
        ],
        [
            "Old Cathedral in Oton: consecrated 1891, destroyed by earthquake January 24, 1948"
        ],
        [
            "Soon, the area itself began to prosper, due to its successful textile and sugar industry.",
            "As a result, it received Chinese immigrants from the west (that worked for its trades) and Latinos from the ports of Mexico in the east (to man its military installations).",
            "The Jesuits soon built a school for Spanish and Visayan boys in Tigbauan, Iloilo.",
            ": 113"
        ],
        [
            "American invasion era"
        ],
        [
            "During the American colonial period, Iloilo became a home to many firsts: including the first department stores and cinema theaters in the Commonwealth of the Philippines."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "Iloilo experienced severe devastation during the events of World War II.",
            "The Japanese built \"comfort stations\" in Iloilo in 1942, where they imprisoned Filipino \"comfort women\" who they routinely gang-raped, brutalized, and murdered for entertainment.",
            ": 110"
        ],
        [
            "Philippine independence"
        ],
        [
            "Iloilo became a province of the newly fledged Republic of the Philippines when the archipelago gained independence from the United States on July 4, 1946."
        ],
        [
            "Geography"
        ],
        [
            "Map of Iloilo"
        ],
        [
            "The province covers a total area of 5,000.83 square kilometres (1,930.83 sq mi) occupying the central and eastern section of Panay island in the Western Visayas region.",
            "If Iloilo City is included for geographical purposes, Iloilo has an area of 5,079.17 square kilometres (1,961.08 sq mi).",
            "The province is bordered by the province of Antique to the west, Capiz to the north, the Jintotolo Channel to the northeast, the Visayan Sea and Guimaras Strait to the east, and the Iloilo Strait and Panay Gulf to the southwest."
        ],
        [
            "The province is divided into two distinct geographic regions; the highlands of the Central Panay Mountain Range on the western border and the lowland plains which account for a larger portion of the province.",
            "Small islands east of its northernmost tip also dot the Visayan Sea - of these, Pan de Azucar and Sicogon are well-known.",
            "Mount Baloy is the highest mountain in Iloilo with an elevation of 6,424 feet (1,958 m) above sea level, located on the triple border of Iloilo, Capiz, and Antique.",
            "Other peaks are Mount Llorente 4,409 ft. (1,344m), Mount Sansanan 4,219 ft. (1,286m), Mount Napulak 4,095 ft. (1,248 m), Mount Balabag 3,728 ft. (1,136m)."
        ],
        [
            "Expansive fishponds and mangrove wetlands are found along the coasts and rivers of Iloilo City and the towns of Oton, Leganes, Zarraga, Dumangas, Anilao, Banate, Barotac Viejo, Barotac Nuevo, Ajuy, Balasan and Carles."
        ],
        [
            "Topography"
        ],
        [
            "List of peaks in Iloilo by elevation:"
        ],
        [
            "Mount Baloy"
        ],
        [
            "Mount Inaman"
        ],
        [
            "Mount Igdalig"
        ],
        [
            "Mount Tiran"
        ],
        [
            "Rivers"
        ],
        [
            "List of rivers in Iloilo by length:"
        ],
        [
            "Jalaur River"
        ],
        [
            "Tigum River"
        ],
        [
            "Lamunan River"
        ],
        [
            "Ulian River (Laglag)"
        ],
        [
            "Suage River"
        ],
        [
            "Aganan River"
        ],
        [
            "Sibalom River, Tigbauan"
        ],
        [
            "Jar-ao River, Guimbal"
        ],
        [
            "Asisig River"
        ],
        [
            "Alawihaw River"
        ],
        [
            "Tangyan River"
        ],
        [
            "Balantian River"
        ],
        [
            "Barotac Viejo River"
        ],
        [
            "Sara River"
        ],
        [
            "Siuaragan River"
        ],
        [
            "Barotac Nuevo River"
        ],
        [
            "Lawigan River"
        ],
        [
            "Cata-an River"
        ],
        [
            "Banate River"
        ],
        [
            "Tiolas River"
        ],
        [
            "Tumagbok River"
        ],
        [
            "Oyungan River"
        ],
        [
            "Iloilo River"
        ],
        [
            "Administrative divisions"
        ],
        [
            "The Province of Iloilo consists of 42 municipalities and two cities (one component and one highly urbanized)."
        ],
        [
            " †  Provincial capital and highly urbanized city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Ajuy"
        ],
        [
            "5th"
        ],
        [
            "2.6%"
        ],
        [
            "53,462"
        ],
        [
            "52,268"
        ],
        [
            "+0.43%"
        ],
        [
            "175.57"
        ],
        [
            "67.79"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "34"
        ],
        [
            "11°10′17″N 123°01′12″E﻿ / ﻿11.1713°N 123.0199°E﻿ / 11.1713; 123.0199﻿ (Ajuy)"
        ],
        [
            "Alimodian"
        ],
        [
            "2nd"
        ],
        [
            "1.9%"
        ],
        [
            "39,722"
        ],
        [
            "38,408"
        ],
        [
            "+0.64%"
        ],
        [
            "144.82"
        ],
        [
            "55.92"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "51"
        ],
        [
            "10°48′59″N 122°25′56″E﻿ / ﻿10.8163°N 122.4321°E﻿ / 10.8163; 122.4321﻿ (Alimodian)"
        ],
        [
            "Anilao"
        ],
        [
            "4th"
        ],
        [
            "1.5%"
        ],
        [
            "30,520"
        ],
        [
            "28,684"
        ],
        [
            "+1.19%"
        ],
        [
            "85.09"
        ],
        [
            "32.85"
        ],
        [
            "360"
        ],
        [
            "930"
        ],
        [
            "21"
        ],
        [
            "10°58′44″N 122°45′04″E﻿ / ﻿10.9789°N 122.7511°E﻿ / 10.9789; 122.7511﻿ (Anilao)"
        ],
        [
            "Badiangan"
        ],
        [
            "3rd"
        ],
        [
            "1.3%"
        ],
        [
            "27,056"
        ],
        [
            "27,005"
        ],
        [
            "+0.04%"
        ],
        [
            "77.50"
        ],
        [
            "29.92"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "31"
        ],
        [
            "10°59′11″N 122°32′12″E﻿ / ﻿10.9863°N 122.5367°E﻿ / 10.9863; 122.5367﻿ (Badiangan)"
        ],
        [
            "Balasan"
        ],
        [
            "5th"
        ],
        [
            "1.7%"
        ],
        [
            "35,064"
        ],
        [
            "33,088"
        ],
        [
            "+1.11%"
        ],
        [
            "54.27"
        ],
        [
            "20.95"
        ],
        [
            "650"
        ],
        [
            "1,700"
        ],
        [
            "23"
        ],
        [
            "11°28′23″N 123°05′21″E﻿ / ﻿11.4731°N 123.0891°E﻿ / 11.4731; 123.0891﻿ (Balasan)"
        ],
        [
            "Banate"
        ],
        [
            "4th"
        ],
        [
            "1.6%"
        ],
        [
            "33,376"
        ],
        [
            "32,532"
        ],
        [
            "+0.49%"
        ],
        [
            "73.48"
        ],
        [
            "28.37"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "18"
        ],
        [
            "11°00′02″N 122°49′06″E﻿ / ﻿11.0006°N 122.8182°E﻿ / 11.0006; 122.8182﻿ (Banate)"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "4th"
        ],
        [
            "2.8%"
        ],
        [
            "58,176"
        ],
        [
            "54,146"
        ],
        [
            "+1.38%"
        ],
        [
            "94.49"
        ],
        [
            "36.48"
        ],
        [
            "620"
        ],
        [
            "1,600"
        ],
        [
            "29"
        ],
        [
            "10°53′42″N 122°42′15″E﻿ / ﻿10.8951°N 122.7041°E﻿ / 10.8951; 122.7041﻿ (Barotac Nuevo)"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "5th"
        ],
        [
            "2.4%"
        ],
        [
            "48,614"
        ],
        [
            "45,808"
        ],
        [
            "+1.14%"
        ],
        [
            "185.78"
        ],
        [
            "71.73"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "26"
        ],
        [
            "11°02′31″N 122°51′02″E﻿ / ﻿11.0419°N 122.8505°E﻿ / 11.0419; 122.8505﻿ (Barotac Viejo)"
        ],
        [
            "Batad"
        ],
        [
            "5th"
        ],
        [
            "1.1%"
        ],
        [
            "22,157"
        ],
        [
            "21,298"
        ],
        [
            "+0.76%"
        ],
        [
            "53.10"
        ],
        [
            "20.50"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "24"
        ],
        [
            "11°25′02″N 123°06′35″E﻿ / ﻿11.4173°N 123.1098°E﻿ / 11.4173; 123.1098﻿ (Batad)"
        ],
        [
            "Bingawan"
        ],
        [
            "3rd"
        ],
        [
            "0.8%"
        ],
        [
            "16,164"
        ],
        [
            "15,199"
        ],
        [
            "+1.18%"
        ],
        [
            "85.20"
        ],
        [
            "32.90"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "14"
        ],
        [
            "11°13′58″N 122°34′03″E﻿ / ﻿11.2329°N 122.5675°E﻿ / 11.2329; 122.5675﻿ (Bingawan)"
        ],
        [
            "Cabatuan"
        ],
        [
            "3rd"
        ],
        [
            "3.0%"
        ],
        [
            "61,110"
        ],
        [
            "58,442"
        ],
        [
            "+0.85%"
        ],
        [
            "112.90"
        ],
        [
            "43.59"
        ],
        [
            "540"
        ],
        [
            "1,400"
        ],
        [
            "68"
        ],
        [
            "10°52′49″N 122°28′53″E﻿ / ﻿10.8803°N 122.4815°E﻿ / 10.8803; 122.4815﻿ (Cabatuan)"
        ],
        [
            "Calinog"
        ],
        [
            "3rd"
        ],
        [
            "3.1%"
        ],
        [
            "62,853"
        ],
        [
            "60,413"
        ],
        [
            "+0.76%"
        ],
        [
            "274.55"
        ],
        [
            "106.00"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "59"
        ],
        [
            "11°07′21″N 122°32′17″E﻿ / ﻿11.1225°N 122.5380°E﻿ / 11.1225; 122.5380﻿ (Calinog)"
        ],
        [
            "Carles"
        ],
        [
            "5th"
        ],
        [
            "3.5%"
        ],
        [
            "72,637"
        ],
        [
            "68,160"
        ],
        [
            "+1.22%"
        ],
        [
            "104.05"
        ],
        [
            "40.17"
        ],
        [
            "700"
        ],
        [
            "1,800"
        ],
        [
            "33"
        ],
        [
            "11°34′17″N 123°07′57″E﻿ / ﻿11.5713°N 123.1326°E﻿ / 11.5713; 123.1326﻿ (Carles)"
        ],
        [
            "Concepcion"
        ],
        [
            "5th"
        ],
        [
            "2.2%"
        ],
        [
            "44,633"
        ],
        [
            "43,159"
        ],
        [
            "+0.64%"
        ],
        [
            "86.12"
        ],
        [
            "33.25"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "25"
        ],
        [
            "11°12′53″N 123°06′30″E﻿ / ﻿11.2148°N 123.1082°E﻿ / 11.2148; 123.1082﻿ (Concepcion)"
        ],
        [
            "Dingle"
        ],
        [
            "4th"
        ],
        [
            "2.2%"
        ],
        [
            "45,965"
        ],
        [
            "45,335"
        ],
        [
            "+0.26%"
        ],
        [
            "98.37"
        ],
        [
            "37.98"
        ],
        [
            "470"
        ],
        [
            "1,200"
        ],
        [
            "33"
        ],
        [
            "11°00′00″N 122°40′18″E﻿ / ﻿11.0000°N 122.6717°E﻿ / 11.0000; 122.6717﻿ (Dingle)"
        ],
        [
            "Dueñas"
        ],
        [
            "4th"
        ],
        [
            "1.7%"
        ],
        [
            "34,597"
        ],
        [
            "34,242"
        ],
        [
            "+0.20%"
        ],
        [
            "90.52"
        ],
        [
            "34.95"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "47"
        ],
        [
            "11°03′58″N 122°37′06″E﻿ / ﻿11.0662°N 122.6183°E﻿ / 11.0662; 122.6183﻿ (Duenas)"
        ],
        [
            "Dumangas"
        ],
        [
            "4th"
        ],
        [
            "3.6%"
        ],
        [
            "73,899"
        ],
        [
            "69,108"
        ],
        [
            "+1.28%"
        ],
        [
            "128.70"
        ],
        [
            "49.69"
        ],
        [
            "570"
        ],
        [
            "1,500"
        ],
        [
            "45"
        ],
        [
            "10°49′17″N 122°42′44″E﻿ / ﻿10.8214°N 122.7122°E﻿ / 10.8214; 122.7122﻿ (Dumangas)"
        ],
        [
            "Estancia"
        ],
        [
            "5th"
        ],
        [
            "2.6%"
        ],
        [
            "53,200"
        ],
        [
            "48,546"
        ],
        [
            "+1.76%"
        ],
        [
            "29.38"
        ],
        [
            "11.34"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "25"
        ],
        [
            "11°27′29″N 123°09′04″E﻿ / ﻿11.4580°N 123.1511°E﻿ / 11.4580; 123.1511﻿ (Estancia)"
        ],
        [
            "Guimbal"
        ],
        [
            "1st"
        ],
        [
            "1.7%"
        ],
        [
            "35,022"
        ],
        [
            "33,820"
        ],
        [
            "+0.67%"
        ],
        [
            "44.63"
        ],
        [
            "17.23"
        ],
        [
            "780"
        ],
        [
            "2,000"
        ],
        [
            "33"
        ],
        [
            "10°39′41″N 122°19′22″E﻿ / ﻿10.6615°N 122.3228°E﻿ / 10.6615; 122.3228﻿ (Guimbal)"
        ],
        [
            "Igbaras"
        ],
        [
            "1st"
        ],
        [
            "1.6%"
        ],
        [
            "32,197"
        ],
        [
            "32,004"
        ],
        [
            "+0.11%"
        ],
        [
            "148.72"
        ],
        [
            "57.42"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "46"
        ],
        [
            "10°43′02″N 122°15′55″E﻿ / ﻿10.7172°N 122.2654°E﻿ / 10.7172; 122.2654﻿ (Igbaras)"
        ],
        [
            "Iloilo City"
        ],
        [
            "†"
        ],
        [
            "lone"
        ],
        [
            "—"
        ],
        [
            "457,626"
        ],
        [
            "447,992"
        ],
        [
            "+0.41%"
        ],
        [
            "78.34"
        ],
        [
            "30.25"
        ],
        [
            "5,800"
        ],
        [
            "15,000"
        ],
        [
            "180"
        ],
        [
            "10°42′09″N 122°34′08″E﻿ / ﻿10.7024°N 122.5690°E﻿ / 10.7024; 122.5690﻿ (Iloilo City)"
        ],
        [
            "Janiuay"
        ],
        [
            "3rd"
        ],
        [
            "3.3%"
        ],
        [
            "66,786"
        ],
        [
            "63,905"
        ],
        [
            "+0.84%"
        ],
        [
            "179.10"
        ],
        [
            "69.15"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "60"
        ],
        [
            "10°56′57″N 122°30′07″E﻿ / ﻿10.9491°N 122.5019°E﻿ / 10.9491; 122.5019﻿ (Janiuay)"
        ],
        [
            "Lambunao"
        ],
        [
            "3rd"
        ],
        [
            "4.0%"
        ],
        [
            "81,236"
        ],
        [
            "73,640"
        ],
        [
            "+1.89%"
        ],
        [
            "407.09"
        ],
        [
            "157.18"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "73"
        ],
        [
            "11°03′19″N 122°28′29″E﻿ / ﻿11.0553°N 122.4746°E﻿ / 11.0553; 122.4746﻿ (Lambunao)"
        ],
        [
            "Leganes"
        ],
        [
            "2nd"
        ],
        [
            "1.7%"
        ],
        [
            "34,725"
        ],
        [
            "32,480"
        ],
        [
            "+1.28%"
        ],
        [
            "32.20"
        ],
        [
            "12.43"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "18"
        ],
        [
            "10°47′11″N 122°35′21″E﻿ / ﻿10.7863°N 122.5892°E﻿ / 10.7863; 122.5892﻿ (Leganes)"
        ],
        [
            "Lemery"
        ],
        [
            "5th"
        ],
        [
            "1.5%"
        ],
        [
            "31,414"
        ],
        [
            "30,851"
        ],
        [
            "+0.34%"
        ],
        [
            "137.55"
        ],
        [
            "53.11"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "31"
        ],
        [
            "11°13′33″N 122°55′39″E﻿ / ﻿11.2258°N 122.9274°E﻿ / 11.2258; 122.9274﻿ (Lemery)"
        ],
        [
            "Leon"
        ],
        [
            "2nd"
        ],
        [
            "2.5%"
        ],
        [
            "51,990"
        ],
        [
            "49,875"
        ],
        [
            "+0.79%"
        ],
        [
            "163.97"
        ],
        [
            "63.31"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "85"
        ],
        [
            "10°46′50″N 122°23′18″E﻿ / ﻿10.7805°N 122.3882°E﻿ / 10.7805; 122.3882﻿ (Leon)"
        ],
        [
            "Maasin"
        ],
        [
            "3rd"
        ],
        [
            "1.9%"
        ],
        [
            "38,461"
        ],
        [
            "36,922"
        ],
        [
            "+0.78%"
        ],
        [
            "128.59"
        ],
        [
            "49.65"
        ],
        [
            "300"
        ],
        [
            "780"
        ],
        [
            "50"
        ],
        [
            "10°53′27″N 122°26′00″E﻿ / ﻿10.8908°N 122.4332°E﻿ / 10.8908; 122.4332﻿ (Maasin)"
        ],
        [
            "Miagao"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "68,115"
        ],
        [
            "67,565"
        ],
        [
            "+0.15%"
        ],
        [
            "156.80"
        ],
        [
            "60.54"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "119"
        ],
        [
            "10°38′28″N 122°14′08″E﻿ / ﻿10.6410°N 122.2355°E﻿ / 10.6410; 122.2355﻿ (Miagao)"
        ],
        [
            "Mina"
        ],
        [
            "3rd"
        ],
        [
            "1.2%"
        ],
        [
            "24,042"
        ],
        [
            "23,546"
        ],
        [
            "+0.40%"
        ],
        [
            "43.40"
        ],
        [
            "16.76"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "22"
        ],
        [
            "10°55′48″N 122°34′27″E﻿ / ﻿10.9300°N 122.5742°E﻿ / 10.9300; 122.5742﻿ (Mina)"
        ],
        [
            "New Lucena"
        ],
        [
            "2nd"
        ],
        [
            "1.2%"
        ],
        [
            "24,314"
        ],
        [
            "23,240"
        ],
        [
            "+0.86%"
        ],
        [
            "44.10"
        ],
        [
            "17.03"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "21"
        ],
        [
            "10°52′39″N 122°35′48″E﻿ / ﻿10.8776°N 122.5967°E﻿ / 10.8776; 122.5967﻿ (New Lucena)"
        ],
        [
            "Oton"
        ],
        [
            "1st"
        ],
        [
            "4.8%"
        ],
        [
            "98,509"
        ],
        [
            "89,115"
        ],
        [
            "+1.93%"
        ],
        [
            "86.44"
        ],
        [
            "33.37"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "37"
        ],
        [
            "10°41′37″N 122°28′38″E﻿ / ﻿10.6936°N 122.4773°E﻿ / 10.6936; 122.4773﻿ (Oton)"
        ],
        [
            "Passi City"
        ],
        [
            "∗"
        ],
        [
            "4th"
        ],
        [
            "4.3%"
        ],
        [
            "88,873"
        ],
        [
            "80,544"
        ],
        [
            "+1.89%"
        ],
        [
            "251.39"
        ],
        [
            "97.06"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "51"
        ],
        [
            "11°07′03″N 122°38′36″E﻿ / ﻿11.1174°N 122.6432°E﻿ / 11.1174; 122.6432﻿ (Passi)"
        ],
        [
            "Pavia"
        ],
        [
            "2nd"
        ],
        [
            "3.4%"
        ],
        [
            "70,388"
        ],
        [
            "55,603"
        ],
        [
            "+4.59%"
        ],
        [
            "27.15"
        ],
        [
            "10.48"
        ],
        [
            "2,600"
        ],
        [
            "6,700"
        ],
        [
            "18"
        ],
        [
            "10°46′29″N 122°32′31″E﻿ / ﻿10.7748°N 122.5419°E﻿ / 10.7748; 122.5419﻿ (Pavia)"
        ],
        [
            "Pototan"
        ],
        [
            "3rd"
        ],
        [
            "3.8%"
        ],
        [
            "78,298"
        ],
        [
            "75,070"
        ],
        [
            "+0.80%"
        ],
        [
            "97.10"
        ],
        [
            "37.49"
        ],
        [
            "810"
        ],
        [
            "2,100"
        ],
        [
            "50"
        ],
        [
            "10°56′32″N 122°38′09″E﻿ / ﻿10.9421°N 122.6358°E﻿ / 10.9421; 122.6358﻿ (Pototan)"
        ],
        [
            "San Dionisio"
        ],
        [
            "5th"
        ],
        [
            "1.9%"
        ],
        [
            "39,048"
        ],
        [
            "38,775"
        ],
        [
            "+0.13%"
        ],
        [
            "127.06"
        ],
        [
            "49.06"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "29"
        ],
        [
            "11°16′12″N 123°05′39″E﻿ / ﻿11.2701°N 123.0942°E﻿ / 11.2701; 123.0942﻿ (San Dionisio)"
        ],
        [
            "San Enrique"
        ],
        [
            "4th"
        ],
        [
            "1.8%"
        ],
        [
            "36,911"
        ],
        [
            "33,911"
        ],
        [
            "+1.63%"
        ],
        [
            "110.28"
        ],
        [
            "42.58"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "28"
        ],
        [
            "11°04′21″N 122°39′21″E﻿ / ﻿11.0724°N 122.6558°E﻿ / 11.0724; 122.6558﻿ (San Enrique)"
        ],
        [
            "San Joaquin"
        ],
        [
            "1st"
        ],
        [
            "2.6%"
        ],
        [
            "52,617"
        ],
        [
            "51,892"
        ],
        [
            "+0.26%"
        ],
        [
            "234.84"
        ],
        [
            "90.67"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "85"
        ],
        [
            "10°35′11″N 122°08′32″E﻿ / ﻿10.5865°N 122.1422°E﻿ / 10.5865; 122.1422﻿ (San Joaquin)"
        ],
        [
            "San Miguel"
        ],
        [
            "2nd"
        ],
        [
            "1.5%"
        ],
        [
            "30,115"
        ],
        [
            "27,686"
        ],
        [
            "+1.61%"
        ],
        [
            "31.97"
        ],
        [
            "12.34"
        ],
        [
            "940"
        ],
        [
            "2,400"
        ],
        [
            "24"
        ],
        [
            "10°46′51″N 122°27′54″E﻿ / ﻿10.7807°N 122.4650°E﻿ / 10.7807; 122.4650﻿ (San Miguel)"
        ],
        [
            "San Rafael"
        ],
        [
            "5th"
        ],
        [
            "0.9%"
        ],
        [
            "17,795"
        ],
        [
            "16,532"
        ],
        [
            "+1.41%"
        ],
        [
            "67.05"
        ],
        [
            "25.89"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "9"
        ],
        [
            "11°10′48″N 122°49′44″E﻿ / ﻿11.1801°N 122.8288°E﻿ / 11.1801; 122.8288﻿ (San Rafael)"
        ],
        [
            "Santa Barbara"
        ],
        [
            "2nd"
        ],
        [
            "3.3%"
        ],
        [
            "67,630"
        ],
        [
            "60,215"
        ],
        [
            "+2.24%"
        ],
        [
            "131.96"
        ],
        [
            "50.95"
        ],
        [
            "510"
        ],
        [
            "1,300"
        ],
        [
            "60"
        ],
        [
            "10°49′38″N 122°31′53″E﻿ / ﻿10.8272°N 122.5314°E﻿ / 10.8272; 122.5314﻿ (Santa Barbara)"
        ],
        [
            "Sara"
        ],
        [
            "5th"
        ],
        [
            "2.7%"
        ],
        [
            "54,637"
        ],
        [
            "52,631"
        ],
        [
            "+0.71%"
        ],
        [
            "169.02"
        ],
        [
            "65.26"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "42"
        ],
        [
            "11°15′31″N 123°00′46″E﻿ / ﻿11.2587°N 123.0128°E﻿ / 11.2587; 123.0128﻿ (Sara)"
        ],
        [
            "Tigbauan"
        ],
        [
            "1st"
        ],
        [
            "3.2%"
        ],
        [
            "65,245"
        ],
        [
            "62,706"
        ],
        [
            "+0.76%"
        ],
        [
            "83.68"
        ],
        [
            "32.31"
        ],
        [
            "780"
        ],
        [
            "2,000"
        ],
        [
            "52"
        ],
        [
            "10°40′28″N 122°22′34″E﻿ / ﻿10.6744°N 122.3761°E﻿ / 10.6744; 122.3761﻿ (Tigbauan)"
        ],
        [
            "Tubungan"
        ],
        [
            "1st"
        ],
        [
            "1.1%"
        ],
        [
            "23,021"
        ],
        [
            "22,449"
        ],
        [
            "+0.48%"
        ],
        [
            "85.18"
        ],
        [
            "32.89"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "48"
        ],
        [
            "10°45′55″N 122°19′05″E﻿ / ﻿10.7654°N 122.3181°E﻿ / 10.7654; 122.3181﻿ (Tubungan)"
        ],
        [
            "Zarraga"
        ],
        [
            "2nd"
        ],
        [
            "1.3%"
        ],
        [
            "27,305"
        ],
        [
            "25,605"
        ],
        [
            "+1.23%"
        ],
        [
            "54.48"
        ],
        [
            "21.03"
        ],
        [
            "500"
        ],
        [
            "1,300"
        ],
        [
            "24"
        ],
        [
            "10°49′25″N 122°36′36″E﻿ / ﻿10.8236°N 122.6099°E﻿ / 10.8236; 122.6099﻿ (Zarraga)"
        ],
        [
            "Total"
        ],
        [
            "2,051,899"
        ],
        [
            "1,936,423"
        ],
        [
            "+1.11%"
        ],
        [
            "4,997.64"
        ],
        [
            "1,929.60"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "1,721"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude.^ Total figures exclude the highly urbanized city of Iloilo."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Iloilo, Philippines — NOAA Station Id: PH98637"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.7(85.5)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.7(89.1)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "30.7(87.3)"
        ],
        [
            "30.4(86.7)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.1(88.0)"
        ],
        [
            "30.9(87.6)"
        ],
        [
            "30.2(86.4)"
        ],
        [
            "31.12(88.02)"
        ],
        [
            "Daily mean °C (°F)"
        ],
        [
            "26.1(79.0)"
        ],
        [
            "26.5(79.7)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "28.9(84.0)"
        ],
        [
            "29.1(84.4)"
        ],
        [
            "28.1(82.6)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "27.6(81.7)"
        ],
        [
            "27.7(81.9)"
        ],
        [
            "27.5(81.5)"
        ],
        [
            "26.8(80.2)"
        ],
        [
            "27.59(81.66)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "25.1(77.2)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "24.02(75.24)"
        ],
        [
            "Average rainfall mm (inches)"
        ],
        [
            "39.9(1.57)"
        ],
        [
            "19.1(0.75)"
        ],
        [
            "27.1(1.07)"
        ],
        [
            "47.7(1.88)"
        ],
        [
            "117.9(4.64)"
        ],
        [
            "255.2(10.05)"
        ],
        [
            "313.2(12.33)"
        ],
        [
            "363.7(14.32)"
        ],
        [
            "266.8(10.50)"
        ],
        [
            "264.1(10.40)"
        ],
        [
            "174.8(6.88)"
        ],
        [
            "64.2(2.53)"
        ],
        [
            "1,953.7(76.92)"
        ],
        [
            "Average relative humidity (%)"
        ],
        [
            "82"
        ],
        [
            "80"
        ],
        [
            "75"
        ],
        [
            "73"
        ],
        [
            "77"
        ],
        [
            "82"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "85"
        ],
        [
            "84"
        ],
        [
            "84"
        ],
        [
            "83"
        ],
        [
            "81.25"
        ],
        [
            "Source: \"Climate (Average Weather) Data\".",
            "Climate-Charts.com.",
            "Archived from the original on May 11, 2011.",
            "Retrieved March 13, 2011."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of IloiloYearPop.±% p.a.1903 329,993—    1918 397,854+1.25%1939 589,198+1.89%1948 665,563+1.36%1960 757,440+1.08%YearPop.±% p.a.1970 885,221+1.57%1975 1,001,507+2.51%1980 1,096,432+1.83%1990 1,337,981+2.01%1995 1,415,022+1.05%YearPop.±% p.a.2000 1,559,182+2.10%2007 1,691,878+1.13%2010 1,805,576+2.40%2015 1,936,423+1.34%2020 2,051,899+1.15%Excluding Iloilo CitySource: Philippine Statistics Authority"
        ],
        [
            "The population of Iloilo in the 2020 census was 2,051,899 people, with a density of 410 inhabitants per square kilometre or 1,100 inhabitants per square mile.",
            "If the highly urbanized city of Iloilo is included for statistical purposes, the province's total population is 2,509,525 people, with a density of 494/km2 (1,280/sq mi)."
        ],
        [
            "People from Iloilo are called Ilonggos.",
            "There are three local languages used in the province: Hiligaynon (Ilonggo), Kinaray-a and Capiznon.",
            "Hiligaynon and dialects/variants of it are spoken in Iloilo City and in some towns of the province, especially to the northeast.",
            "Tagalog and English are widely used as administrative, educational, and commercial languages."
        ],
        [
            "Language"
        ],
        [
            "The Ten Commandments in Hiligaynon, the predominant language of Panay"
        ],
        [
            "Languages Spoken (2000)"
        ],
        [
            "Language"
        ],
        [
            "Speakers"
        ],
        [
            "Hiligaynon"
        ],
        [
            "899,108"
        ],
        [
            "Kinaray-a"
        ],
        [
            "148,307"
        ],
        [
            "Capiznon"
        ],
        [
            "2,913"
        ],
        [
            "Other Visayan languages"
        ],
        [
            "2,731"
        ],
        [
            "Others"
        ],
        [
            "11,815"
        ],
        [
            "Not Reported"
        ],
        [
            "7,596"
        ],
        [
            "Hiligaynon is concentrated in the city of Iloilo and surrounding areas, as well as the northeastern portion of the province, Guimaras and the Negros Island (especially in Negros Occidental and to a lesser extent in Negros Oriental), as well as the provinces of South Cotabato, Sultan Kudarat, and North Cotabato in Soccsksargen, Mindanao.",
            "It is also spoken in the neighboring provinces, such as Capiz, Antique, Aklan, Masbate, Palawan and Romblon as well as in some parts of Maguindanao.",
            "It is also spoken as a second language by Cebuano speakers in Negros Oriental, Kinaray-a speakers in Antique, Aklanon/Malaynon speakers in Aklan, and Capiznon speakers in Capiz."
        ],
        [
            "The language is referred to as Ilonggo in Iloilo and Negros Occidental.",
            "More precisely, Ilonggo is an ethno-linguistic group referring to the people living in southeastern Panay and its associated culture.",
            "The boundaries of the language called Ilonggo and that called Hiligaynon are unclear.",
            "The disagreement of which name is correct extends to Philippine language specialists and native laypeople."
        ],
        [
            "Religion"
        ],
        [
            "Iloilo is a Roman Catholic-predominated province comprising about 87% of the population.",
            "Independent Catholic and Protestant churches also exist such as members of Iglesia Filipina Independiente or Aglipayan Church, Baptists, Presbyterians, Methodists, Adventists, and other Evangelical Christians; There are also non-Protestant and other Christian sects such as Iglesia Ni Cristo, Church of Christ of Latter day Saints (Mormons) and Jehovah's Witnesses while non-Christians are usually represented by Muslims, and to a lesser extent, Buddhists and Hindus."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Iloilo"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  21.76"
        ],
        [
            "2009  26.62"
        ],
        [
            "2012  26.21"
        ],
        [
            "2015  22.03"
        ],
        [
            "2018  16.49"
        ],
        [
            "2021  12.60"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Iloilo City, the economic center of the province and the whole island of Panay."
        ],
        [
            "Iloilo's vibrant economy can be attributed to the combination of good political will and the collective cooperation of the Ilonggos.",
            "This fruitful collaboration has resulted in an \"economic boom\" that has generated thousands of jobs and propelled the province to become one of the most competitive in the country."
        ],
        [
            "Iloilo City, as the economic center, offers a diverse range of industries and services.",
            "It serves as a hub for real estate, accommodation, medical centers, education, shopping centers, business centers, and IT/BPO centers, among others.",
            "The city's dynamic and multifaceted economy contributes significantly to the overall growth and development of the province."
        ],
        [
            "The northern part of Iloilo thrives on a strong fishing industry and a flourishing tourism sector.",
            "Its proximity to the Visayan Sea has made it a leading area for fisheries in the nation.",
            "The region's natural beauty and tourist attractions have bolstered its tourism industry, attracting visitors to its pristine beaches and marine reserves.",
            "Additionally, the central part of the province serves as an agri-industrial center, producing a wide array of agricultural products such as corn, rice, bananas, pineapples, sugar, and high-end crops in areas like Bucari in Leon and the highlands of Alimodian.",
            "These areas also offer inland resorts and trekking sites, providing additional avenues for tourism and recreation."
        ],
        [
            "The sugar industry, centered in Passi City and neighboring towns like Lambunao, Duenas, San Enrique, and Bingawan, contributes significantly to the local economy.",
            "Southern Iloilo's economy revolves largely around tourism, thanks to its century-old churches, colonial buildings, and beautiful beaches and marine reserves found in towns like Guimbal, Miagao, and San Joaquin."
        ],
        [
            "Government"
        ],
        [
            "Former provincial flag of Iloilo featured the white and blue ensign, which served as inspiration for elements adopted in the national Philippine flag"
        ],
        [
            "The government of Iloilo was established in 1566 when the Spanish settled a colonial center in Ogtong (now Oton).",
            "Control was later shifted to La Villa Rica de Arevalo (now Arevalo, Iloilo City) in 1581, which also served as the seat of the Spanish Government overseeing vast territories encompassing Iloilo, Capiz, Aklan, Antique, and surrounding islands such as Negros, Guimaras, Cuyo, Palawan, Caluya, Romblon, and Boracay.",
            "Over time, these territories gained independence.",
            "By 1616, the seat of government was transferred to La Punta, now known as Iloilo City Proper.",
            "This relocation marked a significant increase in colonial power, and the city's economy boomed, making it the largest in the Philippines after Manila during the Spanish period until the American period.The New Capitol building of the Province of Iloilo"
        ],
        [
            "The Old Capitol building of the Province of Iloilo, with the Arroyo FountainThe Governor of Iloilo serves as the local chief executive of the province, with the official office located at the Iloilo Provincial Capitol.",
            "Historically, the governor, along with the alcalde-mayor and presidente municipal, held office at the Casa Real de Iloilo from 1869 until 2006, when the larger capitol building adjacent to it was completed."
        ],
        [
            "Governor: Arthur R. Defensor, Jr."
        ],
        [
            "Vice Governor: Christine S. Garin"
        ],
        [
            "Provincial board members"
        ],
        [
            "1st District:"
        ],
        [
            "Marcelo Valentine S. Serag"
        ],
        [
            "Jo Ann B. Germinanda"
        ],
        [
            "2nd District:"
        ],
        [
            "June S. Mondejar"
        ],
        [
            "Rolito S. Cajilig"
        ],
        [
            "3rd District:"
        ],
        [
            "Matt P. Palabrica"
        ],
        [
            "Jason R. Gonzales"
        ],
        [
            "4th District:"
        ],
        [
            "Domingo B. Oso, Jr."
        ],
        [
            "Rolando B. Distura"
        ],
        [
            "5th District:"
        ],
        [
            "Binky April M. Tupas"
        ],
        [
            "Carol-V Espinosa-Diaz"
        ],
        [
            "Ex-officio Board Members:"
        ],
        [
            "PCL President: Ramon G. Sullano"
        ],
        [
            "LNB President: Amalia Victoria F. Debuque"
        ],
        [
            "PPSK President: Esara Aldeguer Javier"
        ],
        [
            "District Representatives"
        ],
        [
            "1st District: Janette L. Garin"
        ],
        [
            "2nd District: Michael B. Gorriceta"
        ],
        [
            "3rd District: Lorenz R. Defensor"
        ],
        [
            "4th District: Ferjenel G. Biron"
        ],
        [
            "5th District: Raul \"Boboy\" C. Tupas"
        ],
        [
            "Culture"
        ],
        [
            "The old buildings in downtown Iloilo showcase the influence of Spanish architecture, reflecting the historical presence of the Spaniards in the region.",
            "However, even before the arrival of the Mexicans, Spaniards, and other Europeans, Iloilo had already established trade relations with ancient Indonesians, Malaysians and Vietnamese, Indian, Arab, Chinese, Korean and Japanese merchants.",
            "The Spanish government encouraged foreign merchants to trade in Iloilo, although they were not granted land ownership privileges.",
            "Over time, intermarriage between foreign merchants, Spaniards, and the locals led to the emergence of the Mestizo class, who eventually became the ruling class of the Ilonggos, known as the Principalía."
        ],
        [
            "Iloilo is also home to two of the nation's cultural minorities: the Sulod-Bukidnon and the Ati.",
            "These indigenous groups contribute to the cultural diversity of the province and add to its vibrant tapestry of traditions and customs."
        ],
        [
            "Festivals"
        ],
        [
            "Dinagyang Festival, one of the largest festivals in the Philippines."
        ],
        [
            "See also: Iloilo City § Festivals"
        ],
        [
            "Iloilo is dubbed as the \"Festival Capital of the Philippines\" with various renowned festivals in the country celebrated in the province.",
            "The Dinagyang Festival is the most popular and largest festival in Iloilo, held every January in honor of the Santo Niño in Iloilo City.",
            "It features elaborate street dancing, vibrant costumes, and a festive atmosphere that attracts both locals and tourists.",
            "The Kasadyahan Festival, which is celebrated during the Dinagyang, is a competition among cultural festivals from different parts of Iloilo and Western Visayas.",
            "The Paraw Regatta Festival is another significant event, celebrating the traditional sailboats known as paraws.",
            "This festival includes boat races, cultural presentations, and various activities showcasing the maritime culture of Iloilo.",
            "Jaro Fiesta, held every February, is a religious and cultural celebration in honor of the Nuestra Señora de la Candelaria (Our Lady of Candles), featuring processions, a grand fair, and traditional performances.",
            "The Pintados de Pasi is a cultural festival honors the tribal tradition of body painting known as pintados in Passi City."
        ],
        [
            "Every municipality, barangay, and district in the province and city of Iloilo, has its own cultural, social, and religious festivals.",
            "Many of these festivals hold religious significance, honoring deities, saints, or important religious events.",
            "Others commemorate historical milestones such as independence days, national holidays, or significant local happenings.",
            "Some festivals focus on social bonding, bringing people together and fostering a strong sense of community."
        ],
        [
            "Cuisine"
        ],
        [
            "La Paz Batchoy, one of the most popular dishes from Iloilo"
        ],
        [
            "See also: Iloilo City § Cuisine"
        ],
        [
            "Its capital city, Iloilo City has been recognized as a UNESCO Creative City of Gastronomy.",
            "It is renowned for its distinctive and flavorful cuisine including La Paz Batchoy, a hearty noodle soup with pork innards, liver, and crunchy chicharon.",
            "Pancit Molo, a dumpling soup named after the Molo district, features wonton-style dumplings in a savory broth.",
            "Iloilo is also known for its Biscocho, a type of toasted bread topped with butter and sugar, and Barquillos, thin rolled wafers that are delightfully crispy.",
            "Seafood is abundant, and dishes like Grilled Talaba (oysters) and Kinilaw (raw fish marinated in vinegar and spices) are local favorites.",
            "Roberto’s Siopao, a popular restaurant in Iloilo City Proper, is known for its siopao, a steamed bun with a variety of fillings.",
            "Tinuom, a native dish of Cabatuan, is made up of native chickens seasoned with onions, tomatoes and lemon grass (tanglad) wrapped in banana leaves."
        ],
        [
            "Tourism"
        ],
        [
            "Heritage sites"
        ],
        [
            "The Miag-ao Church is one of the Baroque Churches of the Philippines.The San Joaquin Campo Santo is one of the oldest and well preserved cemeteries in the Philippines.The Santa Barbara Church is one of the National Cultural Tresures in Iloilo."
        ],
        [
            "See also: Iloilo City § Architecture"
        ],
        [
            "As a leading province during the Spanish Colonial Era, the province of Iloilo is widely known for its beautiful old world architecture similar to that of Latin American Countries.",
            "Spanish colonial Churches are amongst the well-known tourist sites in the province.",
            "Among its many attractions, the Spanish colonial churches including the Miag-ao Church, a UNESCO World Heritage Site, features an Aztec-Baroque inspired design with intricate Filipino botanicals carved into its façade.",
            "The Gothic-Renaissance Molo Church was used as a watchtower and is known for its classical and gothic details, often referred to as the 'feminist church' due to the female saints lining its interior.",
            "Jaro Cathedral boasts a Neo-Romanesque style with a distinctive bell tower located across a busy street from the church.",
            "Cabatuan Church, the largest red brick structure in the Visayas, is celebrated for its Neoclassic design and three facades.",
            "San Jose Church in front of Plaza Libertad is considered the most historic in Iloilo City, known for its Byzantine-Neoclassic architecture and collection of priceless Catholic treasures.",
            "Plaza Libertad is the historic plaza where the flag of the first Philippine Republic was raised after Spain surrendered Iloilo to revolutionary forces on December 25, 1898."
        ],
        [
            "The San Joaquin Church features a large pediment with a sculptural relief of the Spanish victory in the Battle of Tetuan, making it a National Cultural Treasure along with San Joaquin Campo Santo, a Roman Catholic cemetery with a Spanish Baroque mortuary chapel.",
            "Passi City Church is a fortress church with massive buttresses built to replace earlier structures destroyed by natural disasters.",
            "The Casa Real de Iloilo, a National Historical Site, served as the capitol when the civil government of Iloilo was founded in 1901.",
            "Santa Barbara Church, known as the \"Cradle of Independence\" in Panay and the Visayas, was the site of General Martin Delgado's junta leading to the first Cry of Revolution against the Spaniards outside Luzon.",
            "The Calle Real Heritage District houses numerous old colonial buildings, including the Eusebio Villanueva Building, formerly known as the International Hotel.",
            "The Iloilo Golf and Country Club, the oldest golf course in Southeast Asia, was established in the 1850s by British Vice Consul Nicholas Loney, known as the \"Father of the Philippine Sugar Industry.\""
        ],
        [
            "Natural attractions"
        ],
        [
            "Bantigue Island Sandbar in the Gigantes group of islands."
        ],
        [
            "Cabugao Gamay Island, a selfie island in Islas de Gigantes."
        ],
        [
            "The province also boasts a variety of natural attractions including Bucari, situated in the highlands of Leon, is known as the \"Summer Capital of Iloilo\" due to its cool climate and highland attractions.",
            "Bulabog Putian National Park, a protected rainforest area within San Enrique and Dingle, features diverse flora and fauna, and over 30 caves, making it a popular eco-tourism destination in the province.",
            "The Islas de Gigantes, known for island-hopping adventures, is an island group off the shores of Carles renowned for its white sand beaches, emerald-like shores and lagoons, and rock formations.",
            "Cabugao Gamay is the most popular island in the archipelago, features two white sand beaches that forms like a sandbar connecting two islets.",
            "Sicogon Island, another island in Carles south of the Islas de Gigantes, is a resort island developed by Ayala Land, Inc.."
        ],
        [
            "Infrastructure"
        ],
        [
            "Iloilo International Airport"
        ],
        [
            "Main article: Iloilo International Airport"
        ],
        [
            "Iloilo International Airport terminal building."
        ],
        [
            "The airport serves the Province of Iloilo, including its capital city, Iloilo City, the regional center of the Western Visayas region in the Philippines.",
            "It opened its doors to commercial traffic on June 14, 2007, after a decade of planning and construction located at Cabatuan, Iloilo, replacing Mandurriao Airport in Mandurriao, Iloilo City and inherited its IATA and ICAO airport codes from its predecessor.",
            "The fourth-busiest airport in the Philippines, it is the first airport in both Western Visayas and the island of Panay to be built to international standards, and one of the four airports in the region planned to be an international gateway.",
            "It is one of two international airports in Western Visayas, the others being Kalibo International Airport."
        ],
        [
            "Sicogon Airport"
        ],
        [
            "Main article: Sicogon Airport"
        ],
        [
            "The airport serves tourists to the island of Sicogon in Carles, Iloilo.",
            "The airport has been redeveloped and opened in 2018.",
            "Charter flights to and from Sicogon to Manila and vice versa took place in late 2018.",
            "It is located in Barangay San Fernando on the island."
        ],
        [
            "Iloilo Port Complex"
        ],
        [
            "Main article: Port of Iloilo"
        ],
        [
            "The Port of Iloilo, considered the leader of trade and a commercial hub for Western Visayas is also one of the safest natural seaports in the Philippines.",
            "The Iloilo Commercial Port Complex is located on 20.8 hectares of reclaimed land.",
            "It includes 11,400 sq.",
            "meters of open space for operations, supplemented by an area of 97,000 sq.",
            "meters, a crane, rails of 348 lineal meters; roll-on-roll-off support; a 7,800 container freight stations; and a 720 sq.",
            "meter passenger shed.",
            "The port complex is ideal for ships plying international routes having a berth length of 400 meters, a width of 26.26 meters and a berthing depth of 10.50 meters."
        ],
        [
            "A number of shipping companies use the Port of Iloilo, including Lorenzo Shipping Corporation, 2GO, Amigo Shipping Company, New Panay Shipping Company, Sulpicio Lines, and Trans-Asia Shipping Lines Inc. Fast ferries serve Iloilo-Bacolod routes eight times daily.",
            "2GO inter-island, overnight ferries serve longer routes, going to Manila, Bacolod, Cebu, Zamboanga and Cagayan de Oro City.",
            "Pumpboat ferries cross the Iloilo Strait to Guimaras constantly during the day and on special trips at night."
        ],
        [
            "Roll-on/roll-off ferry service, known as RO-RO, is available between Iloilo City and Guimaras, but the ro-ro to Negros is available from Dumangas, Iloilo including ro-ro from Iloilo to Palawan."
        ],
        [
            "It is ranked third in terms of ship calls at 11,853, fourth in cargo throughout at 491,719 million metric tons and fourth in passenger traffic at 2.4 million annually."
        ],
        [
            "Accessibility"
        ],
        [
            "Festive Walk Transport Hub and the Premium Point-to-Point (P2P) Bus servicing Iloilo City to Iloilo International, Kalibo International, and Caticlan Airports and vice versa."
        ],
        [
            "Iloilo is one of the most accessible provinces in the Philippines.",
            "Iloilo can be reached by plane on regular commercial international flights from Hong Kong and Singapore to the Iloilo International Airport.",
            "Direct domestic flights connect Iloilo to other major cities in the Philippines including Manila, Cebu, Davao, General Santos, Puerto Princesa, Zamboanga and Cagayan de Oro.",
            "Direct ferry routes and roll-on roll-off connections on the Philippines’ nautical highway are also available between Iloilo and all other major cities in the country."
        ],
        [
            "By plane, travel time to the Iloilo takes around 1 hour from Manila, 30 minutes from Cebu, 2 hours and 30 minutes from Hong Kong, and 3 hours and 30 minutes from Singapore.",
            "By direct ferry, Iloilo is approximately 1.5 hours away from Bacolod, and 15 minutes away from Guimaras.",
            "By land, Iloilo is around 4–5 hours away from Boracay, 3 hours away from Kalibo, and 2 hours away from Roxas City."
        ],
        [
            "Iloilo transportation gateways"
        ],
        [
            "Iloilo International Airport – The Iloilo International Airport is the primary gateway to Iloilo.",
            "It serves regularly scheduled direct domestic flights to Iloilo from major Philippine airlines including Manila, Cebu, Davao, General Santos, Puerto Princesa, and Cagayan de Oro.",
            "The airport also serves international flights from Iloilo to Hong Kong and Singapore.",
            "Flights to Iloilo are served by Cebu Pacific, Philippine Airlines, PAL Express, and TigerAir.",
            "The Iloilo Airport is located approximately 19 kilometers or 20 minutes away by taxi from Iloilo City."
        ],
        [
            "Iloilo Seaports – Ferries in Iloilo depart and arrive at various seaports in Iloilo City and Iloilo Province depending on the route and vessel type.",
            "(1) Ferry terminals along the Iloilo River in Lapuz district, Iloilo City serves fastcraft ferries to and from Bacolod, RORO ferries to and from Guimaras, and ferries to and from Palawan.",
            "(2) The Iloilo Domestic Port in Fort San Pedro, Iloilo City Proper, serves shipping companies with routes to and from Manila, Cebu, Cagayan de Oro, and Zamboanga."
        ],
        [
            "Universities and colleges"
        ],
        [
            "Main articles: List of universities and colleges in Iloilo and List of colleges and universities in the Philippines"
        ],
        [
            "Herrera Hall at the University of San Agustin, the first university in Western Visayas."
        ],
        [
            "The province of Iloilo, including the city of Iloilo, is the center of education in the Western Visayas region.",
            "It has one of the largest numbers of universities in the country, with a total of ten major universities."
        ],
        [
            "Universities:"
        ],
        [
            "Central Philippine University, Jaro, Iloilo City"
        ],
        [
            "Iloilo Science and Technology University, La Paz, Iloilo City (with branch campuses in Barotac Nuevo, Leon and Miag-ao)"
        ],
        [
            "Iloilo State University of Science and Technology, Barotac Nuevo (with branch campuses in Dingle, Dumangas, and San Enrique)"
        ],
        [
            "John B. Lacson Foundation Maritime University, Molo, Iloilo City (with branch campus in Arevalo, Iloilo City)"
        ],
        [
            "Northern Iloilo State University, Estancia (with branch campuses in Ajuy, Barotac Viejo, Batad, Concepcion, Lemery, and Sara)"
        ],
        [
            "St. Paul University Iloilo, Iloilo City Proper"
        ],
        [
            "University of Iloilo, Iloilo City Proper"
        ],
        [
            "University of San Agustin, Iloilo City Proper (with branch campus in Jaro, Iloilo City)"
        ],
        [
            "University of the Philippines Visayas, Iloilo City Proper and Miag-ao (Main Campus)"
        ],
        [
            "West Visayas State University, La Paz, Iloilo City (with branch campuses in Calinog, Janiuay, Lambunao/CAF, Lambunao/East, and Pototan)"
        ],
        [
            "Colleges:"
        ],
        [
            "ABBA Institute of Technology, Iloilo City Proper"
        ],
        [
            "ACSI College Iloilo, Iloilo City Proper"
        ],
        [
            "ABE International Business College (Iloilo campus), Iloilo City Proper"
        ],
        [
            "AMA Computer College (Iloilo campus), Iloilo City Proper"
        ],
        [
            "Asian College of Aeronautics, Jaro, Iloilo City"
        ],
        [
            "Cabalum Western College, Iloilo City Proper"
        ],
        [
            "Colegio de San Jose, Jaro, Iloilo City"
        ],
        [
            "Colegio del Sagrado Corazon de Jesus, Iloilo City Proper"
        ],
        [
            "Computer College of the Visayas, Iloilo City Proper"
        ],
        [
            "De Paul College, Jaro, Iloilo City"
        ],
        [
            "Dominican College of Iloilo, Zarraga"
        ],
        [
            "FAST Aviation Academy Inc. Iloilo, Jaro, Iloilo City"
        ],
        [
            "Gov.",
            "Angel Medina Foundation College, Passi City"
        ],
        [
            "Great Saviour College, La Paz, Iloilo City"
        ],
        [
            "Hua Siong College of Iloilo, Iloilo City Proper"
        ],
        [
            "Iloilo City Community College, Molo, Iloilo City"
        ],
        [
            "Iloilo Doctors' College, Molo, Iloilo City"
        ],
        [
            "Iloilo Doctors' College of Medicine, Molo, Iloilo City"
        ],
        [
            "Iloilo State College of Fisheries, Barotac Nuevo"
        ],
        [
            "Iloilo Technical College, Iloilo City Proper"
        ],
        [
            "Integrated Midwives Association of the Philippines Foundation School of Midwifery, La Paz, Iloilo City"
        ],
        [
            "Interface Computer College (Iloilo campus), Iloilo City Proper"
        ],
        [
            "Leon Ganzon Polythechnic College, Balasan"
        ],
        [
            "New Lucena Polytechnic College, New Lucena"
        ],
        [
            "Passi City College, Passi City"
        ],
        [
            "Philippine College of Aeronautics, Science and Technology, Jaro, Iloilo City"
        ],
        [
            "St. Anne College of Iloilo, Mandurriao, Iloilo City"
        ],
        [
            "St. Therese – MTC colleges, Molo, Iloilo City (with branch campuses in La Paz, Iloilo City and Tigbauan)"
        ],
        [
            "St. Vincent College of Science and Technology, Leganes"
        ],
        [
            "St. Vincent Ferrer Seminary, Jaro, Iloilo City"
        ],
        [
            "STI College (Iloilo campus), Iloilo City Proper"
        ],
        [
            "St. Vincent College of Business and Accountancy, Pototan"
        ],
        [
            "Santa Isabel College of Iloilo City, Mandurriao, Iloilo City"
        ],
        [
            "Western Institute of Technology, La Paz, Iloilo City"
        ],
        [
            "Special Schools:"
        ],
        [
            "SPED-Integrated School for Exceptional Children, Iloilo City Proper"
        ],
        [
            "Sports"
        ],
        [
            "Iloilo is home to two professional sports teams.",
            "Kaya F.C.–Iloilo competes in the Philippines Football League (PFL), the highest tier of Philippine football.",
            "The club relocated to the province in 2018.",
            "Kaya has won 2 PFL titles, 3 Copa Paulino Alcantara, and 1 UFL Cup.",
            "Kaya has also competed in the AFC Champions League and the AFC Cup.",
            "The Iloilo United Royals compete in the Maharlika Pilipinas Basketball League, joining as an expansion team in the 2019–20 season."
        ],
        [
            "Media"
        ],
        [
            "Main article: List of television and radio stations in Iloilo City"
        ],
        [
            "Iloilo City is home to regional television stations of GMA Network (GMA TV6 & GMA News TV 28), TV5 (UHF 36 & AksyonTV 46), Solar channels (9TV TV-4) ETC UHF 32 & 2nd Avenue UHF 24), IBC (VHF 12), (BEAM UHF 26) and ABS-CBN (ABS-CBN TV10, ABS-CBN Sports+Action (UHF 38))."
        ],
        [
            "Notable people"
        ],
        [
            "Main article: List of people from Iloilo"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved February 11, 2013."
        ],
        [
            "^ a b c Census of Population (2015).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"2021 to 2023 Gross Regional Domestic Product (GRDP)\".",
            "openstat.psa.gov.ph.",
            "Philippine Statistics Authority.",
            "Retrieved April 26, 2024."
        ],
        [
            "^ de Mentrida, Alonso (1841).",
            "Diccionario De La Lengua Bisaya, Hiligueina Y Haraya de la isla de Panay.",
            "En La Imprenta De D. Manuel Y De D. Felis Dayot.",
            "pp.",
            "202–203."
        ],
        [
            "^ Doeppers, Daniel F. (2017).",
            "\"The Development of Philippine Cities Before 1900\".",
            "In Frost, Lionel (ed.).",
            "Urbanization and the Pacific World, 1500–1900.",
            "Lands, Peoples, and History of the Pacific, 1500-1900.",
            "Vol. 15.",
            "Routledge.",
            "ISBN 9781351876346."
        ],
        [
            "^ Law, Gwillim (2015).",
            "Administrative Subdivisions of Countries: A Comprehensive World Reference, 1900 through 1998.",
            "McFarland.",
            "p. 289.",
            "ISBN 9781476604473."
        ],
        [
            "^ Romuáldez, Norberto (1908).",
            "A Bisayan Grammar and Notes on Bisayan Rhetoric and Poetics and Filipino Dialectology.",
            "Tacloban: Pag Pahayag Co."
        ],
        [
            "^ Jocano, Felipe Landa; Hugan-an (2000).",
            "Hinilawod: Adventures of Humadapnon Tarangban I. Quezon City: Punlad Research House, Inc. ISBN 971-622-010-3."
        ],
        [
            "^ Ma.",
            "Cecilia Locsin-Nava (2001).",
            "History & Society in the Novels of Ramon Muzones.",
            "Ateneo de Manila University Press.",
            "pp. 46.",
            "ISBN 978-971-550-378-5."
        ],
        [
            "^ Originally titled Maragtás kon (historia) sg pulô nga Panay kutub sg iya una nga pamuluyö tubtub sg pag-abut sg mga taga Borneo nga amó ang ginhalinan sg mga bisayâ kag sg pag-abut sg mga Katsilâ, Scott, William Henry (1984).",
            "Pre-hispanic Source Materials for the Study of Philippine History.",
            "Quezon City: New Day Publishers.",
            "pp.",
            "92–93, 103."
        ],
        [
            "^ \"Philippine Ethnography: Ilongo\" (PDF).",
            "CCP encyclopedia of Philippine Art.",
            "Vol. 1.",
            "manila: Cultural Center of the Philippines.",
            "1990.",
            "Archived from the original (PDF) on May 4, 2014.",
            "Retrieved April 19, 2014."
        ],
        [
            "^ \"Iloilo History Part 2 - Research Center for Iloilo\".",
            "Archived from the original on October 9, 2014.",
            "Retrieved September 14, 2014."
        ],
        [
            "^ Philippines: A Unique Nation By Dr. Sonia  M. Zaide (2015) p. 150."
        ],
        [
            "^ \"Jesuits In The Philippines (1581-1768)\" Page 145."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ Dayrit, Christine S. \"Iloilo: City of love\".",
            "Philstar.com.",
            "Retrieved May 20, 2023."
        ],
        [
            "^ \"Philippine Survivor Recounts Her Struggle As A 'Comfort Woman' For Wartime Japan\".",
            "NPR.org.",
            "NPR.",
            "Retrieved August 15, 2021."
        ],
        [
            "^ The Other Empire: Literary Views of Japan from the Philippines, Singapore, and Malaysia.",
            "The University of the Philippines Press.",
            "2008.",
            "ISBN 9789715425629.",
            "Retrieved August 15, 2021."
        ],
        [
            "^ \"Women made to be Comfort Women - Philippines\"."
        ],
        [
            "^ Lapham, R., and Norling, B., 1996, Lapham's Raiders, Lexington: The University Press of Kentucky,ISBN 0813119499"
        ],
        [
            "^ a b c \"Province: Iloilo\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population (2020).",
            "\"Region VI (Western Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VI (Western Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Philippines Census Of Population of all LGUs 1903-2007\".",
            "archive.org.",
            "Philippine Statistics Authority.",
            "Retrieved February 14, 2017."
        ],
        [
            "^ Table 5.",
            "Household Population by Ethnicity and Sex: Iloilo, 2000"
        ],
        [
            "^ and \"Languages of Iloilo - Research Center for Iloilo\".",
            "Archived from the original on February 15, 2013.",
            "Retrieved October 18, 2012."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Iloilo History Part 2 - Research Center for Iloilo\"."
        ],
        [
            "^ \"What is Tinuom?",
            "– Municipality of Cabatuan\".",
            "December 1, 2019.",
            "Retrieved July 13, 2024."
        ],
        [
            "^ \"Baye-Baye\".",
            "Globalpinoy.com.",
            "Archived from the original on April 19, 2007.",
            "Retrieved September 29, 2013."
        ],
        [
            "^ \"How to Get to and Around Iloilo\".",
            "Explore Iloilo."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Iloilo (province) at Wikimedia Commons"
        ],
        [
            " Iloilo (province) travel guide from Wikivoyage"
        ],
        [
            " Geographic data related to Iloilo at OpenStreetMap"
        ],
        [
            "Iloilo Travel Website Archived January 13, 2018, at the Wayback Machine"
        ],
        [
            "Republic of the Philippines: Official website of the Provincial Government of Iloilo"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to Iloilo"
        ],
        [
            "Capiz"
        ],
        [
            "Antique"
        ],
        [
            "Iloilo"
        ],
        [
            "Visayan Sea"
        ],
        [
            "Panay Gulf, Iloilo StraitGuimaras"
        ],
        [
            "Guimaras Strait / Negros Occidental"
        ],
        [
            "vte Province of IloiloIloilo City (capital and largest city)Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Anilao"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Banate"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Bingawan"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumangas"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Igbaras"
        ],
        [
            "Janiuay"
        ],
        [
            "Lambunao"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Maasin"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "New Lucena"
        ],
        [
            "Oton"
        ],
        [
            "Pavia"
        ],
        [
            "Pototan"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sara"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tubungan"
        ],
        [
            "Zarraga"
        ],
        [
            "Component city"
        ],
        [
            "Passi"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City  (Administratively independent from the province but grouped under Iloilo by the Philippine Statistics Authority.)"
        ],
        [
            "Articles related to Iloilo"
        ],
        [
            "vteWestern Visayas (Region VI)Regional center"
        ],
        [
            "Iloilo City"
        ],
        [
            "Provinces"
        ],
        [
            "Aklan"
        ],
        [
            "Antique"
        ],
        [
            "Capiz"
        ],
        [
            "Guimaras"
        ],
        [
            "Iloilo"
        ],
        [
            "Metropolitan Area"
        ],
        [
            "Metro Iloilo–Guimaras"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Iloilo City"
        ],
        [
            "Component cities"
        ],
        [
            "Passi"
        ],
        [
            "Roxas"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Iloilo City"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Roxas"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "Municipalities"
        ],
        [
            "Ajuy"
        ],
        [
            "Alimodian"
        ],
        [
            "Altavas"
        ],
        [
            "Anilao"
        ],
        [
            "Anini-y"
        ],
        [
            "Badiangan"
        ],
        [
            "Balasan"
        ],
        [
            "Balete"
        ],
        [
            "Banate"
        ],
        [
            "Banga"
        ],
        [
            "Barbaza"
        ],
        [
            "Barotac Nuevo"
        ],
        [
            "Barotac Viejo"
        ],
        [
            "Batad"
        ],
        [
            "Batan"
        ],
        [
            "Belison"
        ],
        [
            "Bingawan"
        ],
        [
            "Buenavista"
        ],
        [
            "Bugasong"
        ],
        [
            "Buruanga"
        ],
        [
            "Cabatuan"
        ],
        [
            "Calinog"
        ],
        [
            "Caluya"
        ],
        [
            "Carles"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuartero"
        ],
        [
            "Culasi"
        ],
        [
            "Dao"
        ],
        [
            "Dingle"
        ],
        [
            "Dueñas"
        ],
        [
            "Dumalag"
        ],
        [
            "Dumangas"
        ],
        [
            "Dumarao"
        ],
        [
            "Estancia"
        ],
        [
            "Guimbal"
        ],
        [
            "Hamtic"
        ],
        [
            "Ibajay"
        ],
        [
            "Igbaras"
        ],
        [
            "Ivisan"
        ],
        [
            "Jamindan"
        ],
        [
            "Janiuay"
        ],
        [
            "Jordan"
        ],
        [
            "Kalibo"
        ],
        [
            "Lambunao"
        ],
        [
            "Laua-an"
        ],
        [
            "Leganes"
        ],
        [
            "Lemery"
        ],
        [
            "Leon"
        ],
        [
            "Lezo"
        ],
        [
            "Libacao"
        ],
        [
            "Libertad"
        ],
        [
            "Maasin"
        ],
        [
            "Ma-ayon"
        ],
        [
            "Madalag"
        ],
        [
            "Makato"
        ],
        [
            "Malay"
        ],
        [
            "Malinao"
        ],
        [
            "Mambusao"
        ],
        [
            "Miagao"
        ],
        [
            "Mina"
        ],
        [
            "Nabas"
        ],
        [
            "New Lucena"
        ],
        [
            "New Washington"
        ],
        [
            "Nueva Valencia"
        ],
        [
            "Numancia"
        ],
        [
            "Oton"
        ],
        [
            "Panay"
        ],
        [
            "Pandan"
        ],
        [
            "Panitan"
        ],
        [
            "Patnongon"
        ],
        [
            "Pavia"
        ],
        [
            "Pilar"
        ],
        [
            "Pontevedra"
        ],
        [
            "Pototan"
        ],
        [
            "President Roxas"
        ],
        [
            "San Dionisio"
        ],
        [
            "San Enrique"
        ],
        [
            "San Joaquin"
        ],
        [
            "San Jose de Buenavista"
        ],
        [
            "San Lorenzo"
        ],
        [
            "San Miguel"
        ],
        [
            "San Rafael"
        ],
        [
            "San Remigio"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Sapian"
        ],
        [
            "Sara"
        ],
        [
            "Sebaste"
        ],
        [
            "Sibalom"
        ],
        [
            "Sibunag"
        ],
        [
            "Sigma"
        ],
        [
            "Tangalan"
        ],
        [
            "Tapaz"
        ],
        [
            "Tibiao"
        ],
        [
            "Tigbauan"
        ],
        [
            "Tobias Fornier"
        ],
        [
            "Tubungan"
        ],
        [
            "Valderrama"
        ],
        [
            "Zarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Iloilo&oldid=1234242522\""
        ],
        [
            "Categories: IloiloProvinces of the PhilippinesProvinces of Western VisayasStates and territories established in 15661566 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWikipedia indefinitely move-protected pagesUse mdy dates from December 2022Use Philippine English from December 2022All Wikipedia articles written in Philippine EnglishArticles with short descriptionShort description is different from WikidataPages using multiple image with auto scaled imagesCoordinates on WikidataPages with Tagalog IPAArticles containing Hiligaynon-language textArticles containing Kinaray-a-language textArticles containing Cebuano-language textArticles containing Filipino-language textArticles containing Spanish-language textLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataWebarchive template wayback linksArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}