{
    "name": "La Union",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "La Union"
        ],
        [
            "44 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålOccitanPangasinanPolskiPortuguêsРусскийScotsSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 16°30′N 120°25′E﻿ / ﻿16.5°N 120.42°E﻿ / 16.5; 120.42"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "For the railway station, see Los Angeles Union Station."
        ],
        [
            "Not to be confused with La Unión or L'Union."
        ],
        [
            "Province in Ilocos Region, PhilippinesLa UnionProvinceProvince of La Union(from top: left to right) San Fernando City, Beach in Agoo, Welcome arch at the La Union-Ilocos Sur border, rice field in Naguilian, Tapuakan River in Pugo"
        ],
        [
            "FlagSealNickname: ElyuMotto(s): \"Love, Union, Concord\"Anthem: La Union HymnLocation in the PhilippinesOpenStreetMapCoordinates: 16°30′N 120°25′E﻿ / ﻿16.5°N 120.42°E﻿ / 16.5; 120.42CountryPhilippinesRegionIlocos RegionFoundedMarch 2, 1850Capitaland largest citySan FernandoGovernment • GovernorRaphaelle Veronica A. Ortega-David • Vice GovernorMario Eduardo C. Ortega (NUP) • LegislatureLa Union Provincial BoardArea • Total822,352 • Rank37th out of 81 • Density550/km2 (1,400/sq mi)  • Rank9th out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " San Fernando"
        ],
        [
            " • Municipalities"
        ],
        [
            "19"
        ],
        [
            " Agoo"
        ],
        [
            " Aringay"
        ],
        [
            " Bacnotan"
        ],
        [
            " Bagulin"
        ],
        [
            " Balaoan"
        ],
        [
            " Bangar"
        ],
        [
            " Bauang"
        ],
        [
            " Burgos"
        ],
        [
            " Caba"
        ],
        [
            " Luna"
        ],
        [
            " Naguilian"
        ],
        [
            " Pugo"
        ],
        [
            " Rosario"
        ],
        [
            " San Gabriel"
        ],
        [
            " San Juan"
        ],
        [
            " Santo Tomas"
        ],
        [
            " Santol"
        ],
        [
            " Sudipen"
        ],
        [
            " Tubao"
        ],
        [
            " • Barangays576 • DistrictsLegislative districts of La UnionTime zoneUTC+8 (PHT)ZIP code2500–2520IDD : area code +63 (0)72ISO 3166 codePH-LUNLanguagesIlocano (official)PangasinanKankanaeyIbaloiTagalogEnglishWebsitewww.launion.gov.ph"
        ],
        [
            "La Union (Tagalog pronunciation: ), officially the Province of La Union (Ilocano: Probinsia ti La Union; Pangasinan: Luyag/Probinsia na La Union;"
        ],
        [
            "Tagalog: Lalawigan ng La Union), is a province in the Philippines located in the Ilocos Region in the island of Luzon.",
            "Its capital is the City of San Fernando, which also serves as the regional center of the Ilocos Region."
        ],
        [
            "The province is bordered by Ilocos Sur to the north, Benguet to the east, Pangasinan to the south, and to the west by the shores of the South China Sea."
        ],
        [
            "History"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(June 2016)"
        ],
        [
            "Early history"
        ],
        [
            "See also: History of the Philippines (900–1565)"
        ],
        [
            "During the pre-colonial era, the coastal plains of northwestern La Union and Ilocos Sur stretching from the town of \"Tagudan\" (Tagudin) in the north to Sudipen, Namacpacan (Luna), Bangar, \"Basnutan\" (Bacnotan), and \"Purao\" or \"Puraw\" (Balaoan) in the south, and along the riverbanks of the Amburayan River – were the early settlement of the \"Samtoy\" or the \"Ilocanos\" in La Union."
        ],
        [
            "Thus according to William Henry Scott, \"the northern section of La Union was an emporium and renowned for the exchange of Igorot gold and gold mines\", involving merchants often from the Chinese, Japanese, Igorots, and Tagalogs during the early settlement period.",
            "Rice, cotton, gold, wax, iron, glass beads, silk (abel), honey, ceramics, and stoneware jars known as burnáy were all traded goods.\""
        ],
        [
            "Furthermore, the southern coastal section of La Union was identified as \"Aroo\" or \"Agoho\" (Agoo).",
            "Agoo was the northern section of Caboloan (Pangasinan), and a settlement of people of the \"same race as those of Pangasinan, encompassing the settlements of \"Atuley\" (San Juan)\", \"San Fernando\", \"Bauang\", \"Caba\", the settlement of \"Alingay or Alinguey\" (Aringay), \"Santo Tomas\", and \"Rosario\"."
        ],
        [
            "These people traded actively trading with their Ilocano and Igorot neighbors and traders from China, Japan, and Southeast Asia for a long time before the age of colonization, as evidenced by the porcelain and pottery excavated from the site of the Catholic church during its renovation and now housed in the Museo de Iloko."
        ],
        [
            "Later, Japanese traders and fisherfolk arrived in the Philippines and established a settlement.",
            "La Union's coast was shaped in such a way at the time that it provided a good harbor for foreign vessels entering Lingayen Gulf."
        ],
        [
            "In the highlands of La Union is home of the Igorot people mainly the Kankaney and Ibaloi."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "See also: Spanish Colonial Era (Philippines)"
        ],
        [
            "A year after Adelantado Miguel Lopez de Legazpi made Manila the capital of the Philippines on June 24, 1571, the Spaniards started the colonization in Northern Luzon \"to pacify the people in it\"."
        ],
        [
            "In June, 1572, the conquistadores led by Juan de Salcedo (grandson of Legazpi) sailing the Angalakan River and landed in “Aroo” or “Agoho” present Agoo, then a part of Pangasinan.",
            "Juan de Salcedo saw three Japanese ships, he tracked them down until they landed in a Japanese settlement.",
            "The Japanese were permitted to stay after paying tribute.",
            "As a result of the incident, Agoo was dubbed \"El Puerto de Japon\" or \"Japanese Port\", because enterprising Japanese and Chinese merchants have been trading with the natives through this port.",
            "Agoo was highly involved in commerce with other Southeast Asian countries in the region."
        ],
        [
            "In her book \"Pangasinan 1572–1800\", Rosario Mendoza-Cortes states that La Union specifically Agoo was the region's principal port of call for Japanese and Chinese traders, with Sual, Pangasinan, as the only other contender.",
            "This was due to the presence of a Japanese colony.",
            "Traders at Agoo, after all, would have access to a larger number of people, and it was closer to China and Japan.",
            "The principal export from the region was deer pelts, which were shipped to Japan.",
            "When the Spanish closed the Philippines to foreign trade, Agoo's function as an ancient port began to deteriorate.",
            "When the port of Agoo was eventually closed, the Japanese would leave, but not before teaching the locals about fish farming, rice cultivation, deerskin tanning, duck breeding, and weapon production."
        ],
        [
            "The Spaniards marched up north without any resistance.",
            "They had their first taste of the Ilocanos' bravery and fighting heart during a historic Battle in Purao (literally, \"white\" and maybe due to the white sands of the beach) now known as Balaoan.",
            "The Spaniards befriended the Ilocanos who reluctantly acceded to Spanish rule."
        ],
        [
            "A secret society of insurrectos was organized in the town of Balaoan.",
            "Its purpose was to fight and revolt against the Spanish Government in the area.",
            "On the eve of the revolution, a traitor told the Spanish of their plan.",
            "The Spanish soldiers, without any investigation, arrested seven members of the secret society and executed them the same night.",
            "Only one, Fernando Ostrea, escaped with leg wounds.",
            "He informed the people about what had happened.",
            "In memory of the seven Martyrs, a masonic lodge, Siete Martires Lodge No.",
            "177, was organized."
        ],
        [
            "Formation in 1850"
        ],
        [
            "La Union was formed on March 2, 1850, and became the 34th province of the Philippines."
        ],
        [
            "After Cebu became the first provincia in 1565, new provinces have been created by the Spaniards.",
            "Three main functions were considered so: political-civil administration, ecclesiastical governance and geographical considerations.",
            "For more than two and one-half centuries, the original llocos province remained intact until 1818 when it split into llocos Norte and Ilocos Sur.",
            "In 1846, Abra was created by Governor General Narciso Zaldua Claveria."
        ],
        [
            "Governor General Claveria was a visionary administrator.",
            "He believed that combining three contiguous areas that are far from their respective provincial capitals was a viable solution to the demands of political-civil administration.",
            "He also saw the territory's agricultural and commercial growth potentials.",
            "And the kicker was the extension of Hispanic civilization and Christianity to the area.",
            "Bangar, Namacpacan (Luna) and Balaoan in the southern portion of llocos Sur was quite a distance from the cabezera of Vigan and in almost like manner, Sto.",
            "Tomas, Agoo, Aringay, Caba, Bauang, Naguilian, San Fernando, San Juan and Bacnotan were that far from Pangasinan's capital of Lingayen.",
            "The 40–45 rancherias in the depths of Central Cordillera of the Benguet (Eastern Pais del Igorotes) district bordered by the three Ilocos Sur towns and the nine of Pangasinan have even worse problems."
        ],
        [
            "Thus on October 29, 1849, Governor General Claveria signed the proposal (promovido) to unite the Pangasinan-Ilocos-Cordillera areas into a new province called La Union (the official name designated by Claveria himself).",
            "For 124 days, high and important Spanish colonial officers studied and deliberated on the proposition to create La Union or not.",
            "On March 2, 1850, Governor General Antonio Maria Blanco signed the Superior Decreto that founded La Union – the 34th province since the founding of Cebu in 1565.",
            "It was classified as a gobierno politico-militar (Political-Military Government).",
            "Blanco appointed, on March 4, 1850, Captain Toribio Ruiz de la Escalera (Claveria's former trusted aide de camp) as the first Gobernador Military y Politico.",
            "La Union is the union of lands, people, cultures and resources.",
            "On April 18, 1854, Queen Isabella II of Spain issued the royal decree (real orden) from Madrid confirming Blanco's Superior Decreto."
        ],
        [
            "By 1860, there was a dramatic progress in commerce and agriculture in the province primarily because of Tobacco.",
            "Spanish authorities banked on the prized leaf for further economic development.",
            "The industry was so lucrative that a Tobacco Monopoly was established.",
            "All Tobacco leaves were strictly monitored and bought exclusively by the government at a fixed price."
        ],
        [
            "1898 Philippine Revolution"
        ],
        [
            "See also: Philippine Revolution"
        ],
        [
            "By 1896, the people of La Union had enough of the Spanish atrocities.",
            "The torture of the native priests, Padres Adriano Garces of Balaoan, Mariano Gaerlan of San Fernando and Mariano Dacanay of Bacnotan; the execution of the Balaoan Siete Martires, a majority of whom are ancestors of former La Union Board Member Joaquin C. Ostrea Jr.; the persecution of Masons, whose membership included the elite natives; and others have all the more agitated the people to unite and fight their masters for three centuries."
        ],
        [
            "On May 22, 1898, a gunshot killed the much-hated Friar Mariano Garcia of Santo Tomas, it was a shot heard in the whole province which eventually ignited the revolution in what the Spaniards used to call, \"Una Provincia Modelo\"."
        ],
        [
            "Led by Manuel Tinio y Bondoc, a boy general under the command of General Emilio Aguinaldo, the Spaniards were finally defeated in La Union, some of whom escaped and sought refuge in Vigan.",
            "With the help of the Americans, the Filipinos were finally freed from Spain only to find out later that they will be subjected to a new colonial rule."
        ],
        [
            "A Revolutionary Government was established with Aguinaldo as president.",
            "Tinio acted as de facto governor of La Union but was later on replaced by Dr. Lucino Almeida as Presidente Provincial."
        ],
        [
            "American invasion era"
        ],
        [
            "See also: American colonial era in the Philippines"
        ],
        [
            "During the American occupation, Dr. Almeida was reappointed as provincial chief, only to be convicted and exiled after his revolutionary connections were discovered.",
            "In defense of their hard-fought freedom, the people of La Union resisted American power and maintained their allegiance to Aguinaldo.",
            "Due however to the superior American military firepower, the whole province and the whole archipelago were finally subdued and pacified."
        ],
        [
            "The Americans prioritized education during their rule.",
            "Schools were massively constructed, and public education attracted the Filipinos.",
            "Democracy, which was given equal importance, facilitated the election of La Union's first Civil Governor in 1901 in the person of Don Joaquín Joaquino Ortega.",
            "Nine other equally able governors followed Don Joaquin before the outbreak of World War II: Joaquín Luna 1904–1907, Sixto Zandueta 1908–1919, Pío Ancheta 1919–1922, Thomas de Guzmán 1922 1923, 1928–1931, Juan Lucero 1923–1929, Mauro Ortiz 1931–1934, Juan Rivera 1934–1937, Francisco Nisce 1937–1940 and Bernardo Gapuz 1940.",
            "Just as when the Filipinos were awaiting independence, as promised by the Americans under the Tydings-Mcduffie Law, World War II exploded."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "See also: World War II in the Philippines and Japanese Invasion of Lingayen Gulf"
        ],
        [
            "La Union had great strategic significance for both Allied and Japanese forces.",
            "The Filipinos fought side by side with the Americans.",
            "Amid the chaos and anarchy, three provincial chieftains rose to the occasion to lead the people of La Union, Gov.",
            "Bernardo Gapuz (1940), Gov.",
            "Jorge Camacho (1941–1942) and Gov.",
            "Bonifacio Tadiar (1942–1944)."
        ],
        [
            "Battle of Rosario (Japanese Invasion of Lingayen Gulf)"
        ],
        [
            "On December 22, 1941, the Japanese 4th Tank Regiment and the 47th Infantry Regiment under the command of Col. Isamu Yanagi, supported by a massive flotilla of navy ships tried to land in Agoo to make it one of three major beachheads for the Japanese Invasion of Lingayen Gulf, although weather dispersed their forces and made them deploy on a wide stretch of beach that ranged from Poro Point (San Fernando) to as far south as Damortis.",
            "These forces later met the commonwealth defence forces—consisting of the 26th Cavalry Regiment (Philippine Scouts), the Philippine 21st Division, the Philippine 11th Division, and the newly formed Philippine 71st Division—in what would later be called the Battle of Rosario."
        ],
        [
            "Bacnotan"
        ],
        [
            "Invading Japanese soldiers arrived at Bacnotan on December 21, 1941, during the early days of World War II.",
            "On January 4, 1945, the tides of war changed in La Union as Filipino-American soldiers captured Baroro Bridge in Bacnotan, a strategic bridge that connects the rest of Northern Luzon to San Fernando.",
            "The victory ensured the liberation of La Union.",
            "It was followed by the historic Battle of San Fernando and Bacsil Ridge.",
            "Defeated, the Japanese Imperial Army retreated to Baguio where they joined their comrades and made their last stand."
        ],
        [
            "The Battle of Bacsil Ridge"
        ],
        [
            "The Battle of Bacsil Ridge was fought in March 1945 was one of the continued main battles of the Philippines Campaign of the Second World War are between the Filipino soldiers under the 121st Infantry Regiment, Philippine Commonwealth Army, USAFIP-NL, under the command of Russell W. Volckmann, and the Japanese Imperial forces under by General Tomoyuki Yamashita."
        ],
        [
            "The Battle of Bacsil Ridge ended the month-long battle for control of San Fernando.",
            "The Japanese defenders called the Hayashi Detachment, composed of 3,000 armed troops and 2,000 unarmed support forces, took hold of San Fernando and its surrounding areas which denied entry to the port of the city and a road leading to Baguio.",
            "As part of the San Fernando-Bacsil Operations, the 1st Battalion of 121st Infantry were sent to loosen the enemy positions starting late February with the assistance of the Allied Air Force."
        ],
        [
            "The 1st Battalion made a general attack to the ridge on 16 March 1945 and fought the Japanese defenders until the capture of Bacsil on 19 March.",
            "On the same day, the 3rd battalion captured the Reservoir Hill.",
            "The Battle of Bacsil Ridge between the Filipino soldiers and recognized guerrillas and the Japanese Forces resulted in the recapture of the city of San Fernando, La Union.",
            "Which resulted in the capture of San Fernando, La Union on 23 March 1945, and Bacnotan, La Union and the military offensive throughout the province ended on 24 March after two months of fighting."
        ],
        [
            "Liberation of Bauang"
        ],
        [
            "The Liberation of Bauang, La Union was part of the San Fernando-Bascil operations aimed to liberate the province of La Union and open one of the roads to Baguio.",
            "Units from Rosario, La Union including elements of the 2nd Battalion, 121st Infantry of the United States Army Forces in the Philippines – Northern Luzon (USAFIP-NL) under the command of Major Diego Sipin, were tasked to make the northward advance to Bauang.",
            "The 2nd Battalion, 121st Infantry, USAFIP-NL reinforce the other battalions in the efforts to capture San Fernando.",
            "Meanwhile, combat units from the “B” company, 1st Battalion, 121st Infantry, USAFIP-NL attacked the defensive lines in Bauang to aid the 1st Battalion, 130th Infantry (US) in its advance from the south.",
            "Bauang was first liberated on 19 March 1945, followed by the declaration of the end of operations at La Union on 24 March 1945.",
            "On January 4, 1945, La Union was liberated by the Battle of San Fernando and Bacsil Ridge."
        ],
        [
            "As San Fernando was in ruins at the time, Bacnotan became the provisional seat of the province administration after the war.",
            "The La Union National High School was also relocated to Bacnotan as a result of this relocation.",
            "When things returned to normal, the provincial government was relocated to San Fernando, followed by the La Union National High School.",
            "The North Provincial High School was established after the provincial high school in Bacnotan was transferred (now Bacnotan National High School)."
        ],
        [
            "Postwar era"
        ],
        [
            "See also: Tobacco production in the Philippines and Stonehill scandal"
        ],
        [
            "The postwar recovery period marked a return of the tobacco industry to the Ilocos Region.",
            "Ever since the end of the tobacco monopoly, tobacco production had declined in the Ilocos as filipinos started shifting from locally made cigars to foreign made cigarettes."
        ],
        [
            "During the Marcos Dictatorship"
        ],
        [
            "See also: Martial law under Ferdinand Marcos, Armando Palabay, Human rights abuses of the Marcos dictatorship, and Bantayog ng mga Bayani"
        ],
        [
            "Although economically affected by the rapid peso devaluation brought about by unbridled election spending heading into the 1969 presidential elections,"
        ],
        [
            "The powerful family factions which had dominated La Union politics since before the American colonial era largely remained in place, although the family of Congressman Jose D. Aspiras became much more prominent after he became Marcos’ Tourism Minister.",
            "The main political change was the increased power of regional and provincial offices of national agencies, whose directors were answerable directly to Marcos."
        ],
        [
            "This technique used by Marcos to consolidate political power did not get much resistance in the Ilocos Region, and his successor Jose D. Aspiras was also a close associate of Marcos who was made Minister of Tourism after Martial Law was declared."
        ],
        [
            "But there were still La Union natives who were willing to object to the authoritarian practices and abuses of the Marcos administration, despite personal risk."
        ],
        [
            "Agoo, La Union, native Antonio L. Mabutas had become Archbishop of Davao by the time of Martial Law, and spoke actively against the human rights abuses of that time,"
        ],
        [
            "Contemporary"
        ],
        [
            "1990 Luzon earthquake"
        ],
        [
            "Main article: 1990 Luzon earthquake"
        ],
        [
            "La Union was severely hit by the 1990 Luzon earthquake.",
            "Five municipalities in La Union were affected: Agoo, Aringay, Caba, Santo Tomas, and Tubao with a combined population of 132,208.",
            "Many buildings, including the Agoo Municipal hall, collapsed or were severely damaged.",
            "100,000 families were displaced when two coastal villages sank due to liquefaction.",
            "The province suffered many casualties leaving 32 people dead."
        ],
        [
            "2010s tourism boom"
        ],
        [
            "See also: Tarlac–Pangasinan–La Union Expressway and Manuel Arguilla"
        ],
        [
            "From the mid-2000s to the early 2010s, an influx of entrepreneurs began putting up establishments such as boho-chic-style art hostels and third-wave coffeeshops in San Juan and Agoo."
        ],
        [
            "Alongside the rising influence of social media outlets Twitter and Instagram, these factors led to a drastic tourism boom that made San Juan—previously been seen as just one of the Philippines' many surfing venues—a major backpacker's destination whose attractions centered on surfing and art."
        ],
        [
            "San Juan began to be featured prominently in independent films such as Jay Abello's 2015 film Flotsam"
        ],
        [
            "Among Philippines literary circles, the town of Bauang has also become a pilgrimage site of sorts for celebrating the life of and works of writer and World War II martyr Manuel Arguilla, with writers visiting the author's hometown to experience the landscapes that inspired him, and which featured prominently in his stories."
        ],
        [
            "Geography"
        ],
        [
            "Landscape in Rosario"
        ],
        [
            "La Union covers a total area of 1,497.70 square kilometres (578.27 sq mi) occupying the central‑southern section of the Ilocos Region in Luzon.",
            "The province is bordered by Ilocos Sur to the north, Benguet to the east, Pangasinan to the south, and to the west by the South China Sea."
        ],
        [
            "La Union is 273 kilometres (170 mi) north of Metro Manila and 57 kilometres (35 mi) northwest of Baguio.",
            "The land area of the province is 149,770 hectares (370,100 acres)."
        ],
        [
            "Like most of the Ilocos Region, the province is squeezed in by the Cordillera mountain range to the east and the South China Sea to the west.",
            "Yet, unlike other portions of Luzon and the Philippines' two other island groupings, the Visayas and Mindanao, La Union experiences a rather arid and prolonged dry season with little precipitation to be expected between the months of November and May."
        ],
        [
            "Administrative divisions"
        ],
        [
            "La Union comprises 19 municipalities and 1 component city,"
        ],
        [
            "Political map of La Union"
        ],
        [
            " †  Provincial capital and component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Agoo"
        ],
        [
            "2nd"
        ],
        [
            "8.0%"
        ],
        [
            "66,028"
        ],
        [
            "63,692"
        ],
        [
            "0.69%"
        ],
        [
            "52.84"
        ],
        [
            "20.40"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "49"
        ],
        [
            "16°19′20″N 120°21′58″E﻿ / ﻿16.3223°N 120.3660°E﻿ / 16.3223; 120.3660﻿ (Agoo)"
        ],
        [
            "Aringay"
        ],
        [
            "2nd"
        ],
        [
            "6.1%"
        ],
        [
            "50,380"
        ],
        [
            "47,458"
        ],
        [
            "1.14%"
        ],
        [
            "84.54"
        ],
        [
            "32.64"
        ],
        [
            "600"
        ],
        [
            "1,600"
        ],
        [
            "24"
        ],
        [
            "16°23′45″N 120°21′19″E﻿ / ﻿16.3957°N 120.3553°E﻿ / 16.3957; 120.3553﻿ (Aringay)"
        ],
        [
            "Bacnotan"
        ],
        [
            "1st"
        ],
        [
            "5.4%"
        ],
        [
            "44,388"
        ],
        [
            "42,078"
        ],
        [
            "1.02%"
        ],
        [
            "78.18"
        ],
        [
            "30.19"
        ],
        [
            "570"
        ],
        [
            "1,500"
        ],
        [
            "47"
        ],
        [
            "16°43′18″N 120°20′59″E﻿ / ﻿16.7218°N 120.3497°E﻿ / 16.7218; 120.3497﻿ (Bacnotan)"
        ],
        [
            "Bagulin"
        ],
        [
            "2nd"
        ],
        [
            "1.8%"
        ],
        [
            "14,428"
        ],
        [
            "13,456"
        ],
        [
            "1.34%"
        ],
        [
            "107.33"
        ],
        [
            "41.44"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "10"
        ],
        [
            "16°36′27″N 120°26′15″E﻿ / ﻿16.6076°N 120.4374°E﻿ / 16.6076; 120.4374﻿ (Bagulin)"
        ],
        [
            "Balaoan"
        ],
        [
            "1st"
        ],
        [
            "4.9%"
        ],
        [
            "40,339"
        ],
        [
            "39,188"
        ],
        [
            "0.55%"
        ],
        [
            "68.70"
        ],
        [
            "26.53"
        ],
        [
            "590"
        ],
        [
            "1,500"
        ],
        [
            "36"
        ],
        [
            "16°49′15″N 120°24′09″E﻿ / ﻿16.8208°N 120.4025°E﻿ / 16.8208; 120.4025﻿ (Balaoan)"
        ],
        [
            "Bangar"
        ],
        [
            "1st"
        ],
        [
            "4.6%"
        ],
        [
            "38,041"
        ],
        [
            "35,947"
        ],
        [
            "1.08%"
        ],
        [
            "37.36"
        ],
        [
            "14.42"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "33"
        ],
        [
            "16°53′37″N 120°25′22″E﻿ / ﻿16.8937°N 120.4229°E﻿ / 16.8937; 120.4229﻿ (Bangar)"
        ],
        [
            "Bauang"
        ],
        [
            "2nd"
        ],
        [
            "9.5%"
        ],
        [
            "78,449"
        ],
        [
            "75,032"
        ],
        [
            "0.85%"
        ],
        [
            "73.15"
        ],
        [
            "28.24"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "39"
        ],
        [
            "16°31′35″N 120°19′45″E﻿ / ﻿16.5265°N 120.3292°E﻿ / 16.5265; 120.3292﻿ (Bauang)"
        ],
        [
            "Burgos"
        ],
        [
            "2nd"
        ],
        [
            "1.1%"
        ],
        [
            "9,006"
        ],
        [
            "8,067"
        ],
        [
            "2.12%"
        ],
        [
            "70.80"
        ],
        [
            "27.34"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "12"
        ],
        [
            "16°31′11″N 120°26′36″E﻿ / ﻿16.5196°N 120.4433°E﻿ / 16.5196; 120.4433﻿ (Burgos)"
        ],
        [
            "Caba"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "23,119"
        ],
        [
            "22,039"
        ],
        [
            "0.92%"
        ],
        [
            "46.31"
        ],
        [
            "17.88"
        ],
        [
            "500"
        ],
        [
            "1,300"
        ],
        [
            "17"
        ],
        [
            "16°25′52″N 120°20′38″E﻿ / ﻿16.4311°N 120.3439°E﻿ / 16.4311; 120.3439﻿ (Caba)"
        ],
        [
            "Luna"
        ],
        [
            "1st"
        ],
        [
            "4.5%"
        ],
        [
            "37,318"
        ],
        [
            "35,802"
        ],
        [
            "0.79%"
        ],
        [
            "42.90"
        ],
        [
            "16.56"
        ],
        [
            "870"
        ],
        [
            "2,300"
        ],
        [
            "40"
        ],
        [
            "16°51′10″N 120°22′35″E﻿ / ﻿16.8528°N 120.3765°E﻿ / 16.8528; 120.3765﻿ (Luna)"
        ],
        [
            "Naguilian"
        ],
        [
            "2nd"
        ],
        [
            "6.3%"
        ],
        [
            "52,189"
        ],
        [
            "54,221"
        ],
        [
            "−0.72%"
        ],
        [
            "104.60"
        ],
        [
            "40.39"
        ],
        [
            "500"
        ],
        [
            "1,300"
        ],
        [
            "37"
        ],
        [
            "16°31′56″N 120°23′45″E﻿ / ﻿16.5321°N 120.3958°E﻿ / 16.5321; 120.3958﻿ (Naguilian)"
        ],
        [
            "Pugo"
        ],
        [
            "2nd"
        ],
        [
            "2.4%"
        ],
        [
            "19,337"
        ],
        [
            "19,690"
        ],
        [
            "−0.34%"
        ],
        [
            "62.84"
        ],
        [
            "24.26"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "14"
        ],
        [
            "16°19′13″N 120°28′02″E﻿ / ﻿16.3202°N 120.4673°E﻿ / 16.3202; 120.4673﻿ (Pugo)"
        ],
        [
            "Rosario"
        ],
        [
            "2nd"
        ],
        [
            "7.3%"
        ],
        [
            "60,278"
        ],
        [
            "55,458"
        ],
        [
            "1.60%"
        ],
        [
            "73.98"
        ],
        [
            "28.56"
        ],
        [
            "810"
        ],
        [
            "2,100"
        ],
        [
            "33"
        ],
        [
            "16°13′46″N 120°29′16″E﻿ / ﻿16.2295°N 120.4878°E﻿ / 16.2295; 120.4878﻿ (Rosario)"
        ],
        [
            "San Fernando"
        ],
        [
            "†"
        ],
        [
            "1st"
        ],
        [
            "15.3%"
        ],
        [
            "125,640"
        ],
        [
            "121,812"
        ],
        [
            "0.59%"
        ],
        [
            "102.72"
        ],
        [
            "39.66"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "59"
        ],
        [
            "16°36′52″N 120°18′57″E﻿ / ﻿16.6145°N 120.3158°E﻿ / 16.6145; 120.3158﻿ (San Fernando, La Union)"
        ],
        [
            "San Gabriel"
        ],
        [
            "1st"
        ],
        [
            "2.3%"
        ],
        [
            "18,943"
        ],
        [
            "18,172"
        ],
        [
            "0.79%"
        ],
        [
            "129.87"
        ],
        [
            "50.14"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "15"
        ],
        [
            "16°40′27″N 120°24′04″E﻿ / ﻿16.6742°N 120.4010°E﻿ / 16.6742; 120.4010﻿ (San Gabriel)"
        ],
        [
            "San Juan"
        ],
        [
            "1st"
        ],
        [
            "4.9%"
        ],
        [
            "40,507"
        ],
        [
            "37,188"
        ],
        [
            "1.64%"
        ],
        [
            "57.12"
        ],
        [
            "22.05"
        ],
        [
            "710"
        ],
        [
            "1,800"
        ],
        [
            "41"
        ],
        [
            "16°40′12″N 120°20′14″E﻿ / ﻿16.6701°N 120.3373°E﻿ / 16.6701; 120.3373﻿ (San Juan)"
        ],
        [
            "Santo Tomas"
        ],
        [
            "2nd"
        ],
        [
            "5.0%"
        ],
        [
            "40,846"
        ],
        [
            "39,092"
        ],
        [
            "0.84%"
        ],
        [
            "64.00"
        ],
        [
            "24.71"
        ],
        [
            "640"
        ],
        [
            "1,700"
        ],
        [
            "24"
        ],
        [
            "16°17′04″N 120°23′19″E﻿ / ﻿16.2845°N 120.3885°E﻿ / 16.2845; 120.3885﻿ (Santo Tomas)"
        ],
        [
            "Santol"
        ],
        [
            "1st"
        ],
        [
            "1.7%"
        ],
        [
            "14,166"
        ],
        [
            "12,476"
        ],
        [
            "2.45%"
        ],
        [
            "93.70"
        ],
        [
            "36.18"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "11"
        ],
        [
            "16°46′22″N 120°27′35″E﻿ / ﻿16.7729°N 120.4596°E﻿ / 16.7729; 120.4596﻿ (Santol)"
        ],
        [
            "Sudipen"
        ],
        [
            "1st"
        ],
        [
            "2.1%"
        ],
        [
            "17,187"
        ],
        [
            "17,056"
        ],
        [
            "0.15%"
        ],
        [
            "97.59"
        ],
        [
            "37.68"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "17"
        ],
        [
            "16°54′27″N 120°27′52″E﻿ / ﻿16.9074°N 120.4645°E﻿ / 16.9074; 120.4645﻿ (Sudipen)"
        ],
        [
            "Tubao"
        ],
        [
            "2nd"
        ],
        [
            "3.9%"
        ],
        [
            "31,763"
        ],
        [
            "28,729"
        ],
        [
            "1.93%"
        ],
        [
            "50.75"
        ],
        [
            "19.59"
        ],
        [
            "630"
        ],
        [
            "1,600"
        ],
        [
            "18"
        ],
        [
            "16°20′49″N 120°24′45″E﻿ / ﻿16.3470°N 120.4126°E﻿ / 16.3470; 120.4126﻿ (Tubao)"
        ],
        [
            "Total"
        ],
        [
            "822,352"
        ],
        [
            "786,653"
        ],
        [
            "0.85%"
        ],
        [
            "1,499.28"
        ],
        [
            "578.88"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "576"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Barangays"
        ],
        [
            "La Union has a total of 576 barangays comprising its 19 municipalities and 1 city."
        ],
        [
            "The most populous barangay in the province is Sevilla in the City of San Fernando with a population of 11,316 in the 2020 census.",
            "If cities are excluded, Central East (Poblacion) in the municipality of Bauang has the highest number of inhabitants, at 4,249.",
            "Caggao in Bangar has the lowest with only 192."
        ],
        [
            "Further information: List of barangays in La Union"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of La UnionYearPop.±% p.a.1903 137,847—    1918 178,400+1.73%1939 207,701+0.73%1948 237,340+1.49%1960 293,330+1.78%YearPop.±% p.a.1970 373,682+2.45%1975 414,635+2.11%1980 452,578+1.77%1990 548,742+1.95%1995 597,442+1.61%YearPop.±% p.a.2000 657,945+2.09%2007 720,972+1.27%2010 741,906+1.05%2015 786,653+1.12%2020 822,352+0.88%Source: Philippine Statistics Authority"
        ],
        [
            "The population of La Union in the 2020 census was 822,352 people, with a density of 550 inhabitants per square kilometre or 1,400 inhabitants per square mile."
        ],
        [
            "The province is predominantly Ilocano (over 90% based on recent"
        ],
        [
            "Small populations of indigenous Cordilleran peoples, mostly Ibaloi, Kankanaey, and Bago, live in ancestral domain areas in the mountainous parts of Sudipen, Santol, San Gabriel, Bacnotan, Tubao, Pugo, Bagulin and Burgos."
        ],
        [
            "According to the Philippine Statistics Authority report in 2012, the province has the longest life expectancy in the country at 78.3 years."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of La Union"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  25.99"
        ],
        [
            "2009  29.29"
        ],
        [
            "2012  18.50"
        ],
        [
            "2015  17.53"
        ],
        [
            "2018  4.43"
        ],
        [
            "2021  6.60"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Paddy fields in Naguilian."
        ],
        [
            "View of San Fernando City, the provincial capital"
        ],
        [
            "This section is missing information about economic indicators (e.g.",
            "per capita income, unemployment, etc.",
            "Please expand the section to include this information.",
            "Further details may exist on the talk page.",
            "(October 2021)"
        ],
        [
            "According to the Philippine Statistics Authority, La Union had a Human Development Index (HDI) of 0.687 in 2012;  0.615 in 2009; and 0.587 in 2006."
        ],
        [
            "Currently, 80% of the income of the province comes from San Juan due to its tourism."
        ],
        [
            "Industries and products"
        ],
        [
            "La Union's economy is diversified with service, cottage industries, and agricultural industries spread throughout the province.",
            "The Port of San Fernando operates as an increasingly active shipping point, and the former American airbase Wallace Air Station, having been converted into a business and industrial area, helps to facilitate such commercial activity."
        ],
        [
            "La Union is known for its indigenous textile industries, as well as its booming tourism sector."
        ],
        [
            "The major products of the province include hand-woven blankets (Inabel), soft brooms, baskets, pottery, rice wine (tapuey), sugarcane wine (basi), sugarcane vinegar (sukang Iloco), wood craft, bamboo craft, native rice cakes, antique-finish furniture, dried fish, coconuts, sea urchins, malunggay and pebble stones."
        ],
        [
            "Culture"
        ],
        [
            "The province of La Union has a 93% llocano population that is overwhelmingly Roman Catholic.",
            "Its culture and traditions are rooted on Ilocano culture and traditions, which have evolved extensively and distinctively over the decades with the influences of neighboring provinces.",
            "Pangasinan communities can be found in southern, Igorot tribes, primarily the Ibaloi, Kankanaey, and Bago/Bag-o tribes found in La Union's Cordilleran foothills, and Chinese in the city."
        ],
        [
            "La Union was the birthplace of at least two of the most revered figures in Philippine art – writer and World War II hero Manuel Arguilla"
        ],
        [
            "Abel weaving (Panagabel)"
        ],
        [
            "The municipality of Bangar is known for its local loom-weaving industry, which produces the Abel Iloko cloth, a traditional Ilocano fabric that the town has been producing for centuries."
        ],
        [
            "Basi winemaking"
        ],
        [
            "The tradition of making basi is still prevalent and relevant in the municipality of Naguilian, where it has been practiced for centuries.",
            "Basi is a fermented alcoholic beverage made from unas (sugarcane) that, if fermented for a longer time period, turns into sukang Iloco.",
            "Basi is the \"One Town, One Product\" of Naguilian, and the Basi Festival is held annually.",
            "Unlike in Ilocos and Pangasinan, the method of making basi in Naguilian is distinct.",
            "The Naguilian method entails the preparation of bubod or starter, as well as the 24-hour binubudan (steamed rice plus starter), boiling sugarcane juice, and additives such as one-year-old duhat bark, tangal bark, and green guava leaves."
        ],
        [
            "Even before the arrival of the Spaniards, drinking basi was an important part of Ilocano culture, from marriage to childbirth to death.",
            "It is a part of their rituals, traditions, and daily life.",
            "That is why, on September 16, 1807, the Basi Revolt, which lasted 13 days in Piddig, Ilocos Norte, occurred when the Spanish rulers effectively prohibited private production of basi wine.",
            "The series of unrest also led the colonial government to divide the province into the now Ilocos Norte and Ilocos Sur."
        ],
        [
            "Festivals (Fiestas)"
        ],
        [
            "Festivals in the Philippines are vibrant, large, and celebrated with a lot of pomp and show.",
            "Every month and every city has its own vibrancy bursting forth from their festivals for at least a week, if not more.",
            "Each town in La Union has its own fiesta, and the people of La Union have a strong celebration game.",
            "Aside from that, there are several other special festivals held throughout La Union each year:"
        ],
        [
            "Pindangan Festival"
        ],
        [
            "A festival that  commemorates the founding anniversary of San Fernando as a city, which was ratified in a plebiscite on March 20, 1998.",
            "Pindangan is an Ilocano term for a location \"where meat is sun-dried\".",
            "The area was named \"Pindangan\" because the locals used to make a lot of sun-dried meat (with salt) to preserve it."
        ],
        [
            "Sillag Festival"
        ],
        [
            "Summer festival in La Union, Sillag Poro Point Festival of Lights.",
            "Sillag is an Ilocano word meaning \"moonbeam\" or \"illumination\" from the Moon.",
            "The festival was anchored on that theme of lights, with various activities kicking of as soon as the sun goes down at Poro Point."
        ],
        [
            "Diro Festival"
        ],
        [
            "Diro is an Ilocano word for \"honey\" that represents unity and oneness for Bacnoteñans.",
            "It is also \"One Town, One Product\" of Bacnotan under the DTI program.",
            "Officers and staff from the Head Office and the Bacnotan branch participated in the float parade and distributed giveaways to the residents."
        ],
        [
            "Dinengdeng Festival"
        ],
        [
            "The Dinengdeng Festival is the official festivity event of the municipality of Agoo.",
            "It is held annually in summer in celebration of a dish by which its name is derived from.",
            "Dinengdeng is the Ilocano term for any vegetable-simmered dish.",
            "Usually cooked in a banga, a local term for a cooking clay pot being used by the descendants of the local settlers in the ancient times."
        ],
        [
            "Tinungbo Festival"
        ],
        [
            "An annual celebration in the town of Pugo.",
            "The Tinungbo festival took its name from the local dialect tinungbo, which is an indigenous way of cooking rice and fresh water and other local delicacies light young bamboo internode, locally called as tubong, grilled over charcoal or low fire."
        ],
        [
            "Timpuyog Festival"
        ],
        [
            "A festival celebrated at the town of Caba, shat showcases its One Town product bamboo crafts.",
            "Timpuyog is an Ilocano word for \"unity, teamwork, cooperation\" or \"solidarity\"."
        ],
        [
            "Baggak Festival"
        ],
        [
            "Every month of January, the town of Bauang comes alive to stage this colorful festival.",
            "Typically baggak means \"morning star\" in Ilocano and stands for the dawning of a new day.",
            "During this event, it portrays the Ilocano spirit of unity and diversity of culture."
        ],
        [
            "Daing Festival"
        ],
        [
            "The town of Santo Tomas is known for its Damortis dried fish (daing stalls along the national highway) local trade, and exports.",
            "Daing Festival is held every April 20, followed by the annual town Fiesta every April 24 and 25."
        ],
        [
            "Basi Festival"
        ],
        [
            "Held every third week of February in the town of Naguilian to celebrate the basi traditional wine made from sugarcane which is its namesake.",
            "The festival mainly promotes Basi as a local product and the usual activities include street dancing, sport events, agri-trade fair & other amusement games."
        ],
        [
            "La Union Foundation Anniversary celebrations"
        ],
        [
            "Held around March, festivity for the La Union Foundation Anniversary celebrates the formation of the province in 1850.",
            "One of its highlights is the Miss La Union or Mutia ti La Union contest."
        ],
        [
            "In its 174th Foundation Anniversary, Governor Raphaelle Veronica Ortega-David, a licensed pilot, on  March 2–3, 204, led the Second La Union Hot Air Balloon Show at Poro Point bay-walk in San Fernando, La Union.",
            "Other activities include La Union Static Display and the La Union Car Show will and drift show."
        ],
        [
            "Provincial government and politics"
        ],
        [
            "Provincial CapitolLegislative BuildingBulwagan ng Katarungan (Regional Trial Courts, in San Fernando"
        ],
        [
            "Just as the national government, La Union provincial government is divided into three branches: executive, legislative, and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branches."
        ],
        [
            "The executive branch is composed of the governor for the provinces, the mayor for the cities and municipalities, and the barangay captain for the barangays."
        ],
        [
            "The legislative branch is composed of the Sangguniang Panlalawigan (provincial assembly) for the provinces, Sangguniang Panlungsod (city assembly) for the cities, Sangguniang Bayan (town assembly) for the municipalities, Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of government is vested upon the mayor and other elected officers who hold office at the City Hall of San Fernando.",
            "The Sangguniang Bayan is the center of legislation, stationed in the Speaker Pro-Tempore Francisco I. Ortega Building, the Legislative Building at the back of the Capitol."
        ],
        [
            "Elected officials"
        ],
        [
            "La Union is governed by Raphaelle Veronica Ortega-David, the chief executive, her vice governor, Mario Ortega, and 13 board members."
        ],
        [
            "Governors"
        ],
        [
            "American period:"
        ],
        [
            "Lucino Almeida (1901)"
        ],
        [
            "Don Joaquin Joaquino Ortega (1901–1904)"
        ],
        [
            "Joaquin Luna (1904–1907)"
        ],
        [
            "Sixto Zandueta (1907–1909)"
        ],
        [
            "Francisco Zandueta (1909–1912)"
        ],
        [
            "Mauro Ortiz (1912–1916)"
        ],
        [
            "Tomas de Guzman (1916)"
        ],
        [
            "Mauro Ortiz (1916–1918)"
        ],
        [
            "Pio Ancheta (1918–1921)"
        ],
        [
            "Thomas de Guzman (1922–1923)"
        ],
        [
            "Juan Lucero (1923–1928)"
        ],
        [
            "Thomas de Guzman (1928–1931)"
        ],
        [
            "Pio Ancheta (1931)"
        ],
        [
            "Mauro Ortiz (1931–1934)"
        ],
        [
            "Juan Rivera (1934–1937)"
        ],
        [
            "Francisco Nisce, (1937–1940)"
        ],
        [
            "Bernardo Gapuz (1940)"
        ],
        [
            "Japanese occupation:"
        ],
        [
            "Jorge Camacho (1941–1942)"
        ],
        [
            "Bonifacio Tadiar (1942–1944)"
        ],
        [
            "Postwar and present era:"
        ],
        [
            "Agaton Yaranon (1946–1947)"
        ],
        [
            "Doroteo Aguila (1948–1951)"
        ],
        [
            "Juan Carbonell (1952–1955)"
        ],
        [
            "Bernardo Gapuz (1956–1959)"
        ],
        [
            "Eulogio de Guzman, (1960–1967)"
        ],
        [
            "Juvenal Guerrero (1968–1977)"
        ],
        [
            "Tomas Asprer, (1977–1986)"
        ],
        [
            "Robert V. Dulay (1986–1987)"
        ],
        [
            "Joaquin Ortega (1988–1992)"
        ],
        [
            "Justo O. Orros (1992–2001)"
        ],
        [
            "Victor F. Ortega, (2001–2007)"
        ],
        [
            "Manuel C. Ortega (2007–2016)"
        ],
        [
            "Francisco Emmanuel R. Ortega III, (2016–2022)"
        ],
        [
            "Raphaelle Veronica Ortega-David (2022–present)"
        ],
        [
            "Court system"
        ],
        [
            "The Supreme Court of the Philippines recognizes La Union (inter alia) regional trial courts and metropolitan or municipal trial courts within the province and towns that have an overall jurisdiction in the populace of the province and towns, respectively."
        ],
        [
            "Batas Pambansa Blg.",
            "129, \"The Judiciary Reorganization Act of 1980\", as amended, created Regional, Metropolitan, Municipal Trial and Circuit Courts.",
            "The Third Judicial Region includes RTCs in La Union xxx Sec.",
            "14.",
            "Regional Trial Courts.",
            "(a) Fifty-seven Regional Trial Judges shall be commissioned for the First Judicial Region.",
            "Nine branches (Branches XXVI to XXXIV) for the province of La Union, Branches XXVI to XXX with seats at San Fernando, Branches XXXI and XXXII at Agoo, Branch XXXIII at Bauang, and Branch XXXIV at Balaoan;"
        ],
        [
            "The law also created Metropolitan Trial Courts in each metropolitan area established by law, a Municipal Trial Court in each of the other cities or municipalities, and a Municipal Circuit Trial Court in each circuit comprising such cities and/or municipalities as are grouped together pursuant to law: three branches for Cabanatuan City; in every city which does not form part of a metropolitan area, there is also a Municipal Trial Court with one branch, except as provided: Two branches for San Fernando, La Union;"
        ],
        [
            "The courts of law are stationed in Halls of Justices of the Province and towns.",
            "In La Union, the Regional Trial Court is stationed at the Bulwagan ng Katarungan or Halls of Justice in San Fernando, La Union and other Regional Trial Courts in Bauang and Agoo, La Union."
        ],
        [
            "Education"
        ],
        [
            "La Union has 333 public elementary schools, 56 private elementary schools, 79 public high schools, 51 private secondary schools, 20 Colleges and 5 State Universities."
        ],
        [
            "Colleges:"
        ],
        [
            "Saint Louis College La Union"
        ],
        [
            "Union Christian College"
        ],
        [
            "AMA Computer College – La Union Campus"
        ],
        [
            "Lorma Colleges"
        ],
        [
            "CICOSAT Colleges"
        ],
        [
            "Northern Philippines College for Maritime Science and Technology"
        ],
        [
            "STI College La Union"
        ],
        [
            "Saint John Bosco College of Northern Luzon"
        ],
        [
            "Sea and Sky Colleges"
        ],
        [
            "La Finn's Scholastica"
        ],
        [
            "Sta.",
            "Veronica Colleges"
        ],
        [
            "South Ilocandia College of Arts and Technology"
        ],
        [
            "La Union College of Science and Technology"
        ],
        [
            "La Union Christian Comprehensive College"
        ],
        [
            "Agoo Computer Colleges"
        ],
        [
            "Polytechnic College of La Union"
        ],
        [
            "Philippine Central College of Arts, Science and Technology"
        ],
        [
            "Universities:"
        ],
        [
            "Don Mariano Marcos Memorial State University-MID La Union Campus (MLUC)"
        ],
        [
            "Don Mariano Marcos Memorial State University-North La Union Campus Don (NLUC)"
        ],
        [
            "Don Mariano Marcos Memorial State University-South La Union Campus (SLUC)"
        ],
        [
            "Don Mariano Marcos Memorial State University-Open Uviversity"
        ],
        [
            "Notable people"
        ],
        [
            "Diego Silang (December 16, 1730 – May 28, 1763) – Filipino Revolutionary"
        ],
        [
            "Magnolia Antonino (1915–2010) – former Senator of the Philippines"
        ],
        [
            "Manuel Arguilla (1911–1944) – writer, patriot, and martyr"
        ],
        [
            "Jose D. Aspiras – 1st Secretary of the Department of Tourism and former congressman"
        ],
        [
            "Fortunato Abat (1925–2018) –  20th Secretary of the Department of National Defense (DND), Ambassador to the People's Republic of China, and Commanding General of the Philippine Army."
        ],
        [
            "Clare R. Baltazar (born 1927) – National Scientist of the Philippines for Systematic Entomology"
        ],
        [
            "Edward Barber — Filipino-British actor and host who came to prominence in 2016 Pinoy Big Brother: Lucky 7, 4th placed.",
            "from Aringay, La Union."
        ],
        [
            "Rolando Joselito Bautista – retired Filipino lieutenant general and 26th Secretary of Social Welfare and Development"
        ],
        [
            "Carlo Biado (born 1983) — Filipino Athlete and professional pool player “2021 US Open Pool Grand Champion”.",
            "from Rosario, La Union."
        ],
        [
            "Rafael Buenaventura – Governor of the Bangko Sentral ng Pilipinas"
        ],
        [
            "Carina Cariño — Miss Millennial 2017 1st Runner up, Binibining Pilipinas La Union.",
            "from Agoo, La Union."
        ],
        [
            "Roger Casugay — Filipino surfer who competed for the Philippines at the 2019 Southeast Asian Games gold medalist.",
            "He is the first Filipino to receive the Pierre de Coubertin Act of Fair Play Award of the International Fair Play Committee in recognition of saving a competitor in longboard semifinals of the 2019 Southeast Asian Games.",
            "from the City of San Fernando, La Union."
        ],
        [
            "Anacleto Diaz (1878–1945) – 31st Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Gloria Diaz (born 1951) – Miss Philippines 1969, Miss Universe 1969, Actress, from Aringay, La Union."
        ],
        [
            "Samuel Gaerlan – 187th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Coleen Garcia — is a Filipino actress, host, and model.",
            "from the City of San Fernando, La Union."
        ],
        [
            "Cheska Garcia Kramer — is a Filipino actress and model.",
            "from Bauang, La Union"
        ],
        [
            "Paolo Gallardo — Mister Grand International 2019 2nd Runner-up.",
            "from the City of San Fernando, La Union."
        ],
        [
            "Lucrecia Roces Kasilag (1918 2008) – National Artist of the Philippines for Music"
        ],
        [
            "Mario Lopez — 185th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Antonio Mabutas – Agoo-born first bishop of Diocese of Laoag and the second Archbishop of the Archdiocese of Davao, historically noted as the first Roman Catholic Archbishop to write a pastoral letter to criticize human rights violations under the Marcos dictatorship."
        ],
        [
            "JB Magsaysay (born 1980) – Pinoy Big Brother (season 1) housemate; actor, public servant, and businessman.",
            "from San Juan, La Union."
        ],
        [
            "José B. Nísperos (1887–1922) First Asian and Filipino to win US Medal of Honor"
        ],
        [
            "Doña Laureana Novicio Luna y Ancheta (July 4, 1836 – August 18, 1906) — Mother of Antonio Luna and Juan Luna."
        ],
        [
            "Bienvenido Nebres (born 1940) – academic, National Scientist of the Philippines for Mathematics, former Provincial Superior of the Society of Jesus in the Philippines"
        ],
        [
            "Ashley Ortega — is a Filipino-German actress well known for her roles in Dormitoryo and My Destiny on GMA Network.",
            "She is formerly a co-host of the variety show Wowowin.",
            "from the City of San Fernando, La Union."
        ],
        [
            "Camilo Osias (1889–1976) – Filipino politician, 6th and 8th President of the Senate of the Philippines."
        ],
        [
            "Wenceslao Padilla –  Filipino Scheut priest who from 2 August 2003 was the Apostolic prefect of the Apostolic Prefecture of Ulaanbaatar, a diocese of the Roman Catholic Church in Mongolia."
        ],
        [
            "Armando \"Mandrake\" Ducusin Palabay (1953–1974) - Filipino student leader and activist from San Fernando La Union, honored at the Philippines' Bantayog ng mga Bayani as a martyr of the resistance against the Marcos dictatorship."
        ],
        [
            "Jessica Soho — Multi-awarded (Asia Journalist of All Times, Peabody Award) Filipina broadcast journalist dubbed as the Asia's Powerhouse Journalist and known as the host of the news magazine program Kapuso Mo, Jessica Soho on GMA Network and formerly anchored the newscast State of the Nation with Jessica Soho on GMA News TV."
        ],
        [
            "Vice Ganda  – Singer, actor, comedian and host.",
            "from San Juan, La Union."
        ],
        [
            "References"
        ],
        [
            "^ a b \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 11 January 2013.",
            "Retrieved 30 July 2013."
        ],
        [
            "^ a b c d Census of Population (2020).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ Reid, Lawrence A.; Rubino, Carl Ralph Galvez (June 2002).",
            "\"Ilocano Dictionary and Grammar: Ilocano-English, English-Ilocano\".",
            "Oceanic Linguistics.",
            "41 (1): 238. doi:10.2307/3623336.",
            "ISSN 0029-8115.",
            "JSTOR 3623336."
        ],
        [
            "^ \"Kurditan Samtoy: The Literature of A Manly Race\".",
            "National Commission for Culture and the Arts.",
            "Retrieved 26 September 2021."
        ],
        [
            "^ Scott, William Henry (1994).",
            "Barangay: Sixteenth Century Philippine Culture and Society.",
            "Quezon City: Ateneo de Manila University Press.",
            "ISBN 971-550-135-4."
        ],
        [
            "^ a b Sals, Florent Joseph (2005).",
            "The History of Agoo: 1578-2005.",
            "La Union: Limbagan Printhouse.",
            "p. 80."
        ],
        [
            "^ Cortes, Rosario Mendoza (1991).",
            "A History of Pangasinan, 1572–1800.",
            "New Day."
        ],
        [
            "^ La Union Profile: Gallery of Governors – Province of La Union :: Official Website"
        ],
        [
            "^ Dull, Paul S. (1978).",
            "A Battle History of the Imperial Japanese Navy, 1941–1945.",
            "Naval Institute Press.",
            "pp. 29–31.",
            "ISBN 1299324614."
        ],
        [
            "^ a b \"Battle of Bacsil Ridge – PVAO\".",
            "Retrieved 26 September 2021."
        ],
        [
            "^ Volckmann, R., 954, We Remained, New York:W.W.Norton & Company, Inc.; ISBN 9780393350227"
        ],
        [
            "^ a b \"#OnThisDay – PVAO\".",
            "Retrieved 26 September 2021."
        ],
        [
            "^ Sison, Norman.",
            "\"Tabacalera: 130 years of cigars and Philippine history\".",
            "The Philippine Star.",
            "Retrieved 26 March 2024."
        ],
        [
            "^ a b Department of Agriculture, National Tobacco Administration.",
            "\"Tobacco History\".",
            "National Tobacco Administration.",
            "Retrieved 26 March 2024."
        ],
        [
            "^ a b De Guzman, Sara Soliven (26 May 2014).",
            "\"A ghost from the past – the Stonehill scandal\".",
            "The Phiippine Star."
        ],
        [
            "^ \"The American Chamber of Commerce Journal, June 1951\".",
            "The American Chamber of Commerce Journal.",
            "XXVII (6).",
            "June 1951.",
            "Archived from the original on 30 March 2024."
        ],
        [
            "^ a b c Magno, Alexander R., ed.",
            "(1998).",
            "\"A Web of Corruption\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Diola, Camille.",
            "\"Debt, deprivation and spoils of dictatorship – 31 years of amnesia\".",
            "The Philippine Star.",
            "Archived from the original on 26 June 2017.",
            "Retrieved 2 May 2018."
        ],
        [
            "^ a b c Turner, Mark M. (1989) Elites and Power in a Philippine Town.",
            "Under Martial Law, 1972–76.",
            "Philippine Studies 37: 283–300."
        ],
        [
            "^ a b Cortes, Rosario Mendoza.",
            "(1990) Pangasinan, 1901–1986: A Political, Socioeconomic, and Cultural History.",
            "New Day Publishers."
        ],
        [
            "^ a b Cimatu, Frank (7 June 2022).",
            "\"Solid North: Not gold and honey but blood and money #2\".",
            "Baguio Chronicle.",
            "Retrieved 30 March 2024."
        ],
        [
            "^ \"From 1987: 'A Damaged Culture' in the Philippines – The Atlantic\".",
            "The Atlantic.",
            "Archived from the original on 28 October 2016.",
            "Retrieved 22 January 2020."
        ],
        [
            "^ \"Mula Sigwa hanggang Commune hanggang EDSA: mga kabataang martir at bayani ng UP\", manilatoday.net.",
            "Accessed 28 July 2022."
        ],
        [
            "^ \"PALABAY, Armando D. – Bantayog ng mga Bayani\".",
            "bantayog.org.",
            "18 January 2017.",
            "Retrieved 22 January 2020."
        ],
        [
            "^ Burgonio, TJ \"Museum puts a face on little-known martial law martyrs\", Philippine Daily Inquirer, 21 September 2008."
        ],
        [
            "^ a b c \"Honoring Davao's Contributions to the Struggle for Rights, Freedom\".",
            "Bantayog ng mga Bayani.",
            "23 February 2018.",
            "Archived from the original on 28 February 2018.",
            "Retrieved 8 February 2020."
        ],
        [
            "^ a b Maglana, MAgz (10 July 2017).",
            "\"VOICES FROM MINDANAO: Fear is not a good foundation for getting Mindanao out of the rut\".",
            "MindaNews.",
            "Archived from the original on 8 February 2020.",
            "Retrieved 8 February 2020."
        ],
        [
            "^ Youngblood, Robert L. (1993).",
            "Marcos against the church : economic development and political repression in the Philippines.",
            "Quezon City: New Day Publ.",
            "ISBN 971-10-0512-3.",
            "OCLC 312239945."
        ],
        [
            "^ \"23 Years in La Union\".",
            "The Philippine Navigators.",
            "12 December 2015.",
            "Archived from the original on 16 July 2020.",
            "Retrieved 16 July 2020."
        ],
        [
            "^ \"Killer quake rumbles across Luzon\".",
            "Manila Standard.",
            "17 July 1990.",
            "Retrieved 10 October 2021."
        ],
        [
            "^ \"How entrepreneurs are reinventing the La Union lifestyle\".",
            "F&B Report Magazine.",
            "1 June 2017.",
            "Archived from the original on 27 September 2019.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ \"Hanging Out with Kiddo Cosio, the Man Behind La Union's Hipster Coffee Shop\".",
            "Pepper.Ph.",
            "14 November 2014.",
            "Archived from the original on 14 November 2014.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ Ortiga, Kara (21 July 2017).",
            "\"This La Union Couple Is Raising Smarter Kids Through \"Unschooling\"\".",
            "Esquiremag.ph.",
            "Archived from the original on 10 October 2020.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ Cardiñoza, Gabriel (17 March 2018).",
            "\"Beaches and gardens to beat summer heat\".",
            "INQUIRER.net.",
            "Archived from the original on 17 March 2018.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ \"Best Places in La Union If You're Feeling Artsy – La Union Tayo!\".",
            "launiontayo.com.",
            "10 October 2020.",
            "Archived from the original on 10 October 2020.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ a b \"REVIEW: Maja, Paulo at a crossroads in I'm Drunk I Love You\".",
            "PEP.ph.",
            "19 February 2017.",
            "Archived from the original on 19 February 2017.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ \"10 Philippine Travel Destinations From Our Favorite Pinoy Films\".",
            "When In Manila.",
            "5 May 2016.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ \"Stoked in ELYU : La Union, The Ultimate Beach Vibe\".",
            "Escape Manila.",
            "22 March 2018.",
            "Retrieved 10 October 2020."
        ],
        [
            "^ Sotelo, Yolanda (4 June 2017).",
            "\"House in literary classic defies time\".",
            "INQUIRER.net.",
            "Archived from the original on 3 June 2017.",
            "Retrieved 19 April 2022."
        ],
        [
            "^ Jose, F. Sionil (28 July 2014).",
            "\"A visit to Arguilla Country: Literature as patriotism\".",
            "Philstar.com.",
            "Archived from the original on 30 September 2018.",
            "Retrieved 19 April 2022."
        ],
        [
            "^ a b Dalisay, Butch (3 December 2017).",
            "\"Handfuls of fragrant hay\".",
            "Philstar.com.",
            "Archived from the original on 6 July 2020.",
            "Retrieved 19 April 2022."
        ],
        [
            "^ a b c d \"Province: La Union\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region I (Ilocos Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region I (Ilocos Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Philippines Census Of Population of all LGUs 1903–2007\".",
            "archive.org.",
            "Philippine Statistics Authority.",
            "Retrieved 14 February 2017."
        ],
        [
            "^ Elias, Jun (19 September 2012).",
            "\"Iloko La Union's official language\".",
            "The Philippine Star."
        ],
        [
            "^ \"POPCOM expands its population program to Indigenous peoples and Indigenous Cultural Commmunities\".",
            "Commission on Population and Development (POPCOM) Website.",
            "Archived from the original on 26 November 2020.",
            "Retrieved 5 April 2022."
        ],
        [
            "^ \"List of Identified Ancestral Domain (ADs) per Region: Region 1\" (PDF).",
            "Department of Energy.",
            "2015."
        ],
        [
            "^ Cimatu, Frank; Santos-Doctor, Joya (1 January 2003).",
            "\"Philippines' 'Ozymandias' still haunts\".",
            "Philippine Daily Inquirer.",
            "Retrieved 27 February 2015."
        ],
        [
            "^ Yabes, Criselda.",
            "\"Tribesmen 'Exorcise' Marcos Bust With PM-Philippines\".",
            "Retrieved 5 April 2022."
        ],
        [
            "^ HDI Tables.",
            "Philippine Statistics Authority.",
            "Retrieved 2018-11-13."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved 28 December 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"2018 Quickstat of La Union (Region I - Ilocos Region)\".",
            "Philippine Statistics Authority.",
            "Retrieved 22 October 2021."
        ],
        [
            "^ \"Weaving Communities in Luzon\".",
            "Narra Studio.",
            "Archived from the original on 18 September 2020.",
            "Retrieved 5 April 2022."
        ],
        [
            "^ Valenciano, Al M.; Tysmans, Wig (2015).",
            "Inabel : Philippine textile from the Ilocos Region (First ed.).",
            ".",
            "ISBN 9789710579303.",
            "OCLC 950450580.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ \"Daing (Dried Fish) Vendors of Damortis\".",
            "BlauEarth.",
            "14 June 2013.",
            "Archived from the original on 7 July 2014.",
            "Retrieved 5 April 2022."
        ],
        [
            "^ \"In Pugo, La Union, Fathers Carve Better Livelihood with DOLE's Help\".",
            "Retrieved 5 April 2022."
        ],
        [
            "^ Rudio, Israel O.",
            "\"La Union Soft Brooms: The First and the Original\".",
            "Provincial Government of La Union (Official Website).",
            "Archived from the original on 24 June 2016.",
            "Retrieved 18 May 2016."
        ],
        [
            "^ \"Peoples of the Philippines: Bago\".",
            "National Commission for Culture and the Arts.",
            "Retrieved 21 April 2022."
        ],
        [
            "^ Sotelo, Yolanda (4 June 2017).",
            "\"House in literary classic defies time\".",
            "The Philippine Daily Inquirer.",
            "Retrieved 6 July 2020."
        ],
        [
            "^ Samson, Helen (1976).",
            "Contemporary Filipino Composers.",
            "Quezon City: Manlapaz Publishing Company."
        ],
        [
            "^ Beleo }first=Erwin G. (15 May 2016).",
            "\"LU villagers' life loom with weaving industry\".",
            "Bangar, La Union.",
            "Retrieved 21 April 2022 – via PressReader."
        ],
        [
            "^ \"The Inabel of Ilocos: Woven Cloth for Everyday\".",
            "Narra Studio.",
            "Retrieved 21 April 2022."
        ],
        [
            "^ Sanchez, Prescilla.",
            "STUDIES ON THE TRADITIONAL SUGARCANE WINE (BASI) PRODUCTION IN THE PHILIPPINES."
        ],
        [
            "^ Ano Ang Basi Revolt?",
            "Bakit Nahati Ang Ilocos?",
            "🇵🇭🍷🤔, 27 September 2020, retrieved 22 April 2022"
        ],
        [
            "^ \"Pindangan Festival 2019 in Philippines, photos, Fair, Festival when is Pindangan Festival 2019 – HelloTravel\".",
            "www.hellotravel.com.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ Design, Halcyon Web.",
            "\"La Union Celebrates 7th Sillag Poro Point Festival Of Lights | Bases Conversion and Development Authority\".",
            "bcda.gov.ph.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Bacnotan\".",
            "La Union Tayo!.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Pugo town launches Tinungbo festival - HERALD EXPRESS | News in Cordillera and Northern Luzon\".",
            "12 December 2016.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Festivities | Municipality of Bauang\".",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Santo Tomas: An Introduction to the \"Tabo-an\" of the North – TriptheIslands.com\".",
            "triptheislands.com.",
            "3 April 2016.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Naguilian\".",
            "La Union Tayo!.",
            "Retrieved 24 April 2022."
        ],
        [
            "^ \"Mutia ti La Union 2018\".",
            "Provincial Government of La Union.",
            "9 March 2018.",
            "Retrieved 8 October 2023."
        ],
        [
            "^ Marzan, Jerome (20 February 2023).",
            "\"La Union's Festive Anniversary Celebration Returns, Launches Ayat Fest 2023\".",
            "Provincial Government of La Union.",
            "Retrieved 8 October 2023."
        ],
        [
            "^ Dumlao, Artemio (1 March 2024).",
            "\"Hot air balloon, thrill shows head to La Union\".",
            "The Philippine Star.",
            "Retrieved 2 March 2024."
        ],
        [
            "^ Local Government Code of the Philippines, Book III Archived 2009-03-26 at the Wayback Machine, Department of the Interior and Local Government official website."
        ],
        [
            "^ \"Gobierno ti La Union\".",
            "Provincial Government of La Union (Official Website).",
            "Retrieved 18 May 2016."
        ],
        [
            "^ Philippine Laws, Statutes And Codes – Chan Robles Virtual Law Library"
        ],
        [
            "^ \"Batas Pambansa Bilang 129; An Act Reorganizing the Judiciary, Appropriating Funds Therefor, and for Other Purposes\".",
            "Chan Robles Virtual Law Library.",
            "14 August 1981.",
            "Retrieved 18 May 2016."
        ],
        [
            "^ \"Education\".",
            "Provincial Government of La Union.",
            "Archived from the original on 27 September 2010.",
            "Retrieved 16 April 2016."
        ],
        [
            "^ \"Binibining Pilipinas Beauty Pageant 2021\".",
            "www.bbpilipinas.com.",
            "Retrieved 28 September 2021."
        ],
        [
            "^ Cruz, Lorenzo (21 November 2019).",
            "\"La Union's Paolo Gallardo brings home Mister Grand International 2019 2nd Runner-up honors from Myanmar\".",
            "Good News Pilipinas.",
            "Retrieved 26 September 2021."
        ],
        [
            "^ \"Laureana Novicio-Luna\".",
            "geni_family_tree.",
            "4 July 1836.",
            "Retrieved 26 September 2021."
        ],
        [
            "^ \"Shepherding the flock in Mongolia | I seek for Jesus Christ\".",
            "icjesus.wordpress.com.",
            "14 December 2014.",
            "Retrieved 1 July 2016."
        ],
        [
            "^ \"PALABAY, Armando D. – Bantayog ng mga Bayani\".",
            "bantayog.org.",
            "18 January 2017.",
            "Retrieved 22 January 2020."
        ],
        [
            "^ Armando Palabay (YouTube Video).",
            "Commission on Human Rights of the Philippines.",
            "Archived from the original on 12 December 2021."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to La Union at Wikimedia Commons"
        ],
        [
            " Geographic data related to La Union at OpenStreetMap"
        ],
        [
            "Official Website of the Provincial Government of La Union"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Places adjacent to La Union"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "South China Sea"
        ],
        [
            "La Union"
        ],
        [
            "Benguet"
        ],
        [
            "Lingayen Gulf"
        ],
        [
            "Pangasinan"
        ],
        [
            "vteProvince of La UnionSan Fernando (capital and largest city)Municipalities"
        ],
        [
            "Agoo"
        ],
        [
            "Aringay"
        ],
        [
            "Bacnotan"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Bangar"
        ],
        [
            "Bauang"
        ],
        [
            "Burgos"
        ],
        [
            "Caba"
        ],
        [
            "Luna"
        ],
        [
            "Naguilian"
        ],
        [
            "Pugo"
        ],
        [
            "Rosario"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Juan"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Santol"
        ],
        [
            "Sudipen"
        ],
        [
            "Tubao"
        ],
        [
            "Component city"
        ],
        [
            "San Fernando"
        ],
        [
            "BarangaysSee: List of barangays in La Union"
        ],
        [
            "Articles related to La Union"
        ],
        [
            "vteIlocos Region (Region I)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "La Union"
        ],
        [
            "Pangasinan"
        ],
        [
            "Independent component city"
        ],
        [
            "Dagupan"
        ],
        [
            "Component cities"
        ],
        [
            "Alaminos"
        ],
        [
            "Batac"
        ],
        [
            "Candon"
        ],
        [
            "Laoag"
        ],
        [
            "San Carlos"
        ],
        [
            "San Fernando"
        ],
        [
            "Urdaneta"
        ],
        [
            "Vigan"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Laoag"
        ],
        [
            "Lingayen"
        ],
        [
            "San Fernando"
        ],
        [
            "Vigan"
        ],
        [
            "Municipalities"
        ],
        [
            "Adams"
        ],
        [
            "Agno"
        ],
        [
            "Agoo"
        ],
        [
            "Aguilar"
        ],
        [
            "Alcala"
        ],
        [
            "Alilem"
        ],
        [
            "Anda"
        ],
        [
            "Aringay"
        ],
        [
            "Asingan"
        ],
        [
            "Bacarra"
        ],
        [
            "Bacnotan"
        ],
        [
            "Badoc"
        ],
        [
            "Bagulin"
        ],
        [
            "Balaoan"
        ],
        [
            "Balungao"
        ],
        [
            "Banayoyo"
        ],
        [
            "Bangar"
        ],
        [
            "Bangui"
        ],
        [
            "Bani"
        ],
        [
            "Banna"
        ],
        [
            "Bantay"
        ],
        [
            "Basista"
        ],
        [
            "Bauang"
        ],
        [
            "Bautista"
        ],
        [
            "Bayambang"
        ],
        [
            "Binalonan"
        ],
        [
            "Binmaley"
        ],
        [
            "Bolinao"
        ],
        [
            "Bugallon"
        ],
        [
            "Burgos (Ilocos Norte)"
        ],
        [
            "Burgos (Ilocos Sur)"
        ],
        [
            "Burgos (La Union)"
        ],
        [
            "Burgos (Pangasinan)"
        ],
        [
            "Caba"
        ],
        [
            "Cabugao"
        ],
        [
            "Calasiao"
        ],
        [
            "Caoayan"
        ],
        [
            "Carasi"
        ],
        [
            "Cervantes"
        ],
        [
            "Currimao"
        ],
        [
            "Dasol"
        ],
        [
            "Dingras"
        ],
        [
            "Dumalneg"
        ],
        [
            "Galimuyod"
        ],
        [
            "Gregorio del Pilar"
        ],
        [
            "Infanta"
        ],
        [
            "Labrador"
        ],
        [
            "Laoac"
        ],
        [
            "Lidlidda"
        ],
        [
            "Lingayen"
        ],
        [
            "Luna"
        ],
        [
            "Mabini"
        ],
        [
            "Magsingal"
        ],
        [
            "Malasiqui"
        ],
        [
            "Manaoag"
        ],
        [
            "Mangaldan"
        ],
        [
            "Mangatarem"
        ],
        [
            "Mapandan"
        ],
        [
            "Marcos"
        ],
        [
            "Nagbukel"
        ],
        [
            "Naguilian"
        ],
        [
            "Narvacan"
        ],
        [
            "Natividad"
        ],
        [
            "Nueva Era"
        ],
        [
            "Pagudpud"
        ],
        [
            "Paoay"
        ],
        [
            "Pasuquin"
        ],
        [
            "Piddig"
        ],
        [
            "Pinili"
        ],
        [
            "Pozorrubio"
        ],
        [
            "Pugo"
        ],
        [
            "Quirino"
        ],
        [
            "Rosales"
        ],
        [
            "Rosario"
        ],
        [
            "Salcedo"
        ],
        [
            "San Emilio"
        ],
        [
            "San Esteban"
        ],
        [
            "San Fabian"
        ],
        [
            "San Gabriel"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Juan (Ilocos Sur)"
        ],
        [
            "San Juan (La Union)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Nicolas (Ilocos Norte)"
        ],
        [
            "San Nicolas (Pangasinan)"
        ],
        [
            "San Quintin"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa"
        ],
        [
            "Santa Barbara"
        ],
        [
            "Santa Catalina"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Lucia"
        ],
        [
            "Santa Maria (Ilocos Sur)"
        ],
        [
            "Santa Maria (Pangasinan)"
        ],
        [
            "Santiago"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas (La Union)"
        ],
        [
            "Santo Tomas (Pangasinan)"
        ],
        [
            "Santol"
        ],
        [
            "Sarrat"
        ],
        [
            "Sigay"
        ],
        [
            "Sinait"
        ],
        [
            "Sison"
        ],
        [
            "Solsona"
        ],
        [
            "Sual"
        ],
        [
            "Sudipen"
        ],
        [
            "Sugpon"
        ],
        [
            "Suyo"
        ],
        [
            "Tagudin"
        ],
        [
            "Tayug"
        ],
        [
            "Tubao"
        ],
        [
            "Umingan"
        ],
        [
            "Urbiztondo"
        ],
        [
            "Villasis"
        ],
        [
            "Vintar"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=La_Union&oldid=1231798103\""
        ],
        [
            "Categories: La UnionProvinces of the PhilippinesProvinces of the Ilocos RegionStates and territories established in 18501850 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherWebarchive template wayback linksUse dmy dates from March 2024Articles with short descriptionShort description is different from WikidataPages using infobox settlement with possible motto listCoordinates on WikidataPages with Tagalog IPAArticles containing Ilocano-language textArticles to be expanded from June 2016All articles to be expandedArticles using small message boxesAll articles with unsourced statementsArticles with unsourced statements from March 2024Articles with unsourced statements from January 2023All articles with vague or ambiguous timeVague or ambiguous time from June 2016Articles with unsourced statements from June 2016Articles to be expanded from October 2021Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}