{
    "name": "Laguna",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Laguna (province)"
        ],
        [
            "43 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEuskaraفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文ⵜⴰⵎⴰⵣⵉⵖⵜ ⵜⴰⵏⴰⵡⴰⵢⵜ"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 14°10′N 121°20′E﻿ / ﻿14.17°N 121.33°E﻿ / 14.17; 121.33"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Calabarzon, Philippines"
        ],
        [
            "For other uses, see Laguna."
        ],
        [
            "Province in Calabarzon, PhilippinesLagunaProvinceFrom left-right, top-bottom: Laguna Provincial Capitol • Paete Church • Pagsanjan Falls • Rizal Shrine • Southwoods Mall • Nagcarlan Underground Cemetery"
        ],
        [
            "FlagSealMotto(s): \"Laban, Laguna!\"",
            "Anthem: Himno ng Laguna (Laguna Hymn)Location in the PhilippinesOpenStreetMapCoordinates: 14°10′N 121°20′E﻿ / ﻿14.17°N 121.33°E﻿ / 14.17; 121.33CountryPhilippinesRegionCalabarzonFoundedJuly 28, 1571 • Total3,382,193 • Rank3rd out of 81 • Density1,800/km2 (4,600/sq mi)  • Rank3rd out of 81DemonymLagunenseDivisions • Independent cities0 • Component cities"
        ],
        [
            "6"
        ],
        [
            " Biñan"
        ],
        [
            " Cabuyao"
        ],
        [
            " Calamba"
        ],
        [
            " San Pablo"
        ],
        [
            " San Pedro"
        ],
        [
            " Santa Rosa"
        ],
        [
            " • Municipalities"
        ],
        [
            "24"
        ],
        [
            " Alaminos"
        ],
        [
            " Bay"
        ],
        [
            " Calauan"
        ],
        [
            " Cavinti"
        ],
        [
            " Famy"
        ],
        [
            " Kalayaan"
        ],
        [
            " Liliw"
        ],
        [
            " Los Baños"
        ],
        [
            " Luisiana"
        ],
        [
            " Lumban"
        ],
        [
            " Mabitac"
        ],
        [
            " Magdalena"
        ],
        [
            " Majayjay"
        ],
        [
            " Nagcarlan"
        ],
        [
            " Paete"
        ],
        [
            " Pagsanjan"
        ],
        [
            " Pakil"
        ],
        [
            " Pangil"
        ],
        [
            " Pila"
        ],
        [
            " Rizal"
        ],
        [
            " Santa Cruz"
        ],
        [
            " Santa Maria"
        ],
        [
            " Siniloan"
        ],
        [
            " Victoria"
        ],
        [
            " • Barangays681 • Districts"
        ],
        [
            "Legislative districts of Laguna"
        ],
        [
            "Legislative district of Biñan"
        ],
        [
            "Legislative district of Calamba"
        ],
        [
            "Legislative district of Santa Rosa"
        ],
        [
            "Demographics • Ethnic groupsTagalog (99%)Bicolano (0.5%)Ilocano (0.5%) • LanguagesTagalogEnglishIlocanoBicolanoTime zoneUTC+8 (PHT)ZIP Code4000–4033IDD : area code +63 (0)49ISO 3166 codePH-LAGHDI 0.732 (High)HDI rank8th (2015)Income classification1st classWebsitewww.laguna.gov.ph"
        ],
        [
            "Laguna"
        ],
        [
            "Laguna is notable as the birthplace of José Rizal, the country's de facto national hero.",
            "It has numerous natural and cultural attractions such as Cavinti Falls aka Pagsanjan Falls, the University of the Philippines Los Baños and the University of the Philippines Open University in Los Baños, the hot spring resorts of Calamba on the slopes of Mount Makiling, Pila historic town plaza, Taytay Falls in Majayjay, the wood carvings and papier-mâché created by the people of Paete, the annual Sampaguita Festival in San Pedro, the turumba of Pakil, the tsinelas footwear from Liliw, the Pandan Festival of Luisiana, the Seven Lakes of San Pablo, and the Nagcarlan Underground Cemetery in Nagcarlan."
        ],
        [
            "Laguna is part of the Greater Manila Area alongside Cavite, Rizal, and Bulacan."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Pre-Hispanic settlement in the area can be dated to prehistoric times, as evidenced in the names of towns such as Pila, Laguna, whose name can be traced to the straight mounds of dirt that form the boundaries of the rice paddy, or Pilapil.",
            "The written history of the province of Laguna, (Lagoon in Spanish) and that of the Southern Tagalog region, dates to 900 AD.",
            "The Laguna Copperplate Inscription is the oldest known written document found in the Philippines.",
            "It notes that its subject was released from a debt to the King of Tondo."
        ],
        [
            "A prominent figure during the time of pre-Hispanic contact is Gat Pangil, a powerful native ruler in the area.",
            "The towns of Bay, Pangil and Pakil were reputed to have once been a part of his domain, although accounts vary about his identity."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The province of Laguna, which was formerly called La Laguna and La Provincia de la Laguna de Bay, was named after Laguna de Bay, the body of water that forms its northern boundary.",
            "Laguna de Bay, in turn, was named after the town of Bay, the first provincial capital.",
            "Captain Juan de Salcedo with a band of one hundred Spanish-Mexican soldiers conquered the province and its surrounding regions for Spain in 1571.",
            "The province of La Laguna comprised the modern province of Laguna, as well as parts of what are now known as Rizal and Quezon provinces."
        ],
        [
            "In 1577, Spanish Franciscan missionaries arrived in Manila, and in 1578 they started evangelizing Laguna, Morong (now Rizal), Tayabas (now Quezon) and the Bicol Peninsula as part of the colonizing effort.",
            "Juan de Plasencia and Diego de Oropesa were the earliest Franciscans sent to these places.",
            "From 1580, the towns of Bay, Caliraya, Majayjay, Nagcarlan, Liliw, Pila, Santa Cruz, Lumban, Pangil and Siniloan were founded.",
            "During the time of Governor-General Gómez Pérez Dasmariñas, the province of La Laguna was divided into the following encomiendas:"
        ],
        [
            "Mirabago – Currently the areas surrounding, Liliw, and Nagcarlan."
        ],
        [
            "Tabuco – Currently the areas surrounding San Pedro, Biñan, Santa Rosa, Cabuyao, and Calamba."
        ],
        [
            "Taitay – Currently Taytay, Rizal."
        ],
        [
            "Bay – The area surrounding Bay, Laguna, and Los Baños, Laguna."
        ],
        [
            "Pila – The area that is now Pila, Victoria, Pililla, and Jalajala, Rizal"
        ],
        [
            "Mahaihai – Currently the area around Majayjay, Magdalena, and Luisiana"
        ],
        [
            "Lumbang – The largest encomienda, containing what is now known as Lumban, Santa Cruz, Paete, Pakil, Cavinti, and Pagsanjan."
        ],
        [
            "Tayaval – Tayabas, now known as Quezon province."
        ],
        [
            "Panguil – Now Pangil."
        ],
        [
            "Sinaloa – The area surrounding Siniloan, Famy and Mabitac."
        ],
        [
            "Morong – Currently the areas surrounding Morong, including the town of Santa Maria, formerly known as Caboan."
        ],
        [
            "Nayun – Nayum, currently Tiaong, Quezon."
        ],
        [
            "By 1591, there were approximately 48,400 people living in the province."
        ],
        [
            "Laguna was the site of multiple engagements during the Sangley Rebellion, made up of Chinese-Filipino mestizos.",
            "Captain Don Luys de Velasco, aided by Spanish and Filipino forces, was successful in pursuing the rebels.",
            "Eventually the Chinese were able to kill Luys de Velasco and ten of his men, before securing themselves in San Pablo while waiting for reinforcement from the mainland.",
            "On October 20, 1603, Governor-General Pedro Bravo de Acuña then sent Captain Cristoval de Axqueta Menchaca to pursue and crush the rebellion and was successful after twenty days of fighting."
        ],
        [
            "Around this time the hot springs of Los Baños and San Pablo were known to the Spanish, and a hospital was built in the area.",
            "By 1622, the hospital was notable enough to be mentioned by the Archbishop of Manila at the time, Miguel García Serrano in his letter to King Philip IV."
        ],
        [
            "In 1639, a second rebellion involving the Chinese occurred, and the rebels fortified themselves in the highlands of Cavinti and Lumban before surrendering in Pagsanjan a year later."
        ],
        [
            "Facade of the Cathedral Parish of Saint Paul the Hermit, San Pablo, Laguna"
        ],
        [
            "In 1670, a delimitation of borders were made between Lucban, Majayjay and Cavite.",
            "The most populous town at that time, Bay, was capital of the province until 1688, when the seat of the provincial government was moved to Pagsanján.",
            "Pagsanján would be the provincial seat until 1858 when it was moved once again to Santa Cruz.",
            "In 1754, the province of Laguna and Tayabas were divided, with the Malinao River separating the towns of Majayjay and Lucban."
        ],
        [
            "In 1678, Fray Hernando Cabrera founded San Pablo de los Montes (now San Pablo City) and built a wooden church and convent considered as the best and finest in the province."
        ],
        [
            "Fighting extended to Laguna during the British occupation of Manila between the years of 1762–64.",
            "A detachment of British troops under Captain Thomas Backhouse entered the province in search of the silver cargo of the galleon Filipina while Francisco de San Juan led a band of volunteers that fought them in several engagements in and around the then provincial capital of Pagsanjan.",
            "Backhouse plundered the town and burned its newly reconstructed church but San Juan succeeded in escaping with the precious hoard to Pampanga where the treasure greatly bolstered the defense effort of Governor-General Simón de Anda y Salazar.",
            "For his actions, San Juan was made a brigade commander and alcalde mayor of Tayabas (now Quezon) province."
        ],
        [
            "In 1774, authorities from Bulacan, Tondo, Laguna Bay, and other areas surrounding Manila reported with consternation that discharged soldiers and deserters (from Mexico, Spain and Peru) were providing Indios military training for the weapons that had been disseminated all over the territory during the British war."
        ],
        [
            "By the end of the 1700s, Laguna was a major province of 14,392 native families and 336 Spanish Filipino families."
        ],
        [
            "A major event in Laguna occurred in 1840, when religious intolerance led the people of Majayjay, Nagcarlan, Bay, and Biñan to join the revolt of Hermano Pule (Apolinario de la Cruz) of Lucban, Tayabas.",
            "This revolt was eventually crushed by Governor-General Marcelino de Oraá Lecumberri."
        ],
        [
            "As part of political restructuring during the 19th century, the municipalities of Morong, Pililla, Tanay, Baras, Binangonan, Jalajala, Angono and Cardona were separated from Laguna and re-organized to the province Politico-Militar Distrito de Morong.",
            "In 1858, the provincial capital was once again moved from Pagsanjan to Santa Cruz, where it stands until today."
        ],
        [
            "In 1861, José Rizal was born in Calamba to Francisco Mercado and Teodora Alonso.",
            "Rizal would become one of the leading members of the Propaganda Movement, who advocated political reforms for the colony.",
            "Rizal would go on to write two novels, Noli Me Tángere and El filibusterismo, which in part fueled additional anti-colonial sentiment, contributing to the eventual Philippine Revolution.",
            "In 1896, thousands of inhabitants, especially of Bay, Los Baños, Nagcarlan, Magdalena, Santa Cruz, and Pagsanjan had joined the revolutionary Katipunan.",
            "Rizal was executed on December 30, 1896, on charges of rebellion.",
            "Today, Rizal is recognized as a national hero of the Philippines."
        ],
        [
            "Historical marker of the Battle of Sambat, Pagsanjan, Laguna"
        ],
        [
            "Laguna was one of the eight provinces to rise in revolt against the Spanish misrule led by Generals Paciano Rizal in Calamba, Severino Taiño in Pagsanjan, Agueda Kahabagan in Calauan, and Miguel Malvar in Batangas."
        ],
        [
            "The defeat in Sambat meant the end of large-scale organized revolt in Laguna, the Malungingnging chapter of the Katipunan failing to replicate the relative success of the revolution in Cavite.",
            "The revolutionaries resorted to hit-and-run and guerrilla tactics against the Spanish, lasting until the Pact of Biak-na-Bato on December 14 to 15, 1897.",
            "It was only after the execution of José Rizal that the revolution flared up again, culminating in the Battle of Calamba in May 1898, and the surrender of the last Spanish garrison in Laguna in Santa Cruz, on August 31 of the same year."
        ],
        [
            "Laguna actively supported the First Philippine Republic proclaimed at Malolos on January 23, 1899.",
            "Its two delegates to the Malolos Congress were Don Higino Benítez and Don Graciano Cordero, both natives of Pagsanján."
        ],
        [
            "Philippine–American War"
        ],
        [
            "Upon the outbreak of the Philippine–American War, Generals Juan Cailles and Paciano Rizal led the defense of Laguna during the war's early stages.",
            "The Battle of Mabitac was fought in defense of the town of Mabitac and was won by Filipino forces.",
            "However, forces led by Henry W. Lawton fought and won in Santa Cruz, Pagsanjan, and Paete, effectively securing the province for American forces.",
            "Resistance still occurred during this time.",
            "One of the province's folk hero during the continuing engagements was Teodoro Asedillo, who was considered a bandit by American forces."
        ],
        [
            "American invasion era"
        ],
        [
            "By the end of the war, the entire country was occupied by American forces and was taken as a colony.",
            "The Taft Commission was established to govern the Philippines during the interim period, which appointed Juan Cailles as the provincial governor of Laguna.",
            "Act No.",
            "83, or the Provincial Government Act, established a civilian government under American occupation.",
            "During this time, roads were built, schools were established, and in 1917, the Manila Railroad Company extended its line to Laguna as far as Pagsanjan."
        ],
        [
            "In 1903, the town of Muntinlupa became part of La Laguna and was annexed to the town of Biñan,"
        ],
        [
            "Japanese occupation era"
        ],
        [
            "During the Japanese occupation of the Philippines (1942–1945), Laguna was a center of Filipino resistance despite the presence of Makapili collaborators."
        ],
        [
            "Marking's Guerrillas raided the Cine Lumban in Laguna in June 1942 in an attempt to free the 115 American POWs.",
            "Only one American was rescued, Corporal George Lightman of the 3rd Pursuit Squadron, because the ranking American captain ordered his men to stay where they were.",
            "The Japanese executed 10 American prisoners in retribution."
        ],
        [
            "The establishment of the military general headquarters and military camp bases of the Philippine Commonwealth Army and the Philippine Constabulary is a military unit organization was founded on January 3, 1942, to June 30, 1946, in the province of Laguna, and aided of the local military regular units of the Philippine Commonwealth Army 4th and 42nd Infantry Division and the Philippine Constabulary 4th Constabulary Regiment.",
            "Started the engagements of the Anti-Japanese Military Operations in Southern Luzon, Mindoro and Palawan from 1942 to 1945 against the Japanese Imperial forces."
        ],
        [
            "Beginning in 1945, attacks by the Filipino soldiers of the 4th, 42nd, 43rd, 45th, 46th and 47th Infantry Division of the Philippine Commonwealth Army, 4th Constabulary Regiment of the Philippine Constabulary and the recognized guerrillas against Japanese forces in Laguna increased in anticipation of the Liberation of the Philippines by joint Filipino & American forces."
        ],
        [
            "Philippine independence"
        ],
        [
            "The International Rice Research Institute was established in 1960, during the presidency of Carlos P. Garcia, and a site in Los Baños was selected to be its headquarters.",
            "By 1962 during the presidency of Diosdado Macapagal, IRRI had begun research to develop the new high yield \"Miracle Rice\" (IR8) variety."
        ],
        [
            "The social unrest which arose when Ferdinand Marcos' debt-driven campaign spending led to the 1969 Philippine balance of payments crisis"
        ],
        [
            "Laguna has been the victim of perennial flooding along the south and eastern coasts of Laguna de Bay due to the 1977 cancellation of the Parañaque spillway project.",
            "The spillway had been the second part of a plan to reduce flooding on the lakeshore towns of Metro Manila in the 1970s, but the various economic crises of the 1970s led to a lack of budget, which meant that only the Manggahan Floodway in Rizal province was built."
        ],
        [
            "Geography"
        ],
        [
            "Laguna covers a total area of 1,917.85 km2 (740.49 sq mi) occupying the north‑central section of the Calabarzon region in Luzon.",
            "The province is situated southeast of Metro Manila, south of Rizal province, west of Quezon, north of Batangas and east of Cavite.",
            "Laguna is the third largest province in the Calabarzon region and the 63rd largest in the entire country.",
            "The municipalities of Cavinti and the city of San Pablo have the largest land areas with 203.58 km2 (78.60 sq mi) and 197.56 km2 (76.28 sq mi), respectively.",
            "The municipality of Victoria has the smallest land area with 57.46 km2 (22.19 sq mi)."
        ],
        [
            "Laguna lies on the southern shores of Laguna de Bay, the largest lake in the country.",
            "The land near Laguna de Bay can be considered to be narrow and flat, while become more rugged going further inland towards the mountainous areas of Sierra Madre, Mount Makiling, and Mount Banahaw."
        ],
        [
            "Aerial view of Mount Banahaw"
        ],
        [
            "Laguna is home to 24 mountains, most of which are inactive volcanoes.",
            "The highest peak in Laguna is Mt.",
            "Banahaw, with an elevation of 2,170 m (7,120 ft).",
            "Banahaw, unlike most other volcanoes in Laguna, is an active complex stratovolcano, which last erupted in 1843.",
            "Banahaw is located in the boundary of Laguna and Quezon and is home to multiple hot springs.",
            "Laguna is also home to the Laguna Volcanic Field, which can be found near San Pablo.",
            "The Laguna Volcanic Field is composed of over 200 dormant and monogenetic maars, crater lakes, scoria cones and stratovolcanoes, the tallest of which is Mount Makiling at 1,090 m (3,580 ft) in elevation."
        ],
        [
            "San Pablo itself is known for its seven crater lakes, the largest of which is Lake Sampaloc.",
            "Apart from Laguna de Bay and the Seven Lakes of San Pablo, there are also two reservoir lakes that can be found in Laguna, the Lake Caliraya and Lumot Lake.",
            "These two man-made lakes were formed by the creation of the Caliraya Dam and the Lumot Dam."
        ],
        [
            "View of Pagsanjan Falls from inside the Devil's Cave"
        ],
        [
            "Due to its proximity to Laguna de Bay, Laguna is home to a large number of its tributaries.",
            "One of the most famous rivers in Laguna is the Bumbungan River, also known as the Pagsanjan River, named after the town of Pagsanjan and its falls.",
            "The Pagsanjan Falls lie at the end of the river.",
            "The Pagsanjan Falls are a three-drop waterfall with a longest drop of 120 m (390 ft)."
        ],
        [
            "Laguna has 60,624 ha (606.24 km2) of alienable and disposable agricultural land, mostly found near the low-lying areas.",
            "Around 41,253 ha (412.53 km2), or 23.44% of Laguna's total land area is forest land, situated near Mount Makiling and further south towards Quezon."
        ],
        [
            "Climate"
        ],
        [
            "The province is relatively dry from November to April and wet during the rest of the year for a small portion near the southern boundary.",
            "The other parts, west of Santa Cruz municipality, experience a dry season from November to April and rainy season during the rest of the year.",
            "The eastern and southernmost portions do not have distinct season, with rainfall more evenly distributed throughout the year."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Laguna comprises 24 municipalities and 6 cities.",
            "The provincial capital of Laguna is Santa Cruz.",
            "As of the 2020 census, there are 3,382,193 people in the province."
        ],
        [
            "The province is divided into four parts.",
            "The northwestern half consists of the component cities of San Pedro, Biñan, Santa Rosa, Cabuyao, and Calamba.",
            "The northeastern half is made up of the municipalities of Santa Maria, Mabitac, Famy, Siniloan, Pangil, Pakil, Paete, Kalayaan, and Lumban.",
            "The western half includes the municipalities of Los Baños, Bay, Calauan, Alaminos, and the component city of San Pablo.",
            "The eastern half is composed of the municipalities of Victoria, Pila, Santa Cruz (the capital), Rizal, Nagcarlan, Liliw, Magdalena, Majayjay, Pagsanjan, Luisiana, and Cavinti.",
            "Much of the population is concentrated in the northwestern and western halves of the province."
        ],
        [
            " †  Capital municipality ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Alaminos"
        ],
        [
            "6th"
        ],
        [
            "1.5%"
        ],
        [
            "51,619"
        ],
        [
            "47,859"
        ],
        [
            "1.45%"
        ],
        [
            "57.46"
        ],
        [
            "22.19"
        ],
        [
            "900"
        ],
        [
            "2,300"
        ],
        [
            "15"
        ],
        [
            "14°03′41″N 121°14′52″E﻿ / ﻿14.0613°N 121.2478°E﻿ / 14.0613; 121.2478﻿ (Alaminos)"
        ],
        [
            "Bay"
        ],
        [
            "6th"
        ],
        [
            "2.0%"
        ],
        [
            "67,182"
        ],
        [
            "62,143"
        ],
        [
            "1.50%"
        ],
        [
            "42.66"
        ],
        [
            "16.47"
        ],
        [
            "1,600"
        ],
        [
            "4,100"
        ],
        [
            "15"
        ],
        [
            "14°10′48″N 121°16′48″E﻿ / ﻿14.1800°N 121.2799°E﻿ / 14.1800; 121.2799﻿ (Bay)"
        ],
        [
            "Biñan"
        ],
        [
            "∗"
        ],
        [
            "2nd"
        ],
        [
            "12.0%"
        ],
        [
            "407,437"
        ],
        [
            "333,028"
        ],
        [
            "3.91%"
        ],
        [
            "40.27"
        ],
        [
            "15.55"
        ],
        [
            "10,000"
        ],
        [
            "26,000"
        ],
        [
            "24"
        ],
        [
            "14°20′14″N 121°04′58″E﻿ / ﻿14.3373°N 121.0827°E﻿ / 14.3373; 121.0827﻿ (Biñan)"
        ],
        [
            "Cabuyao"
        ],
        [
            "∗"
        ],
        [
            "4th"
        ],
        [
            "10.5%"
        ],
        [
            "355,330"
        ],
        [
            "308,745"
        ],
        [
            "2.71%"
        ],
        [
            "43.30"
        ],
        [
            "16.72"
        ],
        [
            "8,200"
        ],
        [
            "21,000"
        ],
        [
            "18"
        ],
        [
            "14°16′37″N 121°07′24″E﻿ / ﻿14.2770°N 121.1232°E﻿ / 14.2770; 121.1232﻿ (Cabuyao)"
        ],
        [
            "Calamba"
        ],
        [
            "∗"
        ],
        [
            "5th"
        ],
        [
            "16.0%"
        ],
        [
            "539,671"
        ],
        [
            "454,486"
        ],
        [
            "3.33%"
        ],
        [
            "149.50"
        ],
        [
            "57.72"
        ],
        [
            "3,600"
        ],
        [
            "9,300"
        ],
        [
            "54"
        ],
        [
            "14°12′38″N 121°09′50″E﻿ / ﻿14.2106°N 121.1638°E﻿ / 14.2106; 121.1638﻿ (Calamba)"
        ],
        [
            "Calauan"
        ],
        [
            "6th"
        ],
        [
            "2.6%"
        ],
        [
            "87,693"
        ],
        [
            "80,453"
        ],
        [
            "1.65%"
        ],
        [
            "77.85"
        ],
        [
            "30.06"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "17"
        ],
        [
            "14°08′55″N 121°18′57″E﻿ / ﻿14.1486°N 121.3158°E﻿ / 14.1486; 121.3158﻿ (Calauan)"
        ],
        [
            "Cavinti"
        ],
        [
            "9th"
        ],
        [
            "0.7%"
        ],
        [
            "23,980"
        ],
        [
            "21,702"
        ],
        [
            "1.92%"
        ],
        [
            "203.58"
        ],
        [
            "78.60"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "19"
        ],
        [
            "14°14′43″N 121°30′28″E﻿ / ﻿14.2454°N 121.5078°E﻿ / 14.2454; 121.5078﻿ (Cavinti)"
        ],
        [
            "Famy"
        ],
        [
            "9th"
        ],
        [
            "0.5%"
        ],
        [
            "16,791"
        ],
        [
            "16,587"
        ],
        [
            "0.23%"
        ],
        [
            "53.06"
        ],
        [
            "20.49"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "20"
        ],
        [
            "14°26′24″N 121°26′50″E﻿ / ﻿14.4399°N 121.4471°E﻿ / 14.4399; 121.4471﻿ (Famy)"
        ],
        [
            "Kalayaan"
        ],
        [
            "9th"
        ],
        [
            "0.7%"
        ],
        [
            "24,755"
        ],
        [
            "23,269"
        ],
        [
            "1.19%"
        ],
        [
            "46.60"
        ],
        [
            "17.99"
        ],
        [
            "530"
        ],
        [
            "1,400"
        ],
        [
            "3"
        ],
        [
            "14°19′34″N 121°28′41″E﻿ / ﻿14.3261°N 121.4781°E﻿ / 14.3261; 121.4781﻿ (Kalayaan)"
        ],
        [
            "Liliw"
        ],
        [
            "8th"
        ],
        [
            "1.2%"
        ],
        [
            "39,491"
        ],
        [
            "36,582"
        ],
        [
            "1.47%"
        ],
        [
            "39.10"
        ],
        [
            "15.10"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "33"
        ],
        [
            "14°07′51″N 121°26′11″E﻿ / ﻿14.1307°N 121.4365°E﻿ / 14.1307; 121.4365﻿ (Liliw)"
        ],
        [
            "Los Baños"
        ],
        [
            "6th"
        ],
        [
            "3.4%"
        ],
        [
            "115,353"
        ],
        [
            "112,008"
        ],
        [
            "0.56%"
        ],
        [
            "54.22"
        ],
        [
            "20.93"
        ],
        [
            "2,100"
        ],
        [
            "5,400"
        ],
        [
            "14"
        ],
        [
            "14°10′39″N 121°13′17″E﻿ / ﻿14.1775°N 121.2214°E﻿ / 14.1775; 121.2214﻿ (Los Baños)"
        ],
        [
            "Luisiana"
        ],
        [
            "9th"
        ],
        [
            "0.6%"
        ],
        [
            "20,859"
        ],
        [
            "19,720"
        ],
        [
            "1.07%"
        ],
        [
            "73.31"
        ],
        [
            "28.31"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "23"
        ],
        [
            "14°11′06″N 121°30′34″E﻿ / ﻿14.1850°N 121.5094°E﻿ / 14.1850; 121.5094﻿ (Luisiana)"
        ],
        [
            "Lumban"
        ],
        [
            "9th"
        ],
        [
            "1.0%"
        ],
        [
            "32,330"
        ],
        [
            "30,652"
        ],
        [
            "1.02%"
        ],
        [
            "40.53"
        ],
        [
            "15.65"
        ],
        [
            "800"
        ],
        [
            "2,100"
        ],
        [
            "16"
        ],
        [
            "14°17′51″N 121°27′32″E﻿ / ﻿14.2976°N 121.4589°E﻿ / 14.2976; 121.4589﻿ (Lumban)"
        ],
        [
            "Mabitac"
        ],
        [
            "9th"
        ],
        [
            "0.6%"
        ],
        [
            "21,275"
        ],
        [
            "20,530"
        ],
        [
            "0.68%"
        ],
        [
            "80.76"
        ],
        [
            "31.18"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "15"
        ],
        [
            "14°25′38″N 121°25′35″E﻿ / ﻿14.4272°N 121.4265°E﻿ / 14.4272; 121.4265﻿ (Mabitac)"
        ],
        [
            "Magdalena"
        ],
        [
            "9th"
        ],
        [
            "0.8%"
        ],
        [
            "27,816"
        ],
        [
            "25,266"
        ],
        [
            "1.85%"
        ],
        [
            "35.00"
        ],
        [
            "13.51"
        ],
        [
            "790"
        ],
        [
            "2,000"
        ],
        [
            "24"
        ],
        [
            "14°11′59″N 121°25′45″E﻿ / ﻿14.1996°N 121.4292°E﻿ / 14.1996; 121.4292﻿ (Magdalena)"
        ],
        [
            "Majayjay"
        ],
        [
            "9th"
        ],
        [
            "0.8%"
        ],
        [
            "27,893"
        ],
        [
            "27,792"
        ],
        [
            "0.07%"
        ],
        [
            "69.58"
        ],
        [
            "26.86"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "40"
        ],
        [
            "14°08′44″N 121°28′21″E﻿ / ﻿14.1455°N 121.4725°E﻿ / 14.1455; 121.4725﻿ (Majayjay)"
        ],
        [
            "Nagcarlan"
        ],
        [
            "8th"
        ],
        [
            "1.9%"
        ],
        [
            "64,866"
        ],
        [
            "63,057"
        ],
        [
            "0.54%"
        ],
        [
            "78.10"
        ],
        [
            "30.15"
        ],
        [
            "830"
        ],
        [
            "2,100"
        ],
        [
            "52"
        ],
        [
            "14°08′11″N 121°24′46″E﻿ / ﻿14.1365°N 121.4127°E﻿ / 14.1365; 121.4127﻿ (Nagcarlan)"
        ],
        [
            "Paete"
        ],
        [
            "9th"
        ],
        [
            "0.7%"
        ],
        [
            "24,945"
        ],
        [
            "25,096"
        ],
        [
            "−0.11%"
        ],
        [
            "55.02"
        ],
        [
            "21.24"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "9"
        ],
        [
            "14°21′51″N 121°28′53″E﻿ / ﻿14.3641°N 121.4815°E﻿ / 14.3641; 121.4815﻿ (Paete)"
        ],
        [
            "Pagsanjan"
        ],
        [
            "9th"
        ],
        [
            "1.3%"
        ],
        [
            "44,327"
        ],
        [
            "42,164"
        ],
        [
            "0.96%"
        ],
        [
            "27.40"
        ],
        [
            "10.58"
        ],
        [
            "1,600"
        ],
        [
            "4,100"
        ],
        [
            "16"
        ],
        [
            "14°16′22″N 121°27′14″E﻿ / ﻿14.2727°N 121.4540°E﻿ / 14.2727; 121.4540﻿ (Pagsanjan)"
        ],
        [
            "Pakil"
        ],
        [
            "9th"
        ],
        [
            "0.7%"
        ],
        [
            "23,495"
        ],
        [
            "20,659"
        ],
        [
            "2.48%"
        ],
        [
            "46.50"
        ],
        [
            "17.95"
        ],
        [
            "510"
        ],
        [
            "1,300"
        ],
        [
            "13"
        ],
        [
            "14°22′51″N 121°28′43″E﻿ / ﻿14.3807°N 121.4786°E﻿ / 14.3807; 121.4786﻿ (Pakil)"
        ],
        [
            "Pangil"
        ],
        [
            "9th"
        ],
        [
            "0.7%"
        ],
        [
            "25,026"
        ],
        [
            "24,274"
        ],
        [
            "0.58%"
        ],
        [
            "45.03"
        ],
        [
            "17.39"
        ],
        [
            "560"
        ],
        [
            "1,500"
        ],
        [
            "8"
        ],
        [
            "14°24′10″N 121°28′04″E﻿ / ﻿14.4029°N 121.4677°E﻿ / 14.4029; 121.4677﻿ (Pangil)"
        ],
        [
            "Pila"
        ],
        [
            "8th"
        ],
        [
            "1.6%"
        ],
        [
            "54,613"
        ],
        [
            "50,289"
        ],
        [
            "1.58%"
        ],
        [
            "31.20"
        ],
        [
            "12.05"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "17"
        ],
        [
            "14°14′15″N 121°21′42″E﻿ / ﻿14.2374°N 121.3618°E﻿ / 14.2374; 121.3618﻿ (Pila)"
        ],
        [
            "Rizal"
        ],
        [
            "8th"
        ],
        [
            "0.5%"
        ],
        [
            "18,332"
        ],
        [
            "17,253"
        ],
        [
            "1.16%"
        ],
        [
            "27.90"
        ],
        [
            "10.77"
        ],
        [
            "660"
        ],
        [
            "1,700"
        ],
        [
            "11"
        ],
        [
            "14°06′50″N 121°23′36″E﻿ / ﻿14.1140°N 121.3933°E﻿ / 14.1140; 121.3933﻿ (Rizal)"
        ],
        [
            "San Pablo City"
        ],
        [
            "∗"
        ],
        [
            "7th"
        ],
        [
            "8.4%"
        ],
        [
            "285,348"
        ],
        [
            "266,068"
        ],
        [
            "1.34%"
        ],
        [
            "197.56"
        ],
        [
            "76.28"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "80"
        ],
        [
            "14°04′12″N 121°19′32″E﻿ / ﻿14.0700°N 121.3255°E﻿ / 14.0700; 121.3255﻿ (San Pablo)"
        ],
        [
            "San Pedro"
        ],
        [
            "∗"
        ],
        [
            "1st"
        ],
        [
            "9.6%"
        ],
        [
            "326,001"
        ],
        [
            "325,809"
        ],
        [
            "0.01%"
        ],
        [
            "24.05"
        ],
        [
            "9.29"
        ],
        [
            "14,000"
        ],
        [
            "36,000"
        ],
        [
            "27"
        ],
        [
            "14°21′43″N 121°03′27″E﻿ / ﻿14.3620°N 121.0574°E﻿ / 14.3620; 121.0574﻿ (San Pedro)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "†"
        ],
        [
            "8th"
        ],
        [
            "3.7%"
        ],
        [
            "123,574"
        ],
        [
            "117,605"
        ],
        [
            "0.95%"
        ],
        [
            "38.59"
        ],
        [
            "14.90"
        ],
        [
            "3,200"
        ],
        [
            "8,300"
        ],
        [
            "26"
        ],
        [
            "14°17′07″N 121°24′48″E﻿ / ﻿14.2854°N 121.4134°E﻿ / 14.2854; 121.4134﻿ (Santa Cruz)"
        ],
        [
            "Santa Maria"
        ],
        [
            "9th"
        ],
        [
            "1.0%"
        ],
        [
            "34,511"
        ],
        [
            "30,830"
        ],
        [
            "2.17%"
        ],
        [
            "108.40"
        ],
        [
            "41.85"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "25"
        ],
        [
            "14°28′20″N 121°25′24″E﻿ / ﻿14.4721°N 121.4234°E﻿ / 14.4721; 121.4234﻿ (Santa Maria)"
        ],
        [
            "Santa Rosa"
        ],
        [
            "∗"
        ],
        [
            "3rd"
        ],
        [
            "12.3%"
        ],
        [
            "414,812"
        ],
        [
            "353,767"
        ],
        [
            "3.08%"
        ],
        [
            "54.84"
        ],
        [
            "21.17"
        ],
        [
            "7,600"
        ],
        [
            "20,000"
        ],
        [
            "18"
        ],
        [
            "14°18′57″N 121°06′44″E﻿ / ﻿14.3157°N 121.1122°E﻿ / 14.3157; 121.1122﻿ (Santa Rosa)"
        ],
        [
            "Siniloan"
        ],
        [
            "9th"
        ],
        [
            "1.2%"
        ],
        [
            "39,460"
        ],
        [
            "38,067"
        ],
        [
            "0.69%"
        ],
        [
            "64.51"
        ],
        [
            "24.91"
        ],
        [
            "610"
        ],
        [
            "1,600"
        ],
        [
            "20"
        ],
        [
            "14°25′17″N 121°26′40″E﻿ / ﻿14.4215°N 121.4444°E﻿ / 14.4215; 121.4444﻿ (Siniloan)"
        ],
        [
            "Victoria"
        ],
        [
            "8th"
        ],
        [
            "1.3%"
        ],
        [
            "43,408"
        ],
        [
            "39,321"
        ],
        [
            "1.90%"
        ],
        [
            "22.35"
        ],
        [
            "8.63"
        ],
        [
            "1,900"
        ],
        [
            "4,900"
        ],
        [
            "9"
        ],
        [
            "14°13′54″N 121°19′40″E﻿ / ﻿14.2316°N 121.3278°E﻿ / 14.2316; 121.3278﻿ (Victoria)"
        ],
        [
            "Total"
        ],
        [
            "3,382,193"
        ],
        [
            "3,035,081"
        ],
        [
            "2.08%"
        ],
        [
            "1,928.23"
        ],
        [
            "744.49"
        ],
        [
            "1,800"
        ],
        [
            "4,700"
        ],
        [
            "681"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the town center, and are sortable by latitude."
        ],
        [
            "1 Biñan was constituted into its own congressional district for the purposes of electing a member of the Philippine House of Representatives.",
            "However, for the purposes of electing members of the Sangguniang Panlalawigan, the city remains part of the province's 1st Sangguniang Panlalawigan District."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of LagunaYearPop.±% p.a.1903 148,606—    1918 195,546+1.85%1939 279,505+1.72%1948 321,247+1.56%1960 472,064+3.26%YearPop.±% p.a.1970 699,736+4.01%1975 803,750+2.82%1980 973,104+3.90%1990 1,370,232+3.48%1995 1,631,082+3.32%YearPop.±% p.a.2000 1,965,872+4.08%2007 2,473,530+3.22%2010 2,669,847+2.82%2015 3,035,081+2.47%2020 3,382,193+2.15%Sources: Philippine Statistics Authority"
        ],
        [
            "The population of Laguna in the 2020 census was 3,382,193 people,"
        ],
        [
            "Being in the middle of the Southern Tagalog Region, almost all people in Laguna speak Tagalog, with 99.2% of the population being fluent in it.",
            "It is spoken with a dialect greatly influenced from those spoken in the neighboring Cavite, Batangas, Rizal and Bulacan, and has several variants in each municipality.",
            "There is a minority of people fluent in Bicolano, Hiligaynon, Karay-a, Ilocano, Cuyunon, Pangasinan and Waray.",
            "A significant portion of the workforce in Laguna can read and speak English and Filipino."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Catholicism"
        ],
        [
            "Laguna was historically one of the first provinces in the Philippines to have been visited by Catholic missionaries.",
            "Today, the province, like the rest of the country, is predominantly Christian, with most being a part of the Roman Catholic Church.",
            "The Diocese of San Pablo is the only Roman Catholic diocese in Laguna."
        ],
        [
            "Others"
        ],
        [
            "Other Christian denominations present in Laguna are the Members Church of God International (MCGI), Philippine Independent Church, the Iglesia ni Cristo, Baptists, and other Mainline Protestants.",
            "Most non-Christians in Laguna practice Islam, Anitism, animism, or atheism."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Laguna"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "2006  5.53"
        ],
        [
            "2009  8.37"
        ],
        [
            "2012  6.39"
        ],
        [
            "2015  5.12"
        ],
        [
            "2018  3.88"
        ],
        [
            "2021  6.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Economic History"
        ],
        [
            "No other province besides Cavite had experience the rapid economic growth of Laguna between the late 1960s to the mid-1980s."
        ],
        [
            "Present-day Laguna shows a thriving highly developed mixed economy.",
            "With a population of 3,382,193 (2020 census),"
        ],
        [
            "Laguna is labeled as the Detroit of the Philippines because of the presence of major vehicle manufacturers in the city of Santa Rosa.",
            "It is also considered as the Silicon Valley of the Philippines because of the vast number of electronic and semi-conductor companies operating in the province.",
            "Laguna is also the Resort Capital of the Philippines for it houses more than 700 hot spring resorts in the areas of Calamba and Los Baños."
        ],
        [
            "Natural resources"
        ],
        [
            "Caliraya-Lumot River Watershed Forest Reserve"
        ],
        [
            "The main natural resources of Laguna are in its agriculture and fisheries, owing to its position near Laguna de Bay and the surrounding lowlands."
        ],
        [
            "There are about forty rivers in Laguna with a total area of almost 0.5 km2 (0.19 sq mi)."
        ],
        [
            "Laguna has an estimated 300,000,000 US gallons (1,100,000 m3) of underground water.",
            "At least seven principal water basins in the province with a total of 5,773 square kilometers (2,229 sq mi) drainage area and 1,316 square kilometers (508 sq mi) level area provide an estimated 9.238 square kilometers (3.567 sq mi) total run-off annually."
        ],
        [
            "Laguna has a relatively small mining industry compared to the other provinces in the region, with only 11 non-metallic mines registered in the region, and only 8 of which are operating.",
            "These mines are found in Santa Cruz, Magdalena, Siniloan, Lumban, and San Pablo.",
            "A total of 39.7823 hectares (0.397823 km2) are used for mining purposes."
        ],
        [
            "Agricultural activities"
        ],
        [
            "Rice field in Mabitac"
        ],
        [
            "Laguna has 60,624 hectares (149,810 acres) of alienable and disposable agricultural land.",
            "About 41,253 hectares (101,940 acres) or 23.44% of Laguna's total land area is forest land.",
            "Calamba was once the site of a sugar cane mill, although the decline of the sugar industry during the 1970s and 1980s resulted in its eventual shutdown."
        ],
        [
            "Rice farming is an important part of Laguna's agriculture, with approximately 30,619 ha (306.19 km2) of land used for cultivating 130,904 metric tons (130,904,000 kg) of rice."
        ],
        [
            "Laguna de Bay, with a surface area of 900 kilometers (560 mi), is the province's main fishing ground producing 410,000 metric tons (410,000,000 kg) of fish.",
            "Carp and tilapia fingerlings are also being grown in inland ponds and freshwater fish pens.",
            "There are a total of 457 operators utilizing an area of 1,839 ha (18.39 km2) for fish pens and fish cages.",
            "Aside from Laguna de Bay, approximately 12% of the area in the Seven Lakes of San Pablo is being used for aquaculture."
        ],
        [
            "Industry and commerce"
        ],
        [
            "Calamba Premiere International Park, one of the industrial areas in Laguna"
        ],
        [
            "Laguna is home to twenty-one economic zones as registered under the Philippine Economic Zone Authority.",
            "Most of these economic zones are located in Santa Rosa, Biñan, and Calamba.",
            "The largest economic zone in Laguna is the Laguna Technopark, located in Santa Rosa and Biñan, with an area of 337.215 hectares (3.37215 km2).",
            "Laguna is home to a large automotive industry, with Toyota Motor Philippines, Nissan Motor Philippines, Honda Philippines Incorporated, and Mitsubishi Motors Philippines all having plants in Santa Rosa."
        ],
        [
            "Laguna has a growing business process outsourcing industry, with companies such as IBM and Convergys establishing offices in Santa Rosa.",
            "PEZA lists 4 IT parks and 1 IT Center in Laguna.",
            "Business districts and shopping malls continues to arise bringing opportunities and attractive places to dine and relax."
        ],
        [
            "Infrastructure"
        ],
        [
            "Road network"
        ],
        [
            "The South Luzon Expressway connects Laguna with Metro Manila and Batangas"
        ],
        [
            "Laguna has a total of 348 kilometers (216 mi) of national roads, all paved.",
            "Daang Maharlika/Manila South Road (Route 1, AH26), Calamba–Pagsanjan Road (Route 66) and Manila East Road (Route 601, Route 602), Pagsanjan–Lucban Road (Route 603) and Bay–Calauan–San Pablo Road (Route 67), form the highway network backbone, and secondary and tertiary national roads interconnect most municipalities, with Magdalena only connected by provincial road.",
            "Provincial roads serves as a supplement to the national roads, and connects barangays and municipalities not connected to the main network.",
            "The highway network is interconnected with nearby provinces and Metro Manila."
        ],
        [
            "The South Luzon Expressway (SLEX) passes through Laguna.",
            "The Cavite–Laguna Expressway begins in Biñan and connects the province to Cavite.",
            "A public-private partnership initiative of the national government include plans to build a circumferential road along Laguna de Bay shoreline, the Laguna Lakeshore Expressway Dike (or C-6 Extension),"
        ],
        [
            "Power"
        ],
        [
            "Three power generating plants are operating in the province."
        ],
        [
            "Botocan Hydro-electric Plant (25MW) — Majayjay"
        ],
        [
            "Caliraya Hydro-electric Plant (23.5 MW) — Kalayaan"
        ],
        [
            "Mak-Ban Geothermal Plant (20MW) — Bay"
        ],
        [
            "Meralco, the main electricity distributor of Metro Manila, has also the franchise for most of Laguna.",
            "Most of the municipalities on the 4th District, however, are franchise areas of First Laguna Electric Cooperative (FLECO)."
        ],
        [
            "Government"
        ],
        [
            "See also: Laguna Provincial Board"
        ],
        [
            "GovernorRamil HernandezVice GovernorKatherine Agapay"
        ],
        [
            "Laguna Provincial Capitol"
        ],
        [
            "The seat of the provincial government of Laguna is Santa Cruz, and has been the capital since 1858.",
            "Historically, the provincial government was seated in Bay (1581–1688) and Pagsanjan (1688–1858) before setting in Santa Cruz."
        ],
        [
            "The provincial government is organized under a governor and vice governor, as well as the Laguna Provincial Board.",
            "Laguna is divided to four districts for the purposes of electing members of the provincial board.",
            "On a municipal level, the province is governed by mayors and their own legislatures, the Sangguniang Panlungsod and Sangguniang Bayan for cities and municipalities, respectively.",
            "Each municipality is further composed for barangays, which are headed by a Punong Barangay and legislated by a Sangguniang Barangay."
        ],
        [
            "Provincial government"
        ],
        [
            "The governor of Laguna is Ramil Hernandez, who is a member of PDP–Laban, since 2014."
        ],
        [
            "Governor"
        ],
        [
            "  Ramil Hernandez"
        ],
        [
            "Vice Governor"
        ],
        [
            "  Katherine Agapay"
        ],
        [
            "Provincial Board"
        ],
        [
            "1st District"
        ],
        [
            "Magtangol Jose Carait (Lakas)"
        ],
        [
            "Danzel Rafter Fernandez (Aksyon)"
        ],
        [
            "Wilfredo Bejasa Jr. (PFP)"
        ],
        [
            "2nd District"
        ],
        [
            "Christian Niño Lajara (Aksyon)"
        ],
        [
            "Peewee Perez (AKAY)"
        ],
        [
            "Tito Fortunato Caringal II (NP)"
        ],
        [
            "3rd District"
        ],
        [
            "Alejandro Yu (PDPLBN)"
        ],
        [
            "Karla Monica Adajar-Lajara (Lakas)"
        ],
        [
            "4th District"
        ],
        [
            "Joseph Kris Benjamin Agarao (NUP)"
        ],
        [
            "Francis Joseph San Luis (Aksyon)"
        ],
        [
            "House of Representatives"
        ],
        [
            "On the legislative level, the province is divided into seven legislative districts, each of which elect their own representative to the House of Representatives."
        ],
        [
            "District"
        ],
        [
            "Representative"
        ],
        [
            "1st District"
        ],
        [
            "  Ann Matibag"
        ],
        [
            "2nd District"
        ],
        [
            "  Ruth Hernandez"
        ],
        [
            "3rd District"
        ],
        [
            "  Loreto Amante"
        ],
        [
            "4th District"
        ],
        [
            "  Jam Agarao"
        ],
        [
            "Lone District of Biñan"
        ],
        [
            "  Marlyn Alonte-Naguiat"
        ],
        [
            "Lone District of Calamba"
        ],
        [
            "  Charisse Anne Hernandez"
        ],
        [
            "Lone District of Santa Rosa"
        ],
        [
            "  Dan Fernandez"
        ],
        [
            "  Lakas–CMD  Partido Federal ng Pilipinas"
        ],
        [
            "National Unity Party"
        ],
        [
            "Arts and culture"
        ],
        [
            "Mural at the St. James the Apostle Parish Church"
        ],
        [
            "Laguna is a major contributor to the development of arts in the Philippines.",
            "Paete is known as the Woodcarving Capital of the Philippines for the murals found in the Saint James the Apostle Parish Church.",
            "The church houses three murals created by Luciano Dans depicting images of Heaven, Earth, and Hell, as well as other murals of Saint Christopher.",
            "Some of these murals, however, need restoration as they have been infested by termites.",
            "Manuel Baldemor is an internationally acclaimed woodcarver born in Paete.",
            "Another famous icon in Laguna is the Our Lady of Turumba, found in Pakil."
        ],
        [
            "Much like the rest of the country, Laguna celebrates multiple feasts and festivals throughout the year.",
            "Each barangay has their own fiesta in homage to a patron saint.",
            "Some of Laguna's famous festivals include the Turumba Festival in Pakil, the Pinya Festival in Calauan, and the Tsinelas Festival in Liliw."
        ],
        [
            "Tourism"
        ],
        [
            "Laguna has a large tourist industry, owing to its historical and natural resources.",
            "The Department of Tourism currently accredits two hotels, one inn, six resorts, one establishment, one restaurant, four tour operations, four tour guides, and two museums in the province."
        ],
        [
            "Rizal Shrine"
        ],
        [
            "Owing to its long history, Laguna has a host of sites that showcase the different periods of history in Laguna.",
            "The Rizal Shrine in Calamba is the ancestral home of the Philippines' national hero, José Rizal.",
            "Other historical sites include the Alberto House in Biñan, the Cuartel de Santo Domingo in Santa Rosa, the Pagsanjan Municipal Hall, the Pagsanjan Arch, the Nagcarlan Underground Cemetery, the ancestral homes and Pinagbayanan crematorium in Pila, Emilio Jacinto Shrine in Santa Cruz, the Baker Memorial Hall in UP Los Baños, and the Tipakan in Luisiana."
        ],
        [
            "Other historical markers include the Japanese Garden in Cavinti and the Homma-Yamashita Shrine in Los Baños, both of which commemorate the Japanese occupation of the Philippines during the Second World War, the memorial sites of the Battle of Sambat in Pagsanjan and the Battle of Mabitac in Mabitac, and the Bantayog ng Kagitingan, Bantayog ng mga Bayani, Trece Martires Monument, and the Bonifacio Monument in San Pablo."
        ],
        [
            "Saint Gregory the Great Parish Church in Majayjay"
        ],
        [
            "There are multiple historical and educational museums in Laguna in addition to its historical sites, such as the Pila Memorial Museum in Pila, the Salvador Laurel Museum and Library in San Pedro,"
        ],
        [
            "Laguna is home to some of the oldest churches in the Philippines, dating back to the end of the 16th century.",
            "The St. James the Apostle Parish Church in Paete, and the Saint Gregory the Great Parish Church in Majayjay are considered to be some of the oldest in the province, dating as far back as 1578 and 1571, respectively."
        ],
        [
            "Other historical churches in the provinces include the Saint Paul the First Hermit Cathedral in San Pablo (the see of the Bishop of the Roman Catholic Diocese of San Pablo), the Transfiguration of our Lord Parish Church in Cavinti, the Nuestra Señora de Candelaria Parish Church in Mabitac, the Immaculate Conception Parish Church in Los Baños, the Saint John the Baptist Church in Liliw, the St. John the Baptist Church in Calamba, where Rizal was baptized, the Saint Peter of Alcantara Parish Church in Pakil, which houses the Our Lady of Turumba painting, the Immaculate Conception Parish Church in Santa Cruz, St. Polycarp Church and the Diocesan Shrine of San Vicente Ferrer in Cabuyao, Santa Rosa de Lima Parish Church in Santa Rosa, and the Diocesan Shrine of Jesus in the Holy Sepulchre (Lolo Uweng) and the San Pedro Apostol Parish Church in San Pedro.",
            "Lolo Uweng Church was known as the \"Quiapo Church of the South.\""
        ],
        [
            "Republic Wakepark in Nuvali, Calamba, Laguna"
        ],
        [
            "Laguna contains many natural tourist spots, owing to its geography and climate.",
            "Laguna is home to the Laguna Volcanic Field, a group of 200 volcanoes and maars.",
            "The highest feature of these fields is Mount Makiling, which is also considered to be a holy mountain.",
            "The Seven Lakes of San Pablo are also part of this field.",
            "The highest peak in Laguna is Mount Banahaw, which it shares with the province of Quezon.",
            "Laguna also features multiple waterfalls, such as the Pagsanjan Falls, the Buruwisan Falls in Siniloan, the Botocan and Taytay Falls in Majayjay, the Talon ng Aliw and the Hulugan Falls, both in Luisiana.",
            "Other attractions in the province include the Cavinti Underground River and Caves Complex, the Simbahang Bato in Luisiana, the Dalitiwan River in Majayjay, and the Crocodile Park in Los Baños."
        ],
        [
            "There are also multiple man-made tourist attractions and parks located in Laguna.",
            "The Enchanted Kingdom theme park is found in Santa Rosa and is accredited by the Department of Tourism.",
            "Other parks in Laguna include the Valesol Haven, the Boy Scouts of the Philippines Camp, the Maria Makiling Park, and the Makiling Botanical Garden, all found in Los Baños; the Wawa Park in Paete, and the Public Plaza of San Pablo."
        ],
        [
            "Calamba and Los Baños are famous for its resorts and hot springs, lending to it the title of Resort Capital of the Philippines.",
            "Other sites include the Turumba Swimming Pool in Pakil, the Caliraya Lake, Dagatan Boulevard in San Pablo, and the Sampaloc Lake Staircase."
        ],
        [
            "Education"
        ],
        [
            "See also: Category:Universities and colleges in Laguna (province)"
        ],
        [
            "Highest Educational Attainment (2015, Non-Overseas Residents)"
        ],
        [
            "No grade completed"
        ],
        [
            "53,694"
        ],
        [
            "Pre-school"
        ],
        [
            "67,512"
        ],
        [
            "Elementary"
        ],
        [
            "673,229"
        ],
        [
            "High school"
        ],
        [
            "1,169,174"
        ],
        [
            "Post-secondary"
        ],
        [
            "64,042"
        ],
        [
            "College undergraduate"
        ],
        [
            "330,952"
        ],
        [
            "Academic degree holder"
        ],
        [
            "368,948"
        ],
        [
            "Post baccalaureate"
        ],
        [
            "3,502"
        ],
        [
            "Not stated"
        ],
        [
            "1,140"
        ],
        [
            "Highest Educational Attainment (2010, Overseas Workers)"
        ],
        [
            "No grade completed"
        ],
        [
            "28"
        ],
        [
            "Pre-school"
        ],
        [
            "6"
        ],
        [
            "Elementary"
        ],
        [
            "3,298"
        ],
        [
            "High school"
        ],
        [
            "17,773"
        ],
        [
            "Post-secondary"
        ],
        [
            "7,333"
        ],
        [
            "College undergraduate"
        ],
        [
            "10,041"
        ],
        [
            "Academic degree holder"
        ],
        [
            "21,557"
        ],
        [
            "Post baccalaureate"
        ],
        [
            "214"
        ],
        [
            "Not stated"
        ],
        [
            "44"
        ],
        [
            "Education rates in Laguna are high.",
            "In 2015, there were approximately 2,734,045 out of 3,035,081 people having attained some form of education.",
            "The literacy rate of Laguna in 2015 was 99.6%.",
            "Most people in Laguna are high school graduates, while most overseas workers from Laguna have a college degree."
        ],
        [
            "There are 586 public schools in Laguna, composed of 458 public schools and 128 secondary schools.",
            "The city of San Pablo has the greatest number of public schools with 79, while the municipality of Rizal has the least with four."
        ],
        [
            "Rizal Hall at Mapúa Malayan Colleges Laguna"
        ],
        [
            "Laguna is home to multiple schools and universities.",
            "There are an estimated 18 universities and 37 colleges in the province.",
            "There are 3 state universities in Laguna with a total of 11 campuses: Laguna State Polytechnic University, Pamantasan ng Cabuyao, Polytechnic University of the Philippines, and the University of the Philippines Los Baños.",
            "UPLB is also one of the oldest universities in the Philippines, having been established in 1909.",
            "The International Rice Research Institute can be found within the UPLB campus and is known internationally for its work in developing rice technologies."
        ],
        [
            "There are also multiple private colleges in Laguna.",
            "Some colleges and universities with main campuses in Metro Manila have also established satellite campuses in Laguna, such as Lyceum of the Philippines University-Laguna, De La Salle University – Laguna Campus, Colegio San Agustin, La Consolacion College, San Sebastian College – Recoletos, Colegio de San Juan de Letran, Mapúa Malayan Colleges Laguna, National University Laguna, and Our Lady of Fatima University – Laguna Campus.",
            "Most recently, the University of Santo Tomas and University of the East have announced that they will establish their respective campus in Santa Rosa."
        ],
        [
            "Notable alumni from colleges in Laguna include Teodoro Casiño, a former member of the House of Representatives; Eduardo Cojuangco Jr., the chairman of San Miguel Corporation; and Jerrold Tarog, film director."
        ],
        [
            "Notable people"
        ],
        [
            "National heroes and patriots"
        ],
        [
            "José Rizal – writer, propagandist, national hero of the Philippines (Calamba)"
        ],
        [
            "Pedro Pelaez – educator, priest, known as the Father of Filipinization of the Church (Pagsanjan)"
        ],
        [
            "Ambrosio Rianzares Bautista – lawyer and author of the Declaration of Philippine Independence (Biñan)"
        ],
        [
            "Paciano Rizal – military general and revolutionary; older brother of José Rizal (Calamba)"
        ],
        [
            "Agueda Kahabagan – Filipina general of the Philippine Revolutionary Army (Santa Cruz)"
        ],
        [
            "Fernando Canon – Filipino revolutionary general, poet, inventor, engineer, musician (Biñan)"
        ],
        [
            "Vicente Lim – World War II general (Calamba)"
        ],
        [
            "Delfina Herbosa de Natividad – one of the three women, together with Marcela Agoncillo and her daughter Lorenza, who seamed together the Flag of the Philippines.",
            "Niece of José Rizal.",
            "(Calamba)"
        ],
        [
            "Trinidad Rizal – feminist leader and co-founder of the Philippines' first feminist organization, the Asociacion Femenista Filipina.",
            "(Calamba)"
        ],
        [
            "Saturnina Rizal Hidalgo – José Rizal's eldest sister (Calamba)"
        ],
        [
            "Salud Algabre – Filipina leader of the Sakdal movement.",
            "(Cabuyao)"
        ],
        [
            "Rizalina Ilagan – anti-martial law activist who was abducted by state security agents anddisappeared along with  nine other activists in what is believed to be the single biggest case of involuntary disappearance during Ferdinand Marcos' martial law in the Philippines.",
            "(Los Baños)"
        ],
        [
            "Florencio Pesquesa – farm worker and labor leader during the  Martial law era that was abducted and disappeared.",
            "His name is inscribed in the Bantayog ng mga Bayani(Calamba)"
        ],
        [
            "Sciences"
        ],
        [
            "Encarnacion Alzona – National Scientist of the Philippines for Philippine History (Biñan)"
        ],
        [
            "Dioscoro L. Umali – National Scientist of the Philippines for Agriculture and Rural Development (Biñan)"
        ],
        [
            "Eduardo Quisumbing – National Scientist of the Philippines for Plant Taxonomy, Systematics, and Morphology (Santa Cruz)"
        ],
        [
            "Ricardo Lantican – National Scientist of the Philippines for Plant Breeding  (Los Baños)"
        ],
        [
            "Dolores Ramirez – National Scientist of the Philippines for Biochemical Genetics & Cytogenetics (Calamba)"
        ],
        [
            "Bienvenido O. Juliano – National Scientist of the Philippines for Biochemistry  (Calamba)"
        ],
        [
            "Gelia Tagumpay Castillo – National Scientist of the Philippines for Rural Sociology  (Pagsanjan)"
        ],
        [
            "Emil Q. Javier, National Scientist of the Philippines for Agriculture, and 17th President of the University of the Philippines (Santa Cruz)"
        ],
        [
            "José Fabella – Filipino physician and a public health advocate, Father of Public Health and Social Welfare in the Philippines.",
            "(Pagsanjan)"
        ],
        [
            "Bonifacio Arévalo – founder of the Sociedad Dental de Filipinas, which is now known as the Philippine Dental Association (Biñan)"
        ],
        [
            "Jose Juliano – Filipino nuclear physicist and chemist (Calamba)"
        ],
        [
            "Rogel Mari Sese – Filipino astrophysicist who is known for being a proponent of space science in the Philippines.",
            "(Los Baños)"
        ],
        [
            "Francisco E. Baisas – entomologist regarded as the \"Dean of Philippine Culicidologists\" (Paete)"
        ],
        [
            "Mercedes Delfinado – acarologist (Cabuyao)"
        ],
        [
            "Aloysius Baes – environmental chemist, environmental and pro-democracy activist, educator, and musician (Los Baños)"
        ],
        [
            "Gregorio F. Zaide – historian, author, known as the Dean of Filipino Historiographers (Pagsanjan)"
        ],
        [
            "Leandro H. Fernandez – educator, author, and historian (Pagsanjan)"
        ],
        [
            "Alfredo E. Evangelista – archaeologist (San Pedro)"
        ],
        [
            "Vicente Fabella – first Filipino certified public accountant and founder of José Rizal University (Pagsanjan)"
        ],
        [
            "Emerlinda R. Roman – educator, university administrator, and 19th President of the University of the Philippines (Los Baños)"
        ],
        [
            "Arts"
        ],
        [
            "Marcelo Adonay – Filipino church composer, musician, organist, musical director, and music teacher (Pakil)"
        ],
        [
            "José Maceda – National Artist of the Philippines for Music (Pila)"
        ],
        [
            "Tony Mabesa – National Artist of the Philippines for Theater.",
            "(Los Baños)"
        ],
        [
            "Jonas Baes – composer (Los Baños)"
        ],
        [
            "Alice Doria-Gamilla – composer (Nagcarlan)"
        ],
        [
            "Cesar Alzona – military music composer and military official (Biñan)"
        ],
        [
            "Celso Ad.",
            "Castillo – film director and screenwriter.",
            "(Siniloan)"
        ],
        [
            "Celso Al.",
            "Carunungan – writer, novelist, and film scriptwriter (San Pablo)"
        ],
        [
            "Bonifacio Ilagan –  playwright, screenwriter, filmmaker, journalist, editor, and activist (Los Baños)"
        ],
        [
            "Rene Alviar - journalist (San Pedro)"
        ],
        [
            "Tony Calvento, journalist (San Pedro)"
        ],
        [
            "Frank G. Rivera – playwright, actor and production designer.",
            "(Paete)"
        ],
        [
            "Edgar Calabia Samar – poet and novelist.",
            "(San Pablo)"
        ],
        [
            "Louie Ignacio – TV director (Pagsanjan)"
        ],
        [
            "Jerrold Tarog – film director and screenwriter (Calamba)"
        ],
        [
            "Gerry Alanguilan – comic book artist, writer, and architect (San Pablo)"
        ],
        [
            "Manuel Baldemor – painter, sculptor, printmaker, writer and book illustrator (Paete)"
        ],
        [
            "Nena Saguil – modernist and abstract art painter (Santa Cruz)"
        ],
        [
            "Danilo Echavaria Dalena – modern and contemporary painter.",
            "(Pakil)"
        ],
        [
            "Maria Carpena – stage actress and soprano singer.",
            "She was the first recording artist in the Philippine music industry.",
            "She was also dubbed as the country's \"Nightingale of Zarzuela\".",
            "(Santa Rosa)"
        ],
        [
            "HaveYouSeenThisGirl – author of the books Diary ng Panget, Voiceless and She Died (San Pablo)"
        ],
        [
            "Religion"
        ],
        [
            "Dalisay Lazaga – Roman Catholic Canossian nun and Servant of God (Santa Rosa)"
        ],
        [
            "Leo M. Drona – Catholic Bishop.",
            "Second Bishop of the Roman Catholic Diocese of San Jose (Nueva Ecija) and Third Bishop of the Roman Catholic Diocese of San Pablo, Laguna.",
            "(Pangil)"
        ],
        [
            "Efren V. Esmilla – Catholic Bishop.",
            "Auxiliary Bishop of the Archdiocese of Philadelphia (Nagcarlan)"
        ],
        [
            "Timoteo Ofrasio, S.J.",
            "– Filipino Jesuit priest, liturgist and lyricist.",
            "He is known for liturgical catholic songs produced under the Jesuit Music Ministry such as \"Paghahandog ng Sarili\", \"Isang Bansa\", and \"Panalangin sa Pagiging Bukas-Palad\".",
            "This also includes \"Alay sa Diyos\" used during the 2015 papal visit to the Philippines.",
            "(Alaminos)"
        ],
        [
            "Business"
        ],
        [
            "Socorro Ramos – entrepreneur and co-founder of National Book Store, the largest bookstore chain in the Philippines.",
            "(Santa Cruz)"
        ],
        [
            "Jaime Aristotle Alip – social entrepreneur, and the Founder and Chairman Emeritus of the CARD Mutually Reinforcing Institutions.",
            "(San Pablo)"
        ],
        [
            "Politics and Government"
        ],
        [
            "Ernesto Maceda – 15th President of the Senate of the Philippines, columnist, and lawyer (Pagsanjan)"
        ],
        [
            "Pedro Guevara – former senator and former Resident Commissioner to the U.S. House of Representatives from the Philippine Islands (Santa Cruz)"
        ],
        [
            "Wenceslao Lagumbay – former senator and former member of the Regular Batasang Pambansa (Kalayaan)"
        ],
        [
            "Alexander Gesmundo – 27th Chief Justice of the Supreme Court of the Philippines (San Pablo)"
        ],
        [
            "Estanislao Fernandez – 88th Associate Justice of the Supreme Court of the Philippines and former senator (Liliw)"
        ],
        [
            "Lorenzo Relova – 103rd Associate Justice of the Supreme Court of the Philippines.",
            "(Pila)"
        ],
        [
            "Conrado M. Vasquez – first Ombudsman of the Philippines and 102nd Associate Justice of the Supreme Court of the Philippines.",
            "(Biñan)"
        ],
        [
            "Arturo Brion – 161st Associate Justice of the Supreme Court of the Philippines.",
            "and 26th Secretary of the Department of Labor and Employment (San Pablo)"
        ],
        [
            "Conrado Benitez – statesman, writer, educator, and was one of the drafters of the 1935 Constitution of the Philippines.",
            "(Pagsanjan)"
        ],
        [
            "Crispin Oben – lawyer, member of the First Philippine Assembly (Lumban)"
        ],
        [
            "Joey Lina – 15th Governor of Laguna, 20th Secretary of the Interior and Local Government, and former senator (Victoria)"
        ],
        [
            "Cielito Habito – economist, professor, former NEDA Director-General (Cabuyao)"
        ],
        [
            "Antonio C. Delgado – former Philippine Ambassador to the Vatican (San Pablo)"
        ],
        [
            "Benjamin Madrigal Jr. – 51st Chief of Staff of the Armed Forces of the Philippines (Los Baños)"
        ],
        [
            "ER Ejercito – 17th Governor of Laguna, Actor, and Former Mayor of Pagsanjan (Pagsanjan)"
        ],
        [
            "Liza Maza – former Gabriela Partylist and Bayan Muna Partylist Representative (San Pablo)"
        ],
        [
            "Sol Aragones – former news reporter and host of ABS-CBN News and Current Affairs, former legislator (San Pablo)"
        ],
        [
            "Angelica Jones – actress and singer, former 3rd District board member of the Laguna Provincial Board (San Pablo)"
        ],
        [
            "Cha Hernandez – incumbent congresswoman (Calamba)"
        ],
        [
            "Sports and Beauty pageants"
        ],
        [
            "Anthony Villanueva – boxer, 1964 Summer Olympics silver medalist (Cabuyao)"
        ],
        [
            "Ariella Arida – fashion model, television personality, Miss Universe-Philippines 2013, Miss Universe 2013 3rd Runner-up (Alaminos)"
        ],
        [
            "Ronato Alcano – professional pool player (Calamba)"
        ],
        [
            "Maybelline Masuda – Filipino Brazilian Jiu-Jitsu practitioner (Calamba)"
        ],
        [
            "Jema Galanza –  volleyball player (San Pedro)"
        ],
        [
            "John Vic De Guzman – volleyball player and actor (Calamba)"
        ],
        [
            "Trisha Genesis, volleyball player (Sta.",
            "Rosa)"
        ],
        [
            "Joshua Retamar, volleyball player (San Pedro)"
        ],
        [
            "Kyla Atienza, volleyball player (San Pedro)"
        ],
        [
            "Mean Mendrez, volleyball player (San Pedro)"
        ],
        [
            "Yllana Aduana, Miss Philippines Earth 2023 and Miss Earth Air 2023 (Siniloan)"
        ],
        [
            "Entertainment"
        ],
        [
            "Marco Sison, singer, actor, politician (Binan)"
        ],
        [
            "Jake Zyrus, singer (Cabuyao)"
        ],
        [
            "Didith Reyes, actress, singer"
        ],
        [
            "Rico Blanco, singer, songwriter"
        ],
        [
            "Julia Clarete, host, singer, actress"
        ],
        [
            "Sabrina, singer"
        ],
        [
            "Karylle, It's Showtime host, actress, daughter of Zsa Zsa Padilla"
        ],
        [
            "Jessie Lasaten, film composer, musical scorer"
        ],
        [
            "Pat Lasaten, film composer, musical scorer and arranger, keyboardist of Ben&Ben"
        ],
        [
            "Mario Montenegro, actor"
        ],
        [
            "Bayani Casimiro, tap dancer"
        ],
        [
            "Dencio Padilla, actor and comedian."
        ],
        [
            "Palito – Filipino comedian and actor (Calamba)"
        ],
        [
            "Teody Belarmino – Filipino film actor (Calamba)"
        ],
        [
            "Alden Richards, model and actor (Santa Rosa)"
        ],
        [
            "Angeli Gonzales, actress"
        ],
        [
            "Alfie Anido, actor, matinee idol"
        ],
        [
            "Paw Diaz, actress, model, TV host"
        ],
        [
            "Dion Ignacio, actor"
        ],
        [
            "C. J. Muere, actor"
        ],
        [
            "Ronnie Alonte, actor, singer, dancer, It's Showtime, Hashtags member"
        ],
        [
            "Jane de Leon, It's Showtime GirlTrend member, Actress."
        ],
        [
            "Sabrina Man, child actress"
        ],
        [
            "Princess Snell, actress"
        ],
        [
            "Halina Perez, model, actress"
        ],
        [
            "Carmina Villaroel, actress"
        ],
        [
            "Charo Ronquillo, fashion model"
        ],
        [
            "Charlene Almarvez, fashion model"
        ],
        [
            "Barbie Forteza, actress, model"
        ],
        [
            "Joan Da, Finalist of the X Factor Philippines"
        ],
        [
            "Thea Tolentino, female winner of GMA Network's Protégé Season 2 (Calamba)"
        ],
        [
            "Jeric Gonzales, male winner of GMA Network's Protégé Season 2 (Calamba)"
        ],
        [
            "Zephanie Dimaranan, an Idol Philippines Grand Winner, singer,  (Biñan)"
        ],
        [
            "Led Sobrepeña III, house singer The Singing Bee (Philippine game show), actor (Biñan)"
        ],
        [
            "Jak Roberto, actor, model"
        ],
        [
            "Sanya Lopez, actress, model"
        ],
        [
            "Stephanie Retuya, contestant and runner-up in Asia's Next Top Model (cycle 1)"
        ],
        [
            "Jiggly Caliente, actress, contestant on RuPaul's Drag Race season 4 and All Stars 6, and judge on Drag Race Philippines"
        ],
        [
            "Other Personalities"
        ],
        [
            "Flor Contemplacion, Filipina domestic helper executed in Singapore after being convicted of murder.",
            "(San Pablo)"
        ],
        [
            "Jeff Cagandahan – prominent Filipino intersex man and intersex human rights activist who first successfully petitioned the Philippine courts to change name and sex markers.",
            "(Pakil)"
        ],
        [
            "Communication"
        ],
        [
            "Telephone & Internet"
        ],
        [
            "Telephone and Internet service having monthly pay bills:"
        ],
        [
            "Globe Telecommunications"
        ],
        [
            "PLDT"
        ],
        [
            "Dito Telecommunity"
        ],
        [
            "Smart Communications"
        ],
        [
            "Thrifty Digital Free tv"
        ],
        [
            "GMA Affordabox"
        ],
        [
            "Sulit TV"
        ],
        [
            "Cable & Satellite"
        ],
        [
            "Cable TV service provider which is a having monthly pay bills:"
        ],
        [
            "Sky Cable"
        ],
        [
            "Cignal"
        ],
        [
            "G Sat"
        ],
        [
            "See also"
        ],
        [
            "Campaigns of the Philippine–American War"
        ],
        [
            "Laguna Lake Development Authority"
        ],
        [
            "Roman Catholic Diocese of San Pablo"
        ],
        [
            "Legislative districts of Laguna"
        ],
        [
            "References"
        ],
        [
            "^ \"28 JULY 1571: The Foundation date of the Province of Laguna\".",
            "Academia.edu."
        ],
        [
            "^ Young historian finds Laguna birth date|Inquirer News Archived October 8, 2012, at the Wayback Machine"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 11, 2013.",
            "Retrieved November 18, 2013."
        ],
        [
            "^ a b c d e f Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Here are the Philippines' richest cities, provinces and towns in 2016\".",
            "The Philippine Star."
        ],
        [
            "^ a b c \"History of Laguna\".",
            "Calirayalake.com.",
            "Retrieved June 23, 2016."
        ],
        [
            "^ Blair, Emma Helen; Robertson, James Alexander.",
            "The Philippine Islands, 1493 - 1898, Volume VIII.",
            "Retrieved April 24, 2017."
        ],
        [
            "^ Blair, Emma Helen; Robertson, James Alexander.",
            "The Philippine Islands, 1493–1898, Volume V. Retrieved April 24, 2017."
        ],
        [
            "^ Barreto-Tesoro, Grace.",
            "\"Ano at Saan ang Lumban\" (PDF).",
            "Archived from the original (PDF) on April 25, 2017.",
            "Retrieved April 24, 2017.",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ de Morga, Antonio.",
            "History of the Philippine Islands.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ Blair, Emma Helen; Robertson, James Alexander.",
            "The Philippine Islands, 1493 - 1898 Volume XX.",
            "Retrieved April 26, 2017."
        ],
        [
            "^ a b c d e f g h i \"History – Laguna, Philippines\".",
            "lagunaphilippines.weebly.com."
        ],
        [
            "^ \"Eva Maria Mehl: Forced migration in the Spanish pacific world: From Mexico to the Philippines, 1765–1811\" Page 100.",
            "Archived May 16, 2022, at the Wayback Machine From the original Spanish language source in the archives of Mexico: \"CSIC ser.",
            "Consultas riel 208 leg.14 (1774)\""
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ Conquest and Pestilence in the Early Spanish Philippines By Linda A. Newson; Quirino and García, “Manners,” 410–411; Morga, Sucesos, 275; Phelan, Hispanization, 19; Scott, Barangay, 141.)"
        ],
        [
            "^ \"Why Laguna deserves a ray of sun in the Philippine National Flag\".",
            "Provincial Government of Laguna.",
            "Archived from the original on December 1, 2017.",
            "Retrieved April 28, 2017."
        ],
        [
            "^ Act No.",
            "83 (February 6, 1901), A General Act For The Organization Of Provincial Governments In The Philippine Islands, retrieved July 30, 2022"
        ],
        [
            "^ Act No.",
            "1008 (November 25, 1903), An Act Amending Act Numbered Nine hundred and thirty-nine, entitled \"An Act reducing the thirty municipalities of the Province of La Laguna to nineteen,\" and Act Numbered Nine hundred and forty-two, entitled \"An Act reducing the thirty - two municipalities of the Province of Rizal to fifteen,\" and providing that the boundary line between the Provinces of La Laguna and Rizal be changed so as to include in La Laguna the municipality of Muntinlupa now a part of Rizal., retrieved April 24, 2022"
        ],
        [
            "^ Act No.",
            "1308 (March 22, 1905), An Act providing for the return of the former municipality of Muntinlupa from the Province of La Laguna to the Province of Rizal, repealing paragraph (e) of section one and sections two and three of Act Numbered One thousand and eight, and changing the name of the municipality of Pateros, of the Province of Rizal, to Taguig., retrieved June 18, 2022"
        ],
        [
            "^ \"About the City\".",
            "City Government of Muntinlupa.",
            "Archived from the original on June 26, 2022.",
            "Retrieved June 19, 2022."
        ],
        [
            "^ Kaminski, Theresa (2016).",
            "Angels of the Underground.",
            "New York: Oxford University Press.",
            "pp. 241–242.",
            "ISBN 9780199928248."
        ],
        [
            "^ Panlilio, Yay (1950).",
            "The Crucible: An Autobiography by Colonel Yay, Filipina American Guerrilla.",
            "New Brunswick: Rutgers University Press.",
            "pp. 19-20.",
            "ISBN 9780813546827."
        ],
        [
            "^ Ganzel, Bill (2007).",
            "\"The Development of \"Miracle Rice\" Varieties\".",
            "Wessels Living History Farm.",
            "Ganzel Group.",
            "Archived from the original on June 5, 2017.",
            "Retrieved September 19, 2017."
        ],
        [
            "^ Reyes, Miguel Paolo P.; Ariate, Joel F. Jr.; Del Mundo, Lara Vinda.",
            "\"'Success' of Masagana 99 all in Imee's head – UP researchers\".",
            "Vera Files.",
            "Archived from the original on May 24, 2020.",
            "Retrieved May 24, 2020."
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 18, 2022."
        ],
        [
            "^ Diola, Camille.",
            "\"Debt, deprivation and spoils of dictatorship | 31 years of amnesia\".",
            "The Philippine Star.",
            "Archived from the original on June 26, 2017.",
            "Retrieved May 2, 2018."
        ],
        [
            "^ a b Pangilinan-Jamolin, Lei; Guzman, Rowena de; Yema, Dan Paolo (December 1, 2020).",
            "\"Experiences of selected University of the Philippines Los Banos (UPLB) community members during Martial Law in the Philippines\".",
            "U.P.",
            "Los Baños Journal."
        ],
        [
            "^ Malay, Carolina S., 1940- (2015).",
            "Ang mamatay nang dahil sa 'yo.",
            "Ermita, Manila, Philippines.",
            "ISBN 978-971-538-270-0.",
            "OCLC 927728036.",
            "{{cite book}}:  CS1 maint: location missing publisher (link) CS1 maint: multiple names: authors list (link) CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ \"ONTONG, Manuel F\"."
        ],
        [
            "^ \"Martyrs and Heroes: MENDOZA, Armando Lano\".",
            "Bantayog ng mga Bayani Website.",
            "Retrieved November 18, 2022."
        ],
        [
            "^ \"VERA FILES FACT CHECK: Claim on Cory Aquino scrapping Marcos-era floodway NEEDS CONTEXT\".",
            "VERA Files.",
            "December 9, 2020.",
            "Retrieved September 26, 2022."
        ],
        [
            "^ Japan International Cooperation Agency; CTI Engineering International Co. Ltd.; Nippon Koei Co. Ltd. (October 2020).",
            "Republic of The Philippines Follow-Up Study on Parañaque Spillway Project – Final Report (PDF) (Report).",
            "Vol.",
            "1: Main Report.",
            "Department of Public Works and Highways, Republic of The Philippines.",
            "Retrieved October 11, 2022."
        ],
        [
            "^ \"Laguna de Bay Masterplan\".",
            "Laguna Lake Development Authority.",
            "Archived from the original on January 29, 2009.",
            "Retrieved July 21, 2009."
        ],
        [
            "^ Alcazaren, Paulo (June 15, 2013).",
            "\"City Sense: 10 reasons why it floods in Manila\".",
            "The Philippine Star.",
            "STAR Group of Publications.",
            "Retrieved October 10, 2014."
        ],
        [
            "^ S.E.",
            "Jorgensen and R.A. Vollenweider, Guidelines of Lake Management, Volume 1 – Principles of Lake Management, International Lake Environment Committee (Online version Archived 2011-05-23 at the Wayback Machine)"
        ],
        [
            "^ a b c \"Province: Laguna (province)\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ \"About Region 4a, The CaLaBaRzon Region\".",
            "DAR.",
            "Archived from the original on June 12, 2017.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Banahaw Volcano\".",
            "Philippine Institute of Volcanology and Seismology.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ a b c d e f g h i \"Province Profile\" Archived August 29, 2012, at the Wayback Machine.",
            "Provincial Government of Laguna."
        ],
        [
            "^ \"Forest Cover in Calabarzon as of CY 2003 (in hectare)\".",
            "Department of Environment and Natural Resources.",
            "Archived from the original on February 6, 2017.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ \"Physical and Socio-Economic Profile\".",
            "Department of Environment and Natural Resources.",
            "Archived from the original on May 18, 2017.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ \"CLIMATE: LAGUNA\".",
            "Climate-Data.org.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ a b Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Republic Act No.",
            "10658 (March 27, 2015), An act separating the city of Biñan from the first legislative district of the province of Laguna to constitute the Lone legislative district of the city of Biñan, retrieved June 13, 2016"
        ],
        [
            "^ COMELEC (August 18, 2015).",
            "\"Resolution No.",
            "9982 – Annex B\" (PDF).",
            "Retrieved June 13, 2016."
        ],
        [
            "^ Republic Act No.",
            "11078 (September 24, 2018), An act separating the city of Calamba from the second legislative district of the province of Laguna to constitute the lone legislative district of the city of Calamba, retrieved August 19, 2019"
        ],
        [
            "^ COMELEC (October 15, 2018).",
            "\"Resolution No.",
            "10434 - IN THE MATTER OF THE IMPLEMENTING RULES AND REGULATIONS OF REPUBLIC ACT NO.",
            "11078 ENTITLED, \"AN ACT SEPARATING THE CITY OF CALAMBA FROM THE SECOND LEGISLATIVE DISTRICT OF THE PROVINCE OF LAGUNA TO CONSTITUTE THE LONE LEGISLATIVE DISTRICT OF THE CITY OF CALAMBA\"\".",
            "Retrieved August 19, 2019."
        ],
        [
            "^ \"Los Baños\".",
            "Laguna Travel Guide.",
            "September 17, 2000.",
            "Archived from the original on December 26, 2013.",
            "Retrieved October 29, 2012."
        ],
        [
            "^ Republic Act No.",
            "11395 (August 28, 2019), An Act Separating the City of Santa Rosa from the First Legislative District of the Province of Laguna to Constitute the Lone Legislative District of Santa Rosa (PDF)"
        ],
        [
            "^ Census of Population and Housing (2010).",
            "Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities (PDF).",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ a b c d e \"Laguna Quickstat - June 2018\".",
            "Philippine Statistics Authority.",
            "Retrieved February 4, 2023."
        ],
        [
            "^ \"Philippine Sites – Laguna\".",
            "Department of Tourism.",
            "Archived from the original on June 5, 2017.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"MCGI leads charitable outreach in Sta.",
            "Rosa, Laguna and Talisay, Batangas\".",
            "MCGI Cares.",
            "December 18, 2022."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ Saaduddin, Jii (May 20, 2023).",
            "\"Department Of Tourism | DOT Commends PATAS Initiative – Revitalizing Tourism In Laguna — Davao Corporate\".",
            "Retrieved June 6, 2023."
        ],
        [
            "^ \"Which regions, provinces, cities are Philippines' richest?\".",
            "ABS-CBN.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ \"Laguna, pangunahing lugar na puntahan, tirahan, at pangalakalan\" Archived December 21, 2012, at archive.today.",
            "Philippine Information Agency."
        ],
        [
            "^ \"Proclaimed Watershed Forest Reserve\".",
            "DENR.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Directory of Non-Metallic Mines and Quarries\".",
            "DENR Mines and Geosciences Bureau.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Region IV-A Mineral Production by Province, by Mineral 2015\".",
            "DENR Mines and Geosciences Bureau.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Performance of Philippine Agriculture January-March 2012\" (PDF).",
            "Bureau of Agricultural Statistics.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ \"Top Five Permanent Crops in Terms of Number of Trees/Vines/Hills by Province : Calabarzon, 1991 and 2002\" (PDF).",
            "Philippine Statistics Authority.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ \"Region IV-A Profile\".",
            "Department of Agrarian Reform.",
            "Retrieved April 30, 2017."
        ],
        [
            "^ a b \"List of Economic Zones\".",
            "DTI – PEZA.",
            "Archived from the original on April 28, 2017.",
            "Retrieved April 28, 2017."
        ],
        [
            "^ Kilometer count tabulated from data for the e district engineering offices in Laguna in the 2015 Road Data Archived April 7, 2017, at the Wayback Machine by the Department of Public Works and Highways"
        ],
        [
            "^ dpwh.gov.ph \"Private-Public Partnership - Laguna de Bay Flood Control Dike Expressway (C-6 Extension)\" Archived July 27, 2012, at the Wayback Machine"
        ],
        [
            "^ dpwh.gov.ph \"Private-Public Partnership - Calamba–Los Baños Expressway\" Archived July 11, 2012, at the Wayback Machine"
        ],
        [
            "^ \"Paete, the Wood Carving Capital of the Philippines\".",
            "UP Open University.",
            "Archived from the original on May 8, 2017.",
            "Retrieved May 6, 2017."
        ],
        [
            "^ \"Laguna\".",
            "Department of Tourism.",
            "Archived from the original on October 1, 2018.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ Tamayo, Ma.",
            "Rosario; Celis, Mark Irvin.",
            "\"Tourism Development in Region IV: Employment Prospects and Opportunities of Tourism Graduates of Lyceum of the Philippines University\" (PDF).",
            "Retrieved April 29, 2017.",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ \"Laguna: Historical\".",
            "Department of Tourism.",
            "Archived from the original on September 11, 2016.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Salvador H Laurel museum and library\".",
            "Salvador H. Laurel."
        ],
        [
            "^ \"Museums\".",
            "Laguna Travel Guide.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Laguna: Museums\".",
            "Department of Tourism.",
            "Archived from the original on September 11, 2016.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Lolo Uweng:Quiapo Church of the South\".",
            "Opinyon.",
            "Retrieved April 13, 2015."
        ],
        [
            "^ \"Laguna: Natural\".",
            "Department of Tourism.",
            "Archived from the original on September 29, 2017.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"Laguna: Man-Made\".",
            "Department of Tourism.",
            "Archived from the original on October 1, 2018.",
            "Retrieved April 29, 2017."
        ],
        [
            "^ \"DepEd: Datasets\".",
            "Department of Education.",
            "Archived from the original on May 16, 2017."
        ],
        [
            "^ \"PESQUESA, Florencio S.\" Bantayog ng mga Bayani.",
            "July 13, 2016.",
            "Retrieved February 24, 2021."
        ],
        [
            "^ Angelo, Mikael (January 8, 2019).",
            "\"Dr. Ricardo M. Lantican: The Filipino whose research changed four industries – FlipScience – Top Philippine science news and features for the inquisitive Filipino\".",
            "Flipscience.ph.",
            "Retrieved December 12, 2021."
        ],
        [
            "^ \"Ben Juliano, cereal chemist second to none – Manila Bulletin\".",
            "Manila Bulletin."
        ],
        [
            "^ GOVPH.",
            "\"Gelia T. Castillo: Distinguished Rural Sociologist, 89\".",
            "Nast.ph.",
            "Retrieved December 12, 2021."
        ],
        [
            "^ \"Danilo E. Dalena Biography\".",
            "Retrieved November 8, 2019."
        ],
        [
            "^ \"The art of Danilo Dalena and the Filipino everyman\".",
            "CNN Philippines.",
            "Archived from the original on November 7, 2019.",
            "Retrieved November 8, 2019."
        ],
        [
            "^ \"9 Kickass Women in Philippine History You've Never Heard Of\".",
            "FilipiKnow.",
            "June 3, 2018.",
            "Retrieved February 6, 2021."
        ],
        [
            "^ Pa-a, Saul.",
            "\"Sta.",
            "Rosa, Laguna honors 1st Filipino soprano recording artist\".",
            "Philippine News Agency.",
            "Retrieved February 6, 2021."
        ],
        [
            "^ \"Blog Archive » Sister Dalisay Lazaga\".",
            "CatholicSaints.Info.",
            "Retrieved December 12, 2021."
        ],
        [
            "^ \"Pope Francis Names New Auxiliary Bishops of Philadelphia\".",
            "Retrieved December 8, 2023."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Laguna (province) at Wikimedia Commons"
        ],
        [
            " Geographic data related to Laguna (province) at OpenStreetMap"
        ],
        [
            "Official Website of the Province of Laguna"
        ],
        [
            "Places adjacent to Laguna (province)"
        ],
        [
            "Metro Manila"
        ],
        [
            "RizalLaguna de Bay"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Batangas"
        ],
        [
            "Quezon"
        ],
        [
            "vteProvince of LagunaSanta Cruz (capital)  Calamba (largest city)Municipalities"
        ],
        [
            "Alaminos"
        ],
        [
            "Bay"
        ],
        [
            "Calauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Famy"
        ],
        [
            "Kalayaan"
        ],
        [
            "Liliw"
        ],
        [
            "Los Baños"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabitac"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Paete"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Pila"
        ],
        [
            "Rizal"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Siniloan"
        ],
        [
            "Victoria"
        ],
        [
            "Component Cities"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "BarangaysSee: List of barangays in Laguna (province)"
        ],
        [
            "Articles related to Laguna"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vteLaguna de Bay\"The Largest Lake in the Philippines\"Location"
        ],
        [
            "Calabarzon"
        ],
        [
            "Metro Manila"
        ],
        [
            "Basin country"
        ],
        [
            "Philippines"
        ],
        [
            "Islands"
        ],
        [
            "Talim Island"
        ],
        [
            "Wonder Island"
        ],
        [
            "Cielito Lindo Island"
        ],
        [
            "Primary outflow"
        ],
        [
            "Pasig River"
        ],
        [
            "Primary inflows"
        ],
        [
            "21 tributaries: Bumbungan River (formerly Pagsanjan River)"
        ],
        [
            "Santa Cruz River"
        ],
        [
            "Balanak River"
        ],
        [
            "Marikina River"
        ],
        [
            "Mangangate River"
        ],
        [
            "Tunasan River"
        ],
        [
            "San Pedro River"
        ],
        [
            "Cabuyao River"
        ],
        [
            "San Cristobal River"
        ],
        [
            "San Juan River"
        ],
        [
            "Bay River"
        ],
        [
            "Calo River"
        ],
        [
            "Maitem River"
        ],
        [
            "Molawin River"
        ],
        [
            "Dampalit River"
        ],
        [
            "Pele River"
        ],
        [
            "Pangil River"
        ],
        [
            "Tanay River"
        ],
        [
            "Morong River"
        ],
        [
            "Siniloan River"
        ],
        [
            "Sapang Baho River"
        ],
        [
            "SettlementsProvinces"
        ],
        [
            "Laguna"
        ],
        [
            "Rizal"
        ],
        [
            "Metro Manila"
        ],
        [
            "Cities"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Muntinlupa"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Taguig"
        ],
        [
            "Municipalities"
        ],
        [
            "Angono"
        ],
        [
            "Baras"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Calauan"
        ],
        [
            "Cardona"
        ],
        [
            "Jalajala"
        ],
        [
            "Kalayaan"
        ],
        [
            "Los Baños"
        ],
        [
            "Lumban"
        ],
        [
            "Mabitac"
        ],
        [
            "Morong"
        ],
        [
            "Paete"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Siniloan"
        ],
        [
            "Tanay"
        ],
        [
            "Taytay"
        ],
        [
            "Victoria"
        ],
        [
            "Luzon, Philippines"
        ],
        [
            "vteMajor Institutions in LagunaUniversities"
        ],
        [
            "De La Salle University (Laguna Campus)"
        ],
        [
            "Laguna State Polytechnic University"
        ],
        [
            "Laguna University"
        ],
        [
            "Lyceum of the Philippines University (Laguna campus)"
        ],
        [
            "National University (Laguna campus)"
        ],
        [
            "Our Lady of Fatima University (Laguna campus)"
        ],
        [
            "University of Cabuyao"
        ],
        [
            "Polytechnic University of the Philippines (Santa Rosa, San Pedro, Biñan, Calauan campuses)"
        ],
        [
            "University of the Philippines Los Baños"
        ],
        [
            "University of the Philippines Open University"
        ],
        [
            "University of Perpetual Help System DALTA (Calamba campus)"
        ],
        [
            "University of Perpetual Help JONELTA"
        ],
        [
            "Colleges"
        ],
        [
            "Calamba Doctors' College"
        ],
        [
            "City College of Calamba"
        ],
        [
            "Colegio San Agustin – Biñan"
        ],
        [
            "Colegio de San Juan de Letran - Calamba"
        ],
        [
            "Colegio de San Pedro"
        ],
        [
            "Colegio de Santo Niño de Cabuyao"
        ],
        [
            "Dalubhasaan ng Lungsod ng San Pablo"
        ],
        [
            "Don Bosco College"
        ],
        [
            "La Consolacion College - Biñan"
        ],
        [
            "Laguna College"
        ],
        [
            "Laguna College of Business and Arts"
        ],
        [
            "Mapúa Malayan Colleges Laguna"
        ],
        [
            "Miriam College"
        ],
        [
            "Our Lady of Assumption College"
        ],
        [
            "San Pablo Colleges"
        ],
        [
            "San Pedro College of Business Administration"
        ],
        [
            "San Sebastian College – Recoletos"
        ],
        [
            "Saint Michael's College of Laguna"
        ],
        [
            "Saint Vincent College of Cabuyao"
        ],
        [
            "St. John Colleges"
        ],
        [
            "Rizal College of Laguna"
        ],
        [
            "Union College of Laguna"
        ],
        [
            "Institutes"
        ],
        [
            "AMA (Biñan, Calamba, San Pablo, Santa Cruz)"
        ],
        [
            "Calamba Institute"
        ],
        [
            "International Electronics and Technical Institute Inc.",
            "(I.E.T.I.)"
        ],
        [
            "MSC Institute of Technology"
        ],
        [
            "Southeast Asia Institute of Science, Arts and Technology"
        ],
        [
            "STI (San Pedro, Calamba, San Pablo, Santa Rosa, Southwoods, Santa Cruz)"
        ],
        [
            "Rizal Institute – Canlubang"
        ],
        [
            "vteSpecial Zones of Laguna"
        ],
        [
            "Canlubang Industrial Zone"
        ],
        [
            "Makiling Forest Reserve"
        ],
        [
            "Nature and Science City of Los Baños"
        ],
        [
            "Laguna de Bay"
        ],
        [
            "Pagsanjan Falls (Cavinti)"
        ],
        [
            "Seven Lakes of San Pablo"
        ],
        [
            "Lake Caliraya"
        ],
        [
            "Mount Sembrano"
        ],
        [
            "Laguna Caldera"
        ],
        [
            "Caliraya Dam"
        ],
        [
            "University of the Philippines Los Baños"
        ],
        [
            "International Rice Research Institute"
        ],
        [
            "Nagcarlan Underground Cemetery"
        ],
        [
            "Enchanted Kingdom"
        ],
        [
            "Villa Escudero Plantations"
        ],
        [
            "Rizal Monument"
        ],
        [
            "Rizal Shrine"
        ],
        [
            "vte Major roads in LagunaExpresswaysOperational"
        ],
        [
            "E2/AH26"
        ],
        [
            "South Luzon Expressway"
        ],
        [
            "Cavite–Laguna Expressway"
        ],
        [
            "Planned/under construction"
        ],
        [
            "Calamba–Bay Bypass Road"
        ],
        [
            "Calamba–Los Baños Expressway"
        ],
        [
            "Laguna de Bay Coastal Road"
        ],
        [
            "Laguna Lakeshore Expressway Dike"
        ],
        [
            "National highwaysPrimary"
        ],
        [
            "N1"
        ],
        [
            "Pan-Philippine Highway (AH26)"
        ],
        [
            "Manila South Road"
        ],
        [
            "N65"
        ],
        [
            "General Malvar Street"
        ],
        [
            "N66"
        ],
        [
            "Calamba–Pagsanjan Road"
        ],
        [
            "N67"
        ],
        [
            "Calauan-Victoria Road"
        ],
        [
            "Bay–Calauan–San Pablo Road (Calauan to San Pablo segment)"
        ],
        [
            "Cipriano B. Colago Avenue"
        ],
        [
            "Jose Rizal Avenue"
        ],
        [
            "Marcos Paulino Avenue"
        ],
        [
            "Crispin T. Calabia Avenue"
        ],
        [
            "Secondary"
        ],
        [
            "N420"
        ],
        [
            "Santa Rosa–Tagaytay Road"
        ],
        [
            "N601"
        ],
        [
            "Manila East Road (Mabitac to Famy segment)"
        ],
        [
            "Famy–Real–Infanta Road"
        ],
        [
            "N602"
        ],
        [
            "Manila East Road (Famy to Pagsanjan segment)"
        ],
        [
            "N603"
        ],
        [
            "Pagsanjan–Cavinti Road"
        ],
        [
            "Cavinti–Luisiana Road"
        ],
        [
            "Luisiana–Lucban Road"
        ],
        [
            "Tertiary"
        ],
        [
            "Alaminos-Lipa City Road"
        ],
        [
            "Balagtas Boulevard"
        ],
        [
            "Calauan–Nagcarlan Road"
        ],
        [
            "Cavinti-Caliraya Road"
        ],
        [
            "Jamboree Road"
        ],
        [
            "Kalayaan Poblacion Road"
        ],
        [
            "Liliw-Majayjay Road"
        ],
        [
            "Lopez Avenue"
        ],
        [
            "Lumban-Caliraya Road"
        ],
        [
            "Majayjay-Lucban Road"
        ],
        [
            "Marikina–Infanta Highway"
        ],
        [
            "Mayapa–Canlubang Cadre Road"
        ],
        [
            "Mt.",
            "Makiling Eco Garden Road"
        ],
        [
            "Paete-Famy Poblacion Road"
        ],
        [
            "Pedro Alcantara Street"
        ],
        [
            "Pila-Poblacion Road"
        ],
        [
            "Rizal Avenue"
        ],
        [
            "San Pablo-Dolores Road"
        ],
        [
            "San Pablo-Rizal-Nagcarlan-Liliw Road"
        ],
        [
            "Santa Cruz-Pob Road"
        ],
        [
            "Tagaytay–Calamba Road"
        ],
        [
            "Werner P. Schetelig Avenue"
        ],
        [
            "Provincial roads and other major roads"
        ],
        [
            "Bucal Bypass Road"
        ],
        [
            "Laguna Boulevard"
        ],
        [
            "Magdalena-Liliw Road"
        ],
        [
            "Magdalena-Majayjay Road"
        ],
        [
            "Santa Cruz-Nagcarlan Road"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Laguna_(province)&oldid=1231795000\""
        ],
        [
            "Categories: Laguna (province)1571 establishments in the PhilippinesProvinces of the PhilippinesProvinces of CalabarzonStates and territories established in 1571Hidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsWebarchive template wayback linksCS1 errors: missing periodicalAll articles with dead external linksArticles with dead external links from February 2024Articles with permanently dead external linksCS1 maint: location missing publisherCS1 maint: multiple names: authors listCS1 maint: numeric names: authors listCS1: long volume valueWebarchive template archiveis linksArticles with short descriptionShort description is different from WikidataUse mdy dates from November 2022Use Philippine English from November 2022All Wikipedia articles written in Philippine EnglishPages using multiple image with auto scaled imagesPages using infobox settlement with possible motto listCoordinates on WikidataPages with Tagalog IPAArticles containing Filipino-language textAll Wikipedia articles that are incomprehensibleWikipedia articles that are incomprehensible from April 2016Wikipedia articles needing clarification from April 2016All articles with unsourced statementsArticles with unsourced statements from August 2012Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}