{
    "name": "Leyte",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Leyte (province)"
        ],
        [
            "43 languages"
        ],
        [
            "Acèhالعربية閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDanskDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 11°00′N 124°51′E﻿ / ﻿11°N 124.85°E﻿ / 11; 124.85"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Eastern Visayas, PhilippinesLeyteProvinceProvince of Leyte(from top: left to right) Tacloban Bay,  Leyte Provincial Capitol, Lake Danao San Juanico Bridge, Kalanggaman Island and Calubian."
        ],
        [
            "FlagSealLocation in the PhilippinesOpenStreetMapCoordinates: 11°00′N 124°51′E﻿ / ﻿11°N 124.85°E﻿ / 11; 124.85CountryPhilippinesRegionEastern VisayasFounded1735 • Total1,776,847 • Rank14th out of 81 • Density280/km2 (730/sq mi)  • Rank34th out of 81 (excludes Tacloban City)Demonym(s)LeytehanonLeyteño (Spanish)Divisions • Independent cities"
        ],
        [
            "2"
        ],
        [
            " Ormoc"
        ],
        [
            "Tacloban"
        ],
        [
            " • Component cities"
        ],
        [
            "1"
        ],
        [
            " Baybay"
        ],
        [
            " • Municipalities"
        ],
        [
            "40"
        ],
        [
            " Abuyog"
        ],
        [
            " Alangalang"
        ],
        [
            " Albuera"
        ],
        [
            " Babatngon"
        ],
        [
            " Barugo"
        ],
        [
            " Bato"
        ],
        [
            " Burauen"
        ],
        [
            " Calubian"
        ],
        [
            " Capoocan"
        ],
        [
            " Carigara"
        ],
        [
            " Dagami"
        ],
        [
            " Dulag"
        ],
        [
            " Hilongos"
        ],
        [
            " Hindang"
        ],
        [
            " Inopacan"
        ],
        [
            " Isabel"
        ],
        [
            " Jaro"
        ],
        [
            " Javier"
        ],
        [
            " Julita"
        ],
        [
            " Kananga"
        ],
        [
            " La Paz"
        ],
        [
            " Leyte"
        ],
        [
            " MacArthur"
        ],
        [
            " Mahaplag"
        ],
        [
            " Matag-ob"
        ],
        [
            " Matalom"
        ],
        [
            " Mayorga"
        ],
        [
            " Merida"
        ],
        [
            " Palo"
        ],
        [
            " Palompon"
        ],
        [
            " Pastrana"
        ],
        [
            " San Isidro"
        ],
        [
            " San Miguel"
        ],
        [
            " Santa Fe"
        ],
        [
            " Tabango"
        ],
        [
            " Tabontabon"
        ],
        [
            " Tanauan"
        ],
        [
            " Tolosa"
        ],
        [
            " Tunga"
        ],
        [
            " Villaba"
        ],
        [
            " • Barangays1,393including independent cities: 1,641 • DistrictsLegislative districts of Leyte (shared with Ormoc and Tacloban cities)Time zoneUTC+8 (PST)ZIP Code6500–6542IDD : area code +63 (0)53ISO 3166 codePH-LEYSpoken languagesWaray-WarayCebuanoBaybayanonEnglishTagalogWebsitehttp://leyteprovince.gov.ph/"
        ],
        [
            "Leyte (also Northern Leyte; Waray: Norte san/Amihanan nga Leyte; Cebuano: Amihanang Leyte; Tagalog: Hilagang Leyte), officially the Province of Leyte, is a province in the Philippines located in the Eastern Visayas region occupying the northern three-quarters of Leyte Island (with the remaining portion being the province of Southern Leyte).",
            "Its capital and largest city is Tacloban, administered independently from the province.",
            "Leyte is thus north of Southern Leyte, south of Biliran, and west of Samar Island.",
            "To the west across the Camotes Sea is the province of Cebu."
        ],
        [
            "The historical name of the Philippines, \"Las Islas Felipenas\", named by Spanish explorer Ruy López de Villalobos in honor of Prince Philip of Spain, used to refer to the islands of Leyte and Samar only, until it was adopted to refer to the entire archipelago."
        ],
        [
            "The island of Leyte is known as Tandaya during the 16th century."
        ],
        [
            "Leyte is also known as the site of the largest naval battle in modern history, the Battle of Leyte Gulf, which took place during the Second World War."
        ],
        [
            "Leyte is especially prone to typhoons because it geographically faces toward the Pacific Ocean.",
            "On 8 November 2013, the province was severely affected by Super Typhoon Yolanda (Haiyan).",
            "The typhoon, known internationally as Haiyan, and domestically referred to as Yolanda, killed thousands of people and garnered significant international media attention.",
            "Leyte suffered similar destruction and loss of life in 1991 from Tropical Storm Thelma."
        ],
        [
            "History"
        ],
        [
            "Leyte province in 1918, before its division into three provinces, namely Leyte, Southern Leyte and Biliran"
        ],
        [
            "Early history"
        ],
        [
            "The island of Leyte was once the location of Mairete, meaning land of Ete, a historic community which was ruled by Datu Ete centered in present-day municipality of Leyte and nearby towns.",
            "It was the oldest city-state in the entire Eastern Visayas region.",
            "Before being colonized by Spain, the island was once home to indigenous animist Warays to the East and other indigenous Hindu-Buddhist Visayan groups to the west."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The Spanish explorer Ruy López de Villalobos, first came to the island in 1543 and named it Las Islas Felipinas.",
            "When the Spanish government established government in Cebu, Leyte and Samar became part of the province of Cebu.",
            "In 1595, the religious Jesuits established mission in Carigara which preceded the mission established in Palo in 1596 and Ormoc and Alangalang missions in 1597.",
            "In 1735, Leyte and Samar were separated from Cebu to be established as a single provincial government with Carigara as the first provincial capital.",
            "Leyte had jurisdiction over Samar.",
            "In 1768, Leyte and Samar were split into two separate provinces."
        ],
        [
            "American invasion era"
        ],
        [
            "On March 27, 1923, Act No 3117 was proposed to divide Leyte into Occidental Leyte and Oriental Leyte but was not proclaimed by the Governor-General of the Philippines."
        ],
        [
            "On May 22, 1959, Republic Act No.",
            "2227 was passed into law that separated the third Congressional District of Leyte into a separate province of Southern Leyte."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "During the World War II era, the Leyte Provincial Capitol briefly became the seat of the Philippine Commonwealth Government."
        ],
        [
            "Battle of Leyte Gulf"
        ],
        [
            "When Americans stormed ashore at Leyte, it fulfilled the promise to return made by Gen. Douglas MacArthur in the days following the fall of the Philippines to the Japanese in 1942."
        ],
        [
            "Main article: Battle of Leyte Gulf"
        ],
        [
            "The Battle of Leyte Gulf took place in the seas surrounding this island from 23 October to 26 October 1944.",
            "It was the largest naval battle in modern history, when at least 212 Allied ships clashed with the remnants of the Imperial Japanese Navy, some 60 ships, including the super battleships Yamato and Musashi."
        ],
        [
            "The First Battle of Leyte occurred on 20 October 1944.",
            "A successful Allied invasion of the island was the crucial element to the eventual Filipino and American victory in the Philippines."
        ],
        [
            "Contemporary"
        ],
        [
            "The municipality of Baybay became a component city by virtue of Republic Act No.",
            "9389 which sought to convert the town into a city.",
            "The law was ratified on June 16, 2007.",
            "However, the cityhood status was lost twice in the years 2008 and 2010 after the LCP questioned the validity of the cityhood law.",
            "The cityhood status was reaffirmed after the court finalized its ruling on February 15, 2011 which declared the cityhood law constitutional."
        ],
        [
            "Geography"
        ],
        [
            "Political map of Leyte"
        ],
        [
            "Leyte covers a total area of 6,313.33 square kilometres (2,437.59 sq mi) occupying the northern and central sections of Leyte in the Eastern Visayas region.",
            "The province is situated west of Samar Island, north of Southern Leyte, south of Biliran, and east of the Camotes Sea."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Leyte comprises 40 municipalities and three cities, all clustered into 6 congressional districts."
        ],
        [
            "Ormoc is an independent component city, while the capital Tacloban was declared a highly urbanized city in 2008.",
            "Both cities govern themselves independently of the province and their residents do not vote for elective provincial officials."
        ],
        [
            "Baybay attained cityhood in 2007 but reverted to its municipal status when the Supreme Court declared its city charter unconstitutional in 2008.",
            "It regained its city status following the reversal of the Supreme Court decision dated December 22, 2009.",
            "In August 2010, however, a resolution had been passed reverting 16 cities, one of which was Baybay, to municipal status.",
            "It was on February 15, 2011, that the Supreme Court reversed its decision once again, allowing Baybay, along with the other 16 cities, to retain their cityhood status."
        ],
        [
            " †  Provincial capital and highly urbanized city ^  Independent component city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Abuyog"
        ],
        [
            "5th"
        ],
        [
            "3.4%"
        ],
        [
            "61,216"
        ],
        [
            "59,571"
        ],
        [
            "+0.52%"
        ],
        [
            "688.25"
        ],
        [
            "265.73"
        ],
        [
            "89"
        ],
        [
            "230"
        ],
        [
            "63"
        ],
        [
            "10°44′50″N 125°00′41″E﻿ / ﻿10.7471°N 125.0114°E﻿ / 10.7471; 125.0114﻿ (Abuyog)"
        ],
        [
            "Alangalang"
        ],
        [
            "1st"
        ],
        [
            "3.2%"
        ],
        [
            "57,185"
        ],
        [
            "55,235"
        ],
        [
            "+0.66%"
        ],
        [
            "150.54"
        ],
        [
            "58.12"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "54"
        ],
        [
            "11°12′24″N 124°50′45″E﻿ / ﻿11.2066°N 124.8457°E﻿ / 11.2066; 124.8457﻿ (Alangalang)"
        ],
        [
            "Albuera"
        ],
        [
            "4th"
        ],
        [
            "2.7%"
        ],
        [
            "47,151"
        ],
        [
            "46,332"
        ],
        [
            "+0.33%"
        ],
        [
            "303.35"
        ],
        [
            "117.12"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "16"
        ],
        [
            "10°55′05″N 124°41′45″E﻿ / ﻿10.9180°N 124.6959°E﻿ / 10.9180; 124.6959﻿ (Albuera)"
        ],
        [
            "Babatngon"
        ],
        [
            "1st"
        ],
        [
            "1.6%"
        ],
        [
            "28,823"
        ],
        [
            "27,797"
        ],
        [
            "+0.69%"
        ],
        [
            "115.18"
        ],
        [
            "44.47"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "25"
        ],
        [
            "11°25′24″N 124°50′46″E﻿ / ﻿11.4233°N 124.8461°E﻿ / 11.4233; 124.8461﻿ (Babatngon)"
        ],
        [
            "Barugo"
        ],
        [
            "6th"
        ],
        [
            "1.9%"
        ],
        [
            "34,497"
        ],
        [
            "32,745"
        ],
        [
            "+1.00%"
        ],
        [
            "84.62"
        ],
        [
            "32.67"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "37"
        ],
        [
            "11°19′30″N 124°44′13″E﻿ / ﻿11.3249°N 124.7370°E﻿ / 11.3249; 124.7370﻿ (Barugo)"
        ],
        [
            "Bato"
        ],
        [
            "5th"
        ],
        [
            "2.2%"
        ],
        [
            "38,505"
        ],
        [
            "38,356"
        ],
        [
            "+0.07%"
        ],
        [
            "72.45"
        ],
        [
            "27.97"
        ],
        [
            "530"
        ],
        [
            "1,400"
        ],
        [
            "32"
        ],
        [
            "10°19′43″N 124°47′20″E﻿ / ﻿10.3286°N 124.7889°E﻿ / 10.3286; 124.7889﻿ (Bato)"
        ],
        [
            "Baybay City"
        ],
        [
            "∗"
        ],
        [
            "5th"
        ],
        [
            "6.3%"
        ],
        [
            "111,848"
        ],
        [
            "109,432"
        ],
        [
            "+0.42%"
        ],
        [
            "459.34"
        ],
        [
            "177.35"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "92"
        ],
        [
            "10°40′38″N 124°47′49″E﻿ / ﻿10.6771°N 124.7970°E﻿ / 10.6771; 124.7970﻿ (Baybay)"
        ],
        [
            "Burauen"
        ],
        [
            "2nd"
        ],
        [
            "3.0%"
        ],
        [
            "52,511"
        ],
        [
            "52,732"
        ],
        [
            "−0.08%"
        ],
        [
            "265.33"
        ],
        [
            "102.44"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "77"
        ],
        [
            "10°58′27″N 124°53′35″E﻿ / ﻿10.9741°N 124.8931°E﻿ / 10.9741; 124.8931﻿ (Burauen)"
        ],
        [
            "Calubian"
        ],
        [
            "3rd"
        ],
        [
            "1.8%"
        ],
        [
            "31,646"
        ],
        [
            "31,228"
        ],
        [
            "+0.25%"
        ],
        [
            "100.95"
        ],
        [
            "38.98"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "53"
        ],
        [
            "11°26′45″N 124°25′41″E﻿ / ﻿11.4459°N 124.4280°E﻿ / 11.4459; 124.4280﻿ (Calubian)"
        ],
        [
            "Capoocan"
        ],
        [
            "6th"
        ],
        [
            "1.9%"
        ],
        [
            "33,721"
        ],
        [
            "33,617"
        ],
        [
            "+0.06%"
        ],
        [
            "185.40"
        ],
        [
            "71.58"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "21"
        ],
        [
            "11°17′37″N 124°38′34″E﻿ / ﻿11.2935°N 124.6429°E﻿ / 11.2935; 124.6429﻿ (Capoocan)"
        ],
        [
            "Carigara"
        ],
        [
            "6th"
        ],
        [
            "3.1%"
        ],
        [
            "54,656"
        ],
        [
            "51,345"
        ],
        [
            "+1.20%"
        ],
        [
            "117.86"
        ],
        [
            "45.51"
        ],
        [
            "460"
        ],
        [
            "1,200"
        ],
        [
            "49"
        ],
        [
            "11°17′58″N 124°41′20″E﻿ / ﻿11.2995°N 124.6889°E﻿ / 11.2995; 124.6889﻿ (Carigara)"
        ],
        [
            "Dagami"
        ],
        [
            "2nd"
        ],
        [
            "2.0%"
        ],
        [
            "36,178"
        ],
        [
            "35,147"
        ],
        [
            "+0.55%"
        ],
        [
            "161.65"
        ],
        [
            "62.41"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "65"
        ],
        [
            "11°03′42″N 124°54′09″E﻿ / ﻿11.0617°N 124.9026°E﻿ / 11.0617; 124.9026﻿ (Dagami)"
        ],
        [
            "Dulag"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "48,992"
        ],
        [
            "47,300"
        ],
        [
            "+0.67%"
        ],
        [
            "110.70"
        ],
        [
            "42.74"
        ],
        [
            "440"
        ],
        [
            "1,100"
        ],
        [
            "45"
        ],
        [
            "10°57′10″N 125°01′56″E﻿ / ﻿10.9528°N 125.0321°E﻿ / 10.9528; 125.0321﻿ (Dulag)"
        ],
        [
            "Hilongos"
        ],
        [
            "5th"
        ],
        [
            "3.6%"
        ],
        [
            "64,514"
        ],
        [
            "63,431"
        ],
        [
            "+0.32%"
        ],
        [
            "192.92"
        ],
        [
            "74.49"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "51"
        ],
        [
            "10°22′22″N 124°44′54″E﻿ / ﻿10.3728°N 124.7483°E﻿ / 10.3728; 124.7483﻿ (Hilongos)"
        ],
        [
            "Hindang"
        ],
        [
            "5th"
        ],
        [
            "1.2%"
        ],
        [
            "20,849"
        ],
        [
            "20,924"
        ],
        [
            "−0.07%"
        ],
        [
            "50.04"
        ],
        [
            "19.32"
        ],
        [
            "420"
        ],
        [
            "1,100"
        ],
        [
            "20"
        ],
        [
            "10°26′02″N 124°43′35″E﻿ / ﻿10.4338°N 124.7263°E﻿ / 10.4338; 124.7263﻿ (Hindang)"
        ],
        [
            "Inopacan"
        ],
        [
            "5th"
        ],
        [
            "1.2%"
        ],
        [
            "21,389"
        ],
        [
            "20,550"
        ],
        [
            "+0.76%"
        ],
        [
            "94.62"
        ],
        [
            "36.53"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "20"
        ],
        [
            "10°29′57″N 124°44′22″E﻿ / ﻿10.4993°N 124.7395°E﻿ / 10.4993; 124.7395﻿ (Inopacan)"
        ],
        [
            "Isabel"
        ],
        [
            "4th"
        ],
        [
            "2.6%"
        ],
        [
            "46,781"
        ],
        [
            "46,915"
        ],
        [
            "−0.05%"
        ],
        [
            "64.01"
        ],
        [
            "24.71"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "24"
        ],
        [
            "10°55′30″N 124°26′18″E﻿ / ﻿10.9250°N 124.4383°E﻿ / 10.9250; 124.4383﻿ (Isabel)"
        ],
        [
            "Jaro"
        ],
        [
            "6th"
        ],
        [
            "2.5%"
        ],
        [
            "43,758"
        ],
        [
            "43,199"
        ],
        [
            "+0.25%"
        ],
        [
            "207.19"
        ],
        [
            "80.00"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "46"
        ],
        [
            "11°11′19″N 124°46′56″E﻿ / ﻿11.1886°N 124.7822°E﻿ / 11.1886; 124.7822﻿ (Jaro)"
        ],
        [
            "Javier (Bugho)"
        ],
        [
            "5th"
        ],
        [
            "1.5%"
        ],
        [
            "26,658"
        ],
        [
            "25,379"
        ],
        [
            "+0.94%"
        ],
        [
            "152.70"
        ],
        [
            "58.96"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "28"
        ],
        [
            "10°47′39″N 124°56′10″E﻿ / ﻿10.7941°N 124.9361°E﻿ / 10.7941; 124.9361﻿ (Javier)"
        ],
        [
            "Julita"
        ],
        [
            "2nd"
        ],
        [
            "0.9%"
        ],
        [
            "15,598"
        ],
        [
            "15,114"
        ],
        [
            "+0.60%"
        ],
        [
            "53.30"
        ],
        [
            "20.58"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "26"
        ],
        [
            "10°58′22″N 124°57′44″E﻿ / ﻿10.9729°N 124.9621°E﻿ / 10.9729; 124.9621﻿ (Julita)"
        ],
        [
            "Kananga"
        ],
        [
            "4th"
        ],
        [
            "3.4%"
        ],
        [
            "59,696"
        ],
        [
            "56,575"
        ],
        [
            "+1.03%"
        ],
        [
            "144.20"
        ],
        [
            "55.68"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "23"
        ],
        [
            "11°11′07″N 124°33′38″E﻿ / ﻿11.1852°N 124.5606°E﻿ / 11.1852; 124.5606﻿ (Kananga)"
        ],
        [
            "La Paz"
        ],
        [
            "2nd"
        ],
        [
            "1.1%"
        ],
        [
            "19,174"
        ],
        [
            "19,998"
        ],
        [
            "−0.80%"
        ],
        [
            "72.70"
        ],
        [
            "28.07"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "35"
        ],
        [
            "10°53′27″N 124°57′27″E﻿ / ﻿10.8909°N 124.9576°E﻿ / 10.8909; 124.9576﻿ (La Paz)"
        ],
        [
            "Leyte"
        ],
        [
            "3rd"
        ],
        [
            "2.3%"
        ],
        [
            "40,397"
        ],
        [
            "40,639"
        ],
        [
            "−0.11%"
        ],
        [
            "181.26"
        ],
        [
            "69.98"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "30"
        ],
        [
            "11°22′12″N 124°29′12″E﻿ / ﻿11.3701°N 124.4868°E﻿ / 11.3701; 124.4868﻿ (Leyte)"
        ],
        [
            "MacArthur"
        ],
        [
            "2nd"
        ],
        [
            "1.2%"
        ],
        [
            "21,578"
        ],
        [
            "21,211"
        ],
        [
            "+0.33%"
        ],
        [
            "57.57"
        ],
        [
            "22.23"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "31"
        ],
        [
            "10°50′05″N 124°59′47″E﻿ / ﻿10.8347°N 124.9963°E﻿ / 10.8347; 124.9963﻿ (MacArthur)"
        ],
        [
            "Mahaplag"
        ],
        [
            "5th"
        ],
        [
            "1.6%"
        ],
        [
            "27,865"
        ],
        [
            "27,823"
        ],
        [
            "+0.03%"
        ],
        [
            "104.79"
        ],
        [
            "40.46"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "28"
        ],
        [
            "10°36′16″N 124°57′56″E﻿ / ﻿10.6045°N 124.9655°E﻿ / 10.6045; 124.9655﻿ (Mahaplag)"
        ],
        [
            "Matag-ob"
        ],
        [
            "4th"
        ],
        [
            "1.0%"
        ],
        [
            "17,522"
        ],
        [
            "18,373"
        ],
        [
            "−0.90%"
        ],
        [
            "104.40"
        ],
        [
            "40.31"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "21"
        ],
        [
            "11°08′47″N 124°28′22″E﻿ / ﻿11.1465°N 124.4729°E﻿ / 11.1465; 124.4729﻿ (Matag-ob)"
        ],
        [
            "Matalom"
        ],
        [
            "5th"
        ],
        [
            "1.8%"
        ],
        [
            "32,586"
        ],
        [
            "33,121"
        ],
        [
            "−0.31%"
        ],
        [
            "132.00"
        ],
        [
            "50.97"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "30"
        ],
        [
            "10°16′59″N 124°47′16″E﻿ / ﻿10.2831°N 124.7877°E﻿ / 10.2831; 124.7877﻿ (Matalom)"
        ],
        [
            "Mayorga"
        ],
        [
            "2nd"
        ],
        [
            "1.0%"
        ],
        [
            "18,071"
        ],
        [
            "17,161"
        ],
        [
            "+0.99%"
        ],
        [
            "42.17"
        ],
        [
            "16.28"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "16"
        ],
        [
            "10°54′10″N 125°00′21″E﻿ / ﻿10.9028°N 125.0059°E﻿ / 10.9028; 125.0059﻿ (Mayorga)"
        ],
        [
            "Merida"
        ],
        [
            "4th"
        ],
        [
            "1.8%"
        ],
        [
            "31,574"
        ],
        [
            "29,863"
        ],
        [
            "+1.07%"
        ],
        [
            "95.21"
        ],
        [
            "36.76"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "22"
        ],
        [
            "10°54′32″N 124°32′17″E﻿ / ﻿10.9088°N 124.5380°E﻿ / 10.9088; 124.5380﻿ (Merida)"
        ],
        [
            "Ormoc"
        ],
        [
            "^"
        ],
        [
            "4th"
        ],
        [
            "13.0%"
        ],
        [
            "230,998"
        ],
        [
            "215,031"
        ],
        [
            "+1.37%"
        ],
        [
            "613.60"
        ],
        [
            "236.91"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "110"
        ],
        [
            "11°00′16″N 124°36′27″E﻿ / ﻿11.0044°N 124.6075°E﻿ / 11.0044; 124.6075﻿ (Ormoc)"
        ],
        [
            "Palo"
        ],
        [
            "1st"
        ],
        [
            "4.3%"
        ],
        [
            "76,213"
        ],
        [
            "70,052"
        ],
        [
            "+1.62%"
        ],
        [
            "221.27"
        ],
        [
            "85.43"
        ],
        [
            "340"
        ],
        [
            "880"
        ],
        [
            "33"
        ],
        [
            "11°09′36″N 124°59′24″E﻿ / ﻿11.1600°N 124.9901°E﻿ / 11.1600; 124.9901﻿ (Palo)"
        ],
        [
            "Palompon"
        ],
        [
            "4th"
        ],
        [
            "3.3%"
        ],
        [
            "58,313"
        ],
        [
            "58,108"
        ],
        [
            "+0.07%"
        ],
        [
            "126.07"
        ],
        [
            "48.68"
        ],
        [
            "460"
        ],
        [
            "1,200"
        ],
        [
            "50"
        ],
        [
            "11°03′00″N 124°23′13″E﻿ / ﻿11.0501°N 124.3869°E﻿ / 11.0501; 124.3869﻿ (Palompon)"
        ],
        [
            "Pastrana"
        ],
        [
            "6th"
        ],
        [
            "1.1%"
        ],
        [
            "19,359"
        ],
        [
            "18,002"
        ],
        [
            "+1.39%"
        ],
        [
            "86.35"
        ],
        [
            "33.34"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "29"
        ],
        [
            "11°08′12″N 124°53′10″E﻿ / ﻿11.1367°N 124.8861°E﻿ / 11.1367; 124.8861﻿ (Pastrana)"
        ],
        [
            "San Isidro"
        ],
        [
            "3rd"
        ],
        [
            "1.7%"
        ],
        [
            "30,722"
        ],
        [
            "31,641"
        ],
        [
            "−0.56%"
        ],
        [
            "122.50"
        ],
        [
            "47.30"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "19"
        ],
        [
            "11°24′19″N 124°21′08″E﻿ / ﻿11.4054°N 124.3523°E﻿ / 11.4054; 124.3523﻿ (San Isidro)"
        ],
        [
            "San Miguel"
        ],
        [
            "1st"
        ],
        [
            "1.1%"
        ],
        [
            "19,753"
        ],
        [
            "19,420"
        ],
        [
            "+0.32%"
        ],
        [
            "145.11"
        ],
        [
            "56.03"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "21"
        ],
        [
            "11°17′36″N 124°49′54″E﻿ / ﻿11.2934°N 124.8318°E﻿ / 11.2934; 124.8318﻿ (San Miguel)"
        ],
        [
            "Santa Fe"
        ],
        [
            "1st"
        ],
        [
            "1.2%"
        ],
        [
            "22,102"
        ],
        [
            "20,439"
        ],
        [
            "+1.50%"
        ],
        [
            "53.97"
        ],
        [
            "20.84"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "20"
        ],
        [
            "11°11′09″N 124°54′55″E﻿ / ﻿11.1858°N 124.9154°E﻿ / 11.1858; 124.9154﻿ (Santa Fe)"
        ],
        [
            "Tabango"
        ],
        [
            "3rd"
        ],
        [
            "1.9%"
        ],
        [
            "33,868"
        ],
        [
            "34,195"
        ],
        [
            "−0.18%"
        ],
        [
            "96.62"
        ],
        [
            "37.31"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "13"
        ],
        [
            "11°18′23″N 124°22′19″E﻿ / ﻿11.3064°N 124.3719°E﻿ / 11.3064; 124.3719﻿ (Tabango)"
        ],
        [
            "Tabontabon"
        ],
        [
            "2nd"
        ],
        [
            "0.7%"
        ],
        [
            "11,902"
        ],
        [
            "11,204"
        ],
        [
            "+1.16%"
        ],
        [
            "24.18"
        ],
        [
            "9.34"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "16"
        ],
        [
            "11°02′30″N 124°57′52″E﻿ / ﻿11.0418°N 124.9644°E﻿ / 11.0418; 124.9644﻿ (Tabontabon)"
        ],
        [
            "Tacloban"
        ],
        [
            "‡"
        ],
        [
            "1st"
        ],
        [
            "—"
        ],
        [
            "251,881"
        ],
        [
            "242,089"
        ],
        [
            "+0.76%"
        ],
        [
            "201.72"
        ],
        [
            "77.88"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "138"
        ],
        [
            "11°14′35″N 125°00′29″E﻿ / ﻿11.2430°N 125.0081°E﻿ / 11.2430; 125.0081﻿ (Tacloban)"
        ],
        [
            "Tanauan"
        ],
        [
            "1st"
        ],
        [
            "3.2%"
        ],
        [
            "57,455"
        ],
        [
            "55,021"
        ],
        [
            "+0.83%"
        ],
        [
            "78.41"
        ],
        [
            "30.27"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "54"
        ],
        [
            "11°06′34″N 125°01′14″E﻿ / ﻿11.1094°N 125.0206°E﻿ / 11.1094; 125.0206﻿ (Tanauan)"
        ],
        [
            "Tolosa"
        ],
        [
            "1st"
        ],
        [
            "1.2%"
        ],
        [
            "20,708"
        ],
        [
            "20,978"
        ],
        [
            "−0.25%"
        ],
        [
            "22.54"
        ],
        [
            "8.70"
        ],
        [
            "920"
        ],
        [
            "2,400"
        ],
        [
            "15"
        ],
        [
            "11°03′41″N 125°02′14″E﻿ / ﻿11.0614°N 125.0371°E﻿ / 11.0614; 125.0371﻿ (Tolosa)"
        ],
        [
            "Tunga"
        ],
        [
            "6th"
        ],
        [
            "0.4%"
        ],
        [
            "7,656"
        ],
        [
            "7,584"
        ],
        [
            "+0.18%"
        ],
        [
            "7.70"
        ],
        [
            "2.97"
        ],
        [
            "990"
        ],
        [
            "2,600"
        ],
        [
            "8"
        ],
        [
            "11°14′54″N 124°45′09″E﻿ / ﻿11.2483°N 124.7524°E﻿ / 11.2483; 124.7524﻿ (Tunga)"
        ],
        [
            "Villaba"
        ],
        [
            "3rd"
        ],
        [
            "2.4%"
        ],
        [
            "42,859"
        ],
        [
            "41,891"
        ],
        [
            "+0.44%"
        ],
        [
            "150.31"
        ],
        [
            "58.04"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "35"
        ],
        [
            "11°12′47″N 124°23′36″E﻿ / ﻿11.2130°N 124.3932°E﻿ / 11.2130; 124.3932﻿ (Villaba)"
        ],
        [
            "Total"
        ],
        [
            "1,776,847"
        ],
        [
            "1,724,679"
        ],
        [
            "+0.57%"
        ],
        [
            "6,313.33"
        ],
        [
            "2,437.59"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "1,503"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Former names are italicized.^ Coordinates mark the city/town center, and are sortable by latitude^ Total figures include the independent component city of Ormoc, and exclude the highly urbanized city of Tacloban."
        ],
        [
            "Demographics"
        ],
        [
            "Leyte Sports Development Center"
        ],
        [
            "Population census of Leyte (province)YearPop.±% p.a.1903 294,892—    1918 440,328+2.71%1939 688,934+2.15%1948 751,649+0.97%1960 876,079+1.28%1970 1,020,128+1.53%1975 1,099,848+1.52%1980 1,191,227+1.61%1990 1,367,816+1.39%1995 1,511,251+1.89%2000 1,592,336+1.13%2007 1,724,240+1.10%2010 1,567,984−3.40%2015 1,724,679+1.83%2020 1,776,847+0.59%(excluding Tacloban City)Source: Philippine Statistics Authority"
        ],
        [
            "The population of Leyte in the 2020 census was 1,776,847 people, with a density of 280 inhabitants per square kilometre or 730 inhabitants per square mile.",
            "When Tacloban is included for geographical purposes, the population comes to 1,966,768 people, with a density of 302/km2 (782/sq mi)."
        ],
        [
            "The people of Leyte province are subdivided into two closely related Visayan ethnolinguistic groups.",
            "In the northern, central and eastern parts are the Warays and in the western part are the Cebuanos."
        ],
        [
            "Tacloban-Waray dialect is considered as the standard form of Waray language and is used as the de facto lingua franca in both Leyte and Samar Islands.",
            "Aside from Cebuano and Waray, most Leyteños can also speak and understand Filipino and English.",
            "Some students who have studied the Spanish language and a few descendants of Spanish colonists can also speak and understand Spanish."
        ],
        [
            "Leyte is predominantly a Roman Catholic Christian province.",
            "The 2000 census stated that 97% of Leyte's population adhered to Roman Catholicism, one of the highest percentages in the Visayas.",
            "The remaining 3% were adherents of other different Christian denominations and sects, such as the indigenous Iglesia ni Cristo, the Kingdom of Jesus Christ and Members Church of God International, popularly known as Ang Dating Daan, and many other foreign religious groups like the Mormons, Born Again Christians, Baptists, Pentecostals, Seventh-Day Adventists (Sabadistas), and many more."
        ],
        [
            "Islam is also present in the province and concentrated in the metropolitan Tacloban area.",
            "It comprises 0.3% of Tacloban City's population, and its adherents are mainly the Maranao people and other Moro migrants from Mindanao who work mostly as traders."
        ],
        [
            "Official provincial seal"
        ],
        [
            "The upper portion is a perspective of the national Freedom Park commemorating the landing of General Douglas MacArthur and the American Liberation Forces in Leyte during World War II.",
            "The white cross represents the 2nd phase of Leyte's development when Magellan stopped here on his way to Cebu.",
            "The alphabet on the cross argent is the ancient Visayan paleographic syllabary of the letter L which stands for Leyte.",
            "The stars around the inner circle symbolize the forty-one towns of Leyte and the everlasting flame symbolizes the soldiers who died during World War II."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Leyte"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  38.42"
        ],
        [
            "2009  36.31"
        ],
        [
            "2012  39.24"
        ],
        [
            "2015  32.80"
        ],
        [
            "2018  28.22"
        ],
        [
            "2021  20.80"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "The economy of Leyte is a mixed agriculture, fishing, industrial, energy and mining.",
            "Rice is farmed in the lowland plains areas specifically those around Tacloban, while coconut farming, is the main cash crop in upland and mountainous areas.",
            "Sugarcane plantation is no.",
            "1 produce in Ormoc City.",
            "Since Leyte is an island province, fishing is a major source of livelihood among coastal residents."
        ],
        [
            "The province is the site of the largest geothermal power plant in Asia, making it one of the resource-rich provinces of the Philippines.",
            "Excess energy of the numerous powerplants in the geothermal valley that generate electricity is supplied to the national grid that adds to the energy demand in Luzon and Mindanao.",
            "Mining industry has started to pick up in the province with the exploration in MacArthur.",
            "The iron smelting in Isabel has been operational for more than 20 years since its inception."
        ],
        [
            "Leyte ICT Park"
        ],
        [
            "The Leyte Information Communications Technology (ICT) Park is one of the economic zones approved by the Philippine Economic Zone Authority (PEZA).",
            "Located at Pawing, Palo, Leyte, the 6.8 facility hosts two business process outsourcing (BPO) companies, namely, the Expert Global Solutions (EGS) Company (formerly APAC Customer Services, Inc.) and ACUDATA, Inc. (a financial and data services BPO).",
            "However, EGS decided to fully close its operations after its facility was destroyed by Typhoon Haiyan in 2013."
        ],
        [
            "Leyte is emerging to be an ICT-BPO Hub for Eastern Visayas."
        ],
        [
            "Transportation"
        ],
        [
            "Leyte is connected by air with its only commercial airport located in Tacloban City.",
            "Daniel Z. Romualdez Airport, which is one of the busiest airports in the Philippines, is served by three major airlines, Philippine Airlines, Cebu Pacific and AirAsia.",
            "Tacloban Airport primarily serves connecting flights from major Philippine cities (Manila and Cebu)."
        ],
        [
            "Philtranco, which has a bus stop in Tacloban and Ormoc, operates a route along Manila-Maharlika highway, passing through Allen, Northern Samar in Samar Island (via ferry boat) from Matnog, Sorsogon in Bicol region."
        ],
        [
            "Commercial seaport is of vital importance.",
            "Major ports of the province are located at Ormoc City, in the south and Tacloban City, in the north.",
            "Small ports are also located in Palompon, San Isidro, Bato, Hilongos and Baybay."
        ],
        [
            "See also"
        ],
        [
            "Manuel Artigas"
        ],
        [
            "Ruy López de Villalobos"
        ],
        [
            "References"
        ],
        [
            "^ Archdiocese of Palo Archived 2012-02-14 at the Wayback Machine Accessed August 24, 2013"
        ],
        [
            "^ \"List of Provinces\".",
            "Makati, Philippines.",
            "Archived from the original on 17 January 2013.",
            "Retrieved 12 June 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ Lancion, Conrado M. Jr. (1995).",
            "\"The Provinces; Leyte\".",
            "Fast Facts about Philippine Provinces.",
            "cartography by de Guzman, Rey (The 2000 Millenium ed.).",
            "Makati, Metro Manila, Philippines: Tahanan Books.",
            "p. 96.",
            "ISBN 971-630-037-9.",
            "Retrieved 26 December 2015."
        ],
        [
            "^ \"Leyte | island, Philippines\".",
            "20 June 2023."
        ],
        [
            "^ \"Republic Act No.",
            "2227 - An Act Creating the Province of Southern Leyte\".",
            "The LawPhil Project.",
            "22 May 1959.",
            "Retrieved 16 April 2016."
        ],
        [
            "^ a b c \"Province: Leyte (province)\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ Pulta, Benjamin B.",
            "(23 December 2009).",
            "\"SC reverses self, upholds creation of 16 cities\".",
            "The Daily Tribune.",
            "Archived from the original on 8 May 2010.",
            "Retrieved 25 December 2015."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region VIII (Eastern Visayas)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region VIII (Eastern Visayas)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"IT Parks/Centers\".",
            "Philippine Economic Zone Authority.",
            "Archived from the original on 21 November 2011.",
            "Retrieved 16 April 2016."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Leyte travel guide from Wikivoyage"
        ],
        [
            " Media related to Leyte (province) at Wikimedia Commons"
        ],
        [
            " Geographic data related to Leyte (province) at OpenStreetMap"
        ],
        [
            "Official Website of Leyte Province"
        ],
        [
            "2007 Philippine Census Information"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Leyte (province)"
        ],
        [
            "Masbate / Samar Sea"
        ],
        [
            "Biliran"
        ],
        [
            "San Juanico Strait / Samar"
        ],
        [
            "Cebu / Camotes Sea"
        ],
        [
            "Leyte"
        ],
        [
            "Leyte Gulf"
        ],
        [
            "Bohol / Camotes Sea"
        ],
        [
            "Southern Leyte"
        ],
        [
            "vte Province of LeyteTacloban (capital and largest city)Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Babatngon"
        ],
        [
            "Barugo"
        ],
        [
            "Bato"
        ],
        [
            "Burauen"
        ],
        [
            "Calubian"
        ],
        [
            "Capoocan"
        ],
        [
            "Carigara"
        ],
        [
            "Dagami"
        ],
        [
            "Dulag"
        ],
        [
            "Hilongos"
        ],
        [
            "Hindang"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "La Paz"
        ],
        [
            "Leyte"
        ],
        [
            "MacArthur"
        ],
        [
            "Mahaplag"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Mayorga"
        ],
        [
            "Merida"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pastrana"
        ],
        [
            "San Isidro"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Fe"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Tanauan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tunga"
        ],
        [
            "Villaba"
        ],
        [
            "Component city"
        ],
        [
            "Baybay"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban (Administratively independent from the province but grouped under Leyte by the Philippine Statistics Authority.)"
        ],
        [
            "Articles related to Leyte"
        ],
        [
            "vteEastern Visayas (Region VIII)Regional center"
        ],
        [
            "Tacloban"
        ],
        [
            "Provinces"
        ],
        [
            "Biliran"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Leyte"
        ],
        [
            "Northern Samar"
        ],
        [
            "Samar"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Tacloban"
        ],
        [
            "Independent component city"
        ],
        [
            "Ormoc"
        ],
        [
            "Component cities"
        ],
        [
            "Baybay"
        ],
        [
            "Borongan"
        ],
        [
            "Calbayog"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Borongan"
        ],
        [
            "Catarman"
        ],
        [
            "Catbalogan"
        ],
        [
            "Maasin"
        ],
        [
            "Naval"
        ],
        [
            "Tacloban"
        ],
        [
            "Municipalities"
        ],
        [
            "Abuyog"
        ],
        [
            "Alangalang"
        ],
        [
            "Albuera"
        ],
        [
            "Allen"
        ],
        [
            "Almagro"
        ],
        [
            "Almeria"
        ],
        [
            "Anahawan"
        ],
        [
            "Arteche"
        ],
        [
            "Babatngon"
        ],
        [
            "Balangiga"
        ],
        [
            "Balangkayan"
        ],
        [
            "Barugo"
        ],
        [
            "Basey"
        ],
        [
            "Bato"
        ],
        [
            "Biliran"
        ],
        [
            "Biri"
        ],
        [
            "Bobon"
        ],
        [
            "Bontoc"
        ],
        [
            "Burauen"
        ],
        [
            "Cabucgayan"
        ],
        [
            "Caibiran"
        ],
        [
            "Calbiga"
        ],
        [
            "Calubian"
        ],
        [
            "Can-avid"
        ],
        [
            "Capoocan"
        ],
        [
            "Capul"
        ],
        [
            "Carigara"
        ],
        [
            "Catarman"
        ],
        [
            "Catubig"
        ],
        [
            "Culaba"
        ],
        [
            "Dagami"
        ],
        [
            "Daram"
        ],
        [
            "Dolores"
        ],
        [
            "Dulag"
        ],
        [
            "Gamay"
        ],
        [
            "Gandara"
        ],
        [
            "General MacArthur"
        ],
        [
            "Giporlos"
        ],
        [
            "Guiuan"
        ],
        [
            "Hernani"
        ],
        [
            "Hilongos"
        ],
        [
            "Hinabangan"
        ],
        [
            "Hindang"
        ],
        [
            "Hinunangan"
        ],
        [
            "Hinundayan"
        ],
        [
            "Inopacan"
        ],
        [
            "Isabel"
        ],
        [
            "Jaro"
        ],
        [
            "Javier"
        ],
        [
            "Jiabong"
        ],
        [
            "Jipapad"
        ],
        [
            "Julita"
        ],
        [
            "Kananga"
        ],
        [
            "Kawayan"
        ],
        [
            "La Paz"
        ],
        [
            "Laoang"
        ],
        [
            "Lapinig"
        ],
        [
            "Las Navas"
        ],
        [
            "Lavezares"
        ],
        [
            "Lawaan"
        ],
        [
            "Leyte"
        ],
        [
            "Libagon"
        ],
        [
            "Liloan"
        ],
        [
            "Limasawa"
        ],
        [
            "Llorente"
        ],
        [
            "Lope de Vega"
        ],
        [
            "MacArthur"
        ],
        [
            "Macrohon"
        ],
        [
            "Mahaplag"
        ],
        [
            "Malitbog"
        ],
        [
            "Mapanas"
        ],
        [
            "Marabut"
        ],
        [
            "Maripipi"
        ],
        [
            "Maslog"
        ],
        [
            "Matag-ob"
        ],
        [
            "Matalom"
        ],
        [
            "Matuguinao"
        ],
        [
            "Maydolong"
        ],
        [
            "Mayorga"
        ],
        [
            "Mercedes"
        ],
        [
            "Merida"
        ],
        [
            "Mondragon"
        ],
        [
            "Motiong"
        ],
        [
            "Naval"
        ],
        [
            "Oras"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagsanghan"
        ],
        [
            "Palapag"
        ],
        [
            "Palo"
        ],
        [
            "Palompon"
        ],
        [
            "Pambujan"
        ],
        [
            "Paranas"
        ],
        [
            "Pastrana"
        ],
        [
            "Pinabacdao"
        ],
        [
            "Pintuyan"
        ],
        [
            "Quinapondan"
        ],
        [
            "Rosario"
        ],
        [
            "Saint Bernard"
        ],
        [
            "Salcedo"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro (Leyte)"
        ],
        [
            "San Isidro (Northern Samar)"
        ],
        [
            "San Jorge"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose de Buan"
        ],
        [
            "San Juan"
        ],
        [
            "San Julian"
        ],
        [
            "San Miguel"
        ],
        [
            "San Policarpo"
        ],
        [
            "San Ricardo"
        ],
        [
            "San Roque"
        ],
        [
            "San Sebastian"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Margarita"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Niño"
        ],
        [
            "Silago"
        ],
        [
            "Silvino Lobos"
        ],
        [
            "Sogod"
        ],
        [
            "Sulat"
        ],
        [
            "Tabango"
        ],
        [
            "Tabontabon"
        ],
        [
            "Taft"
        ],
        [
            "Tagapul-an"
        ],
        [
            "Talalora"
        ],
        [
            "Tanauan"
        ],
        [
            "Tarangnan"
        ],
        [
            "Tolosa"
        ],
        [
            "Tomas Oppus"
        ],
        [
            "Tunga"
        ],
        [
            "Victoria"
        ],
        [
            "Villaba"
        ],
        [
            "Villareal"
        ],
        [
            "Zumarraga"
        ],
        [
            "Visayas, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Other"
        ],
        [
            "NARA"
        ],
        [
            "IdRef"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Leyte_(province)&oldid=1230339909\""
        ],
        [
            "Categories: Leyte (province)Provinces of the PhilippinesProvinces of Eastern VisayasStates and territories established in 17351735 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasWebarchive template wayback linksArticles with short descriptionShort description is different from WikidataCoordinates on WikidataPages using infobox settlement with possible demonym listArticles containing Waray (Philippines)-language textArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersArticles with NARA identifiersArticles with SUDOC identifiersPages using the Kartographer extension"
        ]
    ]
}