{
    "name": "Masbate",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Masbate"
        ],
        [
            "44 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीHrvatskiIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuMagyarМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray粵語中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 12°16′N 123°35′E﻿ / ﻿12.27°N 123.58°E﻿ / 12.27; 123.58"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Bicol, Philippines"
        ],
        [
            "This article is about the province.",
            "For its capital city, see Masbate City.",
            "For the major eponymous island of the province, see Masbate Island."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Masbate\" – news · newspapers · books · scholar · JSTOR (January 2013) (Learn how and when to remove this message)"
        ],
        [
            "Province in Bicol Region, PhilippinesMasbateProvinceProvince of Masbate(from top: left to right) Masbate Port, Balangingi Island in Pio V. Corpus, Bituon Beach in Mobo, and Gawas Beach in Esperanza"
        ],
        [
            "FlagSealLocation within the PhilippinesOpenStreetMapCoordinates: 12°16′N 123°35′E﻿ / ﻿12.27°N 123.58°E﻿ / 12.27; 123.58CountryPhilippinesRegionBicol RegionFoundedMarch 18, 1901Capitaland largest cityMasbate CityGovernment • GovernorAntonio T. Kho (PDP-Laban) • Vice GovernorElisa T. Kho (PDP-Laban)Area • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " Masbate City"
        ],
        [
            " • Municipalities"
        ],
        [
            "20"
        ],
        [
            " Aroroy"
        ],
        [
            " Baleno"
        ],
        [
            " Balud"
        ],
        [
            " Batuan"
        ],
        [
            " Cataingan"
        ],
        [
            " Cawayan"
        ],
        [
            " Claveria"
        ],
        [
            " Dimasalang"
        ],
        [
            " Esperanza"
        ],
        [
            " Mandaon"
        ],
        [
            " Milagros"
        ],
        [
            " Mobo"
        ],
        [
            " Monreal"
        ],
        [
            " Palanas"
        ],
        [
            " Pio V. Corpus"
        ],
        [
            " Placer"
        ],
        [
            " San Fernando"
        ],
        [
            " San Jacinto"
        ],
        [
            " San Pascual"
        ],
        [
            " Uson"
        ],
        [
            " • Barangays550 • DistrictsLegislative districts of MasbateTime zoneUTC+8 (PST)ZIP Code5400–5421IDD : area code +63 (0)56ISO 3166 codePH-MASSpoken languagesMasbateñoWarayHiligaynonBikolCebuanoFilipino (Tagalog)EnglishWebsitemasbate.gov.ph"
        ],
        [
            "Masbate, officially the Province of Masbate (Masbateño: Probinsya san Masbate; Tagalog: Lalawigan ng Masbate), is an island province in the Philippines located near the midsection of the nation's archipelago.",
            "Its provincial capital is Masbate City.",
            "The province consists of three major islands: Masbate, Ticao and Burias."
        ],
        [
            "Masbate is at the crossroads of two island groups: Visayas and Luzon.",
            "It is politically part of Bicol Region in the latter.",
            "However, from a bio-geographic and socio-ethno-linguistic perspective, Masbate is grouped in the former."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Masbate is one of the oldest settlements in the Philippines.",
            "Archaeological records show that Batungan (in Mandaon) and Bagumbayan (in Palanas) were major settlement sites during the Bronze Age (4000-1000 BC).",
            "The development of bronze metallurgy in South-East Asia coincided with an increasingly hierarchical society, firmly based on agricultural village settlements.",
            "It was these crucial changes, the introduction of new technologies, new social forms, and a new economic base, which culminated in the foundation of the proto-urban settlements of the 1st millennium AD.",
            "A fine stone chisel from Mount Batungan is dated to the twelfth century BC.",
            "Of the age of Philippine neoliths, it is only possible to say that polished stone adzes from Masbate have been dated from 2710 BC to AD 179.2 Kalanay (in Aroroy) was an island site from 1000 BC to AD 850 (early metal).",
            "Masbateño burial jars and a small pottery skull box found in caves dated to the beginning of the Christian era.",
            "Exquisite goldwork represents an old Philippine wealth in both an economic and an artistic sense: all sorts of wrought or molded ornaments and jewelry demonstrate both the availability of the raw material and the skill of the artisan – finger rings, earrings, head-bands, pendants, and pectoral ornaments, heavy chains with interlocking serrated edges, light filigree work, delicate necklaces of fine twisted wires, 12-millimeter beads composed of 184 separate granules soldered together, thin hammered sheets for decorating grosser objects like earplugs or the visages of corpses, and a charming little snail of unknown use.",
            "Productive mines in Benguet, Butuan, Masbate, and Paracale were in operation and gold being panned in riverbeds all over the archipelago when the Spaniards arrived."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "During the Spanish regime, San Jacinto in Ticao Island was an anchorage point for the Manila-Acapulco-Manila galleons.",
            "The course as described by the standard pilot's guide of Cabrera Bueno was substantially followed by nearly all the galleons.",
            "The largest variations were in the height at which the eastward crossing was made and in the course laid off the coast of the Californias."
        ],
        [
            "The successive stages were as follows: from Cavite on Manila Bay out through one of the bocas, generally between Mariveles and Corregidor; thence SSW, keeping well clear of Fortun to the left and high Ambil to the right; past Cape Santiago on the Luzon Coast, and E between Mindoro and Maricaban; by the Punta de Escarceo, or “Tide Rip Point,” where currents run strong, and under Isla Verde, outside Subaang Bay, within which there was a fair anchorage in case of need; SE past the islets of Baco, with a good channel off Calapan; SE by E down the Mindoro coast by Punta Gorda de Pola; E by SE between the Tres Reyes and the Dos Hermanas; thence by the wide bocanabetween Marinduque and Banton, out onto the tablazo, or open water, above Sibuyan; SE by E between Burias and Masbate; turning ENE around the Punta de San Miguel and the Punta del Diablo; coasting around the east side of Ticao to the anchorage at San Jacinto; clearing from thence and working out seaward with the monsoon; E right leagues, with the dangerous Naranjos to starboard and the shoal of Calantas to port; NE by N and then ENE seven leagues around Capul; NE with the Sorsogon coast to port and San Bernardino to starboard and NE by E seven leagues to the Embocadero, with San Bernardino now to port and the island of Biri to starboard.",
            "At this point, according to Cabrera, “the rapid currents require skillful pilot work.” The galleon was now in the open sea."
        ],
        [
            "From the chronicles of the early years of Spanish colonization, a relacion (report) about Masbate first appeared in Fray Martin de Rada's letter dated July 1569 to the Viceroy of New Spain (Mexico), Marquis de Falces.",
            "He mentioned that in a place called Masbat there were plenty of gold mines.",
            "Other later documents such as Artieda's Relacion (1573) and Andres de Mirandaola's letter (1574) refer to a place called Masbat or Masbad.",
            "It wasn't until 1582 that Miguel de Loarca wrote about a place called Masbate."
        ],
        [
            "In the same year that the Augustinian Fray de Rada wrote about Masbat's gold mines, his fellow Augustinian Fray Alonzo Jimenez landed in Burias and baptized its chieftain Buaya.",
            "This baptism is said to be the very first baptism in Luzon.",
            "Fray Jimenez also built a church in Burias before he sailed on to Ibalon in 1570.",
            "By 1575, Masbate had become a priority in the Augustinian Missionary Memoranda.",
            "Fray Francisco de Ortega reported on the pillaging activities of a pirate named Caxabic in the islands of Masbate and Burias.",
            "By 1600, the Spaniards had developed Mobo as a galleon shipyard and San Jacinto as a strategic port.",
            "In 1605, Masbate was officially an Augustinian Mission and it is first prior was Fray Francisco Guerrero.",
            "Masbate had about 250 tributes and 1000 Christian natives.",
            "In 1609, Fray Pedro de Arce, bishop-elect of Nueva Caceres, ceded the spiritual administration of Masbate to the Mitra (secular clergy).",
            "On May 28, 1682, bishop-elect Dominican Fray Andres Gonzales petitioned the King of Spain to revert some curacies of Nueva Caceres to the charge of religious communities.",
            "The petition was approved in 1685 and by 1687, the first Augustinian Recollect missionaries had sailed for the port of San Jacinto to begin the Recollect Mission in Masbate.",
            "In 1700, Fray Ildefonso de la Concepcion established the settlement of Uson as a visita (barrio) of Mobo.",
            "The town of Masbate was established in 1791 by Fray Manuel dela Virgen del Tremedal."
        ],
        [
            "The jurisdiction of Nueva Caceres embraced the entire provinces of Camarines and Albay, as far as and including the islands of Ticao, Masbate, Burias, and Catanduanes; the province of Tayabas, as far as and including Lucban; and in the opposite coast of Maobàn, to Binangonan, Polo, Baler, and Casiguran.",
            "At one time, it was governed by his very illustrious Lordship Doctor Don Ysidoro de Arevalo, who was the bishop-elect.",
            "Records show that he enjoyed a yearly stipend of 4,000 pesos of common gold, in conformance with a royal decree.",
            "Likewise, a payment was made from the royal treasury, in virtue of a decree by the supreme government and the council of the royal treasury dated October 2, 1723, 200 pesos, for priests of the choir, at 100 pesos each, as assistants of the aforesaid illustrious lord.",
            "Another payment was made of 400 pesos, assigned to this church by the royal decree, dated at San Yldefonso on August 19, 1736; for the pay of singers, sacristans, and doorkeepers, and other expenses for worship and for the  building of the church.",
            "It likewise had a contribution of 232 pesos, 4 tomins, which was paid in 6 quintals of wax, 100 gantas of coconut-oil, and 4 arrobas of Castilian wine, in conformity with another royal decree dated February 21, 1705."
        ],
        [
            "The administration of Masbate was given back to the Mitra after the Recollects left Masbate in 1794.",
            "All in all, over 60 Recollect missionaries were assigned in Masbate for a period of more than 100 years.",
            "Masbate became a separate politico-military command province in 1846.",
            "In 1864, it was declared a separate province from Albay.",
            "After a devastating typhoon in 1908, Masbate was annexed to the province of Sorsogon.",
            "It finally gained status as a separate province on December 15, 1920, by virtue of Commonwealth Act No.",
            "2934.",
            "In Rafael Bernal's book: Mexico En Filipinas, Masbate was listed among other places which include Cavite and Pampanga, as areas where there were large concentrations of Mexican immigrants to the Philippines."
        ],
        [
            "20th century"
        ],
        [
            "During World War II, the Japanese invaded the Philippines and turned Masbate into a hub for sexual slavery which they called \"the military club\".",
            "A \"comfort station\" was built by the Japanese in the province, where young girls and teenagers were forced to become \"comfort women\", and routinely gang-raped, brutalized, humiliated, and murdered by Japanese soldiers for entertainment."
        ],
        [
            "Animasola Beach in Masbate"
        ],
        [
            "Geography"
        ],
        [
            "The province lies roughly at the center of the Philippine archipelago, between latitudes 11°43′ north and 123°09′ east and 124°5′ east.",
            "It is bounded on the north by Burias and Ticao Pass, east by San Bernardino Strait, south by the Visayan Sea, and west by the Sibuyan Sea.",
            "Relative to mainland Bicol, the province faces the southwestern coasts of Camarines Sur, Albay, and Sorsogon areas.",
            "Masbate covers a total area of 4,151.78 square kilometres (1,603.01 sq mi)."
        ],
        [
            "The general surface configuration of the province ranges from slightly undulating to rolling and from hilly to mountainous.",
            "In each island, the rugged topography is concentrated in the northeastern portion and gradually recedes to blunt hills and rolling areas in the south, southeast, and southwest."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Masbate comprises 20 municipalities and one city, all encompassed by 3 congressional districts."
        ],
        [
            " †  Provincial capital and component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Aroroy"
        ],
        [
            "2nd"
        ],
        [
            "9.7%"
        ],
        [
            "88,351"
        ],
        [
            "86,168"
        ],
        [
            "+0.48%"
        ],
        [
            "440.30"
        ],
        [
            "170.00"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "41"
        ],
        [
            "12°30′42″N 123°23′51″E﻿ / ﻿12.5118°N 123.3975°E﻿ / 12.5118; 123.3975﻿ (Aroroy)"
        ],
        [
            "Baleno"
        ],
        [
            "2nd"
        ],
        [
            "3.2%"
        ],
        [
            "28,855"
        ],
        [
            "26,096"
        ],
        [
            "+1.93%"
        ],
        [
            "204.38"
        ],
        [
            "78.91"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "24"
        ],
        [
            "12°28′26″N 123°29′51″E﻿ / ﻿12.4738°N 123.4975°E﻿ / 12.4738; 123.4975﻿ (Baleno)"
        ],
        [
            "Balud"
        ],
        [
            "2nd"
        ],
        [
            "4.4%"
        ],
        [
            "40,155"
        ],
        [
            "38,124"
        ],
        [
            "+0.99%"
        ],
        [
            "231.00"
        ],
        [
            "89.19"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "32"
        ],
        [
            "12°02′15″N 123°11′35″E﻿ / ﻿12.0376°N 123.1930°E﻿ / 12.0376; 123.1930﻿ (Balud)"
        ],
        [
            "Batuan"
        ],
        [
            "1st"
        ],
        [
            "1.6%"
        ],
        [
            "14,610"
        ],
        [
            "15,086"
        ],
        [
            "−0.61%"
        ],
        [
            "56.28"
        ],
        [
            "21.73"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "14"
        ],
        [
            "12°25′16″N 123°46′53″E﻿ / ﻿12.4211°N 123.7815°E﻿ / 12.4211; 123.7815﻿ (Batuan)"
        ],
        [
            "Cataingan"
        ],
        [
            "3rd"
        ],
        [
            "5.6%"
        ],
        [
            "50,623"
        ],
        [
            "50,327"
        ],
        [
            "+0.11%"
        ],
        [
            "191.64"
        ],
        [
            "73.99"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "36"
        ],
        [
            "12°00′01″N 123°59′48″E﻿ / ﻿12.0002°N 123.9966°E﻿ / 12.0002; 123.9966﻿ (Cataingan)"
        ],
        [
            "Cawayan"
        ],
        [
            "3rd"
        ],
        [
            "7.6%"
        ],
        [
            "69,265"
        ],
        [
            "67,033"
        ],
        [
            "+0.63%"
        ],
        [
            "260.19"
        ],
        [
            "100.46"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "37"
        ],
        [
            "11°55′42″N 123°46′08″E﻿ / ﻿11.9284°N 123.7689°E﻿ / 11.9284; 123.7689﻿ (Cawayan)"
        ],
        [
            "Claveria"
        ],
        [
            "1st"
        ],
        [
            "4.6%"
        ],
        [
            "42,142"
        ],
        [
            "43,693"
        ],
        [
            "−0.69%"
        ],
        [
            "182.98"
        ],
        [
            "70.65"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "22"
        ],
        [
            "12°54′10″N 123°14′45″E﻿ / ﻿12.9029°N 123.2457°E﻿ / 12.9029; 123.2457﻿ (Claveria)"
        ],
        [
            "Dimasalang"
        ],
        [
            "3rd"
        ],
        [
            "2.7%"
        ],
        [
            "24,909"
        ],
        [
            "26,192"
        ],
        [
            "−0.95%"
        ],
        [
            "148.07"
        ],
        [
            "57.17"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "20"
        ],
        [
            "12°11′32″N 123°51′32″E﻿ / ﻿12.1923°N 123.8590°E﻿ / 12.1923; 123.8590﻿ (Dimasalang)"
        ],
        [
            "Esperanza"
        ],
        [
            "3rd"
        ],
        [
            "1.9%"
        ],
        [
            "17,534"
        ],
        [
            "18,568"
        ],
        [
            "−1.09%"
        ],
        [
            "67.49"
        ],
        [
            "26.06"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "20"
        ],
        [
            "11°44′11″N 124°02′31″E﻿ / ﻿11.7365°N 124.0420°E﻿ / 11.7365; 124.0420﻿ (Esperanza)"
        ],
        [
            "Mandaon"
        ],
        [
            "2nd"
        ],
        [
            "4.9%"
        ],
        [
            "44,122"
        ],
        [
            "41,262"
        ],
        [
            "+1.28%"
        ],
        [
            "319.15"
        ],
        [
            "123.22"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "26"
        ],
        [
            "12°13′34″N 123°17′03″E﻿ / ﻿12.2262°N 123.2841°E﻿ / 12.2262; 123.2841﻿ (Mandaon)"
        ],
        [
            "Masbate City"
        ],
        [
            "†"
        ],
        [
            "2nd"
        ],
        [
            "11.5%"
        ],
        [
            "104,522"
        ],
        [
            "95,389"
        ],
        [
            "+1.76%"
        ],
        [
            "188.00"
        ],
        [
            "72.59"
        ],
        [
            "560"
        ],
        [
            "1,500"
        ],
        [
            "30"
        ],
        [
            "12°22′08″N 123°37′14″E﻿ / ﻿12.3689°N 123.6205°E﻿ / 12.3689; 123.6205﻿ (Masbate City)"
        ],
        [
            "Milagros"
        ],
        [
            "2nd"
        ],
        [
            "6.3%"
        ],
        [
            "57,538"
        ],
        [
            "57,473"
        ],
        [
            "+0.02%"
        ],
        [
            "565.30"
        ],
        [
            "218.26"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "27"
        ],
        [
            "12°13′06″N 123°30′30″E﻿ / ﻿12.2182°N 123.5082°E﻿ / 12.2182; 123.5082﻿ (Milagros)"
        ],
        [
            "Mobo"
        ],
        [
            "2nd"
        ],
        [
            "4.5%"
        ],
        [
            "40,823"
        ],
        [
            "38,813"
        ],
        [
            "+0.97%"
        ],
        [
            "143.47"
        ],
        [
            "55.39"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "29"
        ],
        [
            "12°20′18″N 123°39′32″E﻿ / ﻿12.3383°N 123.6588°E﻿ / 12.3383; 123.6588﻿ (Mobo)"
        ],
        [
            "Monreal"
        ],
        [
            "1st"
        ],
        [
            "2.8%"
        ],
        [
            "25,164"
        ],
        [
            "26,614"
        ],
        [
            "−1.06%"
        ],
        [
            "128.67"
        ],
        [
            "49.68"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "11"
        ],
        [
            "12°38′35″N 123°39′49″E﻿ / ﻿12.6430°N 123.6636°E﻿ / 12.6430; 123.6636﻿ (Monreal)"
        ],
        [
            "Palanas"
        ],
        [
            "3rd"
        ],
        [
            "3.0%"
        ],
        [
            "27,322"
        ],
        [
            "26,222"
        ],
        [
            "+0.79%"
        ],
        [
            "119.53"
        ],
        [
            "46.15"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "24"
        ],
        [
            "12°08′45″N 123°55′18″E﻿ / ﻿12.1459°N 123.9218°E﻿ / 12.1459; 123.9218﻿ (Palanas)"
        ],
        [
            "Pio V. Corpus"
        ],
        [
            "3rd"
        ],
        [
            "2.6%"
        ],
        [
            "23,744"
        ],
        [
            "23,236"
        ],
        [
            "+0.41%"
        ],
        [
            "89.33"
        ],
        [
            "34.49"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "18"
        ],
        [
            "11°53′01″N 124°02′59″E﻿ / ﻿11.8837°N 124.0498°E﻿ / 11.8837; 124.0498﻿ (Pio V. Corpus)"
        ],
        [
            "Placer"
        ],
        [
            "3rd"
        ],
        [
            "6.2%"
        ],
        [
            "56,340"
        ],
        [
            "55,826"
        ],
        [
            "+0.17%"
        ],
        [
            "193.03"
        ],
        [
            "74.53"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "35"
        ],
        [
            "11°52′05″N 123°54′43″E﻿ / ﻿11.8681°N 123.9120°E﻿ / 11.8681; 123.9120﻿ (Placer)"
        ],
        [
            "San Fernando"
        ],
        [
            "1st"
        ],
        [
            "2.4%"
        ],
        [
            "21,600"
        ],
        [
            "23,057"
        ],
        [
            "−1.24%"
        ],
        [
            "77.50"
        ],
        [
            "29.92"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "26"
        ],
        [
            "12°29′01″N 123°45′45″E﻿ / ﻿12.4835°N 123.7625°E﻿ / 12.4835; 123.7625﻿ (San Fernando)"
        ],
        [
            "San Jacinto"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "29,686"
        ],
        [
            "30,372"
        ],
        [
            "−0.43%"
        ],
        [
            "122.40"
        ],
        [
            "47.26"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "21"
        ],
        [
            "12°34′01″N 123°43′54″E﻿ / ﻿12.5669°N 123.7318°E﻿ / 12.5669; 123.7318﻿ (San Jacinto)"
        ],
        [
            "San Pascual"
        ],
        [
            "1st"
        ],
        [
            "4.9%"
        ],
        [
            "44,449"
        ],
        [
            "46,674"
        ],
        [
            "−0.93%"
        ],
        [
            "246.65"
        ],
        [
            "95.23"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "22"
        ],
        [
            "13°07′36″N 122°58′56″E﻿ / ﻿13.1267°N 122.9821°E﻿ / 13.1267; 122.9821﻿ (San Pascual)"
        ],
        [
            "Uson"
        ],
        [
            "3rd"
        ],
        [
            "6.3%"
        ],
        [
            "57,166"
        ],
        [
            "56,168"
        ],
        [
            "+0.34%"
        ],
        [
            "163.20"
        ],
        [
            "63.01"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "35"
        ],
        [
            "12°13′31″N 123°47′00″E﻿ / ﻿12.2253°N 123.7834°E﻿ / 12.2253; 123.7834﻿ (Uson)"
        ],
        [
            "Total"
        ],
        [
            "908,920"
        ],
        [
            "892,393"
        ],
        [
            "+0.35%"
        ],
        [
            "4,138.56"
        ],
        [
            "1,597.91"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "550"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of MasbateYearPop.±% p.a.1903 43,675—    1918 67,513+2.95%1939 182,483+4.85%1948 211,113+1.63%1960 335,971+3.95%1970 492,908+3.90%1975 533,387+1.60%1980 584,520+1.85%1990 599,355+0.25%1995 653,852+1.64%2000 707,668+1.71%2007 768,939+1.15%2010 834,650+3.03%2015 892,393+1.28%2020 908,920+0.36%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Masbate in the 2020 census was 908,920 people, with a density of 220 inhabitants per square kilometre or 570 inhabitants per square mile."
        ],
        [
            "Language"
        ],
        [
            "Languages Spoken (2000)"
        ],
        [
            "Language"
        ],
        [
            "Speakers in '000"
        ],
        [
            "Masbateño"
        ],
        [
            "500"
        ],
        [
            "Hiligaynon"
        ],
        [
            "328"
        ],
        [
            "Cebuano"
        ],
        [
            "68"
        ],
        [
            "Waray"
        ],
        [
            "26"
        ],
        [
            "There are four Visayan languages and one from Luzon, spoken in the province."
        ],
        [
            "Masbateño or Minasbaté is a Visayan language unique to the province.",
            "It has 75-83% mutual intelligibility with Hiligaynon, another Visayan language spoken in the southwestern tip of Masbate island.",
            "Cebuano is another Visayan language spoken in the southeastern municipalities in the island.",
            "Waray is spoken in the islands of Ticao Island due to their proximity to mainland Northern Samar, especially to the southern portion parts of the Province of Sorsogon where Waray Sorsogon is spoken."
        ],
        [
            "Minasbaté is spoken in Masbate City and its neighboring municipalities.",
            "33% of the population speaks Hiligaynon and it is spoken mainly in the towns of Balud, Mandaon and the southwestern part of Milagros, while the remaining 9% speak Cebuano, mainly in the southern towns of Esperanza, Pio V. Corpus and Placer.",
            "In northeastern Burias Island they speak Bicolano, while in Ticao Island they speak Waray  similarly as the people of Gubat, due to the island's proximity to the Northern Samar mainland."
        ],
        [
            "The people generally speak English and Tagalog, though these languages are rarely used in everyday discourse.",
            "The people only use them when conversing with tourists and visitors from other Philippine regions and foreign nationals."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Prior to colonization, the region had a complex religious system which involved various deities.",
            "Among these deities include: Gugurang, the supreme god who dwells inside of Mount Mayon where he guards and protects the sacred fire in which Aswang, his brother was trying to steal.",
            "Whenever people disobey his orders, wishes and commit numerous sins, he would cause Mount Mayon to burst lava as a sign of warning for people to mend their crooked ways.",
            "Ancient Bikolanos had a rite performed for him called Atang.",
            ";"
        ],
        [
            "Catholicism"
        ],
        [
            "About 91% of the population are members of the Catholic Church (Statistics by Diocese Hierarchy, 2014).",
            "Devotional practices such as the rosary, novenas to saints, and other religious manifestations as processions, the Misa de Gallo and Holy Week traditional activities are still very much part of the way of life of most parishioners.",
            "The Diocese of Masbate was created on March 23, 1968, separating it from the Diocese of Sorsogon.",
            "It comprises then,, and now, the civil province of Masbate with its 121 islands incl,uding the two larger ones Burias and Ticao.",
            "It is now a suffragan of the Archdiocese of Caceres.",
            "Its titular patron is St. Anthony of Padua."
        ],
        [
            "There are a total 22 parishes in the Diocese of Masbate, ministered to by 43 priests and 11 religious sisters.",
            "It has 1 minor seminary, 4 pastoral centers, 3 elementary schools, 6 high schools, 1 college and 7 kindergarten schools.",
            "And among its faith communities are 20 BEC's 46 neo-catechumenal communities, 11 mandated organizations and 3 charismatic groups."
        ],
        [
            "Others"
        ],
        [
            "Other denominations include the Aglipayan Church, the Members Church of God International, popularly called Ang Dating Daan, Jesus Miracle Crusade, Iglesia ni Cristo (Church of Christ) which also functions many religious and social events in the province, as well as Baptist, Methodist, The Church of Jesus Christ of Latter-day Saints (Mormons), Jehovah's Witnesses, Seventh-day Adventist and other Christians.",
            "Non Christians are also present which is commonly represented by Moslems."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Masbate"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  53.57"
        ],
        [
            "2009  56.33"
        ],
        [
            "2012  51.32"
        ],
        [
            "2015  45.44"
        ],
        [
            "2018  32.95"
        ],
        [
            "2021  20.20"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Masbate is endowed with rich natural resources.",
            "In line with its agriculture are other industries such as large farming, livestock, and poultry raising.",
            "Along with its coastal areas, the fishing industry predominates.",
            "Agricultural lands are planted with rice, corn, root crops, and coconut."
        ],
        [
            "Masbate ranks second to Bukidnon in raising cattle.",
            "About 70% of these are sold to Metro Manila and other provinces in Luzon and Visayas.",
            "Farming is the main source of livelihood.",
            "Copra is the leading product, followed by corn, rice and root crops.",
            "Fishing is a major industry along the coast."
        ],
        [
            "Manufacturing firms are in the copra industry, handicrafts, furniture making, and fish processing."
        ],
        [
            "Rich minerals are found in the province.",
            "Masbate is described by geologists as a province sitting on a \"pot of gold\".",
            "Other minerals found in the area are manganese, copper, silver, iron, chromite, limestone, guano, and carbon."
        ],
        [
            "Cottage industries such as furniture and cabinet making, ceramics, garments, handicrafts, and metalcrafts, are likewise the source of livelihood."
        ],
        [
            "Infrastructure"
        ],
        [
            "In an agricultural province, Masbate remains a net importer of consumer and industrial products.",
            "The supply of goods came from Metro Manila, Cebu, Panay, and Bicol Provinces.",
            "Construction materials, particularly cement, are sometimes sourced from as far as Iligan City in Mindanao."
        ],
        [
            "Education"
        ],
        [
            "Major institutions of higher learning in the province include the state-supported Dr. Emilio B. Espinosa Sr. Memorial State College of Agriculture and Technology in Mandaon and in Masbate City, Osmeña Colleges, Masbate Colleges, Liceo de Masbate (a Catholic school with primary, secondary and tertiary educations under the directorship of the Diocese of Masbate), Southern Bicol College, Cataingan Municipal College.",
            "Masbate also has national schools in Aroroy, Cataingan, Placer, San Jacinto, Mandaon, Mobo, and Masbate City."
        ],
        [
            "Other educational institutions include public and private schools such as the Masbate National Comprehensive High School in Masbate City that has two campuses: the Main Campus, which accommodates the Junior High School, and the Annex Campus which holds the Senior High School, Holy Name Academy (a Catholic institution run by the Augustinian Recollect Sisters in Palanas, Masbate) and Lucio Atabay Memorial Elementary School (formerly, Nipa Elem.",
            "School) in Nipa, Palanas, Masbate."
        ],
        [
            "Tourism"
        ],
        [
            "Masbate has several islands and beaches open to tourists.",
            "The province also holds a rodeo festival every summer."
        ],
        [
            "Cathedral of Saint Anthony of Padua"
        ],
        [
            "Buntod, Masbate"
        ],
        [
            "Tinalisayan Island Sandbar in San Pascual"
        ],
        [
            "Sombrero Island"
        ],
        [
            "Animasola Island"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 11 January 2013.",
            "Retrieved 24 January 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"Region: REGION V (Bicol Region)\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Archived from the original on 14 November 2012.",
            "Retrieved 24 January 2013."
        ],
        [
            "^ \"Masbate\".",
            "pia.gov.ph.",
            "Philippine Information Agency.",
            "Retrieved 17 July 2017."
        ],
        [
            "^ http://masbate.gov.ph/governor/history-of-masbate"
        ],
        [
            "^ (In Spanish) Mexico En Filipinas By Rafael Bernal Page 10"
        ],
        [
            "^ \"Philippine Survivor Recounts Her Struggle As A 'Comfort Woman' For Wartime Japan\".",
            "NPR.org.",
            "NPR.",
            "Retrieved 15 August 2021."
        ],
        [
            "^ The Other Empire: Literary Views of Japan from the Philippines, Singapore, and Malaysia.",
            "The University of the Philippines Press.",
            "2008.",
            "ISBN 9789715425629.",
            "Retrieved 15 August 2021."
        ],
        [
            "^ \"Women made to be Comfort Women - Philippines\"."
        ],
        [
            "^ Salazar, G. P., Reyes, F. R., & Nuval, L. Q.",
            "(1994).",
            "World War II in the Philippines.",
            "University of the Philippines Printery: Veterans Federation of the Philippines.",
            "pp. 453–455.",
            "ISBN 971-542-034-6.",
            "{{cite book}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ a b c \"Province: Masbate\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region V (Bicol Region)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region V (Bicol Region)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Census 2000; Population and Housing; Region V\" (PDF).",
            "Philippine Statistics Authority (Philippine Statistics Authority - Region V).",
            "Retrieved 29 June 2016."
        ],
        [
            "^ Table 4.",
            "Household Population by Ethnicity and Sex: Masbate, 2000"
        ],
        [
            "^ a b \"Asuang Steals Fire from Gugurang by Damiana L. Eugenio\".",
            "Archived from the original on 2009-05-26.",
            "Retrieved 2010-04-03."
        ],
        [
            "^ a b Clark, Jordan (2011) The Aswang Phenomenon Animation https://www.youtube.com/watch?v=goLgDpSStmc"
        ],
        [
            "^ \"Inquirer NewsInfo: Bicol Artist protest Natl.",
            "Artist awardees\".",
            "Archived from the original on 2009-09-11.",
            "Retrieved 2010-04-03."
        ],
        [
            "^ \"GMANews: Eclipse; Bakunawa eats the sun behind a curtain of clouds\".",
            "Retrieved 2010-04-03."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Masbate\".",
            "Retrieved 2020-08-23."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Masbate travel guide from Wikivoyage"
        ],
        [
            " Media related to Masbate at Wikimedia Commons"
        ],
        [
            " Geographic data related to Masbate at OpenStreetMap"
        ],
        [
            "Masbate Province Official Site"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Masbate"
        ],
        [
            "Quezon / Sibuyan Sea"
        ],
        [
            "Ragay Gulf"
        ],
        [
            "Burias Pass / AlbayTicao Pass / Sorsogon"
        ],
        [
            "Romblon / Sibuyan Sea"
        ],
        [
            "Masbate"
        ],
        [
            "Samar Sea / Northern Samar Western Samar"
        ],
        [
            "Capiz / Jintotolo Channel"
        ],
        [
            "Visayan SeaCebu"
        ],
        [
            "Samar Sea / Biliran Leyte"
        ],
        [
            "vte Province of MasbateMasbate City (capital and largest city)Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Batuan"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Dimasalang"
        ],
        [
            "Esperanza"
        ],
        [
            "Mandaon"
        ],
        [
            "Milagros"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Palanas"
        ],
        [
            "Pio V. Corpus"
        ],
        [
            "Placer"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Pascual"
        ],
        [
            "Uson"
        ],
        [
            "Component city"
        ],
        [
            "Masbate City"
        ],
        [
            "Articles related to Masbate"
        ],
        [
            "vteBicol Region (Region V)Provinces"
        ],
        [
            "Albay"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Catanduanes"
        ],
        [
            "Masbate"
        ],
        [
            "Sorsogon"
        ],
        [
            "Regional center"
        ],
        [
            "Legazpi"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Daet"
        ],
        [
            "Legazpi"
        ],
        [
            "Masbate City"
        ],
        [
            "Pili"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Virac"
        ],
        [
            "Metropolitan areas"
        ],
        [
            "Metro Naga"
        ],
        [
            "Independent component cities"
        ],
        [
            "Naga"
        ],
        [
            "Component cities"
        ],
        [
            "Legazpi"
        ],
        [
            "Iriga"
        ],
        [
            "Ligao"
        ],
        [
            "Masbate City"
        ],
        [
            "Sorsogon City"
        ],
        [
            "Tabaco"
        ],
        [
            "Municipalities"
        ],
        [
            "Aroroy"
        ],
        [
            "Baao"
        ],
        [
            "Bacacay"
        ],
        [
            "Bagamanoc"
        ],
        [
            "Balatan"
        ],
        [
            "Baleno"
        ],
        [
            "Balud"
        ],
        [
            "Baras"
        ],
        [
            "Barcelona"
        ],
        [
            "Basud"
        ],
        [
            "Bato (Camarines Sur)"
        ],
        [
            "Bato (Catanduanes)"
        ],
        [
            "Batuan"
        ],
        [
            "Bombon"
        ],
        [
            "Buhi"
        ],
        [
            "Bula"
        ],
        [
            "Bulan"
        ],
        [
            "Bulusan"
        ],
        [
            "Cabusao"
        ],
        [
            "Calabanga"
        ],
        [
            "Camalig"
        ],
        [
            "Camaligan"
        ],
        [
            "Canaman"
        ],
        [
            "Capalonga"
        ],
        [
            "Caramoan"
        ],
        [
            "Caramoran"
        ],
        [
            "Casiguran"
        ],
        [
            "Cataingan"
        ],
        [
            "Cawayan"
        ],
        [
            "Claveria"
        ],
        [
            "Daet"
        ],
        [
            "Daraga"
        ],
        [
            "Del Gallego"
        ],
        [
            "Dimasalang"
        ],
        [
            "Donsol"
        ],
        [
            "Esperanza"
        ],
        [
            "Gainza"
        ],
        [
            "Garchitorena"
        ],
        [
            "Gigmoto"
        ],
        [
            "Goa"
        ],
        [
            "Gubat"
        ],
        [
            "Guinobatan"
        ],
        [
            "Irosin"
        ],
        [
            "Jose Panganiban"
        ],
        [
            "Jovellar"
        ],
        [
            "Juban"
        ],
        [
            "Labo"
        ],
        [
            "Lagonoy"
        ],
        [
            "Libmanan"
        ],
        [
            "Libon"
        ],
        [
            "Lupi"
        ],
        [
            "Magallanes"
        ],
        [
            "Magarao"
        ],
        [
            "Malilipot"
        ],
        [
            "Malinao"
        ],
        [
            "Mandaon"
        ],
        [
            "Manito"
        ],
        [
            "Matnog"
        ],
        [
            "Mercedes"
        ],
        [
            "Milaor"
        ],
        [
            "Milagros"
        ],
        [
            "Minalabac"
        ],
        [
            "Mobo"
        ],
        [
            "Monreal"
        ],
        [
            "Nabua"
        ],
        [
            "Oas"
        ],
        [
            "Ocampo"
        ],
        [
            "Palanas"
        ],
        [
            "Pamplona"
        ],
        [
            "Pandan"
        ],
        [
            "Panganiban"
        ],
        [
            "Paracale"
        ],
        [
            "Pasacao"
        ],
        [
            "Pilar"
        ],
        [
            "Pili"
        ],
        [
            "Pio Duran"
        ],
        [
            "Pio V. Corpuz"
        ],
        [
            "Placer"
        ],
        [
            "Polangui"
        ],
        [
            "Presentacion"
        ],
        [
            "Prieto Diaz"
        ],
        [
            "Ragay"
        ],
        [
            "Rapu-Rapu"
        ],
        [
            "Sagñay"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando (Camarines Sur)"
        ],
        [
            "San Fernando (Masbate)"
        ],
        [
            "San Jacinto"
        ],
        [
            "San Jose"
        ],
        [
            "San Lorenzo Ruiz"
        ],
        [
            "San Miguel"
        ],
        [
            "San Pascual"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Elena"
        ],
        [
            "Santa Magdalena"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Sipocot"
        ],
        [
            "Siruma"
        ],
        [
            "Talisay"
        ],
        [
            "Tigaon"
        ],
        [
            "Tinambac"
        ],
        [
            "Tiwi"
        ],
        [
            "Uson"
        ],
        [
            "Viga"
        ],
        [
            "Vinzons"
        ],
        [
            "Virac"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases: Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Masbate&oldid=1233982080\""
        ],
        [
            "Categories: MasbateProvinces of the PhilippinesIsland provinces of the PhilippinesIslands of LuzonProvinces of the Bicol RegionStates and territories established in 18641864 establishments in the PhilippinesFormer sub-provinces of the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasAll articles with dead external linksArticles with dead external links from August 2022CS1 maint: multiple names: authors listArticles with short descriptionShort description is different from WikidataArticles needing additional references from January 2013All articles needing additional referencesCoordinates on WikidataArticles containing Tagalog-language textAll articles with unsourced statementsArticles with unsourced statements from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}