{
    "name": "Nueva Ecija",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "44 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoČeštinaChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°35′N 121°00′E﻿ / ﻿15.58°N 121°E﻿ / 15.58; 121"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Central Luzon, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Nueva Ecija\" – news · newspapers · books · scholar · JSTOR (November 2022) (Learn how and when to remove this message)"
        ],
        [
            "Province in Central Luzon, PhilippinesNueva EcijaProvinceProvince of Nueva Ecija(from top: left to right) Minalungao National Park, Dalton Pass in Carranglan, Pantabangan Dam, Caraballo Mountains, Nueva Ecija Rice field and Upper Tabuating Dam."
        ],
        [
            "FlagSealNickname(s): Rice Bowl of the Philippines Milk Capital of the PhilippinesHeart of Inland LuzonAnthem: Awit ng Nueva Ecija (Song of Nueva Ecija)Location in the PhilippinesOpenStreetMapCoordinates: 15°35′N 121°00′E﻿ / ﻿15.58°N 121°E﻿ / 15.58; 121CountryPhilippinesRegionCentral LuzonFounded25 April 1801 • Rank10th out of 81 • Density400/km2 (1,000/sq mi)  • Rank16th out of 81DemonymNovo Ecijano, NeoecijanoDivisions • Independent cities0 • Component cities"
        ],
        [
            "5"
        ],
        [
            " Cabanatuan"
        ],
        [
            " Gapan"
        ],
        [
            " Muñoz"
        ],
        [
            " Palayan"
        ],
        [
            " San Jose"
        ],
        [
            " • Municipalities"
        ],
        [
            "27"
        ],
        [
            " Aliaga"
        ],
        [
            " Bongabon"
        ],
        [
            " Cabiao"
        ],
        [
            " Carranglan"
        ],
        [
            " Cuyapo"
        ],
        [
            " Gabaldon"
        ],
        [
            " General Mamerto Natividad"
        ],
        [
            " General Tinio"
        ],
        [
            " Guimba"
        ],
        [
            " Jaen"
        ],
        [
            " Laur"
        ],
        [
            " Licab"
        ],
        [
            " Llanera"
        ],
        [
            " Lupao"
        ],
        [
            " Nampicuan"
        ],
        [
            " Pantabangan"
        ],
        [
            " Peñaranda"
        ],
        [
            " Quezon"
        ],
        [
            " Rizal"
        ],
        [
            " San Antonio"
        ],
        [
            " San Isidro"
        ],
        [
            " San Leonardo"
        ],
        [
            " Santa Rosa"
        ],
        [
            " Santo Domingo"
        ],
        [
            " Talavera"
        ],
        [
            " Talugtug"
        ],
        [
            " Zaragoza"
        ],
        [
            " • Barangays849 • DistrictsLegislative districts of Nueva EcijaDemographics • Ethnic groupsTagalog (77.8%)Ilocano (19.3%)Kapampangan (0.06%)Pangasinan (0.03%) • LanguagesTagalogIlocanoEnglishTime zoneUTC+8 (PHT)ZIP code3100–3133IDD : area code +63 (0)44ISO 3166 codePH-NUEWebsitewww.nuevaecija.ph"
        ],
        [
            "Nueva Ecija, officially the Province of Nueva Ecija (Tagalog: Lalawigan ng Nueva Ecija ; Ilocano: Probinsia ti Nueva Ecija; Pangasinan: Luyag/Probinsia na Nueva Ecija), is a landlocked province in the Philippines located in the Central Luzon region.",
            "Its capital is the city of Palayan, while Cabanatuan, its former capital, is the largest local government unit (LGU).",
            "Nueva Ecija borders, from the south clockwise, Bulacan, Pampanga, Tarlac, Pangasinan, Nueva Vizcaya and Aurora.",
            "The province is nationally known as the Rice Granary of the Philippines, producing the largest rice yield in the country."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Nueva Ecija\" – news · newspapers · books · scholar · JSTOR (November 2022) (Learn how and when to remove this message)"
        ],
        [
            "Early history"
        ],
        [
            "These first settlers included tribes of Bugkalots or Italons, Abaca and Buquids."
        ],
        [
            "When the waves of Tagalog migrations took place between 300 and 200 B.C., intrepid travelers and traders set up settlements along Luzon's western coast.",
            "These early settlements formed the nucleus of the Pampango Empire that was consolidated by Balagtas.",
            "The flatlands of the southern portion of Upper Pampanga was a hospitable place for these new Tagalog settlers.",
            "The indigenous tribes were forced to take to the hills in the face of the Tagalogs' superior technology."
        ],
        [
            "Barter trade flourished among communities that settled along the great river.",
            "The constant riverside trading resulted in both a commercial and cultural exchange between the settlements in vast plains upstream of the Pampanga River.",
            "Settlements in Carranglan, Pantabangan, and Bongabon and prospered and grew into more stable communities."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "At the time, the Pampango crown has waned and had little resistance from Spanish invasion.",
            "When the Pampango Empire fell into the hands of Spanish forces under the command of Martin de Goiti in 1572, the conquistadores began their long upward trek towards Cagayan Valley and Mountain Province.",
            "Their forces passed through the settlement areas of the Upper Pampanga River.",
            "They also attacked the Caboloan of Pangasinan, effectively capturing more territories from local kingdoms."
        ],
        [
            "Because of growing territorial domain and evangelical missions, a command outpost or Commandancia in the Upper Pampanga River area was established.",
            "Then Governor-General Fausto Cruzat y Góngora (July 25, 1690, to December 8, 1701) had most likely spent much of his time in the northern outpost in Carranglan and Pantabangan and, baking in the fiercely hot climate, probably waxed nostalgic about his hometown in Écija, Andalusia in Spain, which was also known as \"la sarten\"  (the frying pan) because of its intensely hot summers.",
            "Thus the Governor-General hit upon the notion to name the outpost Nueva Ecija.",
            "Both the New and Old Ecija were washed by navigable rivers- the former, by Pampanga River and the latter, by the river Genil."
        ],
        [
            "Conversion to Christianity"
        ],
        [
            "See also: Hinduism in the Philippines, Religion in pre-colonial Philippines, Indosphere, Indianisation, and List of India-related topics in the Philippines"
        ],
        [
            "Consistent with the history of Hispanization in the rest of Philippine archipelago, Nueva Ecija was established by Augustinian missionaries.",
            "The first mission was established in Gapan in 1595.",
            "The Augustinians abandoned their missionary work in 1636, maintaining only the mission in Bongabon."
        ],
        [
            "At the turn of the 18th century, the missionaries resumed their evangelical work and redirected their efforts to the northeast, towards rough, mountainous terrain inhabited by the Bugkalots."
        ],
        [
            "On September 1, 1759, King Carlos III of Spain issued a Royal Decree that ended the founding missions of Augustinians and transferred all Augustinian responsibilities in the settlements of Nueva Ecija to Franciscan friars.",
            "Through tribute collections and polo y servicio or rendering of force labor, the Franciscans constructed churches, convents, parochial schools and tribunals.",
            "They also constructed roads and bridges to connect other settlements.",
            "In 1781, a simple irrigation system was constructed in Pantabangan.",
            "This new farming technology contributed to the promotion of agriculture in the province."
        ],
        [
            "New province"
        ],
        [
            "To make possible the establishments of settlements, military force became necessary to protect the friars and whatever basic settlement structures were beginning to emerge.",
            "Thus military outposts were of utmost importance, especially with the friars trying to convert fierce head-hunting tribes with spears and bladed weapons.",
            "It was around this time, during the term of Governor General Fausto Cruzat y Gongora (July 25, 1690, to December 8, 1702), that he established the military outpost he named Nueva Ecija.",
            "At this time, however, Nueva Ecija was still part of upper Pampanga."
        ],
        [
            "In 1762, British occupation of Manila happened, and many Tagalog refugees from Manila & north areas of Cavite escaped to Bulacan and Nueva Ecija, where the original Kapampangan settlers welcomed them.",
            "Nueva Ecija, along with Bulacan, was natively Kapampangan when Spaniards arrived.",
            "Majority of Kapampangans sold their lands to the newly-arrived Tagalog settlers and others intermarried with and assimilated to the Tagalog, which made Nueva Ecija dominantly Tagalog, many of the Tagalog settlers arrived in Nueva Ecija directly from Bulacan."
        ],
        [
            "In 2016, researchers of the National Historical Commission of the Philippines (NHCP) and the provincial government found documents showing that in 1799, Carlos IV ordered the separation of towns and parishes of Upper Pampanga, near the Sierra Madre range, as well as coastal towns of Tayabas, along the Pacific Ocean and their organization into a corregimiento (political-military administrative unit).",
            "Royal directives were implemented on April 25, 1801, and the corregimiento was named Nueva Ecija after the Spanish hometown of that period's Governor General Rafael Maria de Aguilar, with Baler as its capital."
        ],
        [
            "Since then, the province had undergone numerous changes in territorial composition.",
            "The progressive towns of Gapan, San Isidro, San Antonio, Cabiao and Aliaga were all annexed to Nueva Ecija from Pampanga, resulting in an economic as well as population boom for inhabitants.",
            "While Nueva Ecija only had a population of 9,165 in 1845,"
        ],
        [
            "Other changes occurred in the following years until, in 1901, Nueva Ecija's northern municipalities of Balungao, Rosales, San Quintin and Umingan were annexed to Pangasinan.",
            "Nueva Ecija's shifting political boundaries in fact necessitated transferring its provincial capital four times.",
            "Still, these changes proved ultimately beneficial to Nueva Ecija, as they resulted in a territory with rich land resources nourished by an excellent river system composed of the Pampanga, Talavera and Penaranda rivers.",
            "This would help lay the foundation for Nueva Ecija's abundant agricultural economy starting with the American Occupation in the early 20th century."
        ],
        [
            "Tobacco monopoly"
        ],
        [
            "Maintaining the Philippines as a colony became a challenge for the Spanish Empire.",
            "Expenses incurred in running the colony were usually paid for by a yearly subsidy (called real situado) sent from the Philippines' sister colony in Mexico.",
            "This financial support from the Spanish royal court was often insufficient, especially with expenditures in the Philippine colony growing each year."
        ],
        [
            "This prompted the royal fiscal assigned in Manila to devise a plan to allow the colony itself to raise revenues on its own and thus be able to supplement the Spanish subsidy.",
            "This royal fiscal was Francisco Leandro de Vianna, who first proposed creating a tobacco monopoly.",
            "De Vianna reasoned, tobacco was a product widely consumed throughout the islands, with a market of roughly one million.",
            "He projected earnings of as much as P400,000 from the venture.",
            "The first time the proposal was made, however, both King Carlos III of Spain and colonial officials didn't give the idea much importance."
        ],
        [
            "All that would change during the term of Governor-General Jose Basco y Vargas.",
            "Basco had plans to develop and promote Philippine agriculture, and de Vianna's proposal seemed attractive to him.",
            "After studying the proposal, Basco sent his plan to establish a large-scale tobacco production in the colony under complete ownership and management by the colonial government of Spain.",
            "What probably perked up the ears of the Spanish king about Basco's plan to make the Philippine colony financially self-sufficient, thus removing a huge financial burden from the Spanish crown.",
            "The King of Spain issued a royal decree on February 9, 1780, setting in motion Basco's plan."
        ],
        [
            "Almost two years to the date of that royal decree, Basco ordered local officials and military commanders to prevent unnecessary losses of tobacco revenues.",
            "By March 2, 1782, tobacco production was established in Luzon, with La Union, Ilocos, Abra, Cagayan Valley and Nueva Ecija (still part of Pampanga at the time) as the centers for planting, growing, harvesting and processing tobacco."
        ],
        [
            "This made a drastic and extreme change in the lives of all Novo Ecijanos.",
            "Where farmland used to bear rice, tobacco was now the only crop allowed to grow.",
            "These included the towns of Gapan, San Isidro, Jaen, Cabiao, Cabanatuan, Talavera, Santor and Bongabon.",
            "Each farming family was given a quota of tobacco plant to grow."
        ],
        [
            "By 1850 the tobacco monopoly was producing immense financial gain for the colonial government.",
            "Some reports at the time pegged the earnings by as much as $500,000.",
            "One account in 1866 reported a much higher amount, as earnings rose to $38,418,939 that year."
        ],
        [
            "Novo Ecijanos suffered a lot from the system.",
            "Nueva Ecija was more often able to meet production quotas compared to the other districts.",
            "Despite this, tobacco policy imposed a lower price on tobacco from areas closer to Manila.",
            "That meant that first-class tobacco leaf grown and harvested from Nueva Ecija was priced lower by one dollar, compared to those from Ilocos, La Union and Cagayan Valley."
        ],
        [
            "The tobacco monopoly did not spur Novo Ecijanos to revolt, unlike the Ilocanos who staged an uprising over injustices in the system.",
            "Some tobacco growers in Nueva Ecija resorted to smuggling their own harvests in order to get some profit.",
            "But getting caught entailed harsher fines and penalties.",
            "Even sympathetic local officials had no choice but to enforce the unjust policies under pain of arrest and hard labor, once laxity on their part resulted in low production."
        ],
        [
            "The flourishing tobacco industry coupled with the rich agricultural lands in central and northeastern Nueva Ecija also attracted migrants from neighboring Pampanga, Pangasinan, Ilocos and Tagalog areas.",
            "This made Nueva Ecija a melting pot of cultures and influences, the results of which are still evident in present-day Novo Ecijano culture."
        ],
        [
            "As the tobacco monopoly fuelled further unrest, Spain finally abolished the monopoly on December 3, 1882.",
            "It was only then that they could all once again grow rice for food."
        ],
        [
            "Philippine revolution"
        ],
        [
            "First prisoners of the Philippine Revolution in 1896"
        ],
        [
            "One distinct feature of the 1896 revolution against Spain in Nueva Ecija was that it was led by the elite, ruling class instead of the masses.",
            "Leaders of the revolt in Nueva Ecija were municipal officials and prominent citizens, who refused to collaborate with the Spanish authorities when armed struggle broke out.",
            "Despite being in the ruling class and enjoying positions in the colonial government, these prominent Novo Ecijanos proved their patriotism and love for fellow Filipinos."
        ],
        [
            "In fact, one of the founding members of the reform movement La Liga Filipina"
        ],
        [
            "Once the Spanish authorities learned of the Katipunan's existence, those perceived as sympathizers of the movement, and even those who were falsely accused of being members of it, were arrested.",
            "Mamerto Natividad was among those arrested for sedition, tortured and killed by guardia civil.",
            "He was one of the first Novo Ecijano martyrs for freedom.",
            "His death, however, would result in bigger problems for the Spanish authorities."
        ],
        [
            "Mamerto Natividad's two sons, Mamerto Jr. and Benito Natividad, later joined the Katipunan.",
            "The Spaniards burned their house and sugar mills in Jaen.",
            "Mamerto Jr. was later jailed for shooting a Spanish judge who had slapped his younger brother.",
            "As the Revolution gained ground, Mamerto Jr. was released and he was able to join the revolutionary army of General Emilio Aguinaldo in Cavite.",
            "By August 30, 1896, a state of war was declared by the Spanish colonial government in several Luzon provinces including Nueva Ecija, Bulacan, Pampanga, Tarlac, Batangas, Laguna, Cavite and Manila."
        ],
        [
            "Novo Ecijanos immediately proved themselves worthy of the fight for freedom.",
            "On September 2, 1896, Novo Ecijanos led by Gen. Mariano Llanera, capital municipal of Cabiao and Gen. Pantaleon Valmonte, capitan municipal of Gapan attacked San Isidro, the provincial capital.",
            "Their 3,000-strong army attacked San Isidro in distinct Novo Ecijano fashion: accompanied by music played by the Banda de Cabiao or Cabiao band."
        ],
        [
            "Wounded American on stretcher in the Philippines, 1899"
        ],
        [
            "Novo Ecijanos like Llanera, Valmonte, Mamerto Natividad, Jr. and Manuel Tinio conducted themselves heroically during the revolution.",
            "They were allied with Aguinaldo's Magdalo"
        ],
        [
            "Pact of Biak-na-Bato Filipino negotiators"
        ],
        [
            "On November 11, 1897, Natividad was killed in action in Cabiao, Nueva Ecija.",
            "His death precipitated the Pact of Biak-na-Bato, and Joaquin Natividad."
        ],
        [
            "Later on, Novo Ecijanos would continue to participate in the drama of war, revolution and the fight for freedom.",
            "They would fight when the revolt against Spain continued after the peace treaty broke down and the United States, after declaring war on Spain, promised to help Filipinos fight for freedom.",
            "Then, Novo Ecijanos again joined General Emilio Aguinaldo in the Philippine–American War (after it became evident the United States wanted to make the Philippines their own colony)."
        ],
        [
            "Cry of Nueva Ecija"
        ],
        [
            "Main article: Cry of Nueva Ecija"
        ],
        [
            "General Manuel Tinio, former governor of Nueva Ecija"
        ],
        [
            "The Cabanatuan Cathedral, which supported the Philippine Revolution and became a headquarters of the First Philippine Republic in the province."
        ],
        [
            "The \"Cry of Nueva Ecija\" is the 1896 revolutionary battle led by General Mariano Llanera, manned and assisted by General Manuel Tinio and Pantaleon Valmonte of Gapan, Nueva Ecija and Colonel Alipio Tecson of Cabiao, Nueva Ecija who later on became Brigadaire General.",
            "The battle was fought in Cabiao, Nueva Ecija.",
            "Alipio Tecson would eventually become Gobernadorcillo of Cabiao, Nueva Ecija."
        ],
        [
            "American invasion era"
        ],
        [
            "History records how the Philippine–American War began after American troops killed a Filipino soldier who was crossing the San Juan bridge on February 4, 1899."
        ],
        [
            "When the war between Filipinos and Americans finally began, the fate of the infant Republic of the Philippines again lay in the hands of General Aguinaldo and his most trusted men who included Novo Ecijanos like General Llanera and General Tinio.",
            "And, as guerilla warfare became an effective tactic for the Filipinos, Novo Ecijanos were among the most feared guerillas.",
            "By the time the war ended on April 1, 1901, with Aguinaldo's surrender to the Americans, Novo Ecijano guerillas who had fought so fiercely and bravely against two sets of foreign invaders reluctantly gave up.",
            "Still that was not the end of the association between them and the Americans.",
            "The end of the Philippine–American War also signaled a new beginning for Nueva Ecija and its people."
        ],
        [
            "The railway"
        ],
        [
            "Commercial, interprovincial trade was carried out using the Rio Grande de Pampanga as main waterway, with trade outposts in San Isidro and Talipapa.",
            "Traders from Bulacan, Tondo and Manila regularly came to Nueva Ecija to carry back rice, palay, tobacco, sugar, corn and livestock."
        ],
        [
            "Americans, however, wanted to shift from water-borne trade to a land-based trade system.",
            "Their idea for establishing this depended on something they were masters at: building railways.",
            "The American colonial government thought a railway could help boost Nueva Ecija's economic growth, in the same way that the US railway system helped unite and develop the economy of the North American continent.",
            "What made the railway project attractive was that it was less expensive than building roads.",
            "At first run by a private company, the US colonial government took over the ownership and management of the railway system by 1917."
        ],
        [
            "The Americans were soon proven right: trade conducted through the railways boosted Nueva Ecija's income by 25% while transport costs went down by 25% to as much as 75%.",
            "With the train able to transport more goods and more people at a cheaper rate, the railway helped spark a rice boom in Gapan, San Isidro, Cabanatuan, Santa Rosa and Penaranda.",
            "Farmers could devote more land to growing rice and even secondary crops like onions and watermelons."
        ],
        [
            "More rice mills, farmers and farmer settlers came to Nueva Ecija.",
            "By 1936, there were 42 rice mills in Nueva Ecija, owned mostly by Chinese."
        ],
        [
            "The agriculture-based economic boom brought about by the train's huge load capacity and greater speed (compared to boats) encouraged waves of migrations to Nueva Ecija from places like Ilocos, Pampanga, Pangasinan, Tarlac and Bulacan."
        ],
        [
            "The railway brought other changes to Nueva Ecija.",
            "While trade was still being done by waterways, settlements by necessity had to be established close to the rivers, where people's basic necessities came from.",
            "When the trains became the main mode of transporting goods and people, and with the influx of migrants, it became not only possible but crucial to build more communities further inland.",
            "This meant roads and irrigation systems were needed."
        ],
        [
            "Roads and irrigation"
        ],
        [
            "As communities expanded inward, first along the rivers and then along the railways, the need for roads and irrigation systems leading to communities in the plains became more urgent.",
            "These made it possible for the more remote towns—those farther away from both rivers and railroads—to grow crops and participate in trade, ending what was until then a very slow pace of economic development.",
            "By 1912 Governor Benito Natividad had appropriated funds to fast-track the building of roads and bridges linking these remote towns and municipalities to then provincial capital Cabanatuan."
        ],
        [
            "The American government also constructed three major irrigation facilities: 1) The Talavera Irrigation System in 1924; 2) Penaranda River Irrigation System in 1930 and 3) Pampanga River Irrigation System in 1939."
        ],
        [
            "By the time these irrigation systems went in full swing, combined with the railway system and the many rice mills, Nueva Ecija had been established as the \"Rice Granary of the Philippines\".",
            "From 1930 to 1939, rice production in Nueva Ecija was averaging more than 9 million cavans of rice."
        ],
        [
            "Homesteading and US-style tenancy"
        ],
        [
            "Unlike the American pioneers of the Old West, Filipinos were not so willing to occupy remote, unsettled and undeveloped areas.",
            "So when the American colonial government introduced homesteading, there were few takers among Filipinos.",
            "Homesteading could be done through a legal process of acquiring a land title, or even without a title at all.",
            "In the latter case however, the lack of a title makes the informal homesteader vulnerable to any legal action attempting to take the land away from him."
        ],
        [
            "When the Philippine Bill of 1902 was passed by the US Congress, the US colonial government was formally established in the Philippine islands.",
            "This meant the colonial government now had the authority to dispose of public lands on its own, without having to seek the approval of the President of the United States.",
            "Based on an earlier survey of public lands by the Philippine Commission, the new American colonial government offered public lands to settlers through homesteading, sale, purchase or lease."
        ],
        [
            "Under the American regime's homesteading system, an individual could get up to 16 hectares of land, while a corporation could get as much as 1,024 hectares.",
            "This did not result in a wide settlement of lands throughout the country, however.",
            "Nueva Ecija was one exception, as more settlers opted to homestead its lands.",
            "A 1928 Statistical Bulletin records nearly 70,000 hectares were given to more than five thousand homestead applicants."
        ],
        [
            "The homesteading efforts under the American regime ultimately failed in succeeding decades due to two major factors.",
            "First, the new farmer-settlers did not have enough capital to sustain farming costs.",
            "Without any financial assistance available from the government that granted them the land, farmer-settlers accumulated huge debts at very high interest rates from usurious moneylenders.",
            "Most of these homesteaders were later forced to sell their land and become tenant farmers instead."
        ],
        [
            "Civil government in the American period"
        ],
        [
            "The civil governments established in various provinces in the Philippines under the American Occupation were supposed to teach Filipinos the basic principles of democracy, following US military rule.",
            "In general, each provincial government presided over local governments in each town or municipality.",
            "In turn, each municipality would have a president, vice-president and municipal councillors.",
            "These were elected by a select group of qualified electors for two-year terms."
        ],
        [
            "The second Philippine Commission went to what was then Nueva's provincial capital, San Isidro, on June 8, 1901, to begin proceedings for establishing the local and provincial governments.",
            "16 out of Nueva Ecija's 19 towns were represented in the meeting.",
            "Elections of various representatives from the different towns were carried out successfully."
        ],
        [
            "However, there was still the thorny problem of deciding whether or not to move the provincial capital.",
            "The dilemma was caused by events related to the Philippine–American War.",
            "First, Nueva Ecija had been a hotbed of resistance against the American Occupation, and was therefore in a state of siege.",
            "Four of its towns, Balungao, Rosales, San Quintin and Umingan, which were further away from the capital and already considered pacified by US forces, had been annexed to the province of Pangasinan.",
            "In 1902, the District of El Príncipe (composed only of Baler and Casiguran at that time, and now also composed of Dinalungan, Dingalan, Dipaculao, Maria Aurora, and San Luis) was separated from Nueva Ecija & annexed to Tayabas (now Quezon), which then became part of Aurora."
        ],
        [
            "The newly elected Nueva Ecija representatives were of the view that since a civil government under the Americans was already being established, it was time to return the four towns to Nueva Ecija.",
            "This would benefit the province as the four town were rich in natural resources.",
            "The fact that the towns were quite far from the capital, one of the representatives suggested, was no obstacle: the provincial capital could simply be moved to Cabanatuan.",
            "Other representatives objected to this proposal, pointing out that Cabanatuan had no infrastructures wherein to house the provincial government.",
            "The matter was not resolved until two years later, when the US governor-general signed Act No.",
            "1748, ordering the transfer of the capital to Cabanatuan by 1912."
        ],
        [
            "The civil provincial government of Nueva Ecija was formally established by the Taft Commission on June 11, 1901.",
            "The very first governor under this new system was Epifanio de los Santos.",
            "The main artery connecting most of Metro Manila, EDSA, is named for Governor de los Santos."
        ],
        [
            "Education during the American period"
        ],
        [
            "Americans succeeded in making education widely available to Filipinos.",
            "While the Spanish government did, rather belatedly in their rule (in the middle of the 19th century), decide to establish public schools, it was the Americans who were able to improve it."
        ],
        [
            "A report of the United States' Philippine Commission in 1900 showed, only 10 out of 23 municipalities in Nueva Ecija had a public school established during the Spanish times and according to the Philippine Commission figures by 1902, 37 public primary schools were established, and 63 Novo Ecijano teachers supported by 16 American \"Thomasites\", part of the larger group of some 500 pioneer American teachers who arrived aboard the USAT Thomas in September 1901, to help establish an American public school system in the Philippines.",
            "The Education Act No.",
            "74 approved by the Philippine Commission in 1901 proved to be the catalyst that made Novo Ecijanos rally behind the local and American teachers to make sure as many children as possible benefitted from the public school system."
        ],
        [
            "People contributed in the form of cash, construction materials or labor, and even vacant lots for the building of schools.",
            "Community support for the building of schools was such that by 1906, there were already 99 schools in Nueva Ecija.",
            "The public school system was still hampered by problems.",
            "Relying only on local support, Nueva Ecija (and other places in the Philippines as well) could simply not meet the increasing needs of a growing number of schools, teachers and students.",
            "Given the high premium placed by Novo Ecijanos on education, a legislator from Nueva Ecija took the crucial step to compel the American colonial government to allot funding for public education via a legislative act."
        ],
        [
            "Assemblyman Isauro Gabaldon of Nueva Ecija filed an education bill before the 1907 Philippine Assembly, which would later be approved and known as the Gabaldon Education Act.",
            "The bill required government to earmark P1,000,000 for public schools throughout the Philippine islands."
        ],
        [
            "Nueva Ecija benefitted tremendously from the new education law.",
            "By 1908 Nueva Ecija had 144 primary schools, 11 non-sectarian private schools, 18 sectarian private schools, nine intermediate schools, one vocational school and one agricultural school, the Central Luzon Agricultural School, which is currently now operating as Central Luzon State University."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "Further information: Raid at Cabanatuan"
        ],
        [
            "Alamo Scouts in the Raid at Cabanatuan"
        ],
        [
            "Giving a sick man a drink as US POWs of Japanese, Philippine Islands, Cabanatuan prison camp"
        ],
        [
            "When the Japanese tried to make the Philippines their own colony based on the book."
        ],
        [
            "During World War II the Imperial Japanese Army entered the province and Nueva Ecija was taken in 1942.",
            "On March 29, 1942, under the leadership of Luis Taruc the Hukbalahap (Hukbo ng Bayan Laban sa Hapon-People's Army Against the Japanese) was organized in Sitio Bawit, Barrio San Julian in the town of Cabiao.",
            "It was perceived to be the military arm of the Partido Komunista ng Pilipinas (Communist Party of the Philippines), that brought about the beginning of the early organized resistance of the Filipino people."
        ],
        [
            "During World War II under the Japanese occupation, The Philippine Commonwealth Army has the re-establishment of the Military General Headquarters, Military Bases and Camps here in the province of Nueva Ecija on January 3, 1942, to June 30, 1946, before the engagements of the Anti-Japanese Imperial Military Operations in Central Luzon include Nueva Ecija, Pampanga, Tarlac, Zambales, Bulacan and Northern Tayabas (now Aurora) from 1942 to 1945 and aided the local recognized guerrillas and the Hukbalahap Communist guerrillas against the Japanese Imperial forces since the Japanese Counter-Insurgencies (1942-1944) and the Allied Liberation (1944-1945)."
        ],
        [
            "In January to August 1945, combined American and Filipino soldiers liberated Nueva Ecija with the recognized guerrillas continuing to harass the Japanese at every opportunity.",
            "When Filipino soldiers of the 2nd, 22nd, 23rd, 25th and 26th Infantry Division of the Philippine Commonwealth Army and the 2nd Constabulary Regiment of the Philippine Constabulary was re-invading launches to entering liberated the province of Nueva Ecija and helping recognized guerrilla resistance fighter units, the Hukbalahap Communist guerrillas and the American troops against the Japanese Imperial forces during the Invasion of Nueva Ecija."
        ],
        [
            "On January 30, 1945, American Army Rangers, Alamo scouts and Filipino guerrillas conducted a raid to liberate Allied civilians and prisoners of war in Cabanatuan, this was successful with over 516 rescued.",
            "By January 31, 1945, the liberated civilians and POWs reached Talavera."
        ],
        [
            "Post-independence era"
        ],
        [
            "After the war, much rebuilding was made at the urban areas of the province, specifically Cabanatuan and Gapan.",
            "This became the focus of the administrations of Quezon, Roxas, Quirino, Magsaysay, Garcia, and Macapagal.",
            "The city of Palayan was formally established by law and became the new capital of the province."
        ],
        [
            "Marcos dictatorship era"
        ],
        [
            "Much of the rebuilding and establishment of economic centers in the province spiraled down due to the declaration of martial law by Marcos, which also resulted to the Talugtug massacre, where commonfolk Ilocanos were gathered and killed by the Marcos-controlled military, and the Gapan massacre, where the military killed-off a whole family, including children."
        ],
        [
            "A number of Novo Ecijanos played an important role in resisting the excesses and abuses of the Marcos dictatorship, and were later honored by having their name inscribed on the Wall of Remembrance at the Philippines' Bantayog ng mga Bayani (lit.",
            "Monument of Heroes).",
            "This included Catholic Priest Pepito Bernardo,"
        ],
        [
            "In 1986, Novo Ecijanos participated in the nationwide EDSA People Power Revolution, effectively ousting Marcos from power and restoring Philippine democracy."
        ],
        [
            "Post-EDSA era"
        ],
        [
            "Repairing the severely-damaged economy was spearheaded by the Cory Aquino government, which also introduced a new Constitution and a game-changing economic reform policy, which resulted to the country's economic resiliency in the 21st century."
        ],
        [
            "In 1987, Nueva Ecija's fourth district"
        ],
        [
            "Contemporary"
        ],
        [
            "The Estrada government was ousted due to illegal activities, leading to the installment of the Arroyo government.",
            "The Duterte government accession made wary ups and downs in the provincial economy."
        ],
        [
            "Geography"
        ],
        [
            "The province is the largest in Central Luzon, covering a total area of 5,751.33 square kilometres (2,220.60 sq mi).",
            "Its terrain begins with the southwestern marshes near the Pampanga border.",
            "It levels off and then gradually increases in elevation to rolling hills as it approaches the mountains of Sierra Madre in the east, and the Caraballo and Cordillera Central ranges in the north."
        ],
        [
            "Nueva Ecija is bordered on the northeast by Nueva Vizcaya, east by Aurora, south by Bulacan, southwest by Pampanga, west by Tarlac, and northwest by Pangasinan.",
            "The province has four distinct districts.",
            "The first district (northwest) has a mixture of Ilokano, Pangasinense, and Tagalog, with little Kapampangan cultures.",
            "The second district (northeast) is the most complex as it has at least 10 different ethnic groups.",
            "The third district (central) has a metropolitan culture, coming from a majority of Tagalog culture, as Cabanatuan is within it.",
            "And the fourth district (southwest) has a mixture of Kapampangan and Tagalog cultures."
        ],
        [
            "Flora and fauna"
        ],
        [
            "Rafflesia consueloae, smallest raflessia species in the world, is found only in the Pantabangan–Carranglan Watershed Forest Reserve."
        ],
        [
            "The species of flora and fauna in the province is diverse on its north and east borders, which exhibit a shared ecosystem with the Caraballo mountains in the north and the Sierra Madre mountains in the east.",
            "The southeast areas are also known for its diverse fauna and flora due to the presence of the Minalungao National Park."
        ],
        [
            "The orchid species Ceratocentron fesselii, which can only be found in the Pantabangan–Carranglan Watershed Forest Reserve in Carranglan, is considered one of the most critically endangered orchid species in the entire Southeast Asian region.",
            "It is endangered due to illegal gathering from the wild and due to the illegal black market trade.",
            "The forest reserve is also home to the endemic Rafflesia consueloae, which is the smallest rafflesia in the world and is found nowhere else.",
            "Philippine deer, Philippine warty pig, and other indigenous mouse species are also present in the province."
        ],
        [
            "In a recent activity, the presence of a Philippine eagle couple was discovered in the Sierra Madre side of Nueva Ecija.",
            "The couple are now protected by the local government units in that area.",
            "Snakes, lizards, and various amphibian species are also present, especially in wetter months."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Political map of Nueva Ecija"
        ],
        [
            "The province is divided into four congressional districts comprising 27 municipalities and five cities.",
            "The province has the most cities in the Central Luzon region."
        ],
        [
            " †  Provincial capital and component city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Aliaga"
        ],
        [
            "1st"
        ],
        [
            "3.0%"
        ],
        [
            "70,363"
        ],
        [
            "63,543"
        ],
        [
            "1.96%"
        ],
        [
            "90.04"
        ],
        [
            "34.76"
        ],
        [
            "780"
        ],
        [
            "2,000"
        ],
        [
            "26"
        ],
        [
            "15°30′12″N 120°50′44″E﻿ / ﻿15.5032°N 120.8455°E﻿ / 15.5032; 120.8455﻿ (Aliaga)"
        ],
        [
            "Bongabon"
        ],
        [
            "3rd"
        ],
        [
            "2.9%"
        ],
        [
            "66,839"
        ],
        [
            "64,173"
        ],
        [
            "0.78%"
        ],
        [
            "242.91"
        ],
        [
            "93.79"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "28"
        ],
        [
            "15°37′56″N 121°08′45″E﻿ / ﻿15.6321°N 121.1459°E﻿ / 15.6321; 121.1459﻿ (Bongabon)"
        ],
        [
            "Cabanatuan"
        ],
        [
            "∗"
        ],
        [
            "Lone"
        ],
        [
            "14.2%"
        ],
        [
            "327,325"
        ],
        [
            "302,231"
        ],
        [
            "1.53%"
        ],
        [
            "282.75"
        ],
        [
            "109.17"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "89"
        ],
        [
            "15°29′25″N 120°57′59″E﻿ / ﻿15.4902°N 120.9665°E﻿ / 15.4902; 120.9665﻿ (Cabanatuan)"
        ],
        [
            "Cabiao"
        ],
        [
            "4th"
        ],
        [
            "3.7%"
        ],
        [
            "85,862"
        ],
        [
            "79,007"
        ],
        [
            "1.60%"
        ],
        [
            "111.83"
        ],
        [
            "43.18"
        ],
        [
            "770"
        ],
        [
            "2,000"
        ],
        [
            "23"
        ],
        [
            "15°15′03″N 120°51′27″E﻿ / ﻿15.2508°N 120.8575°E﻿ / 15.2508; 120.8575﻿ (Cabiao)"
        ],
        [
            "Carranglan"
        ],
        [
            "5th"
        ],
        [
            "1.8%"
        ],
        [
            "42,420"
        ],
        [
            "41,131"
        ],
        [
            "0.59%"
        ],
        [
            "705.31"
        ],
        [
            "272.32"
        ],
        [
            "60"
        ],
        [
            "160"
        ],
        [
            "17"
        ],
        [
            "15°57′37″N 121°03′50″E﻿ / ﻿15.9603°N 121.0638°E﻿ / 15.9603; 121.0638﻿ (Carranglan)"
        ],
        [
            "Cuyapo"
        ],
        [
            "1st"
        ],
        [
            "2.9%"
        ],
        [
            "68,066"
        ],
        [
            "65,039"
        ],
        [
            "0.87%"
        ],
        [
            "215.73"
        ],
        [
            "83.29"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "51"
        ],
        [
            "15°46′39″N 120°39′44″E﻿ / ﻿15.7774°N 120.6622°E﻿ / 15.7774; 120.6622﻿ (Cuyapo)"
        ],
        [
            "Gabaldon"
        ],
        [
            "3rd"
        ],
        [
            "1.7%"
        ],
        [
            "38,958"
        ],
        [
            "35,383"
        ],
        [
            "1.85%"
        ],
        [
            "225.28"
        ],
        [
            "86.98"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "16"
        ],
        [
            "15°27′14″N 121°20′14″E﻿ / ﻿15.4540°N 121.3371°E﻿ / 15.4540; 121.3371﻿ (Gabaldon)"
        ],
        [
            "Gapan"
        ],
        [
            "∗"
        ],
        [
            "4th"
        ],
        [
            "5.3%"
        ],
        [
            "122,968"
        ],
        [
            "110,303"
        ],
        [
            "2.09%"
        ],
        [
            "164.44"
        ],
        [
            "63.49"
        ],
        [
            "750"
        ],
        [
            "1,900"
        ],
        [
            "23"
        ],
        [
            "15°18′45″N 120°56′58″E﻿ / ﻿15.3126°N 120.9495°E﻿ / 15.3126; 120.9495﻿ (Gapan)"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "3rd"
        ],
        [
            "1.9%"
        ],
        [
            "44,311"
        ],
        [
            "41,656"
        ],
        [
            "1.18%"
        ],
        [
            "118.00"
        ],
        [
            "45.56"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "20"
        ],
        [
            "15°36′09″N 121°03′02″E﻿ / ﻿15.6025°N 121.0506°E﻿ / 15.6025; 121.0506﻿ (General Mamerto Natividad)"
        ],
        [
            "General Tinio"
        ],
        [
            "4th"
        ],
        [
            "2.4%"
        ],
        [
            "55,925"
        ],
        [
            "47,865"
        ],
        [
            "3.01%"
        ],
        [
            "533.08"
        ],
        [
            "205.82"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "13"
        ],
        [
            "15°21′00″N 121°02′59″E﻿ / ﻿15.3501°N 121.0498°E﻿ / 15.3501; 121.0498﻿ (General Tinio)"
        ],
        [
            "Guimba"
        ],
        [
            "1st"
        ],
        [
            "5.5%"
        ],
        [
            "127,653"
        ],
        [
            "118,655"
        ],
        [
            "1.40%"
        ],
        [
            "245.29"
        ],
        [
            "94.71"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "64"
        ],
        [
            "15°40′00″N 120°46′00″E﻿ / ﻿15.6666°N 120.7666°E﻿ / 15.6666; 120.7666﻿ (Guimba)"
        ],
        [
            "Jaen"
        ],
        [
            "4th"
        ],
        [
            "3.4%"
        ],
        [
            "79,189"
        ],
        [
            "73,184"
        ],
        [
            "1.51%"
        ],
        [
            "85.46"
        ],
        [
            "33.00"
        ],
        [
            "930"
        ],
        [
            "2,400"
        ],
        [
            "27"
        ],
        [
            "15°20′14″N 120°54′21″E﻿ / ﻿15.3371°N 120.9059°E﻿ / 15.3371; 120.9059﻿ (Jaen)"
        ],
        [
            "Laur"
        ],
        [
            "3rd"
        ],
        [
            "1.7%"
        ],
        [
            "38,263"
        ],
        [
            "35,656"
        ],
        [
            "1.35%"
        ],
        [
            "295.88"
        ],
        [
            "114.24"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "17"
        ],
        [
            "15°35′07″N 121°11′00″E﻿ / ﻿15.5854°N 121.1832°E﻿ / 15.5854; 121.1832﻿ (Laur)"
        ],
        [
            "Licab"
        ],
        [
            "1st"
        ],
        [
            "1.3%"
        ],
        [
            "29,269"
        ],
        [
            "28,254"
        ],
        [
            "0.67%"
        ],
        [
            "67.37"
        ],
        [
            "26.01"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "11"
        ],
        [
            "15°32′27″N 120°45′46″E﻿ / ﻿15.5408°N 120.7629°E﻿ / 15.5408; 120.7629﻿ (Licab)"
        ],
        [
            "Llanera"
        ],
        [
            "5th"
        ],
        [
            "1.8%"
        ],
        [
            "42,281"
        ],
        [
            "39,701"
        ],
        [
            "1.21%"
        ],
        [
            "114.44"
        ],
        [
            "44.19"
        ],
        [
            "370"
        ],
        [
            "960"
        ],
        [
            "22"
        ],
        [
            "15°39′45″N 121°01′19″E﻿ / ﻿15.6624°N 121.0220°E﻿ / 15.6624; 121.0220﻿ (Llanera)"
        ],
        [
            "Lupao"
        ],
        [
            "2nd"
        ],
        [
            "2.0%"
        ],
        [
            "45,917"
        ],
        [
            "43,788"
        ],
        [
            "0.91%"
        ],
        [
            "121.33"
        ],
        [
            "46.85"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "24"
        ],
        [
            "15°52′26″N 120°53′59″E﻿ / ﻿15.8740°N 120.8996°E﻿ / 15.8740; 120.8996﻿ (Lupao)"
        ],
        [
            "Muñoz"
        ],
        [
            "∗"
        ],
        [
            "2nd"
        ],
        [
            "3.6%"
        ],
        [
            "84,308"
        ],
        [
            "81,483"
        ],
        [
            "0.65%"
        ],
        [
            "163.05"
        ],
        [
            "62.95"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "37"
        ],
        [
            "15°42′52″N 120°54′15″E﻿ / ﻿15.7144°N 120.9041°E﻿ / 15.7144; 120.9041﻿ (Muñoz)"
        ],
        [
            "Nampicuan"
        ],
        [
            "1st"
        ],
        [
            "0.6%"
        ],
        [
            "14,471"
        ],
        [
            "14,954"
        ],
        [
            "−0.62%"
        ],
        [
            "52.60"
        ],
        [
            "20.31"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "21"
        ],
        [
            "15°43′56″N 120°38′19″E﻿ / ﻿15.7321°N 120.6386°E﻿ / 15.7321; 120.6386﻿ (Nampicuan)"
        ],
        [
            "Palayan"
        ],
        [
            "†"
        ],
        [
            "3rd"
        ],
        [
            "2.0%"
        ],
        [
            "45,383"
        ],
        [
            "41,041"
        ],
        [
            "1.93%"
        ],
        [
            "101.40"
        ],
        [
            "39.15"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "19"
        ],
        [
            "15°32′26″N 121°04′57″E﻿ / ﻿15.540679°N 121.082430°E﻿ / 15.540679; 121.082430﻿ (Palayan)"
        ],
        [
            "Pantabangan"
        ],
        [
            "5th"
        ],
        [
            "1.4%"
        ],
        [
            "31,763"
        ],
        [
            "29,925"
        ],
        [
            "1.14%"
        ],
        [
            "392.56"
        ],
        [
            "151.57"
        ],
        [
            "81"
        ],
        [
            "210"
        ],
        [
            "14"
        ],
        [
            "15°48′26″N 121°08′39″E﻿ / ﻿15.8073°N 121.1442°E﻿ / 15.8073; 121.1442﻿ (Pantabangan)"
        ],
        [
            "Peñaranda"
        ],
        [
            "4th"
        ],
        [
            "1.4%"
        ],
        [
            "32,269"
        ],
        [
            "29,882"
        ],
        [
            "1.47%"
        ],
        [
            "95.00"
        ],
        [
            "36.68"
        ],
        [
            "340"
        ],
        [
            "880"
        ],
        [
            "10"
        ],
        [
            "15°21′11″N 121°00′09″E﻿ / ﻿15.3530°N 121.0025°E﻿ / 15.3530; 121.0025﻿ (Peñaranda)"
        ],
        [
            "Quezon"
        ],
        [
            "1st"
        ],
        [
            "1.8%"
        ],
        [
            "41,845"
        ],
        [
            "40,592"
        ],
        [
            "0.58%"
        ],
        [
            "68.53"
        ],
        [
            "26.46"
        ],
        [
            "610"
        ],
        [
            "1,600"
        ],
        [
            "16"
        ],
        [
            "15°33′13″N 120°48′36″E﻿ / ﻿15.5536°N 120.8101°E﻿ / 15.5536; 120.8101﻿ (Quezon)"
        ],
        [
            "Rizal"
        ],
        [
            "5th"
        ],
        [
            "3.0%"
        ],
        [
            "70,196"
        ],
        [
            "64,087"
        ],
        [
            "1.75%"
        ],
        [
            "120.55"
        ],
        [
            "46.54"
        ],
        [
            "580"
        ],
        [
            "1,500"
        ],
        [
            "26"
        ],
        [
            "15°42′31″N 121°06′18″E﻿ / ﻿15.7087°N 121.1050°E﻿ / 15.7087; 121.1050﻿ (Rizal)"
        ],
        [
            "San Antonio"
        ],
        [
            "4th"
        ],
        [
            "3.6%"
        ],
        [
            "83,060"
        ],
        [
            "77,836"
        ],
        [
            "1.24%"
        ],
        [
            "153.56"
        ],
        [
            "59.29"
        ],
        [
            "540"
        ],
        [
            "1,400"
        ],
        [
            "16"
        ],
        [
            "15°18′24″N 120°51′00″E﻿ / ﻿15.3067°N 120.8500°E﻿ / 15.3067; 120.8500﻿ (San Antonio)"
        ],
        [
            "San Isidro"
        ],
        [
            "4th"
        ],
        [
            "2.4%"
        ],
        [
            "54,372"
        ],
        [
            "51,612"
        ],
        [
            "1.00%"
        ],
        [
            "56.49"
        ],
        [
            "21.81"
        ],
        [
            "960"
        ],
        [
            "2,500"
        ],
        [
            "9"
        ],
        [
            "15°18′35″N 120°54′23″E﻿ / ﻿15.3096°N 120.9063°E﻿ / 15.3096; 120.9063﻿ (San Isidro)"
        ],
        [
            "San Jose"
        ],
        [
            "∗"
        ],
        [
            "2nd"
        ],
        [
            "6.5%"
        ],
        [
            "150,917"
        ],
        [
            "139,738"
        ],
        [
            "1.48%"
        ],
        [
            "185.99"
        ],
        [
            "71.81"
        ],
        [
            "810"
        ],
        [
            "2,100"
        ],
        [
            "38"
        ],
        [
            "15°47′24″N 120°59′24″E﻿ / ﻿15.7899°N 120.9900°E﻿ / 15.7899; 120.9900﻿ (San Jose)"
        ],
        [
            "San Leonardo"
        ],
        [
            "4th"
        ],
        [
            "3.0%"
        ],
        [
            "68,536"
        ],
        [
            "65,299"
        ],
        [
            "0.93%"
        ],
        [
            "151.90"
        ],
        [
            "58.65"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "15"
        ],
        [
            "15°21′39″N 120°57′33″E﻿ / ﻿15.3607°N 120.9593°E﻿ / 15.3607; 120.9593﻿ (San Leonardo)"
        ],
        [
            "Santa Rosa"
        ],
        [
            "3rd"
        ],
        [
            "3.3%"
        ],
        [
            "75,649"
        ],
        [
            "69,467"
        ],
        [
            "1.64%"
        ],
        [
            "147.15"
        ],
        [
            "56.81"
        ],
        [
            "510"
        ],
        [
            "1,300"
        ],
        [
            "33"
        ],
        [
            "15°25′29″N 120°56′17″E﻿ / ﻿15.4247°N 120.9380°E﻿ / 15.4247; 120.9380﻿ (Santa Rosa)"
        ],
        [
            "Santo Domingo"
        ],
        [
            "1st"
        ],
        [
            "2.6%"
        ],
        [
            "61,092"
        ],
        [
            "57,943"
        ],
        [
            "1.01%"
        ],
        [
            "74.88"
        ],
        [
            "28.91"
        ],
        [
            "820"
        ],
        [
            "2,100"
        ],
        [
            "24"
        ],
        [
            "15°35′11″N 120°52′40″E﻿ / ﻿15.5863°N 120.8778°E﻿ / 15.5863; 120.8778﻿ (Santo Domingo)"
        ],
        [
            "Talavera"
        ],
        [
            "1st"
        ],
        [
            "5.7%"
        ],
        [
            "132,338"
        ],
        [
            "124,829"
        ],
        [
            "1.12%"
        ],
        [
            "140.92"
        ],
        [
            "54.41"
        ],
        [
            "940"
        ],
        [
            "2,400"
        ],
        [
            "53"
        ],
        [
            "15°34′48″N 120°55′12″E﻿ / ﻿15.5800°N 120.9199°E﻿ / 15.5800; 120.9199﻿ (Talavera)"
        ],
        [
            "Talugtug"
        ],
        [
            "5th"
        ],
        [
            "1.1%"
        ],
        [
            "25,236"
        ],
        [
            "23,817"
        ],
        [
            "1.11%"
        ],
        [
            "93.95"
        ],
        [
            "36.27"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "28"
        ],
        [
            "15°46′42″N 120°48′28″E﻿ / ﻿15.7782°N 120.8078°E﻿ / 15.7782; 120.8078﻿ (Talugtug)"
        ],
        [
            "Zaragoza"
        ],
        [
            "1st"
        ],
        [
            "2.3%"
        ],
        [
            "53,090"
        ],
        [
            "49,387"
        ],
        [
            "0.71%"
        ],
        [
            "72.02"
        ],
        [
            "27.81"
        ],
        [
            "740"
        ],
        [
            "1,900"
        ],
        [
            "19"
        ],
        [
            "15°26′54″N 120°47′41″E﻿ / ﻿15.4482°N 120.7948°E﻿ / 15.4482; 120.7948﻿ (Zaragoza)"
        ],
        [
            "Total"
        ],
        [
            "2,310,134"
        ],
        [
            "2,151,461"
        ],
        [
            "1.36%"
        ],
        [
            "5,689.69"
        ],
        [
            "2,196.80"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "849"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the town center, and are sortable by latitude."
        ],
        [
            "Climate"
        ],
        [
            "Climate data for Nueva Ecija"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "34.4(93.9)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "35.3(95.5)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "32.4(90.3)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "32.7(90.9)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "33.3(91.9)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.8(74.8)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "13"
        ],
        [
            "16"
        ],
        [
            "22"
        ],
        [
            "21"
        ],
        [
            "20"
        ],
        [
            "10"
        ],
        [
            "8"
        ],
        [
            "4"
        ],
        [
            "122"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Nueva EcijaYearPop.±% p.a.1903 134,147—    1918 227,096+3.57%1939 416,762+2.93%1948 467,769+1.29%1960 608,362+2.21%1970 851,294+3.41%1975 947,995+2.18%1980 1,069,409+2.44%1990 1,312,680+2.07%1995 1,505,827+2.61%2000 1,659,883+2.11%2007 1,843,853+1.46%2010 1,955,373+2.16%2015 2,151,461+1.84%2020 2,310,134+1.41%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Nueva Ecija in the 2020 census was 2,310,134 people, with a density of 400 inhabitants per square kilometre or 1,000 inhabitants per square mile."
        ],
        [
            "The majority of the population speaks both Tagalog and English fluently.",
            "The province primarily speaks Tagalog dialect called Bulacan Tagalog that resembles poetic form of speech, with a Novoecijano flavor, that added loanwords of Ilocano and Kapampangan origin."
        ],
        [
            "Population percentage(2015 Census)"
        ],
        [
            "  Aliaga: 63,543 (3.0%)"
        ],
        [
            "  Bongabon: 64,173 (3.0%)"
        ],
        [
            "  Cabanatuan: 302,231 (14.0%)"
        ],
        [
            "  Cabiao: 79,007 (3.7%)"
        ],
        [
            "  Carranglan: 41,131 (1.9%)"
        ],
        [
            "  Cuyapo: 65,039 (3.0%)"
        ],
        [
            "  Gabaldon: 35,383 (1.6%)"
        ],
        [
            "  Gapan: 110,303 (5.1%)"
        ],
        [
            "  Gen. M. Natividad: 41,656 (1.9%)"
        ],
        [
            "  Gen. Tinio: 47,865 (2.2%)"
        ],
        [
            "  Guimba: 118,655 (5.5%)"
        ],
        [
            "  Jaen: 73,184 (3.4%)"
        ],
        [
            "  Laur: 35,656 (1.7%)"
        ],
        [
            "  Licab: 28,254 (1.3%)"
        ],
        [
            "  Llanera: 39,701 (1.8%)"
        ],
        [
            "  Lupao: 43,788 (2.0%)"
        ],
        [
            "  Muñoz: 81,483 (3.8%)"
        ],
        [
            "  Nampicuan: 14,954 (0.7%)"
        ],
        [
            "  Palayan: 41,041 (1.9%)"
        ],
        [
            "  Pantabangan: 29,925 (1.4%)"
        ],
        [
            "  Peñaranda: 29,882 (1.4%)"
        ],
        [
            "  Quezon: 40,592 (1.9%)"
        ],
        [
            "  Rizal: 64,087 (3.0%)"
        ],
        [
            "  San Antonio: 77,836 (3.6%)"
        ],
        [
            "  San Isidro: 51,612 (2.4%)"
        ],
        [
            "  San Jose: 139,738 (6.5%)"
        ],
        [
            "  San Leonardo: 65,299 (3.0%)"
        ],
        [
            "  Santa Rosa: 69,467 (3.2%)"
        ],
        [
            "  Santo Domingo: 57,943 (2.7%)"
        ],
        [
            "  Talavera: 124,829 (5.8%)"
        ],
        [
            "  Talugtug: 23,817 (1.1%)"
        ],
        [
            "  Zaragoza: 49,387 (2.3%)"
        ],
        [
            "Total population: 2,151,461"
        ],
        [
            "Ethnicity"
        ],
        [
            "According to the Atlas Filipinas published by the National Commission for Culture and the Arts of the Philippines, 11 local ethnic languages with living ethnic speakers are present in Nueva Ecija, namely Tagalog (in the entire province), Abellen (in a small part in the centre), Kapampangan (in the southwest-most section), Kankanaey (in the east central), Ilokano (in the northern areas and in a small section in the centre, spoken with a Tagalog accent), Alta (in the east central), Ayta Mag-antsi (in the centre and the north-central), Bugkalut (in Carranglan), Ibaloy (in Carranglan), and Kalanguya and Isinay (in Carranglan); another language spoken in the province is Pangasinan, predominantly in northwest areas.",
            "Languages not native in the province are also spoken to varying degrees by their respective ethnic communities within the province,"
        ],
        [
            "Religion"
        ],
        [
            "The province is predominantly Roman Catholic (about 82.43%).",
            "Other Christian groups are Iglesia ni Cristo (5.55%), Born-again Christians, Philippine Independent Church (2.50%), Evangelical (1.70%) & Methodists (1.62%)."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Nueva Ecija"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  26.51"
        ],
        [
            "2009  29.88"
        ],
        [
            "2012  25.20"
        ],
        [
            "2015  20.70"
        ],
        [
            "2018  8.55"
        ],
        [
            "2021  10.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Nueva Ecija is the biggest rice producer in Central Luzon and in the Philippines, thus, often referred to as the Rice Bowl of the Philippines."
        ],
        [
            "Rice fields in Guimba"
        ],
        [
            "Nueva Ecija is considered the main rice growing province of the Philippines and the leading producer of onions in the country."
        ],
        [
            "Major industries"
        ],
        [
            "Nueva Ecija is one of the top producers of agricultural products in the country.",
            "Its principal crops is mainly rice but corn and onion are produced in quantity.",
            "The province is often referred to as the \"Rice Granary of the Philippines\".",
            "Other major crops are mango, calamansi (calamondin orange), banana, garlic, and vegetables.",
            "The municipality of Bongabon at the eastern part of the province at the foot of the Sierra Madre mountains and its neighbouring Laur and Rizal are the major producers of onion and garlic.",
            "Bongabon is called the \"onion capital of the country\".",
            "A sunflower farm is housed inside the Central Luzon State University campus in Science City of Muñoz."
        ],
        [
            "Education is very well established as a major industry in the province.",
            "The leading educational institutions are the Central Luzon State University in Science City of Munoz and Nueva Ecija University of Science and Technology, Wesleyan University-Philippines, the only internationally accredited school in Central Luzon; College of the Immaculate Conception, the oldest Catholic higher-level institution in Nueva Ecija; La Fortuna College and Araullo University in Cabanatuan.",
            "There are 18 tertiary level institutions in Cabanatuan alone."
        ],
        [
            "Health services is a notable industry.",
            "Hospitals cater to patients from Nueva Ecija and some from neighbouring provinces.",
            "There are schools of nursing and midwifery, mostly in Cabanatuan."
        ],
        [
            "There are poultry farms in a number of towns, most notably, the Lorenzo poultry farms in San Isidro which is one of the largest in the country.",
            "Duck raising and egg production is an important livelihood.",
            "Fishponds are unevenly distributed throughout the province but the largest concentrations are in San Antonio, Santa Rosa, and Cuyapo."
        ],
        [
            "Fabrication of tricycle \"sidecars\" is widespread in the province, notably in Santa Rosa, where prices are as low as PhP 7,000 which is practically the cheapest in the country."
        ],
        [
            "Several areas have mineral deposits.",
            "Copper and manganese have been found in General Tinio, Carranglan, and Pantabangan.",
            "The upper reaches of Carranglan and Palayan City are said to contain gold."
        ],
        [
            "In June 2008, it received the title \"Milk Capital of the Philippines\" because Nueva Ecija gathers more milk from cows and carabaos (water buffaloes) than any other place in the Philippines.",
            "The Philippine Carabao Center is in the CLSU compound in Science City of Munoz."
        ],
        [
            "Tourism"
        ],
        [
            "Tourism in Nueva Ecija is focused on gatherings in churches, parks, and festivals."
        ],
        [
            "Some of these heritage areas are the Gapan Church, a Byzantine architecture church built from 1856 to 1872 which has been declared as a National Cultural Treasure, the first in the entire province;"
        ],
        [
            "- the Quezon Family Rest House in Bongabon which was also the place of death of former First Lady Aurora Quezon;"
        ],
        [
            "- Centuries-old brick walls of the Tabacalera in San Isidro remain as witness to the Novo Ecijanos' 100-year oppression, from 1782 to 1882, when the province became the center of the tobacco monopoly in Central Luzon and was thus restricted from raising other crops;"
        ],
        [
            "- the statue of Philippine hero General Antonio Luna astride a horse stands at the Cabanatuan plaza in front of the cathedral on the exact spot where the brave general was assassinated in 1899 in the city that adopted him subsequently;"
        ],
        [
            "- Site of the arrest of Philippine hero Apolinario Mabini, known as \"the sublime paralytic\", by the Americans on December 10, 1899, in Cuyapo;"
        ],
        [
            "- the Triala House of General Manual Tinio, built during the early Commonwealth period, it features ornately designed turn-of-the-century furniture and a life-size figure of esteemed Nove Ecijano Don Kapitan Berong in stained glass;"
        ],
        [
            "- The Grand Sedeco house in San Isidro, which General Emilio Aguinaldo frequented, marks this gallant town that has proven time and again to be cradle of Filipino heroes - it was here that General Frederick Funston planned the capture of Aguinaldo, first President of the Philippine republic, during the Philippine–American War;"
        ],
        [
            "- Wright Institute of San Isidro, of the first high schools established outside Metro Manila during the American period;"
        ],
        [
            "- the Dalton Pass located in Capintalan, Carranglan, the five-hectare area blessed with a cool climate houses the monument of General Dalton and a tower that borders the provinces of Nueva Ecija and Nueva Vizcaya - uphill is a World War II memorial in black marble where a historical account of the war had been etched in English and Japanese;"
        ],
        [
            "- the WWII Concentration Camp in Cabanatuan; Nampicuan Church;"
        ],
        [
            "- Carranglan Church;"
        ],
        [
            "- the grand Minalungao National Park, known for its high limestone formations sculpted by the Penaranda river;"
        ],
        [
            "- General Luna Fall in Rizal;"
        ],
        [
            "- Mount Olivete in Bongabon, which is frequented by pilgrims due to its holy spring;"
        ],
        [
            "- the Capintalan, which is a reserve known for its WWII tunnels, forests, rivers, and artifacts and has been maintained by the only Ifugao community in Nueva Ecija, located in Carranglan; Palaspas Falls in San Jose City;"
        ],
        [
            "- Gabaldon Falls in Gabaldon which is within the Sabani Estate Agricultural College; Peñaranda Church, which is one of the oldest in the province, built initially in 1887; Diamond Park in San Jose City;"
        ],
        [
            "- Pantabangan Dam, built in 1947, is the first and only rubber dam in Asia;"
        ],
        [
            "- the campus of the Philippine Rice Research Institute in Muñoz which is the main research and experimentation arm of the government for rice and other crops;"
        ],
        [
            "- Central Luzon State University, which is the most academically excellent in the province and the only Novo Ecijano university to be declared a cultural property of the nation;"
        ],
        [
            "- CLSU Agricultural Museum;"
        ],
        [
            "- Living Fish Museum in Muñoz;"
        ],
        [
            "- the Philippine Carabao Center in Muñoz, which is the main arm of the national government on carabao research and development;"
        ],
        [
            "- Mount Mapait in Palayan City;"
        ],
        [
            "- the Philippine Eagle Exclusive Area in the Nueva Ecija Sierra Madres."
        ],
        [
            "Tourist attractions:"
        ],
        [
            "Minalungao Park"
        ],
        [
            "Pantabangan Lake"
        ],
        [
            "Lupao Pinsal Falls"
        ],
        [
            "Nabao Lake"
        ],
        [
            "Fort Magsaysay Dam (Pahingahan)"
        ],
        [
            "Tanawan"
        ],
        [
            "Dalton Pass"
        ],
        [
            "Landscape at Carranglan"
        ],
        [
            "Pantabangan Dam"
        ],
        [
            "Central Luzon State University main gate"
        ],
        [
            "Politics"
        ],
        [
            "This section does not cite any sources.",
            "Please help improve this section by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.",
            "(November 2022) (Learn how and when to remove this message)"
        ],
        [
            "The Governor of Nueva Ecija is the highest-ranking official in the province, after the President of the Philippines.",
            "The province is divided into five congressional districts, which consists of 27 municipalities and five cities, namely: Cabanatuan, San Jose, Palayan, Gapan and Science City of Muñoz.",
            "The provincial capital is Palayan City."
        ],
        [
            "Each district has a specialization, where district 1 is known for its organic agriculture, district 2 is known for its highlands and protected forests, district 3 is known for its urban and economic settings, and district 4 is known for its diverse cultural celebrations.",
            "Each district is under a congressperson, whom represents the district at the House of Representatives in Congress."
        ],
        [
            "Political alliances in the province are extremely strong, with the ruling party, the Liberal Party of the Philippines, staying in power since the post-martial law era.",
            "Being an agricultural province, the main political agenda for the province is agricultural and aquacultural advancements, along with high level education, health, and job and business generation.",
            "The current governor of the province is Aurelio Umali and its vice governor is Anthony Umali."
        ],
        [
            "Capitols of Nueva EcijaNew Provincial Capitol (seat of Government) of Nueva Ecija is at Palayan City.The Governor and Provincial Officers still hold office at the Old Provincial Capitol in Cabanatuan"
        ],
        [
            "Culture"
        ],
        [
            "Novo Ecijano culture is a mixture of Tagalog, Kapampangan, Pangasinense, Ilokano, and other indigenous cultures within the province.",
            "A melting pot of culture, the province has a varied of festivals, traditions, and beliefs that constitute Novo Ecijano heritage, along with tangible heritage structures, scenes, and objects."
        ],
        [
            "Cosmopolitanism"
        ],
        [
            "Novoecijano architecture is based on indigenous Filipino types, Spanish colonial types, American colonial types, and modernist types.",
            "In rural areas, the bahay kubo is still present, but has decreased significantly.",
            "Spanish and American colonial architecture, like those in the National Capital Region, have slowly been demolished one after the other, signaling a destruction of colonial heritage.",
            "Despite this, there are still colonial structures preserved and conserved such as town churches and some houses surrounding them.",
            "The current architectural trend in the province is modernist architecture, signaling an end to colonial architecture in the province."
        ],
        [
            "Music"
        ],
        [
            "The music of the Novo Ecijanos is more concentrated on the Tagalog traditional and international music.",
            "The province shares the music heritage of other Tagalog provinces such as Rizal, Batangas, Bataan, Bulacan, Quezon, and Laguna."
        ],
        [
            "Visual arts"
        ],
        [
            "Many Novo ecijanos have been internationally known for their visual arts.",
            "The mediums are diverse, from garlic oil, blood, hair, threads, clays, pastels, leaves, mud, bronze, marble, cotton, pina, and paints which introduced as Indigenous Materials or Indigenouism movement started by Internationally known Hair and Blood Painter of the Philippines."
        ],
        [
            "Values"
        ],
        [
            "As a general description, the distinct value system of Filipinos is rooted primarily in personal alliance systems, especially those based in kinship, obligation, friendship, religion, and commercial relationships."
        ],
        [
            "Filipino values are, for the most part, centered around maintaining social harmony, motivated primarily by the desire to be accepted within a group.",
            "Social approval, acceptance by a group, and belonging to a group are major concerns.",
            "Caring about what others will think, say or do, are strong influences on social behavior among Filipinos."
        ],
        [
            "Other elements of the Filipino value system are optimism about the future, pessimism about present situations and events, concern and care for other people, the existence of friendship and friendliness, the habit of being hospitable, religious nature, respectfulness to self and others, respect for the female members of society, the fear of God, and abhorrence of acts of cheating and thievery."
        ],
        [
            "Dance"
        ],
        [
            "A very Tagalog hotpot of culture, the novoecijano dance scheme is ruled by the carinosa, tinikling, and other Tagalog traditional dances."
        ],
        [
            "Cuisine"
        ],
        [
            "Novo ecijano cuisine is varied.",
            "In its northwest, seafood and vegetable dishes with a lot of salt is prevalent due to its proximity with Pangasinan.",
            "In its northwest, highland crops are much prized.",
            "In its central and southern areas, food is very diverse due to its proximity with numerous sources of ingredients."
        ],
        [
            "Literature"
        ],
        [
            "Novo Ecijano literature is defined by a strong nationalistic approach and a strong ethnically grounded scheme.",
            "The literature of the province is honed by the two literature departments of the Central Luzon State University, among others."
        ],
        [
            "The best known Tagalog novelist of the province is Lázaro Francisco.",
            "His novels depicted life in an agrarian society that gave rise to the social unrest of his period (1950s and 1960s).",
            "One of his novels was serialized by Liwayway Magazine, the most popular Tagalog magazine at that time until the 1970s."
        ],
        [
            "Lázaro Francisco was from Tarlac.",
            "As a child, her parents immigrated to Nueva Ecija.",
            "He practically grew up and studied in Cabanatuan.",
            "One of the elementary schools in Cabanatuan has been named after him.",
            "He was also a Freemason, and one of the distinguished Master of Masonic Lodge 53 in Cabanatuan.",
            "He was named a National Artist in 2012."
        ],
        [
            "Media"
        ],
        [
            "Nueva Ecija has many of its own television channels and radio stations.",
            "Almost all towns have their own radio stations."
        ],
        [
            "Sports"
        ],
        [
            "The province is home to the Nueva Ecija Rice Vanguards of the Maharlika Pilipinas Basketball League (MPBL).",
            "The team has won one championship in 2022, where they also accomplished the first and only regular season sweep in the league."
        ],
        [
            "Games"
        ],
        [
            "Traditional Novo Ecijano games are mainly Tagalog in nature.",
            "These games include luksong baka, patintero, piko, and tumbang preso.",
            "The novo ecijano art group \"Makasining\" is also a main author of \"Laro ng Lahi\" or Philippine Indigenous Games preservation advocacy."
        ],
        [
            "Festivals"
        ],
        [
            "This section has multiple issues.",
            "Please help improve it or discuss these issues on the talk page.",
            "(Learn how and when to remove these template messages)"
        ],
        [
            "This section is written like a travel guide.",
            "Please help improve the section by introducing an encyclopedic style or move the content to Wikivoyage.",
            "(May 2016)"
        ],
        [
            "It has been suggested that parts of this page be moved into Culture of the Philippines#Festivals.",
            "(Discuss)  (September 2019)"
        ],
        [
            " (Learn how and when to remove this message)"
        ],
        [
            "One of the most historic provinces of the Philippines, festivals and fiestas are celebrated in different places in Nueva Ecija.",
            "Local history, customs and traditions can be witnessed in the province's festivals of locality."
        ],
        [
            "Festival"
        ],
        [
            "City/Municipality"
        ],
        [
            "Date"
        ],
        [
            "Notes"
        ],
        [
            "Banatu"
        ],
        [
            "Cabanatuan"
        ],
        [
            "January 29 – February 4"
        ],
        [
            "“Banatu Festival,” takes its name from “banatu” which means “vine”"
        ],
        [
            "Taong Putik Festival"
        ],
        [
            "Aliaga"
        ],
        [
            "June 24"
        ],
        [
            "At the crack of dawn, scores of mud-covered, barely dressed devotees make their appearance, asking for alms and candles form the wide awake town folks.",
            "This practice mimics a biblical myth about St. John the Baptist"
        ],
        [
            "Ragragsak Ti Guimba"
        ],
        [
            "Guimba, Nueva Ecija"
        ],
        [
            "February to March"
        ],
        [
            "-"
        ],
        [
            "Holy Week Rituals of Puncan"
        ],
        [
            "Carranglan"
        ],
        [
            "Holy Week"
        ],
        [
            "The unique Holy Week rites of (Puncan)Carranglan one of the oldest towns in Nueva Ecija"
        ],
        [
            "Kariton Festival"
        ],
        [
            "Licab"
        ],
        [
            "March 28"
        ],
        [
            "Celebrated during the annual celebration of the founding anniversary of Licab"
        ],
        [
            "Baybayanting Festival"
        ],
        [
            "Lupao"
        ],
        [
            "July 25"
        ],
        [
            "Honoring the town's patron – Señor Santiago.",
            "or Saint James"
        ],
        [
            "Araquio Festival"
        ],
        [
            "Penaranda"
        ],
        [
            "May"
        ],
        [
            "The festival dramatized the spread of Christianity in the country and the war between Christians and Muslims"
        ],
        [
            "Tanduyong Festival"
        ],
        [
            "San Jose City"
        ],
        [
            "fourth Sunday of April"
        ],
        [
            "The people of San Jose dance through the main street in a colorful, enchanting celebration of the blessing of the harvest of onion.",
            "The streets are filled with contingents of dancers outfitted in striking, multi-hued native costumes"
        ],
        [
            "Pagibang Damara"
        ],
        [
            "San Jose City"
        ],
        [
            "April or May"
        ],
        [
            "A celebration for a bountiful harvest of the city"
        ],
        [
            "Pandawan Festival"
        ],
        [
            "Pantabangan"
        ],
        [
            "April"
        ],
        [
            "The word “Pandaw” means assurance of an abundant fresh-water catch each time the festival is celebrated"
        ],
        [
            "Sibuyas Festival"
        ],
        [
            "Bongabon"
        ],
        [
            "April 1–10"
        ],
        [
            "Celebrated as a form of thanksgiving and a way to show that Bongabon is one of the largest producers of onion in Asia"
        ],
        [
            "Tsinelas Festival"
        ],
        [
            "Gapan"
        ],
        [
            "August 6–25"
        ],
        [
            "Commemorates Gapan's major industry with the Tsinelas Festival on the anniversary of their cityhood."
        ],
        [
            "Paistima Festival"
        ],
        [
            "Cabiao"
        ],
        [
            "February 5–11"
        ],
        [
            "Commemorate the founding anniversary of the town"
        ],
        [
            "Kabyawan Festival"
        ],
        [
            "Cabiao"
        ],
        [
            "May 8–16"
        ],
        [
            "Thanks giving to the feast of patron's town proper Saint John Nepomocene"
        ],
        [
            "Kalamay Festival"
        ],
        [
            "San Leonardo"
        ],
        [
            "August 25"
        ],
        [
            "Thanksgiving for the abundance of harvest using rice as main ingredients of kalamay is the town's major cultural activity."
        ],
        [
            "Papaya Festival"
        ],
        [
            "General Tinio"
        ],
        [
            "March"
        ],
        [
            "Holy Mass and religious activities are celebrated to honor the town's patron saint, San Isidro de Labrador.",
            "Papaya is the town's former name after a fruit tree abundant in the town."
        ],
        [
            "Patimyas Ani Festival -  Quezon, Nueva Ecija"
        ],
        [
            "• A festival wherein elementary students from each barangay are doing street dancing and showdown in the football field in Quezon, Nueva Ecija.",
            "It celebrates every last week of January annually."
        ],
        [
            "Health"
        ],
        [
            "The health issues facing the province are minimal because of the health establishments dotting all over the province.",
            "National health issues such as dengue, and malaria are on rise during rainy seasons, while HIV/AIDS is still low, but 2015 annual growth rate is unarguably high."
        ],
        [
            "Education"
        ],
        [
            "The level of literacy in the province is very high.",
            "The top five high education centers in the province are Central Luzon State University at Science City of Muñoz, Wesleyan University Philippines, Nueva Ecija University of Science and Technology, Araullo University, and College of the Immaculate Conception, all located in Cabanatuan.",
            "The universities offer a diverse range of specializations.",
            "Every municipality also has local colleges.",
            "Central Luzon State University, a national cultural property, has also been accredited as being the twenty first to the sixth most academically excellent in the entire country.",
            "The university has also been cited as one of the 100 most significant educational institutions in Asia, overwhelming most schools in Metro Manila and other metropolitan areas in the country."
        ],
        [
            "Fashion"
        ],
        [
            "Erjohn Dela Serna, fashion designer"
        ],
        [
            "Notable people"
        ],
        [
            "General Mariano Llanera † (1855–1942) — fought in the provinces of Bulacan, Tarlac, Pampanga, and Nueva Ecija."
        ],
        [
            "General Manuel Tinio † (1877 –1924) —  the youngest General of the Province of Nueva Ecija, Republic of the Philippines in 1907."
        ],
        [
            "General Benito Natividad † (1874–1964) — military leader, a governor, and a judge who fought in the Philippine–American War and was one of the last to surrender together with Gen. Manuel Tinio, after the capture of Aguinaldo."
        ],
        [
            "Engr.",
            "Ponciano A. Bernardo † (December 2, 1905 — April 28, 1949) was the second Mayor of Quezon City.",
            "Ponciano Bernardo was born in Santa Rosa, Nueva Ecija, whose father immigrated from Pandi, Bulacan to PAPAYA now called General Tinio, Nueva Ecija.",
            "Ponciano Bernardo School and Ponciano Bernardo Park in Cubao, Quezon City is a memorial for him.",
            "Ponciano was killed in an ambush by Hukbalahap with the Philippine First Lady Aurora Quezon on their route to Aurora.",
            "Ponciano was appointed by the second Philippine President Manuel Quezon, prior to being Mayor he was Secretary of Department of Public Works and Highways.",
            "Ponciano was a Filipino engineer and politician who served as mayor of Quezon City, holding the position from 1947 until his death in 1949.",
            "It was during his tenure that Quezon City was designated as the capital city of the Philippines."
        ],
        [
            "Juan Pajota (c.1914 – 1976) was involved in the Raid at Cabanatuan, an action which took place in the Philippines on January 30, 1945, by US Army Rangers and Filipino guerrillas and resulted in the liberation of more than 500 American prisoners of war (POWs) from a Japanese POW camp near Cabanatuan"
        ],
        [
            "Epifanio de los Santos † (April 7, 1871 — April 18, 1928) — Epifanio de los Santos y Cristóbal, sometimes known as Don Pañong or Don Panyong he was born in 1871 in Malabon, province of Rizal, (now an independent city) to Escolastico de los Santos of Nueva Ecija and musician Antonina Cristóbal of Malabon.",
            "He was a noted Filipino historian, literary critic, art critic, jurist, prosecutor, antiquarian, archivist, scholar, painter, poet, musician, musicologist, philosopher, philologist, bibliographer, translator, journalist, editor, publisher, paleographer, ethnographer, biographer, researcher, civil servant, patriot and hero.",
            "He was appointed Director of the Philippine Library and Museum by Governor General Leonard Wood in 1925.",
            "He was appointed district attorney of San Isidro, Nueva Ecija.",
            "He was later elected as governor of Nueva Ecija in 1902 and 1904.",
            "His election victory made him the first democratically elected provincial governor and head of the Federal Party in Nueva Ecija."
        ],
        [
            "Ameurfina Melencio-Herrera, Filipino lawyer and jurist who served as Associate Justice of the Supreme Court of the Philippines from 1979 to 1992.",
            "Herrera is a granddaughter of Emilio Aguinaldo."
        ],
        [
            "Felipe Padilla de León  a Filipino classical music composer, conductor, and scholar.",
            "He was named as  National Artist of Philippines for Music."
        ],
        [
            "Lázaro Francisco is one of the finest Tagalog novelist.",
            "One of his novels has been serialized by Liwayway magazine, the most popular Tagalog magazine in the 1950s-1970s.",
            "A Freemason and one of the distinguished Master of Masonic Lodge 53 of Cabanatuan, he was named National Artist of Philippines for Literature in 2012."
        ],
        [
            "Catalino \"Lino\" Ortiz Brocka, also known as Lino Brocka (April 3, 1939 – May 22, 1991) born in Pilar, Sorsogon but he grew up in San Jose City, Nueva Ecija.",
            "He was a Filipino film director, widely regarded as one of the most influential and significant Filipino filmmakers in the history of Philippine cinema.",
            "In 1983, he founded the organization Concerned Artists of the Philippines (CAP), dedicated to helping artists address issues confronting the country."
        ],
        [
            "Francisco Fronda † (December 22, 1896 – February 17, 1986) a Filipino scientist, Father of Poultry Science in the Philippines.",
            "He was a  National Scientist of the Philippines for Animal Husbandry."
        ],
        [
            "E. Arsenio Manuel † (1909 - 2003) a Philippine academic, historian, and anthropologist best known for his contributions to Philippine anthropology, history, literature, and linguistics known as the \"Dean of Filipino Anthropology\" and \"Father of Philippine Folklore"
        ],
        [
            "Heber Gonzalez Bartolome (born November 4, 1948) — a Filipino folk and folk rock singer, songwriter, composer, poet, guitarist, bandurria player, bluesman, and painter.",
            "His music was influenced by the \"stylistic tradition\" of Philippine folk and religious melodies."
        ],
        [
            "Rogelio R. Sikat (Also known as Rogelio Sícat) (1940–1997) — A Filipino fictionist, playwright, translator and educator.",
            "He was born to Estanislao Sikat and Crisanta Rodriguez on June 26, 1940, in Alua, San Isidro, Nueva Ecija.",
            "He is the sixth of eight children.",
            "Sicat graduated with a B.Litt.",
            "in Journalism from the University of Santo Tomas and an M.A.",
            "in Filipino from the University of the Philippines."
        ],
        [
            "Dorothy Acueza Jones, also known as Nida Blanca † (January 6, 1936 – November 7, 2001) — Nida Blanca as popularly known by her stage name, was a Filipina actress.",
            "She starred in over 163 movies and 14 television shows and received over 16 awards for movies and six awards for television during her 50-year film career.",
            "She was named one of 15 Best Actress of all Time by YES magazine."
        ],
        [
            "Nestor de Villa † (July 6, 1928 – February 21, 2004) — was a Filipino actor frequently cast in musical films.",
            "He was a gifted dancer often paired with frequent onscreen partner Nida Blanca in both movies and television.",
            "His dancing talent led some to call him the \"Fred Astaire of the Philippines\", though the same moniker had also been given to Bayani Casimiro."
        ],
        [
            "Rafael V. Mariano (born October 24, 1956)) — former partylist representative for Anakpawis and former Secretary of Agrarian Reform"
        ],
        [
            "Jaime de los Santos (born April 1946) — is a retired military general in the Philippines.",
            "He joined the Philippine Army in 1969 after graduating from the Philippine Military Academy with a degree Bachelor of Science in Military Engineering.",
            "De los Santos later on served as a Brigade Commander, Chief of Staff and Commanding General of an Infantry Division and Superintendent of the Philippine Military Academy."
        ],
        [
            "Frankie Evangelista † (July 24, 1934 — February 18, 2004) — A former radio and television broadcaster of ABS-CBN since 1953."
        ],
        [
            "Josepina \"Josie\" Padiermos Fitial (born November 25, 1962) — The current First Lady of the Northern Mariana Islands and the wife of Governor Benigno Fitial.",
            "She became First Lady upon the inauguration of her husband as the sixth governor of the Northern Mariana Islands on January 9, 2006."
        ],
        [
            "Fred Panopio † (February 2, 1939 — April 22, 2010) — A Filipino singer and actor who rose to fame in the 1970s."
        ],
        [
            "Oscar A. Solis (October 13, 1953) — Oscar Azarcon Solis was born in San Jose City, Philippines.",
            "He studied at Christ the King Seminary of the Society of the Divine Word in Quezon City, Philippines, and at the Pontifical Royal Seminary, University of Santo Tomas, in Manila.",
            "After migrating to the United States in 1984, Father Solis served as associate pastor of St. Rocco's parish, New Jersey, 1984–1988.",
            "With permission from his Ordinary in the Philippines, he went to the Diocese of Houma-Thibodaux in 1988 where he was appointed associate pastor of St. Joseph Co-Cathedral.",
            "He was incardinated into the Diocese of Houma-Thibodaux in 1992, and was named pastor of St. Joseph Co-Cathedral in 1999.",
            "He has been a member of the Diocesan Priests' Council, the Personnel Committee and the College of Consultors.",
            "Solis is the first Filipino-American to be consecrated a bishop."
        ],
        [
            "Joe Taruc (September 18, 1946 - September 30, 2017) - Born in Gapan, Jose Malgapo Taruc, Jr. is his full name.",
            "He is a longtime radio broadcaster of DZRH and also a host of his radio programs Pangunahing Balita and Damdaming Bayan."
        ],
        [
            "Anthony Taberna (January 16, 1975) — Born in San Isidro, Nueva Ecija, Anthony \"Tunying\" Taberna is a Filipino television news anchor and radio broadcaster.",
            "At ABS-CBN, Taberna has hosted television and radio programs covering news and public affairs.",
            "He is currently hosting Umagang Kay Ganda (where he gained popularity in the segment \"Punto por Punto\") and XXX: Exklusibong, Explosibong, Exposé.",
            "As a DZMM broadcaster, Taberna is one of the lead anchors for Dos Por Dos, a late afternoon show, along with Gerry Baja."
        ],
        [
            "Kathryn Bernardo (March 26, 1996) — Born in Cabanatuan, Kathryn Chandria Manuel Bernardo is her full name.",
            "She is a Filipina actress and her career started in 2003.",
            "She is best known for her role as Mara in the primetime Filipino drama, Mara Clara.",
            "Kathryn is currently a contract artist of Star Magic and ABS-CBN and most recently starred as Ana Bartolome in the 2011 drama film, Way Back Home.",
            "She currently plays the main protagonist, Christina Charlota Tampipi, in the primetime series Got to Believe."
        ],
        [
            "Willie Revillame (January 27, 1961) — A Novo Ecijano with roots from Cabanatuan but he was born in Manila, Philippines.",
            "He started his career in 1986.",
            "He is a television host, actor, comedian and a recording artist in the Philippines."
        ],
        [
            "Jose \"Kaka\" Balagtas — A film director, writer, and actor.",
            "He was the Vice Mayor (2010–2016) of San Antonio, Nueva Ecija."
        ],
        [
            "Joanna Cindy Miranda — A Filipina model and host from Rizal, Nueva Ecija, who won the Binibining Pilipinas-Tourism 2013 crown and will represent the country in Miss Tourism Queen International in Lhasa, Tibet in the first week of September 2013."
        ],
        [
            "Paolo Ballesteros — (born November 29, 1982, in Cabanatuan, is a Filipino actor, TV host and model.",
            "He has appeared in films and several TV shows.",
            "He has won numerous international awards, all portraying the struggles of the LGBT community."
        ],
        [
            "John Paul Lizardo — Also known as Japoy Lizardo, is a Filipino Taekwondo Asian Games Bronze medalist, Actor and commercial model from Cabanatuan."
        ],
        [
            "Yen Santos — A Filipina actress and dancer.",
            "Part of ABS-CBN Star Magic.",
            "Had appeared in Growing Up and teleserye Pure Love.",
            "From Cabanatuan."
        ],
        [
            "Jason Abalos (born January 14, 1985) — An actor, dancer and commercial model; from Pantabangan, Nueva Ecija.",
            "In 2022, he was elected member of the provincial board representing the 2nd District."
        ],
        [
            "Rommel Padilla (born January 4, 1965) — A politician, businessman, actor and endorser; from Cuyapo, Nueva Ecija.",
            "He is the father of Daniel Padilla and the brother of elected Senator Robin Padilla.",
            "He was the former member of the provincial board (2007–2010, 2016–2019) representing the 1st District."
        ],
        [
            "Ramon Valmonte— A writer and founder of Nueva Ecija Journal.",
            "Professor from Wesleyan University Philippines descendant of Pantaleón Valmonte y Rufino, sometimes referred to as Pantaleón Belmonte a capitan municipal (mayor) of Gapan and a general during the Philippine Revolution against Spain."
        ],
        [
            "Anselmo Roque— An agricultural columnist.",
            "Multiawarded journalist and educator Anselmo Roque.",
            "One of the longest-serving provincial writers of the Inquirer, Roque joined the paper in 1986 as its correspondent in Nueva Ecija province."
        ],
        [
            "Ryza Cenon — A Filipina actress born on December 21, 1987, in Gapan, as Rhiza Ann Cenon Simbulan.",
            "She is an actress, known for Lovestruck (2005), Mr. & Mrs. Cruz (2018) and Sana ay ikaw na nga (2012)."
        ],
        [
            "Renato Bautista — He was born in 1980 in Nueva Ecija, Philippines as Renato M. Bautista Jr.",
            "He is an assistant director and director, known for 'Di natatapos ang gabi (2010), Palitan (2012) and Expressway (2016)."
        ],
        [
            "Bert Matias — He was born on July 6, 1937, in Cabanatuan, Philippines as Lamberto I. Matias.",
            "He is an actor, known for Fred Claus (2007), Book of Swords (1996) and Renegade Force (1998)."
        ],
        [
            "Vic Sotto — Multi-awarded Filipino actor, television host, comedian."
        ],
        [
            "Alberto Ramento — ninth Supreme Bishop of the Philippine Independent Church, known as the Bishop of Poor Peasants and Workers"
        ],
        [
            "Ruel S. Bayani — Filipino film and television director, writer, producer, who is best known for directing movies like One More Try, and No Other Woman and co-directing television shows like Budoy, Kokey, Mula Sa Puso."
        ],
        [
            "Samboy de Leon — Filipino professional basketball player who last played for the Star Hotshots of the Philippine Basketball Association (PBA).",
            "National Athletic Association of Schools, Colleges and Universities (NAASCU), where he was awarded the league MVP in 2014 played for  CEU Scorpions."
        ],
        [
            "Coleen Perez — (born Coleen Nicole Perez Borgonia on January 26, 1995, in Gapan, (Formerly known as Maricris Garcia and also known as Faye Lorenzo) is a Filipina commercial model and actress, known for her roles such as Molly Rivera in GMA Network's More Than Words."
        ],
        [
            "Nikki Brianne F. Samonte — better known as Nikki \"Nikz\" Samonte (born March 1, 2000) in Nueva Ecija is a Filipina child actress, singer and model.",
            "She is currently handled and managed by ABS-CBN's talent agency, Star Magic."
        ],
        [
            "Manuel Chua (born October 29, 1980) — A model and actor; from Cabanatuan.",
            "He was discovered in the Filipino version of the reality game show Pinoy Fear Factor which was aired on ABS-CBN from 2008 to 2009.",
            "In 2022, he was elected member of the city council of San Jose."
        ],
        [
            "Fred Panopio — (February 2, 1939 – April 22, 2010) was a Filipino singer and actor who rose to fame in the 1970s.",
            "This particular kind of music is evident is many of his hits, such as \"Pitong Gatang\", \"Markado\", and \"Tatlong Baraha\".",
            "He was also an occasional actor, and appeared in several movies alongside Jess Lapid and Fernando Poe, Jr.",
            "He is also known sing the Poe's movie's theme songs.In 1999, Panopio and Victor Wood released an album and became part of the OPM legends."
        ],
        [
            "Grace Nono – (born May 6, 1965) is a Filipino singer known for her musical style based on traditional Filipino rhythms.",
            "She is also an ethnomusicologist, scholar of Philippine shamanism, and cultural worker.",
            "Her father came from Nueva Ecija."
        ],
        [
            "Kurt Isaiah Perez — (born December 1, 1997) in Cabanatuan is a Filipino former child actor.",
            "He became famous for being the Ultimate Male Survivor of StarStruck Kids, the reality-based talent search show of GMA in the Philippines."
        ],
        [
            "See also"
        ],
        [
            "Intangible Cultural Heritage of the Philippines"
        ],
        [
            "List of radio stations in Nueva Ecija"
        ],
        [
            "Super regions of the Philippines"
        ],
        [
            "References"
        ],
        [
            "^ \"N. Ecija founding date April 25, not Sept. 2\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on May 30, 2016.",
            "Retrieved June 17, 2016."
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 17, 2013.",
            "Retrieved October 17, 2013."
        ],
        [
            "^ \"POPULATION PROJECTIONS BY REGION, PROVINCE, CITIES AND MUNICIPALITIES, 2020-2025\".",
            "www.doh.gov.ph.",
            "Department of Health.",
            "August 27, 2020.",
            "Archived from the original on May 14, 2021.",
            "Retrieved October 16, 2020."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Dependency Ratio Down by Three Persons in Nueva Ecija\".",
            "Philippine Statistics Authority.",
            "September 2, 2002.",
            "Retrieved December 15, 2015."
        ],
        [
            "^ Census, United States Bureau of the; Commission (1900-1916), United States Philippine (1905).",
            "Census of the Philippine Islands: Taken Under the Direction of the Philippine Commission in the Year 1903, in Four Volumes ... U.S. Government Printing Office.",
            "Retrieved August 17, 2019.",
            "{{cite book}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Barrows, Dr. David P. (1910).",
            "The Ilongot or Ibilao of Luzon.",
            "Popular Science Monthly."
        ],
        [
            "^ Mozo, Antonio (1763).",
            "En Que Se Da Cuenta.",
            "googlebooks.com.",
            "p. 247."
        ],
        [
            "^ \"The Ilongot\".",
            "Daniel Strouthes."
        ],
        [
            "^ \"Pre Colonial Period\".",
            "oocities.org.",
            "Retrieved November 21, 2022."
        ],
        [
            "^ Barrows, David P. (1916).",
            "\"The Governor-General of the Philippines Under Spain and the United States\".",
            "The American Historical Review.",
            "21 (2): 288–311.",
            "doi:10.2307/1835051.",
            "JSTOR 1835051."
        ],
        [
            "^ \"The Augustinian Friars (Order of Saint Augustine)\".",
            "sanagustinchurch.org."
        ],
        [
            "^ a b The Historical Indúng Kapampángan: Evidence from History and Place Names"
        ],
        [
            "^ a b \"Tantingco: The Kapampangan in Us\".",
            "Archived from the original on January 23, 2024.",
            "Retrieved January 23, 2024."
        ],
        [
            "^ \"N. Ecija founding date April 25, not Sept. 2\".",
            "inquirer.net.",
            "April 25, 2016."
        ],
        [
            "^ \"About Cabanatuan City\".",
            "fnetravel.com.",
            "Archived from the original on June 20, 2012.",
            "Retrieved May 29, 2012."
        ],
        [
            "^ \"Aurora, Philippines – History\".",
            "www.aurora.ph.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Who We Are: Nueva Ecija"
        ],
        [
            "^ Edilberto C de Jesus (April 28, 2010).",
            "\"Tobacco Monopoly in Philippines\".",
            "The Reading Life."
        ],
        [
            "^ \"History of the Province\".",
            "visitmyphilippines.com."
        ],
        [
            "^ \"True Version of the Philippine Revolution\".",
            "authorama.com."
        ],
        [
            "^ Agoncillo & Guerrero (1977).",
            "\"The Constitution of the Old La Liga Filipina (1892)\".",
            "History of the Filipino People (5th ed.).",
            "pp. 164–168.",
            "Archived from the original on August 3, 2012."
        ],
        [
            "^ \"La Solidaridad and La Liga Filipina\".",
            "philippine-history.org."
        ],
        [
            "^ \"About Gapan\".",
            "cityofgapan.gov.",
            "Archived from the original on May 18, 2013.",
            "Retrieved November 21, 2022."
        ],
        [
            "^ \"Philippine Revolution of 1896\".",
            "About Philippines.",
            "November 7, 2010.",
            "Archived from the original on October 21, 2013.",
            "Retrieved May 29, 2012."
        ],
        [
            "^ \"Magdiwang and Magdalo\".",
            "tripod.com."
        ],
        [
            "^ \"Pact of Biak na Bato\".",
            "philippine-history.org."
        ],
        [
            "^ \"Emilio Aguinaldo y Famy\".",
            "Library of Congress."
        ],
        [
            "^ Arnaldo Dumindin.",
            "\"Philippine–American War, 1899–1902\".",
            "philippineamericanwar.webs.com.",
            "Archived from the original on September 5, 2018.",
            "Retrieved June 7, 2012."
        ],
        [
            "^ \"The World of 1898: The Spanish–American War\".",
            "Hispanic Division Library of Congress.",
            "Archived from the original on June 29, 2011.",
            "Retrieved December 29, 2017."
        ],
        [
            "^ \"HISTORY OF \"UNANG SIGAW NG NUEVA ECIJA\"\".",
            "Ginto ang Inaani."
        ],
        [
            "^ Arnaldo Dumindin.",
            "\"Fil-Am War Breaks Out\".",
            "philippineamericanwar.webs.com.",
            "Archived from the original on November 29, 2021.",
            "Retrieved June 7, 2012."
        ],
        [
            "^ \"The Philippines under Spanish and American Rules\".",
            "Forbes-Lindsay, C. H."
        ],
        [
            "^ \"The Treaty of Paris\" (PDF).",
            "law.upd.edu.ph.",
            "Archived from the original (PDF) on March 26, 2012."
        ],
        [
            "^ \"The Last Holdouts\".",
            "Arnaldo Dumindin.",
            "Archived from the original on January 3, 2012.",
            "Retrieved May 29, 2012."
        ],
        [
            "^ Edgar Wickberg.",
            "Early Chinese Economic Influence in the Philippines, 1850–1898 (PDF).",
            "upf.edu.",
            "Archived from the original (PDF) on February 20, 2012."
        ],
        [
            "^ \"Railways in The Philippines\".",
            "Trade Chakra."
        ],
        [
            "^ \"The Rice Granary of the Philippines\".",
            "kylian74."
        ],
        [
            "^ \"Agrarian Reform History\".",
            "Department of Agrarian Reform.",
            "Archived from the original on May 14, 2013.",
            "Retrieved June 24, 2012."
        ],
        [
            "^ \"PHILIPPINE BILL OF JULY 1, 1902\".",
            "chanrobles.com."
        ],
        [
            "^ \"The United States and Its Territories (1870–1925:The Age of Imperialism)\".",
            "quod.lib.umich.edu.",
            "Retrieved November 21, 2022."
        ],
        [
            "^ Henry F. Funtecha (August 18, 2006).",
            "\"The Government During the American Regime\".",
            "The News Today."
        ],
        [
            "^ Modern Dilasag was not included here as it was part of Nueva Vizcaya and also transferred to Tayabas only in 1905.The picture of territorial evolution of Quezon."
        ],
        [
            "^ \"Act No.",
            "1748\".",
            "philippinelaw.info.",
            "Archived from the original on June 1, 2012.",
            "Retrieved June 24, 2012."
        ],
        [
            "^ \"The Taft Commission\".",
            "philippine-history.org."
        ],
        [
            "^ \"American Government Gave Importance to Education\".",
            "etravelpilipinas.com.",
            "Archived from the original on October 15, 2011.",
            "Retrieved May 29, 2012."
        ],
        [
            "^ \"Education Act of 1901\".",
            "philippinelaw.",
            "Archived from the original on March 4, 2014.",
            "Retrieved May 29, 2012."
        ],
        [
            "^ 1st Philippine Legislature"
        ],
        [
            "^ \"Japanese Occupation\".",
            "philippine-history.org."
        ],
        [
            "^ \"Ghost Soldiers\".",
            "Hampton Sides."
        ],
        [
            "^ \"Great Raid\".",
            "Carole D. Bos."
        ],
        [
            "^ Kerkvliet, Benedict J.",
            "(1977).",
            "The Huk Rebellion: A Study of Peasant Revolt in the Philippines.",
            "Rowman & Littlefield.",
            "ISBN 9780742518681."
        ],
        [
            "^ \"1945 Great Raid on Cabanatuan Prison\".",
            "Olive-Drab.",
            "Archived from the original on March 4, 2016.",
            "Retrieved June 11, 2012."
        ],
        [
            "^ Doyo, Ma.",
            "Ceres (September 22, 2016).",
            "\"Martial law massacres\".",
            "Philippine Daily Inquirer."
        ],
        [
            "^ \"Pepito Bernardo - Bantayog ng mga Bayani\".",
            "May 26, 2023."
        ],
        [
            "^ \"Sedfrey Ordoñez - Bantayog ng mga Bayani\".",
            "June 20, 2023."
        ],
        [
            "^ \"Bantayog Street Memorials - Bantayog ng mga Bayani\"."
        ],
        [
            "^ Timeline: EDSA People Power Revolution.",
            "ABS-CBN."
        ],
        [
            "^ Cayco, Libardo D. Epifanio de los Santos Cristobal.",
            "Manila.",
            "National Heroes Day.",
            "Filipiniana Division.",
            "National Library.",
            "Government Property."
        ],
        [
            "^ a b Habito (2015).",
            "Presidential economic legacies.",
            "Inquirer."
        ],
        [
            "^ Galvez, Manny (January 18, 2004).",
            "\"Pardoned ex-Ecija solon tries a political comeback\".",
            "Philstar.com.",
            "Gapan: Philstar Global Corp. Retrieved February 11, 2023."
        ],
        [
            "^ Lanuza, Angelo E. (December 12, 1995).",
            "\"7 jueteng lords, 3 'protectors' charged\".",
            "Manila Standard.",
            "Kamahalan Publishing Corp. pp. 1–2.",
            "Retrieved February 11, 2023."
        ],
        [
            "^ Galvez (2001).",
            "‘Jueteng’ persists in Nueva Ecija despite new government.",
            "Inquirer."
        ],
        [
            "^ PRESIDENT AQUINO APPROVES BIG IRRIGATION PROJECTS.",
            "National Irrigation Administration (2012)."
        ],
        [
            "^ Oplas (2021).",
            "The economic and energy legacy of PNoy Aquino.",
            "Business World."
        ],
        [
            "^ a b c \"Province: Nueva Ecija\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"Weather forecast for Nueva Ecija, Philippines\".",
            "Storm247.com.",
            "Bergen, NO: StormGeo AS.",
            "Retrieved April 23, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"kwf.gov.ph\".",
            "Archived from the original on March 14, 2021.",
            "Retrieved April 3, 2021."
        ],
        [
            "^ History of Nueva Ecija"
        ],
        [
            "^ About Nueva Ecija: People and Culture"
        ],
        [
            "^ \"2000 Census on Population and Housing/\" (PDF).",
            "PSA.gov.",
            "National Statistics Office.",
            "Retrieved September 1, 2019."
        ],
        [
            "^ Tan, Michael L.; Tan, Michael T. (2008).",
            "Revisiting Usog, Pasma, Kulam.",
            "UP Press.",
            "p. 154.",
            "ISBN 9789715425704.",
            "Retrieved September 1, 2019."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"RICE GRANARY OF THE PHILIPPINES\".",
            "Ginto ang Inaani.",
            "Archived from the original on December 4, 2013."
        ],
        [
            "^ \"Nueva Ecija, Still the Country's Top Palay Producing Province\".",
            "National Statistical Coordination Board.",
            "June 2008.",
            "Archived from the original on July 27, 2008."
        ],
        [
            "^ Estimation of the Geologic Mineral Reserve of the small-scale Gold Mines in the Philippines.",
            "National Statistical Coordination Board."
        ],
        [
            "^ TV Patrol North Central Luzon"
        ],
        [
            "^ \"Best Places to Visit in Minalungao National Park\".",
            "Indi Newz.",
            "September 5, 2019.",
            "Retrieved September 27, 2019."
        ],
        [
            "^ Cruz, Neni Sta Romana.",
            "\"Remembering Lazaro Francisco\".",
            "opinion.inquirer.net.",
            "Retrieved August 17, 2019."
        ],
        [
            "^ a b \"Francisco, Lazaro\".",
            "CulturEd: Philippine Cultural Education Online.",
            "Retrieved August 17, 2019."
        ],
        [
            "^ Romulo, Liana (2012).",
            "Filipino Celebrations: A treasury of Feasts and Festivals.",
            "Tuttle Publishing.",
            "ISBN 9781462908622.",
            "Retrieved September 1, 2019."
        ],
        [
            "^ \"Famous and Notable Traditionally Celebrated Socio-cultural and Religious Festivals of Nueva Ecija\".",
            "Knoji.",
            "Retrieved September 1, 2019."
        ],
        [
            "^ \"Manuel S. Tineo\" (PDF).",
            "Archived from the original (PDF) on July 18, 2009.",
            "Retrieved June 6, 2009."
        ],
        [
            "^ Kerkvliet, B.J.",
            "(2002).",
            "The Huk Rebellion: A Study of Peasant Revolt in the Philippines.",
            "Rowman & Littlefield.",
            "p. 7.",
            "ISBN 978-0-7425-1868-1.",
            "Retrieved November 19, 2014."
        ],
        [
            "^ \"Louisiana Pastor Named Auxiliary Bishop Of Los Angeles\".",
            "United States Conference of Catholic Bishops.",
            "Archived from the original on April 16, 2013."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            "Wikimedia Commons has media related to Nueva Ecija."
        ],
        [
            " Geographic data related to Nueva Ecija at OpenStreetMap"
        ],
        [
            "Philippine Standard Geographic Code Archived April 13, 2012, at the Wayback Machine"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Nueva Ecija Now and Beyond"
        ],
        [
            "Places adjacent to Nueva Ecija"
        ],
        [
            "Pangasinan"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Tarlac"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Aurora"
        ],
        [
            "Pampanga"
        ],
        [
            "Bulacan"
        ],
        [
            "vte Province of Nueva EcijaPalayan (capital)  Cabanatuan (largest city)Municipalities"
        ],
        [
            "Aliaga"
        ],
        [
            "Bongabon"
        ],
        [
            "Cabiao"
        ],
        [
            "Carranglan"
        ],
        [
            "Cuyapo"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Guimba"
        ],
        [
            "Jaen"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Llanera"
        ],
        [
            "Lupao"
        ],
        [
            "Nampicuan"
        ],
        [
            "Pantabangan"
        ],
        [
            "Peñaranda"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "San Antonio"
        ],
        [
            "San Isidro"
        ],
        [
            "San Leonardo"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Zaragoza"
        ],
        [
            "Component cities"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Jose"
        ],
        [
            "Articles related to Nueva Ecija"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Nueva_Ecija&oldid=1234594746\""
        ],
        [
            "Categories: Nueva EcijaProvinces of the PhilippinesProvinces of Central LuzonStates and territories established in 18481848 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: numeric names: authors listAll articles with dead external linksArticles with dead external links from March 2023Articles with permanently dead external linksArticles with dead external links from September 2019Articles with short descriptionShort description is different from WikidataArticles needing additional references from November 2022All articles needing additional referencesUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Pages using infobox settlement with possible nickname listCoordinates on WikidataArticles containing Tagalog-language textPages with Tagalog IPAArticles containing Ilocano-language textArticles containing Pangasinan-language textAll articles with unsourced statementsArticles with unsourced statements from November 2022All Wikipedia articles that are incomprehensibleWikipedia articles that are incomprehensible from June 2016Articles with unsourced statements from August 2019Wikipedia articles with style issues from May 2016All articles with style issuesArticles to be split from September 2019All articles to be splitArticles to have a section moved from September 2019All articles to have a section movedArticles with multiple maintenance issuesLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}