{
    "name": "Occidental Mindoro",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "41 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°00′N 120°55′E﻿ / ﻿13°N 120.92°E﻿ / 13; 120.92"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Mimaropa, Philippines"
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Occidental Mindoro\" – news · newspapers · books · scholar · JSTOR (October 2012) (Learn how and when to remove this message)"
        ],
        [
            "Province in Mimaropa, PhilippinesOccidental MindoroProvinceProvince of Occidental Mindoro(from top: left to right) Iglit-Baco National Park, Sablayan,  Landscape in San Jose, Dayap Bridge in Santa Cruz, Mindoro Mountains in Rizal and Devils Mountain in San Jose."
        ],
        [
            "FlagSealLocation in the PhilippinesOpenStreetMapCoordinates: 13°00′N 120°55′E﻿ / ﻿13°N 120.92°E﻿ / 13; 120.92CountryPhilippinesRegionMimaropaFoundedNovember 15, 1950CapitalMamburaoLargest MunicipalitySan JoseGovernment • TypeSangguniang Panlalawigan • GovernorEduardo Gadiano (PFP) • Vice GovernorDiana Apigo-Tayag (Democratic Party of the Philippines) • RepresentativeLeody F. Tarriela (Democratic Party of the Philippines) • LegislatureOccidental Mindoro Provincial BoardArea • Total525,354 • Rank58th out of 81 • Density90/km2 (230/sq mi)  • Rank71st out of 81Divisions • Independent cities0 • Component cities0 • Municipalities"
        ],
        [
            "11"
        ],
        [
            " Abra de IlogCalintaanLoocLubangMagsaysayMamburaoPaluanRizalSablayanSan JoseSanta Cruz"
        ],
        [
            " • Barangays164 • DistrictsLegislative district of Occidental MindoroTime zoneUTC+8 (PHT)ZIP Code5100–5111IDD : area code +63 (0)43ISO 3166 codePH-MDCSpoken languagesTagalogMangyanEnglishWebsiteoccidentalmindoro.gov.ph"
        ],
        [
            "Occidental Mindoro (Tagalog: Kanlurang Mindoro), officially the Province of Occidental Mindoro (Tagalog: Lalawigan ng Kanlurang Mindoro), is a province in the Philippines located in the Mimaropa region.",
            "The province occupies the western half of the island of Mindoro.",
            "Its capital is Mamburao, but the largest municipality is San Jose occupying almost half of the entire province.",
            "As of 2020, Occidental Mindoro has 525,354 inhabitants."
        ],
        [
            "The province is bordered on the east by the province of Oriental Mindoro, and on the south by the Mindoro Strait.",
            "The South China Sea is to the west of the province and Palawan is located to the southwest, across the Mindoro Strait.",
            "Batangas is to the north, separated by the Verde Island Passage, a protected marine area and the center of the world's marine biodiversity."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Mindoro Island was originally known to the ancients as Ma-i.",
            "It was formally called Mait, and known to the Chinese traders before the coming of the Spanish.",
            "Its existence was mentioned in the old Chinese chronicles in 775 A.D. and more elaborately in 1225.",
            "It was a major anchorage in the Southeast Asia trade route during the pre-Philippines period.",
            "Chinese, Arab and Indian merchants traded with the natives."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "In 1570, the Spanish began to explore the island and named it Mina de Oro (\"mine of gold\") after finding some of the precious metal, though no major gold discoveries were ever made."
        ],
        [
            "The natives of Mindoro were called Manguianes by the Spaniards.",
            "But the natives refer to themselves by their ethnic or clan identification.",
            "There were seven such ethnic or clan distinctions, which are differentiated by language and areas where each can be found."
        ],
        [
            "The Mangyans, as they are now anthropologically known, do not have a warrior society.",
            "They are a peaceful, shy but friendly people.",
            "They are rarely known to be hostile, and have had no significant record of violent conflict with other people in the entire history of the province.",
            "They grow root crops in forest clearings (slash and burn farms), and hunt wild animals in the forest for their meat needs."
        ],
        [
            "There are no authentic documents in existence explaining the original stock of the Mangyan people, but later theoreticians postulate that they migrated from Indonesia before 775 A.D.",
            "They hopped from island to island, until finally settling down permanently in Mindoro.",
            "It appeared that clan settlements existed in the North as well as in the southern ends of the island.",
            "By 779, the southwest coast of the island was already a known trading center, and its fine natural harbor frequented by Arab, Indian and Chinese maritime traders who plied the route.",
            "But there was no attempt of subjugation, just trading."
        ],
        [
            "The first semblance of a political system in Mindoro's experience was provided by China in the 13th century.",
            "Chinese imperial forces under Admiral Cheng Ho with a powerful armada of 60 war junks visited Mindoro and other parts of the archipelago in the 13th century, with the purpose of gaining more trading favors for Chinese merchants."
        ],
        [
            "For a time, Admiral Ho tried to exert some effort of rule as a prelude to Sino annexation.",
            "Internal trouble in the Chinese home front, however, recalled the armada, and the attempts of the empire to annex the archipelago did not materialize."
        ],
        [
            "Some time after the Ho overture, Islamic influence reached the island, probably, - Orang Dampuans (economic refugees from Sulu) crossed Mindoro Strait from Paragua (now Palawan) and settled along the coastal areas, developing progressive maritime communities."
        ],
        [
            "In 1572, Captain Juan de Salcedo of the Spanish expeditionary army set sail from Cebu and explored the west coast of the island, encountering the Mangyans, who appeared used to seeing foreigners and were not at all a bit surprised at their arrival.",
            "On the contrary, it was Salcedo and Martin de Goiti who were surprised to see cross designs on the clothing and basketwork of the natives, and thought some early Christian missionary had been there before them.",
            "But later scholars believed the design was Indic in origin and had no religious meaning."
        ],
        [
            "The Spaniards also encountered Moro settlers in Lubang Island that were vassals of and paid tribute to the kingdom of Maynila in the North, under Rajah Sulayman.",
            "This was the first real political system in the island.",
            "The Moros, who apparently had heard of the invaders from their kinsmen in the south, engaged the small Spanish force who landed on their shore, but the Spaniards' arquebuses and cannon fire from the ships hoved-to broadside to the island took the field.",
            "The Moros fled to the hills, and Salcedo burned their village."
        ],
        [
            "After the defeat of Sulaiman in the same year, Mindoro and other vassal states of Maynila became subject of Castillan rule.",
            "The island was officially referred to from then on as Mina de Oro (Mine of Gold), compressed later on into Mindoro.",
            "The free land name, Ma-i, fell into disuse.",
            "The Spanish-Moro war would rage on in Mindoro until toward the end of the Spanish regime in the 19th century."
        ],
        [
            "In 1602, Moro forces plundered the most important Spanish towns along the coasts of Mindoro and Southern Luzon, and subsequently reestablished their hold in Mindoro by constructing a fort at Mamburao.",
            "From 1720 onwards, Moro raids became devastating not only to the island's Hispanized communities but to other parts of the archipelago as well."
        ],
        [
            "In 1757, the Moros, more particularly, the Iranuns (a relative of the Maranaws of the Lake Lanao regions) organized a war fleet of 74 fast native ships called prahus.",
            "They destroyed several settlements in the island, carrying off their inhabitants to be sold as slaves in Jolo."
        ],
        [
            "The fact that a Moro fort at Mamburao threatened Manila, the capital of the colonial government, embarrassed the conquerors in the eyes of their native subjects, which was politically intolerable to the Spanish administrators.",
            "So in 1766, the Spaniards gathered a large force of 1,200 marines, augmented by a large army of native mercenaries, and burned the Iranun fort.",
            "But the Moros simply faded into the hills to escape, and came back when the counter-raid was over and the raiders returned to Manila."
        ],
        [
            "The Moros not only plundered goods, but also took prisoners of war which they sold as slaves.",
            "Many Islamic leaders in Mindanao, in spite of the peace settlement with the Spaniards contained in treaties and formal agreements, supported piratical raids with arms, ammunition and food, not only because it was a patriotic act (defending Moroland), but this patriotism was also giving them handsome profits.",
            "They received part of the \"prisoners of war\" when a successful raider returned, which earned them huge amounts."
        ],
        [
            "Most of the raids were successful because of the fast watercraft in the employ of the raiders.",
            "It was not until the commission of the vapor, fast steamships, in the mid-18th century that the Spanish navy successfully patrolled the archipelagic waters, and fared well against the wind-powered native seacraft of the pirates.",
            "Many pirate fleets were sunk at sea, or confined to their hiding places."
        ],
        [
            "The invention of machines during the Industrial Revolution, which gradually replaced manual labor, and the consecutive abolitions of slave ownership in many liberalized countries, caused a great decline in the demand for slave labor.",
            "Many of the pirate markets closed, and prices fell severely for captives."
        ],
        [
            "With losses to the Spanish navy increasing, and the eventual fall in profits from slave selling, raiding became less appealing to the Iranuns and their Islamic supporters.",
            "Uneconomical patriotism simply did not make quite an appeal.",
            "Thus, it came to pass that the Moro pirates faded from Mindoro's history.",
            "The pirate fort in Mamburao was abandoned, and the Moros retreated to Mindanao to consolidate their forces and continue the Moslem resistance at the homefront.",
            "Mindoro Island then became a Spanish possession in a truer sense for the first time.",
            "But not for long."
        ],
        [
            "In 1896, the Philippine Revolution begun, which spread throughout the islands.",
            "In 1897, the Spaniards posted a rifle company of 140 troops and 51 marines to Calapan to secure the island from the forces of General Emilio Aguinaldo and his revolutionary army, then beginning to overrun Spanish positions in the archipelago.",
            "Only Mindoro was relatively safe.",
            "In 1898, the revolutionaries attacked and overwhelmed the settlement that is now Bongabong.",
            "The revolution also ignited in the western part (Occidental Mindoro), which seized control of the settlements there from the Spaniards.",
            "Finally, they marched against the capital of Calapan with some 1,000 ill-armed foot soldiers."
        ],
        [
            "The attack came to nothing.",
            "The Spanish defenses held.",
            "It was only the arrival of 1,000 regular army troops with artillery, all under the command of General Malvar in Batangas, that compelled the surrender of the Spaniards under Governor Morales.",
            "Hence on July 1, 1898, the Spanish rule in Mindoro Island, lasting for 328 years, ended."
        ],
        [
            "American invasion era"
        ],
        [
            "A new battalion \"Mindoro\", with two rifle companies, was formed under the command of Captain Ruperto Hernandez and Estanislao Cayton, both from Batangas.",
            "The revolutionary political reins were held by the elite, who also held the same reins under the Spaniards (and later under the Americans).",
            "The revolution, therefore, was for liberation against colonial rule but not a war for social change, which was to be defeated late in the US-Filipino war that followed."
        ],
        [
            "In 1910, the successor United States politico-military administration granted over 50 square kilometres (19 sq mi) of land to the Welch and Fargo Sugar Company in what is now San Jose, which built the first modern and biggest sugar mill in the Far East at Siete Central (now barangay Central).",
            "In the same year, the boldly developing community of sugar cane planters, mill workers, company professionals and businessmen enabled the creation of San Jose as an official Philippine town."
        ],
        [
            "Philippine independence"
        ],
        [
            "In 1950, the province of Mindoro was divided into Oriental Mindoro and Occidental Mindoro by virtue of Republic Act No.",
            "505."
        ],
        [
            "Contemporary history"
        ],
        [
            "In April 2023, the provincial government placed the entire province under a state of calamity due to the 20-hour daily power outage that has been occurring for a month and a half."
        ],
        [
            "Geography"
        ],
        [
            "Apo Reef"
        ],
        [
            "Occidental Mindoro covers a total area of 5,865.71 square kilometres (2,264.76 sq mi) occupying the western section of the Mindoro island, and includes outlying islands in the northwest."
        ],
        [
            "General land surface features that characterize Occidental Mindoro are mountains, rivers, hills, valleys, wide plains and some small fresh water lakes.",
            "The taller mountains can be found in the interior that it shares with Oriental Mindoro."
        ],
        [
            "Mountain ranges converge on the two central peaks, Mount Halcon in the north, and Mount Baco in the south.",
            "There is also a mountain known as bundok ng susong dalaga, the \"Maiden's breast mountain\", that looks like a reclined woman."
        ],
        [
            "The northern part of the province has relatively fewer plains, while the southern parts have wider flatlands.",
            "Most of the plains are cultivated fields, with few remaining untouched forests.",
            "Significant hilly areas can be found rolling off in Santa Cruz in the north, and in San Jose and Magsaysay in the south.",
            "These are grassed-over rather than forested."
        ],
        [
            "There are several major drainage or river systems flowing on a generally westerly course: Mamburao River , Pagbahan, Mompong, Biga, Lumintao, Busuanga and Caguray.",
            "Swamp areas are restricted to the south, specially, along the river mouths."
        ],
        [
            "The province is also home to one of the most popular coral reefs in the Philippines, Apo Reef."
        ],
        [
            "Climate"
        ],
        [
            "Occidental Mindoro has two distinct weather types: rainy season and dry season.",
            "Rains begin to fall in the province in late May, intensifying through June, July, August, September and October, then gradually subsides in November."
        ],
        [
            "On the other hand, dry season starts in November, with rainfall subsiding in intensity, and altogether ceasing in January, February, March and April.",
            "March and April are the driest period, with cloudless skies and parched earth characterizing the general area."
        ],
        [
            "Temperature range is from 26 °C (79 °F) in the windy uplands to 32 °C (90 °F) in the lowlands."
        ],
        [
            "Climate data for Occidental Mindoro"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.3(84.7)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.8(89.2)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "29.5(85.1)"
        ],
        [
            "31.3(88.3)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "22.1(71.8)"
        ],
        [
            "22.2(72.0)"
        ],
        [
            "23.2(73.8)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "22.6(72.7)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "Average rainy days"
        ],
        [
            "15"
        ],
        [
            "10"
        ],
        [
            "8"
        ],
        [
            "7"
        ],
        [
            "11"
        ],
        [
            "15"
        ],
        [
            "15"
        ],
        [
            "13"
        ],
        [
            "13"
        ],
        [
            "16"
        ],
        [
            "17"
        ],
        [
            "18"
        ],
        [
            "158"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Occidental Mindoro comprises 11 municipalities and 2 legislative districts."
        ],
        [
            "Municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density (2020)"
        ],
        [
            "Barangay"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "13°26′41″N 120°43′34″E﻿ / ﻿13.4446°N 120.7262°E﻿ / 13.4446; 120.7262﻿ (Abra de Ilog)"
        ],
        [
            "Abra de Ilog"
        ],
        [
            "1st"
        ],
        [
            "6.7%"
        ],
        [
            "35,176"
        ],
        [
            "31,306"
        ],
        [
            "+2.24%"
        ],
        [
            "533.70"
        ],
        [
            "206.06"
        ],
        [
            "66"
        ],
        [
            "170"
        ],
        [
            "10"
        ],
        [
            "12°34′17″N 120°56′27″E﻿ / ﻿12.5713°N 120.9407°E﻿ / 12.5713; 120.9407﻿ (Calintaan)"
        ],
        [
            "Calintaan"
        ],
        [
            "2nd"
        ],
        [
            "5.7%"
        ],
        [
            "30,190"
        ],
        [
            "29,826"
        ],
        [
            "+0.23%"
        ],
        [
            "382.50"
        ],
        [
            "147.68"
        ],
        [
            "79"
        ],
        [
            "200"
        ],
        [
            "7"
        ],
        [
            "13°43′12″N 120°15′00″E﻿ / ﻿13.7200°N 120.2499°E﻿ / 13.7200; 120.2499﻿ (Looc)"
        ],
        [
            "Looc"
        ],
        [
            "1st"
        ],
        [
            "1.5%"
        ],
        [
            "7,802"
        ],
        [
            "10,117"
        ],
        [
            "−4.83%"
        ],
        [
            "132.30"
        ],
        [
            "51.08"
        ],
        [
            "59"
        ],
        [
            "150"
        ],
        [
            "9"
        ],
        [
            "13°51′34″N 120°07′21″E﻿ / ﻿13.8595°N 120.1226°E﻿ / 13.8595; 120.1226﻿ (Lubang)"
        ],
        [
            "Lubang"
        ],
        [
            "1st"
        ],
        [
            "3.3%"
        ],
        [
            "17,437"
        ],
        [
            "18,803"
        ],
        [
            "−1.43%"
        ],
        [
            "113.10"
        ],
        [
            "43.67"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "16"
        ],
        [
            "12°18′25″N 121°08′39″E﻿ / ﻿12.3069°N 121.1441°E﻿ / 12.3069; 121.1441﻿ (Magsaysay)"
        ],
        [
            "Magsaysay"
        ],
        [
            "2nd"
        ],
        [
            "7.6%"
        ],
        [
            "39,767"
        ],
        [
            "36,016"
        ],
        [
            "+1.90%"
        ],
        [
            "296.70"
        ],
        [
            "114.56"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "12"
        ],
        [
            "13°13′21″N 120°35′46″E﻿ / ﻿13.2226°N 120.5962°E﻿ / 13.2226; 120.5962﻿ (Mamburao)"
        ],
        [
            "Mamburao"
        ],
        [
            "†"
        ],
        [
            "1st"
        ],
        [
            "9.1%"
        ],
        [
            "47,705"
        ],
        [
            "42,975"
        ],
        [
            "+2.01%"
        ],
        [
            "283.51"
        ],
        [
            "109.46"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "15"
        ],
        [
            "13°24′56″N 120°27′44″E﻿ / ﻿13.4155°N 120.4623°E﻿ / 13.4155; 120.4623﻿ (Paluan)"
        ],
        [
            "Paluan"
        ],
        [
            "1st"
        ],
        [
            "3.5%"
        ],
        [
            "18,566"
        ],
        [
            "16,025"
        ],
        [
            "+2.84%"
        ],
        [
            "564.50"
        ],
        [
            "217.95"
        ],
        [
            "33"
        ],
        [
            "85"
        ],
        [
            "12"
        ],
        [
            "12°27′30″N 120°57′50″E﻿ / ﻿12.4584°N 120.9638°E﻿ / 12.4584; 120.9638﻿ (Rizal)"
        ],
        [
            "Rizal"
        ],
        [
            "2nd"
        ],
        [
            "7.7%"
        ],
        [
            "40,429"
        ],
        [
            "38,263"
        ],
        [
            "+1.05%"
        ],
        [
            "242.50"
        ],
        [
            "93.63"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "11"
        ],
        [
            "12°50′29″N 120°46′31″E﻿ / ﻿12.8414°N 120.7753°E﻿ / 12.8414; 120.7753﻿ (Sablayan)"
        ],
        [
            "Sablayan"
        ],
        [
            "1st"
        ],
        [
            "17.6%"
        ],
        [
            "92,598"
        ],
        [
            "83,169"
        ],
        [
            "+2.07%"
        ],
        [
            "2,188.80"
        ],
        [
            "845.10"
        ],
        [
            "42"
        ],
        [
            "110"
        ],
        [
            "22"
        ],
        [
            "12°21′10″N 121°03′58″E﻿ / ﻿12.3529°N 121.0662°E﻿ / 12.3529; 121.0662﻿ (San Jose)"
        ],
        [
            "San Jose"
        ],
        [
            "2nd"
        ],
        [
            "29.2%"
        ],
        [
            "153,267"
        ],
        [
            "143,430"
        ],
        [
            "+1.27%"
        ],
        [
            "446.70"
        ],
        [
            "172.47"
        ],
        [
            "340"
        ],
        [
            "880"
        ],
        [
            "39"
        ],
        [
            "13°05′03″N 120°43′01″E﻿ / ﻿13.0843°N 120.7169°E﻿ / 13.0843; 120.7169﻿ (Santa Cruz)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "1st"
        ],
        [
            "8.1%"
        ],
        [
            "42,417"
        ],
        [
            "37,484"
        ],
        [
            "+2.38%"
        ],
        [
            "681.40"
        ],
        [
            "263.09"
        ],
        [
            "62"
        ],
        [
            "160"
        ],
        [
            "11"
        ],
        [
            "Total"
        ],
        [
            "525,354"
        ],
        [
            "487,414"
        ],
        [
            "+1.44%"
        ],
        [
            "5,865.71"
        ],
        [
            "2,264.76"
        ],
        [
            "90"
        ],
        [
            "230"
        ],
        [
            "164"
        ],
        [
            " †  Provincial capital"
        ],
        [
            "  Municipality"
        ],
        [
            "^ The globe  icon marks the town center."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Occidental MindoroYearPop.±% p.a.1903 13,223—    1918 28,193+5.18%1939 39,039+1.56%1948 43,149+1.12%1960 84,316+5.74%1970 144,032+5.49%1975 185,787+5.24%1980 222,431+3.66%1990 282,593+2.42%1995 339,605+3.50%2000 380,250+2.45%2007 421,952+1.45%2010 452,971+2.62%2015 487,414+1.41%2020 525,354+1.48%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Occidental Mindoro in the 2020 census was 525,354 people, with a density of 90 inhabitants per square kilometre or 230 inhabitants per square mile."
        ],
        [
            "Major languages spoken are Tagalog and the Mangyan languages.",
            "Tagalog is usually spoken with Batangas dialect both due to its geographical contact with Batangas and Batangueño residents in the province, with great influences from native Mangyan and Visayan languages.",
            "Ilokano, Visayan, and Bikolano, are varyingly spokren by people who migrated from the provinces where they are spoken.",
            "Occidental Mindoro is a cultural melting pot, populated mostly by recent immigrants."
        ],
        [
            "The indigenous people in the province are the Mangyans (Manguianes in Spanish, Mañguianes in Old Tagalog), consisting of 7 distinct tribes.",
            "They occupy the foothills and interior.",
            "The Mangyan have inhabited the island since pre-history.",
            "They are believed to have originally traveled from Indonesia and settled down for good in the island."
        ],
        [
            "There is much evidence, historical and geophysical, that the Mangyan tribes formerly lived near the coastlines.",
            "They were compelled, however, to move into the interior jungles of the island when the inter-island immigrants came, in order to avoid confrontations, which the peace-loving tribes wished to avoid at all costs.",
            "They also wished to avoid cultural changes and to preserve their way of life."
        ],
        [
            "Today, the Mangyan number to only around 80,000 (freely moving in and out in both provinces of Oriental and Occidental Mindoro).",
            "But there is no accurate accounting of them since many still live elusively in the upper regions of the island, avoiding contact with lowlanders."
        ],
        [
            "Religion"
        ],
        [
            "Like the Eastern half of the island, most of the population of Occidental Mindoro are of Roman Catholic conviction (82%) while minor religions are usually represented by various Christian denominations, Islam, indigenous Philippine folk religions, animism, and atheism."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Occidental Mindoro"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "2006  43.17"
        ],
        [
            "2009  35.88"
        ],
        [
            "2012  38.10"
        ],
        [
            "2015  41.66"
        ],
        [
            "2018  21.75"
        ],
        [
            "2021  23.00"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Occidental Mindoro is an agricultural area devoted to the production of food.",
            "Its economic base is rice production (Oryza sativa culture), a Philippine staple crop.",
            "It is the leading activity and source of seasonal employment in the province, participated in by almost 80 per cent of the population, including children."
        ],
        [
            "Wetland or lowland rice is a rainy season crop, heavily dependent on water and therefore produced from July (planting season) to October (harvest season).",
            "Tobacco, onions, garlic and vegetables are grown during the dry season (November to May) since they are not water-intensive crops, and require longer photoperiodicity."
        ],
        [
            "Rice, corn, onions, garlic, salt, fishes (both wild and cultured) are some of the relatively significant surpluses produced in the province in exportable quantities.",
            "Mangoes, cashew nuts, cooking bananas (saba) and some other fruits grown in upland orchards are among the other exports of Occidental Mindoro that have traditionally contributed to its income.",
            "Peanuts are also grown in some parts of the province, as well as cassava, sweet potatoes, ginger and other minor cultivars."
        ],
        [
            "Forest resources include timber and minerals, among them gold, copper, silver, chrome, and non-metallic minerals such as lime for making cement, and greenstones for ornaments.",
            "Timber groups include many species of hardwoods, such as mahogany, and other types of trees in high demand for durability."
        ],
        [
            "There is no large industry in the province.",
            "The government is the biggest employer, absorbing most of the off-farm labor force.",
            "The local electric cooperative, Occidental Mindoro Electric Cooperative (OMECO), is the biggest employer in the private sector, with nearly 150 regular employees.",
            "The rest of the population is engaged in private trades."
        ],
        [
            "Problems"
        ],
        [
            "There are many multi-faceted problems in Occidental Mindoro's economy.",
            "In rice farming, the biggest issue confronting the producers is the high cost of production.",
            "This is attributed mainly to the spiraling prices of farm inputs.",
            "A study concluded that from 1997 to 2003, the cost of production rose by 47 per cent, while the income derived from marketing rice maintained 1997 levels.",
            "There are also confused reports that the average production rate has declined due to the reduced application of necessary farm chemicals.",
            "In street language, this means that the farmers simply cut the amount of inputs because they cannot afford the high capital requirements of following all the recommended inputs in the farming calendar."
        ],
        [
            "Another structural problem is the inadequacy of irrigation.",
            "Most of the river systems in the province no longer have the demanded volume of water to make irrigation feasible.",
            "This is attributed to the greatly deforested watersheds."
        ],
        [
            "Flora and fauna"
        ],
        [
            "A robust red sea star (Choriaster granulatus) in Pandan Islands"
        ],
        [
            "A colony of orange tunicates (Clavelina dimunata) in Pandan Islands"
        ],
        [
            "A Bright Red Shrimp in Pandan Islands."
        ],
        [
            "A cushion star in Apo Reef"
        ],
        [
            "Yellowish white soft coral in Apo Reef"
        ],
        [
            "A yellow crinoid in Apo Reef"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Retrieved 29 October 2012."
        ],
        [
            "^ a b c Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ TeleRadyo (April 20, 2023).",
            "\"Occidental Mindoro, isinailalim sa state of calamity\".",
            "ABS-CBN News (in Tagalog).",
            "Retrieved April 21, 2023."
        ],
        [
            "^ Llanesca Panti; GMA Integrated News (April 21, 2023).",
            "\"Occidental Mindoro under state of calamity due to 20-hour daily power outage\".",
            "GMA News Online.",
            "Retrieved April 21, 2023."
        ],
        [
            "^ a b c \"Province: Occidental Mindoro\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ Maiden's breast mountain, Occ.",
            "Mindoro"
        ],
        [
            "^ \"Weather forecast for Occidental Mindoro, Philippines\".",
            "Storm247.com.",
            "Bergen, NO: StormGeo AS.",
            "Retrieved 22 April 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities (PDF).",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Fact Sheet; Region IV-B; Mimaropa' 2007 Census of Population\" (PDF).",
            "Philippine Statistics Authority - Region IV-B.",
            "Retrieved 8 July 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Occidental Mindoro at Wikimedia Commons"
        ],
        [
            " Geographic data related to Occidental Mindoro at OpenStreetMap"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Occidental Mindoro"
        ],
        [
            "BatangasIsla Verde Passage"
        ],
        [
            "South China Sea"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "PalawanMindoro Strait"
        ],
        [
            "Sulu Sea"
        ],
        [
            "vte Province of Occidental MindoroMamburao (capital)  San Jose (largest municipality)Municipalities"
        ],
        [
            "Abra de Ilog"
        ],
        [
            "Calintaan"
        ],
        [
            "Looc"
        ],
        [
            "Lubang"
        ],
        [
            "Magsaysay"
        ],
        [
            "Mamburao"
        ],
        [
            "Paluan"
        ],
        [
            "Rizal"
        ],
        [
            "Sablayan"
        ],
        [
            "San Jose"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Articles related to Occidental Mindoro"
        ],
        [
            "vteSouthwestern Tagalog Region (Mimaropa)MIndoro, MArinduque, ROmblon, PAlawanRegional center"
        ],
        [
            "Calapan"
        ],
        [
            "Provinces"
        ],
        [
            "Marinduque"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Romblon"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Component city"
        ],
        [
            "Calapan"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Boac"
        ],
        [
            "Calapan"
        ],
        [
            "Mamburao"
        ],
        [
            "Puerto Princesa"
        ],
        [
            "Romblon"
        ],
        [
            "Municipalities"
        ],
        [
            "Aborlan"
        ],
        [
            "Abra de Ilog"
        ],
        [
            "Agutaya"
        ],
        [
            "Alcantara"
        ],
        [
            "Araceli"
        ],
        [
            "Baco"
        ],
        [
            "Balabac"
        ],
        [
            "Bansud"
        ],
        [
            "Banton"
        ],
        [
            "Bataraza"
        ],
        [
            "Boac"
        ],
        [
            "Bongabong"
        ],
        [
            "Brooke's Point"
        ],
        [
            "Buenavista"
        ],
        [
            "Bulalacao"
        ],
        [
            "Busuanga"
        ],
        [
            "Cagayancillo"
        ],
        [
            "Cajidiocan"
        ],
        [
            "Calatrava"
        ],
        [
            "Calintaan"
        ],
        [
            "Concepcion"
        ],
        [
            "Corcuera"
        ],
        [
            "Coron"
        ],
        [
            "Cuyo"
        ],
        [
            "Dumaran"
        ],
        [
            "El Nido"
        ],
        [
            "Ferrol"
        ],
        [
            "Gasan"
        ],
        [
            "Gloria"
        ],
        [
            "Kalayaan"
        ],
        [
            "Linapacan"
        ],
        [
            "Looc (Occidental Mindoro)"
        ],
        [
            "Looc (Romblon)"
        ],
        [
            "Lubang"
        ],
        [
            "Magdiwang"
        ],
        [
            "Magsaysay (Occidental Mindoro)"
        ],
        [
            "Magsaysay (Palawan)"
        ],
        [
            "Mamburao"
        ],
        [
            "Mansalay"
        ],
        [
            "Mogpog"
        ],
        [
            "Narra"
        ],
        [
            "Naujan"
        ],
        [
            "Odiongan"
        ],
        [
            "Paluan"
        ],
        [
            "Pinamalayan"
        ],
        [
            "Pola"
        ],
        [
            "Puerto Galera"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal (Occidental Mindoro)"
        ],
        [
            "Rizal (Palawan)"
        ],
        [
            "Romblon"
        ],
        [
            "Roxas (Oriental Mindoro)"
        ],
        [
            "Roxas (Palawan)"
        ],
        [
            "Sablayan"
        ],
        [
            "San Agustin"
        ],
        [
            "San Andres"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose (Occidental Mindoro)"
        ],
        [
            "San Jose (Romblon)"
        ],
        [
            "San Teodoro"
        ],
        [
            "San Vicente"
        ],
        [
            "Santa Cruz (Marinduque)"
        ],
        [
            "Santa Cruz (Occidental Mindoro)"
        ],
        [
            "Santa Fe"
        ],
        [
            "Santa Maria"
        ],
        [
            "Socorro"
        ],
        [
            "Sofronio Española"
        ],
        [
            "Taytay"
        ],
        [
            "Torrijos"
        ],
        [
            "Victoria"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Other"
        ],
        [
            "NARA"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Occidental_Mindoro&oldid=1209544946\""
        ],
        [
            "Categories: Occidental MindoroProvinces of the PhilippinesMindoroProvinces of MimaropaStates and territories established in 19501950 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 Tagalog-language sources (tl)Articles with short descriptionShort description is different from WikidataArticles needing additional references from October 2012All articles needing additional referencesCoordinates on WikidataArticles containing Tagalog-language textAll articles that may contain original researchArticles that may contain original research from July 2016All articles with unsourced statementsArticles with unsourced statements from April 2016Articles with unsourced statements from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with NARA identifiersPages using the Kartographer extension"
        ]
    ]
}