{
    "name": "Pampanga",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Pampanga"
        ],
        [
            "43 languages"
        ],
        [
            "AcèhالعربيةAsturianuتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCatalàCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°04′N 120°40′E﻿ / ﻿15.07°N 120.67°E﻿ / 15.07; 120.67"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Central Luzon, Philippines"
        ],
        [
            "This article is about the Philippine province.",
            "For other uses, see Pampanga (disambiguation)."
        ],
        [
            "This article needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources.",
            "Unsourced material may be challenged and removed.Find sources: \"Pampanga\" – news · newspapers · books · scholar · JSTOR (September 2016) (Learn how and when to remove this message)"
        ],
        [
            "Province in Central Luzon, PhilippinesPampangaProvinceProvince of Pampanga(from top: left to right) Mount Pinatubo crater, Pampanga Provincial Capitol, Mount Arayat and Holy Rosary Parish in Angeles."
        ],
        [
            "FlagSealNickname(s): Culinary and Christmas Capital of the PhilippinesAnthem: Imno ning KapampanganEnglish: Pampanga HymnMekeni Tuki Ka, Malaus ka Pampanga (traditional and former anthem)Location in the PhilippinesOpenStreetMapCoordinates: 15°04′N 120°40′E﻿ / ﻿15.07°N 120.67°E﻿ / 15.07; 120.67CountryPhilippinesRegionCentral LuzonFoundedDecember 11, 1571CapitalSan FernandoLargest cityAngeles CityGovernment • TypeSangguniang Panlalawigan • GovernorDennis Pineda (NPC/KAMBILAN) • Vice GovernorLilia Pineda (NUP/KAMBILAN) • LegislaturePampanga Provincial BoardArea • Total2,437,709 • Rank9th out of 81 • Density1,200/km2 (3,200/sq mi)  • Rank5th out of 81 (excluding Angeles)DemonymPampangueño or KampampanganDivisions • Independent cities"
        ],
        [
            "1"
        ],
        [
            " Angeles City"
        ],
        [
            " • Component cities"
        ],
        [
            "2"
        ],
        [
            " Mabalacat"
        ],
        [
            " San Fernando"
        ],
        [
            " • Municipalities"
        ],
        [
            "19"
        ],
        [
            " Apalit"
        ],
        [
            " Arayat"
        ],
        [
            " Bacolor"
        ],
        [
            " Candaba"
        ],
        [
            " Floridablanca"
        ],
        [
            " Guagua"
        ],
        [
            " Lubao"
        ],
        [
            " Macabebe"
        ],
        [
            " Magalang"
        ],
        [
            " Masantol"
        ],
        [
            " Mexico"
        ],
        [
            " Minalin"
        ],
        [
            " Porac"
        ],
        [
            " San Luis"
        ],
        [
            " San Simon"
        ],
        [
            " Santa Ana"
        ],
        [
            " Santa Rita"
        ],
        [
            " Santo Tomas"
        ],
        [
            " Sasmuan"
        ],
        [
            " • Barangays505including independent cities: 538 • DistrictsLegislative districts of Pampanga (shared with Angeles City)Demographics • Ethnic groupsKapampangan (84%)Tagalog (14%)Sambal (2%) • LanguagesKapampanganTagalogEnglishTime zoneUTC+8 (PST)ZIP code2000–2024IDD : area code +63 (0)45ISO 3166 codePH-PAMWebsitewww.pampanga.gov.ph"
        ],
        [
            "Pampanga, officially the Province of Pampanga (Kapampangan: Lalawigan ning Pampanga; Tagalog: Lalawigan ng Pampanga IPA:  pəm-PAHNG-ga), is a province in the Central Luzon region of the Philippines.",
            "Lying on the northern shore of Manila Bay, Pampanga is bordered by Tarlac to the north, Nueva Ecija to the northeast, Bulacan to the east, Manila Bay to the central-south, Bataan to the southwest and Zambales to the west.",
            "Its capital is the City of San Fernando.",
            "Angeles City is the largest LGU, but while geographically within Pampanga, it is classified as a first-class, highly urbanized city and has been governed independently of the province since it received its charter in 1964."
        ],
        [
            "The name La Pampanga was given by the Spaniards, who encountered natives living along the banks (pampáng) of the Pampanga River.",
            "Its creation in 1571 makes it the first Spanish province on Luzon Island (Cebu in Visayas is older as it was founded by the Spaniards in 1565).",
            "The town of Villa de Bacolor in the province briefly served as the Spanish colonial capital when Great Britain invaded Manila as part of the Seven Years' War.",
            "At the eve of the Philippine Revolution of 1896, Pampanga was one of eight provinces placed under martial law for rebellion against the Spanish Empire; it is thus represented on the Philippine national flag as one of the eight rays of the sun."
        ],
        [
            "Pampanga is served by Clark International Airport (formerly Diosdado Macapagal International Airport), which is in Clark Freeport Zone, some 16 kilometres (9.9 mi) north of the provincial capital.",
            "The province is home to two Philippine Air Force airbases: Basa Air Base in Floridablanca and the former United States Clark Air Base in Angeles.",
            "Due to its growing population and developments, the Clark Global City is now developed and is located in Clark Freeport Zone.",
            "In 2015, the province had 2,198,110 inhabitants,"
        ],
        [
            "History"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.",
            "(April 2019) (Learn how and when to remove this message)"
        ],
        [
            "See also: Pampanga in the Philippine Revolution"
        ],
        [
            "Historical marker created by the National Historical Institute in 1982 to commemorate the province and installed at the provincial capitol"
        ],
        [
            "Ancient Pampanga's Territorial area included portions of the modern provinces of Tarlac, Bataan, Zambales, Nueva Ecija, Bulacan, Aurora, and Tondo; i.e.",
            "covered almost the entire Central Luzon.",
            "For better administration and taxation purposes, the Spanish authorities subdivided Pampanga into pueblos, which were further subdivided into districts (barrios) and in some cases into royal and private estates (encomiendas)."
        ],
        [
            "Due to excessive abuses committed by some encomenderos, King Philip II of Spain in 1574 prohibited the further awarding of private estates, but this decree was not fully enforced until 1620.",
            "In a report of Philippine encomiendas on June 20, 1591, Governor-General Gómez Pérez Dasmariñas reported to the Crown that La Pampanga's encomiendas were Bataan, Betis y Lubao, Macabebe, Candaba, Apalit, Calumpit, Malolos, Binto, Guiguinto, Caluya, Bulacan and Mecabayan.",
            "The encomiendas of La Pampanga at that time had eighteen thousand six hundred and eighty whole tributes."
        ],
        [
            "Pampanga, which is about 850 square miles (2,200 km2) in area and inhabited by more than 1.5 million people, had its present borders drawn in 1873.",
            "During the Spanish regime, it was one of the richest Philippine provinces.",
            "Manila and its surrounding region were then primarily dependent on Kapampangan agricultural, fishery and forestry products as well as on the supply of skilled workers.",
            "As other Luzon provinces were created due to increases in population, some well-established Pampanga towns were lost to new emerging provinces in Central Luzon."
        ],
        [
            "During the 17th century, The Dutch recruited men from Pampanga as mercenaries who served the Royal Netherlands East Indies Army, known as Papangers however, there are few traces of their descendants, except for a small community in Kampung Tugu."
        ],
        [
            "The historic province of Bataan which was founded in 1754 under the administration of Spanish Governor-General Pedro Manuel Arandia, absorbed from the province of Pampanga the municipalities of Abucay, Balanga (now a city), Dinalupihan, Llana Hermosa, Orani, Orion, Pilar, and Samal.",
            "During the British occupation of Manila (1762–1764), Bacolor became the provisional Spanish colonial capital and military base.",
            "By the end of the 1700s, Pampanga had 16,604 native families and 2,641 Spanish Filipino families,: 460"
        ],
        [
            "The old Pampanga towns of Aliaga, Cabiao, Gapan, San Antonio and San Isidro were ceded to the province of Nueva Ecija in 1848 during the term of Spanish Governor-General Narciso Claveria y Zaldua.",
            "The municipality of San Miguel de Mayumo of Pampanga was yielded to the province of Bulacan in the same provincial boundary configuration in 1848."
        ],
        [
            "In 1860, the northern towns of Bamban, Capas, Concepcion, Victoria, Tarlac, Mabalacat, Magalang, Porac and Floridablanca were separated from Pampanga and were placed under the jurisdiction of a military command called Comandancia Militar de Tarlac.",
            "However, in 1873, the four latter towns were returned to Pampanga and the other five became municipalities of the newly created Province of Tarlac."
        ],
        [
            "Japanese invasion era"
        ],
        [
            "On December 8, 1941, Japanese planes bombed Clark Air Base marking the beginning of the invasion of Pampanga.",
            "Between 1941 and 1942, occupying Japanese forces began entering Pampanga."
        ],
        [
            "During the counter-insurgencies under the Japanese occupation from 1942 to 1944, Kapampangan guerrilla fighters and the Hukbalahap Communist guerrillas fought side by side in the province of Pampanga, attacking and retreating the Japanese Imperial forces for over three years of fighting and invasion."
        ],
        [
            "The establishment of the military general headquarters and military camp bases of the Philippine Commonwealth Army was active from 1935 to 1946.",
            "The Philippine Constabulary was active from 1935 to 1942 and 1944 to 1946 in the province of Pampanga.",
            "During the military engagements of the anti-Japanese Imperial military operations in central Luzon from 1942 to 1945 in the province of Bataan, Bulacan, Northern Tayabas (now Aurora), Nueva Ecija, Pampanga, Tarlac, and Zambales, the local guerrilla resistance fighters and Hukbalahap Communist guerrillas, helped the U.S. military forces fight the Imperial Japanese armed forces."
        ],
        [
            "In the 1945 liberation of Pampanga, Kapampangan guerrilla fighters and the Hukbalahap Communist guerrillas supported combat forces from Filipino and American ground troops in attacking Japanese Imperial forces during the Battle of Pampanga until the end of the Second World War.",
            "Local military operations soldiers and officers of the Philippine Commonwealth Army 2nd, 26th, 3rd, 32nd, 33rd, 35th, 36th and 37th Infantry Division and the Philippine Constabulary 3rd Constabulary Regiment recaptured and liberated the province of Pampanga and fought against the Japanese Imperial forces during the Battle of Pampanga."
        ],
        [
            "Postwar Era"
        ],
        [
            "Old seal of the province since 1950."
        ],
        [
            "Flag seal of Pampanga"
        ],
        [
            "After the Second World War, operations in the main province of Pampanga was downfall insurgencies and conflicts between the Philippine Government forces and the Hukbalahap Communist rebels on 1946 to 1954 during the Hukbalahap Rebellion."
        ],
        [
            "Under a 1947 Military Bases Agreement,"
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos, Political detainees under the Marcos dictatorship, and Human rights abuses of the Marcos dictatorship"
        ],
        [
            "See also: US Bases in the Philippines"
        ],
        [
            "Due to its proximity to the capital and the presence of Clark Air Base, Pampanga was became one of the flashpoint of social upheavals of the early 1970s, and the ensuing dictatorship of Ferdinand Marcos."
        ],
        [
            "Upon the declaration of Martial Law in September 1972, Camp Olivas in the City of San Fernando  was designated as one of the four provincial camps to become a Regional Command for Detainees (RECAD).",
            "It was designated RECAD I and it housed detainees from Northern and Central Luzon."
        ],
        [
            "Others were killed without being arrested, such as close friends Pepito Deheran, Rolando Castro and Lito Cabrera were sleeping in Cabrera's property in Sapang Bato, Angeles when they were attacked, captured, and tortured by Marcos' Civilian Home Defense Force militia forces after they participated in the protest movement that grew out of the assassination of opposition leader Ninoy Aquino.",
            "Deheran managed to escape the ordeal alive and was taken to the hospital, but was stabbed by unknown assailants in his own hospital bed."
        ],
        [
            "Jennifer Cariño, the Palabay brothers, Macli-ing Dulag, Castro, Cabrera, and Deheran would later be honored by having their names inscribed on the wall of remembrance of the Philippines' Bantayog ng mga Bayani, which honors the martyrs and heroes who dared to resist the dictatorship."
        ],
        [
            "Mount Pinatubo eruption and closure of Clark Air Base"
        ],
        [
            "Main articles: 1991 eruption of Mount Pinatubo and Clark Air Base"
        ],
        [
            "Major events that took place in Pampanga after the People Power revolution include the Mount Pinatubo eruption and the end of the Philippines' Bases Treaty with the United States, which resulted in the closure of Clark Air Base and the later creation of the Clark Freeport and Special Economic Zone."
        ],
        [
            "The June 15, 1991, eruption of Mount Pinatubo displaced a large number of people with the submersion of whole towns and villages by massive lahar floods.",
            "This led to a large-scale advancement in disaster preparation in government.",
            "It also hastened the closure of Clark Air Base, which was already due to close as a result of the November 1991 decision of the Philippine senate not to renew the Philippines' Bases treaty with the United States."
        ],
        [
            "Creation of the Clark Freeport and Special Economic Zone"
        ],
        [
            "Main article: Clark Freeport and Special Economic Zone"
        ],
        [
            "1992 saw the signing of the Bases Conversion and Development Act (Republic Act 7227 ser.",
            "1992), which authorized the President to issue a decree converting the military reservation in the Clark area covering Angeles City, Mabalacat, and Porac, Pampanga and Capas, Tarlac into a special economic zone.",
            "The legislation also created the Bases Conversion and Development Authority (BCDA) to facilitate the conversion process."
        ],
        [
            "The Clark Air Base area would later be declared a Freeport Zone and was separated from the special economic zone through Republic Act 9400 of 2007 Since then the Freeport Zone and the Clark Special Economic Zone were considered as separate areas but collectively they are referred to as the \"Clark Freeport and Special Economic Zone\"."
        ],
        [
            "Contemporary"
        ],
        [
            "In 2010, a Kapampangan, Benigno Aquino III, son of former President Corazon Aquino, was elected as president."
        ],
        [
            "On April 22, 2019, the province suffered severe damage due to 6.1 magnitude earthquake which originated from Zambales and was the most affected area by the earthquake due to province sitting on soft sediment and alluvial soil."
        ],
        [
            "Geography"
        ],
        [
            "Pampanga covers a total area of 2,002.20 square kilometres (773.05 sq mi) The province is bordered by Tarlac to the north, Nueva Ecija to the northeast, Bulacan to the east, Manila Bay to the central-south, Bataan to the southwest, and Zambales to the northwest."
        ],
        [
            "Its terrain is relatively flat with one distinct mountain, Mount Arayat and the notable Pampanga River.",
            "Among its municipalities, Porac has the largest area with 314 square kilometres (121 sq mi); Candaba comes in second with 176 square kilometres (68 sq mi); followed by Floridablanca with 175 square kilometres (68 sq mi).",
            "Santo Tomas, with an area of only 21 square kilometres (8.1 sq mi), is the smallest."
        ],
        [
            "Climate"
        ],
        [
            "The province of Pampanga has two distinct climates, rainy and dry.",
            "The rainy or wet season normally begins in May and runs through October, while the rest of the year is the dry season.",
            "The warmest period of the year occurs between March and April, while the coolest period is from December through February.",
            "The wet season will be from June to October and also dry season"
        ],
        [
            "will be from November to April in the province of Pampanga."
        ],
        [
            "Climate data for Pampanga"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "31.5(88.7)"
        ],
        [
            "33.1(91.6)"
        ],
        [
            "34.5(94.1)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "31.2(88.2)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "31.6(88.9)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "30.5(86.9)"
        ],
        [
            "32.0(89.7)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "21.8(71.2)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "23.5(74.3)"
        ],
        [
            "22.3(72.1)"
        ],
        [
            "23.7(74.6)"
        ],
        [
            "Average rainy days"
        ],
        [
            "5"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "13"
        ],
        [
            "20"
        ],
        [
            "22"
        ],
        [
            "22"
        ],
        [
            "22"
        ],
        [
            "17"
        ],
        [
            "15"
        ],
        [
            "8"
        ],
        [
            "156"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Political map of Pampanga"
        ],
        [
            "Pampanga comprises 19 municipalities and three cities (one highly urbanized and two component)."
        ],
        [
            "The province is divided into three parts.",
            "The western portion includes the municipalities of Porac and Floridablanca, the component city of Mabalacat, and the highly urbanized city of Angeles.",
            "The central part consists of the municipalities of Magalang, Arayat, Mexico, Santa Ana, Bacolor, Santa Rita, Guagua, Lubao, Sasmuan, and the component city of San Fernando.",
            "The eastern half is composed of the municipalities of Candaba, San Luis, Santo Tomas, San Simon, Minalin, Apalit, Macabebe, and Masantol."
        ],
        [
            " †  Provincial capital and component city ∗  Component city  Municipality ‡  Highly urbanized city (geographically within but independent from the province)"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Angeles City"
        ],
        [
            "‡"
        ],
        [
            "Lone"
        ],
        [
            "—"
        ],
        [
            "462,928"
        ],
        [
            "411,634"
        ],
        [
            "2.26%"
        ],
        [
            "63.37"
        ],
        [
            "24.47"
        ],
        [
            "7,300"
        ],
        [
            "19,000"
        ],
        [
            "33"
        ],
        [
            "15°08′24″N 120°35′16″E﻿ / ﻿15.1399°N 120.5879°E﻿ / 15.1399; 120.5879﻿ (Angeles)"
        ],
        [
            "Apalit"
        ],
        [
            "4th"
        ],
        [
            "4.8%"
        ],
        [
            "117,160"
        ],
        [
            "107,965"
        ],
        [
            "1.57%"
        ],
        [
            "61.47"
        ],
        [
            "23.73"
        ],
        [
            "1,900"
        ],
        [
            "4,900"
        ],
        [
            "12"
        ],
        [
            "14°57′01″N 120°45′36″E﻿ / ﻿14.9502°N 120.7599°E﻿ / 14.9502; 120.7599﻿ (Apalit)"
        ],
        [
            "Arayat"
        ],
        [
            "3rd"
        ],
        [
            "5.9%"
        ],
        [
            "144,875"
        ],
        [
            "133,492"
        ],
        [
            "1.57%"
        ],
        [
            "134.48"
        ],
        [
            "51.92"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "30"
        ],
        [
            "15°09′00″N 120°46′03″E﻿ / ﻿15.1501°N 120.7675°E﻿ / 15.1501; 120.7675﻿ (Arayat)"
        ],
        [
            "Bacolor"
        ],
        [
            "3rd"
        ],
        [
            "2.0%"
        ],
        [
            "48,066"
        ],
        [
            "39,460"
        ],
        [
            "3.83%"
        ],
        [
            "71.70"
        ],
        [
            "27.68"
        ],
        [
            "670"
        ],
        [
            "1,700"
        ],
        [
            "21"
        ],
        [
            "14°59′47″N 120°39′05″E﻿ / ﻿14.9965°N 120.6513°E﻿ / 14.9965; 120.6513﻿ (Villa de Bacolor)"
        ],
        [
            "Candaba"
        ],
        [
            "4th"
        ],
        [
            "4.9%"
        ],
        [
            "119,497"
        ],
        [
            "111,586"
        ],
        [
            "1.31%"
        ],
        [
            "176.40"
        ],
        [
            "68.11"
        ],
        [
            "680"
        ],
        [
            "1,800"
        ],
        [
            "33"
        ],
        [
            "15°05′33″N 120°49′39″E﻿ / ﻿15.0925°N 120.8276°E﻿ / 15.0925; 120.8276﻿ (Candaba)"
        ],
        [
            "Floridablanca"
        ],
        [
            "2nd"
        ],
        [
            "5.6%"
        ],
        [
            "135,542"
        ],
        [
            "125,163"
        ],
        [
            "1.53%"
        ],
        [
            "175.48"
        ],
        [
            "67.75"
        ],
        [
            "770"
        ],
        [
            "2,000"
        ],
        [
            "33"
        ],
        [
            "14°58′33″N 120°31′43″E﻿ / ﻿14.9759°N 120.5287°E﻿ / 14.9759; 120.5287﻿ (Floridablanca)"
        ],
        [
            "Guagua"
        ],
        [
            "2nd"
        ],
        [
            "5.3%"
        ],
        [
            "128,893"
        ],
        [
            "117,430"
        ],
        [
            "1.79%"
        ],
        [
            "48.67"
        ],
        [
            "18.79"
        ],
        [
            "2,600"
        ],
        [
            "6,700"
        ],
        [
            "31"
        ],
        [
            "14°57′55″N 120°38′01″E﻿ / ﻿14.9654°N 120.6336°E﻿ / 14.9654; 120.6336﻿ (Guagua)"
        ],
        [
            "Lubao"
        ],
        [
            "2nd"
        ],
        [
            "7.1%"
        ],
        [
            "173,502"
        ],
        [
            "160,838"
        ],
        [
            "1.45%"
        ],
        [
            "155.77"
        ],
        [
            "60.14"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "44"
        ],
        [
            "14°56′16″N 120°36′01″E﻿ / ﻿14.9378°N 120.6004°E﻿ / 14.9378; 120.6004﻿ (Lubao)"
        ],
        [
            "Mabalacat"
        ],
        [
            "∗"
        ],
        [
            "1st"
        ],
        [
            "12.0%"
        ],
        [
            "293,244"
        ],
        [
            "250,799"
        ],
        [
            "3.02%"
        ],
        [
            "82.20"
        ],
        [
            "31.74"
        ],
        [
            "3,600"
        ],
        [
            "9,300"
        ],
        [
            "27"
        ],
        [
            "15°13′22″N 120°34′24″E﻿ / ﻿15.2228°N 120.5733°E﻿ / 15.2228; 120.5733﻿ (Mabalacat)"
        ],
        [
            "Macabebe"
        ],
        [
            "4th"
        ],
        [
            "3.2%"
        ],
        [
            "78,151"
        ],
        [
            "75,850"
        ],
        [
            "0.57%"
        ],
        [
            "105.16"
        ],
        [
            "40.60"
        ],
        [
            "740"
        ],
        [
            "1,900"
        ],
        [
            "25"
        ],
        [
            "14°54′30″N 120°42′53″E﻿ / ﻿14.9084°N 120.7147°E﻿ / 14.9084; 120.7147﻿ (Macabebe)"
        ],
        [
            "Magalang"
        ],
        [
            "1st"
        ],
        [
            "5.1%"
        ],
        [
            "124,188"
        ],
        [
            "113,147"
        ],
        [
            "0.91%"
        ],
        [
            "97.32"
        ],
        [
            "37.58"
        ],
        [
            "1,300"
        ],
        [
            "3,400"
        ],
        [
            "27"
        ],
        [
            "15°12′53″N 120°39′42″E﻿ / ﻿15.2147°N 120.6618°E﻿ / 15.2147; 120.6618﻿ (Magalang)"
        ],
        [
            "Masantol"
        ],
        [
            "4th"
        ],
        [
            "2.4%"
        ],
        [
            "57,990"
        ],
        [
            "57,063"
        ],
        [
            "0.31%"
        ],
        [
            "48.25"
        ],
        [
            "18.63"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "26"
        ],
        [
            "14°53′04″N 120°42′35″E﻿ / ﻿14.8845°N 120.7098°E﻿ / 14.8845; 120.7098﻿ (Masantol)"
        ],
        [
            "Mexico"
        ],
        [
            "3rd"
        ],
        [
            "7.1%"
        ],
        [
            "173,403"
        ],
        [
            "154,624"
        ],
        [
            "2.21%"
        ],
        [
            "117.41"
        ],
        [
            "45.33"
        ],
        [
            "1,500"
        ],
        [
            "3,900"
        ],
        [
            "43"
        ],
        [
            "15°03′53″N 120°43′12″E﻿ / ﻿15.0648°N 120.7200°E﻿ / 15.0648; 120.7200﻿ (Mexico)"
        ],
        [
            "Minalin"
        ],
        [
            "4th"
        ],
        [
            "2.0%"
        ],
        [
            "48,380"
        ],
        [
            "47,713"
        ],
        [
            "0.26%"
        ],
        [
            "48.27"
        ],
        [
            "18.64"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "15"
        ],
        [
            "14°58′04″N 120°41′09″E﻿ / ﻿14.9677°N 120.6859°E﻿ / 14.9677; 120.6859﻿ (Minalin)"
        ],
        [
            "Porac"
        ],
        [
            "2nd"
        ],
        [
            "5.8%"
        ],
        [
            "140,751"
        ],
        [
            "124,381"
        ],
        [
            "2.38%"
        ],
        [
            "314.00"
        ],
        [
            "121.24"
        ],
        [
            "450"
        ],
        [
            "1,200"
        ],
        [
            "29"
        ],
        [
            "15°04′20″N 120°32′28″E﻿ / ﻿15.0723°N 120.5411°E﻿ / 15.0723; 120.5411﻿ (Porac)"
        ],
        [
            "San Fernando"
        ],
        [
            "†"
        ],
        [
            "Lone"
        ],
        [
            "14.5%"
        ],
        [
            "354,666"
        ],
        [
            "306,659"
        ],
        [
            "2.81%"
        ],
        [
            "67.74"
        ],
        [
            "26.15"
        ],
        [
            "5,200"
        ],
        [
            "13,000"
        ],
        [
            "35"
        ],
        [
            "15°01′45″N 120°41′34″E﻿ / ﻿15.0292°N 120.6928°E﻿ / 15.0292; 120.6928﻿ (San Fernando, Pampanga)"
        ],
        [
            "San Luis"
        ],
        [
            "4th"
        ],
        [
            "2.4%"
        ],
        [
            "58,551"
        ],
        [
            "54,106"
        ],
        [
            "1.51%"
        ],
        [
            "56.83"
        ],
        [
            "21.94"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "17"
        ],
        [
            "15°02′21″N 120°47′27″E﻿ / ﻿15.0393°N 120.7908°E﻿ / 15.0393; 120.7908﻿ (San Luis)"
        ],
        [
            "San Simon"
        ],
        [
            "4th"
        ],
        [
            "2.4%"
        ],
        [
            "59,182"
        ],
        [
            "53,198"
        ],
        [
            "2.05%"
        ],
        [
            "57.37"
        ],
        [
            "22.15"
        ],
        [
            "1,000"
        ],
        [
            "2,600"
        ],
        [
            "14"
        ],
        [
            "14°59′42″N 120°46′45″E﻿ / ﻿14.9950°N 120.7793°E﻿ / 14.9950; 120.7793﻿ (San Simon)"
        ],
        [
            "Santa Ana"
        ],
        [
            "3rd"
        ],
        [
            "2.5%"
        ],
        [
            "61,537"
        ],
        [
            "55,178"
        ],
        [
            "2.10%"
        ],
        [
            "39.84"
        ],
        [
            "15.38"
        ],
        [
            "1,500"
        ],
        [
            "3,900"
        ],
        [
            "14"
        ],
        [
            "15°05′41″N 120°45′57″E﻿ / ﻿15.0946°N 120.7659°E﻿ / 15.0946; 120.7659﻿ (Santa Ana)"
        ],
        [
            "Santa Rita"
        ],
        [
            "2nd"
        ],
        [
            "2.0%"
        ],
        [
            "48,209"
        ],
        [
            "40,979"
        ],
        [
            "3.14%"
        ],
        [
            "29.76"
        ],
        [
            "11.49"
        ],
        [
            "1,600"
        ],
        [
            "4,100"
        ],
        [
            "10"
        ],
        [
            "14°59′56″N 120°37′05″E﻿ / ﻿14.9990°N 120.6180°E﻿ / 14.9990; 120.6180﻿ (Santa Rita)"
        ],
        [
            "Santo Tomas"
        ],
        [
            "4th"
        ],
        [
            "1.8%"
        ],
        [
            "42,846"
        ],
        [
            "40,475"
        ],
        [
            "1.09%"
        ],
        [
            "21.30"
        ],
        [
            "8.22"
        ],
        [
            "2,000"
        ],
        [
            "5,200"
        ],
        [
            "7"
        ],
        [
            "14°59′38″N 120°42′16″E﻿ / ﻿14.9939°N 120.7045°E﻿ / 14.9939; 120.7045﻿ (Santo Tomas)"
        ],
        [
            "Sasmuan"
        ],
        [
            "2nd"
        ],
        [
            "1.2%"
        ],
        [
            "29,076"
        ],
        [
            "28,004"
        ],
        [
            "0.72%"
        ],
        [
            "91.80"
        ],
        [
            "35.44"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "12"
        ],
        [
            "14°56′10″N 120°37′21″E﻿ / ﻿14.9362°N 120.6226°E﻿ / 14.9362; 120.6226﻿ (Sasmuan)"
        ],
        [
            "Total"
        ],
        [
            "2,437,709"
        ],
        [
            "2,198,110"
        ],
        [
            "1.99%"
        ],
        [
            "2,001.22"
        ],
        [
            "772.68"
        ],
        [
            "1,200"
        ],
        [
            "3,100"
        ],
        [
            "505"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude.^ Total figures exclude the highly urbanized city of Angeles."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of PampangaYearPop.±% p.a.1903 223,754—    1918 257,620+0.94%1939 375,281+1.81%1948 416,583+1.17%1960 617,259+3.33%1970 772,731+2.27%1975 891,000+2.90%1980 992,756+2.19%1990 1,295,929+2.70%1995 1,401,756+1.48%2000 1,618,759+3.13%2007 1,911,951+2.32%2010 2,014,019+1.91%2015 2,198,110+1.68%2020 2,437,709+2.06%(excluding Angeles)Source: Philippine Statistics Authority"
        ],
        [
            "Population"
        ],
        [
            "The population of Pampanga in the 2020 census was 2,437,709 people, with a density of 1,200 inhabitants per square kilometre or 3,100 inhabitants per square mile.",
            "If Angeles is included for geographical purposes, the population is 2,900,637, with a density of 1,265/km2 (3,277/sq mi).",
            "The native inhabitants of Pampanga are generally referred to as the Kapampangans (alternatively Pampangos or Pampangueños).",
            "Tagalogs live in areas on the boundaries with Bulacan, Nueva Ecija, & Bataan; they are mostly descendants of settlers arrived from those provinces, w/ others from Aurora."
        ],
        [
            "Languages"
        ],
        [
            "See also: Kapampangan language, Tagalog language, and Sambal language"
        ],
        [
            "The whole population of Pampanga speak Kapampangan, which is one of the Central Luzon languages along with the Sambalic languages.",
            "Tagalog is generally spoken in areas bordering Bulacan, Nueva Ecija, and Bataan.",
            "English and Tagalog are rather spoken and used as secondary languages.",
            "There are a few Sambal speakers in the province, especially near the border of Zambales."
        ],
        [
            "Religion"
        ],
        [
            "Main article: Religion in the Philippines"
        ],
        [
            "Catholicism"
        ],
        [
            "Our Lady of Grace Parish in Mabalacat."
        ],
        [
            "Nuestra Señora de la Merced de Pinac (secondary patroness of Pampanga)"
        ],
        [
            "The province of Pampanga is composed of many religious groups, but it is predominantly Roman Catholic (88.92%)."
        ],
        [
            "Islam"
        ],
        [
            "Islam (0.017%) is also present in the province, mainly due to migrants originating from the south, as well as Buddhism, which is practiced by a few people of Chinese descent."
        ],
        [
            "Others"
        ],
        [
            "According to 2010 Census, other prominent Christian groups include the Iglesia ni Cristo (3.84%), Evangelicals (1.34%), Aglipayan Church (0.60%), Jesus is Lord Church (0.48%), Baptist Church (0.39%), Jehovah's Witnesses (0.27%), Church of Christ (0.23%), United Church of Christ in the Philippines (0.22%), Seventh-day Adventist Church (0.18%) and many others."
        ],
        [
            "Economy"
        ],
        [
            "See also: List of shopping malls in Pampanga"
        ],
        [
            "Poverty incidence of Pampanga"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "2006  2.69"
        ],
        [
            "2009  6.87"
        ],
        [
            "2012  7.58"
        ],
        [
            "2015  4.59"
        ],
        [
            "2018  3.00"
        ],
        [
            "2021  2.90"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Farming and fishing are the two main industries.",
            "Major products include rice, corn, sugarcane, and tilapia.",
            "Pampanga is the tilapia capital of the country because of its high production reaching 214,210.12 metric tons in 2015.",
            "In addition to farming and fishing, the province supports thriving cottage industries that specialize in wood carving, furniture making, guitars and handicrafts.",
            "Every Christmas season, the province of Pampanga, especially in the capital city of San Fernando becomes the center of a thriving industry centered on handcrafted lighted lanterns called parols that display a kaleidoscope of light and color.",
            "Other industries include its casket industry and the manufacturing of all-purpose vehicles in the municipality of Santo Tomas."
        ],
        [
            "The province is famous for its sophisticated culinary work: it is called the \"food capital\" of the Philippines.",
            "Kapampangans are well known for their culinary creations.",
            "Famous food products range from the mundane to the exotic.",
            "Roel's Meat Products, Pampanga's Best and Mekeni Food are among the better known meat brands of the country producing Kapampangan favorites such as pork and chicken tocinos, beef tapa, hotdogs, longganizas (Philippine-style cured sausages) and chorizos."
        ],
        [
            "Specialty foods such as the siopao, pandesal, tutong, lechon (roasted pig) and its sarsa (sauce) are popular specialty foods in the region.",
            "The more exotic betute tugak (stuffed frog), kamaru (mole crickets) cooked adobo, bulanglang (pork cooked in guava juice), lechon kawali and bringhe (a green sticky rice dish like paella) are a mainstay in Kapampangan feasts."
        ],
        [
            "Native sweets and delicacies like pastillas, turonnes de casuy, buro, are the most sought after by Filipinos including a growing number of tourists who enjoy authentic Kapampangan cuisine.",
            "The famous cookie in Mexico, Pampanga, Panecillos de San Nicolas, which is known as the mother of all Philippine cookies, is made here, famously made by Lillian Borromeo at her restaurant, Kusinang Matua."
        ],
        [
            "Tourism is a growing industry in the province of Pampanga.",
            "Clark Freeport Zone is home to Clark International Airport, designated as the Philippines' future premier gateway.",
            "Other developing industries include semiconductor manufacturing for electronics and computers mostly located within the freeport."
        ],
        [
            "Within the Clark Special Economic Zone are well-established hotels and resorts.",
            "Popular tourist destinations include St. Peter Shrine in Apalit, Mt.",
            "Arayat National Park in San Juan Bano, Mount Arayat, the Paskuhan Village in the City of San Fernando, the Casino Filipino in Angeles and, for nature and wildlife, \"Paradise Ranch and Zoocobia Fun Zoo\" in Clark.",
            "Well-known annual events include the Giant Lantern Festival in December, the hot air balloon festival in Clarkfield in February and in Lubao in April, the San Pedro Cutud Lenten Rites celebrated two days before Easter, and the Aguman Sanduk in Minalin celebrated on the afternoon of New Year's Day."
        ],
        [
            "Boat culture"
        ],
        [
            "This section needs expansion.",
            "You can help by adding to it.",
            "(June 2021)"
        ],
        [
            "There have been proposals to revitalize the karakoa shipbuilding tradition of the Kapampangan people in recent years.",
            "The karakoa was the warship of the Kapampangan from the classical eras (before 15th century) up to the 16th century.",
            "The production of the karakoa and its usage were stopped by the Spanish colonialists to establish the galleon ship-making tradition instead, as a sign of Spanish dominance over the Kapampangan."
        ],
        [
            "Wildlife"
        ],
        [
            "Pampanga's geography has made the province an important rallying point for biodiversity conservation, particularly in the case of the Candaba Wetlands which provides critical habitat for migratory bird species which visit the Philippines from sites further north in Asia.",
            "Migratory birds frequently seen in the swamp include the Shrenck’s Bittern, the Great Bittern, the Eurasian Spoonbill, the Purple Swamp Hen, the Chinese Pond Heron and the Black-Crowned Heron."
        ],
        [
            "Infrastructure"
        ],
        [
            "Telecommunication"
        ],
        [
            "Telephone services are provided by PLDT, Digitel, Converge Telecom, Datelcom, the Evangelista Telephone Company, and the Pampanga Telecom Company in the town of Macabebe.",
            "The province has 24 public telegraph offices distributed among its towns while the facilities of PT&T and RCPI were set up to serve the business centers in Angeles, San Fernando City and Guagua."
        ],
        [
            "Several Internet Service provider are available.",
            "These include the Angeles Computer Network Specialist, Information Resources Network System, Inc., [Mosaic communications Inc., Net Asia Angeles, Phil World On Line and Comclark Network and Technology Corp."
        ],
        [
            "United Parcel Service (UPS) and Federal Express (FedEx) provide international courier services.",
            "Their hubs are in the Clark Freeport Zone.",
            "They are complemented by four local couriers operating as the communication and baggage of the province.",
            "There are three postal district offices and 35 post office stations distributed in the 20 municipalities and two cities of the province."
        ],
        [
            "Water and power"
        ],
        [
            "Pampanga electrical cooperative service areas"
        ],
        [
            "Potable water supply in the province reaches the populace through three levels namely: Level I (point source system), Level II (communal faucet system), and Level III (individual connections).",
            "A well or spring is the pinpointed water source in areas where houses are few as the system is only designed to serve 15 to 25 households.",
            "As of 1997, there were 128,571 Level I water system users in the province.",
            "The communal faucet system (Level II) serves the rural areas while the Level III system is managed by the Local Water Utilities Administration (LWUA).",
            "The system provides individual house connections to all second and first class private subdivisions."
        ],
        [
            "Electric power is distributed to the majority of the towns through the distribution centers of the Pampanga Electric Cooperative (PELCO) which include PELCO I, II, III.",
            "Small parts of Candaba and Macabebe are also supplied by Manila Electric Company (Meralco).",
            "Angeles and small parts of Mabalacat are supplied by Angeles Electric Corporation (AEC) Villa de Bacolor, Guagua, Sta, Rita, Lubao, Sasmuan, Porac, Mabalacat and small part of Floridablanca are supplied by Pampanga Electric Cooperative II (PELCO II).",
            "City of San Fernando and Floridablanca is supplied by San Fernando Electric Company (SFELAPCO)."
        ],
        [
            "Power is also transmitted to the province through various transmission lines and substations located within the province, such as the Mexico and Clark substations, and Hermosa–Duhat–Balintawak, Mexico–Hermosa, Hermosa–San Jose transmission lines, etc., all of which are operated and maintained by the National Grid Corporation of the Philippines (NGCP)."
        ],
        [
            "Transportation"
        ],
        [
            "The province of Pampanga is strategically located at the crossroads of central Luzon and is highly accessible by air and land.",
            "The province is home to two airstrips: Basa Air Base in Floridablanca, which is used by the military, and Clark International Airport in Clark Freeport Zone.",
            "Pampanga has five municipal ports that function as fish landing centers.",
            "These are in the municipalities of Guagua, Macabebe, Masantol, Minalin, and Sasmuan."
        ],
        [
            "Road transport"
        ],
        [
            "Land travel to Pampanga is provided by highways and by buses.",
            "Buses that travel the routes of Manila-Bataan, Manila-Zambales, Manila-Tarlac, Manila-Nueva Ecija, Manila-Bulacan-Pampanga, and Manila-Pampanga-Dagupan serve as connections with the nearby provinces and Metro Manila."
        ],
        [
            "The 84 kilometres (52 mi) North Luzon Expressway (NLEX) extends from Balintawak in Quezon City, Metro Manila, to Santa Ines in Mabalacat.",
            "It passes through the cities and municipalities of Apalit, San Simon, Santo Tomas, San Fernando, Mexico, Angeles City, and ends on Santa Ines in Mabalacat."
        ],
        [
            "The 94 kilometres (58 mi) four-lane Subic–Clark–Tarlac Expressway (SCTEx) to date, is the longest toll expressway in the Philippines.",
            "Its southern terminus is in the Subic Bay Freeport Zone and passes through the Clark Freeport Zone in two interchanges: Clark North and Clark South.",
            "The expressway is linked to the North Luzon Expressway through the Mabalacat Interchange.",
            "Its northern terminus is located at the Central Techno Park in Tarlac City, Tarlac."
        ],
        [
            "Aside from the expressways, national highways also serve the province.",
            "Two major national highways serves Pampanga, the MacArthur Highway (N2) and Jose Abad Santos Avenue (N3).",
            "Secondary and tertiary national roads, and provincial roads complement the highway backbone."
        ],
        [
            "Schools"
        ],
        [
            "This section reads like a directory.",
            "Wikipedia policy generally considers directories in articles to be unencyclopedic and potential spam.",
            "Please improve this article to conform to a higher standard of quality, and to make it neutral in tone.",
            "If it cannot be properly modified, the article is likely to be merged, redirected, or deleted.",
            "(September 2018) (Learn how and when to remove this message)"
        ],
        [
            "Colleges and universities"
        ],
        [
            "AIE College (Angeles City)"
        ],
        [
            "AMA Computer College (Angeles)"
        ],
        [
            "AMA Computer College (City of San Fernando)"
        ],
        [
            "AMA Computer Learning Center (Angeles)"
        ],
        [
            "AMA Computer Learning Center (City of San Fernando)"
        ],
        [
            "AMA Computer Learning Center (Apalit)"
        ],
        [
            "Angeles University Foundation (Angeles City)"
        ],
        [
            "Arayat Institute (Arayat)"
        ],
        [
            "Arayat National High School (Arayat)"
        ],
        [
            "Asian College of Science & Technology"
        ],
        [
            "Asian Institute of Computer Studies (Mabalacat City and City of San Fernando)"
        ],
        [
            "Center for Asian Culinary Studies (Angeles City)"
        ],
        [
            "Central Luzon College of Science and Technology (CELTECH College), (City of San Fernando)"
        ],
        [
            "City College of Angeles (Angeles City)"
        ],
        [
            "Church Education System Seminary & Institute of Religion, in every chapels of the Church of Jesus Christ of Latter-day Saints"
        ],
        [
            "Colegio de San Lorenzo de Pampanga (Macabebe, Pampanga)"
        ],
        [
            "Colegio de Sebastian (City of San Fernando)"
        ],
        [
            "Computer System Specialist, Inc. (Angeles City)"
        ],
        [
            "Dau Academy-Saint Muchen (Mabalacat City)"
        ],
        [
            "Dee Hwa Liong College Foundation (Mabalacat City)"
        ],
        [
            "Development for Advanced Technology Achievement (DATA) College (City of San Fernando)"
        ],
        [
            "Don Honorio Ventura State University (Bacolor)"
        ],
        [
            "Don Honorio Ventura State University (Candaba)"
        ],
        [
            "Don Honorio Ventura State University (Lubao)"
        ],
        [
            "Don Honorio Ventura State University (Mexico)"
        ],
        [
            "Don Honorio Ventura State University (Porac)"
        ],
        [
            "Don Honorio Ventura State University (Santo Tomas)"
        ],
        [
            "East Central Colleges (City of San Fernando)"
        ],
        [
            "Exact College of Asia (Arayat)"
        ],
        [
            "Gateway Institute of Science and Technology (City of San Fernando)"
        ],
        [
            "Gonzalo Puyat School of Arts and Trades (San Luis)"
        ],
        [
            "Guagua National Colleges (Guagua)"
        ],
        [
            "Harvardian Colleges (City of San Fernando)"
        ],
        [
            "Holy Angel University (Angeles City)"
        ],
        [
            "Holy Cross College Pampanga (Santa Ana)"
        ],
        [
            "Infant Jesus Academy (IJA)"
        ],
        [
            "Information and Communication Technology High School (City of San Fernando)"
        ],
        [
            "Integrated Computer School Foundation (Angeles City)"
        ],
        [
            "International School for Culinary Arts and Hotel Management (Angeles City)"
        ],
        [
            "Jocson College (Angeles City)"
        ],
        [
            "Jose C. Feliciano College, Inc. (Mabalacat City)"
        ],
        [
            "La Plata Science and Technology, Inc. (City of San Fernando)"
        ],
        [
            "La Verdad Christian College (Apalit)"
        ],
        [
            "Mabalacat City College (Mabalacat City)"
        ],
        [
            "Mary Help of Christians School Inc. (Mabalacat City)"
        ],
        [
            "Mary the Queen College (Guagua)"
        ],
        [
            "Mega Computer College (Angeles City)"
        ],
        [
            "Megabyte College of Science and Technology (Floridablanca and Guagua)"
        ],
        [
            "Mother of Good Counsel Major Seminary (City of San Fernando)"
        ],
        [
            "Mother of Good Counsel Minor Seminary (City of San Fernando)"
        ],
        [
            "Mother of Perpetual Help Institute School of Midwifery and Nursing Aide (Angeles City)"
        ],
        [
            "Mount Carmel Colleges (City of San Fernando)"
        ],
        [
            "National University-Clark (Mabalacat City)"
        ],
        [
            "New Era University (City of San Fernando)"
        ],
        [
            "NorthPoint Academy for Culinary Arts (City of San Fernando)"
        ],
        [
            "Our Lady of Fatima University (City of San Fernando)"
        ],
        [
            "Pampanga Colleges (Macabebe)"
        ],
        [
            "Pampanga Institute (Masantol)"
        ],
        [
            "Pampanga State Agricultural University (Magalang)"
        ],
        [
            "Philippine State College of Aeronautics (Floridablanca)"
        ],
        [
            "Proverbsville School (Angeles City)"
        ],
        [
            "Proverbsville School (City of San Fernando)"
        ],
        [
            "Republic Central Colleges (Angeles City)"
        ],
        [
            "Saint Anthony College of Technology (Mabalacat City)"
        ],
        [
            "Saint Mary's Angels College of Pampanga (Santa Ana)"
        ],
        [
            "Saint Michael's College (Guagua)"
        ],
        [
            "St. Nicolas College of Business and Technology (City of San Fernando)"
        ],
        [
            "San Lorenzo Ruiz Center of Studies and Schools (City of San Fernando)"
        ],
        [
            "Santa Rita College of Pampanga (Santa Rita)"
        ],
        [
            "Somascan Fathers Seminary (Lubao)"
        ],
        [
            "Saint Augustine School of Nursing (Angeles City)"
        ],
        [
            "St. Scholastica's Academy (City of San Fernando)"
        ],
        [
            "STI College (Angeles City)"
        ],
        [
            "STI College (City of San Fernando)"
        ],
        [
            "Systems Plus College Foundation, Inc. (Angeles City)"
        ],
        [
            "Systems Plus College Foundation, Inc. (City of San Fernando)"
        ],
        [
            "TESDA Training Center (City of San Fernando)"
        ],
        [
            "The Metropolitan Academy of Arts & Beauty – Pampanga (City of San Fernando)"
        ],
        [
            "University of the Assumption (City of San Fernando)"
        ],
        [
            "University of the Philippines - Diliman Extension Program in Pampanga (Clark Freeport Zone)"
        ],
        [
            "Sports"
        ],
        [
            "Pampanga is home to notable sports personalities, including billiards player Efren \"Bata\" Reyes as well as basketball players Japeth Aguilar and Arwind Santos."
        ],
        [
            "The province is also home to the Pampanga Giant Lanterns, which began play in the Maharlika Pilipinas Basketball League (MPBL) during the 2018–19 season.",
            "The franchise has won two league championships, one in the MPBL and one in the Pilipinas Super League.",
            "The province also hosted the Pampanga Dragons of the defunct Metropolitan Basketball Association (MBA), who were also the league's inaugural champions."
        ],
        [
            "Government and politics"
        ],
        [
            "Like other provinces in the Philippines, Pampanga is governed by a governor and vice governor who are elected to three-year terms.",
            "The governor is the executive head and leads the province's departments in executing the ordinances and improving public services.",
            "The vice governor heads a legislative council (Sangguniang Panlalawigan) consisting of board members from the districts."
        ],
        [
            " Pampanga Provincial Capitol"
        ],
        [
            "Provincial government"
        ],
        [
            "Further information: Governor of Pampanga"
        ],
        [
            "Just as the national government, the provincial government is divided into three branches: executive, legislative, and judiciary.",
            "The judicial branch is administered solely by the Supreme Court of the Philippines.",
            "The LGUs have control of the executive and legislative branches."
        ],
        [
            "The executive branch is composed of the governor for the province, mayors for the cities and municipalities, and the barangay captains for the barangays.",
            "The provincial assembly for the provinces, Sangguniang Panlungsod (city assembly) for the cities, Sangguniang Bayan (town assembly) for the municipalities, Sangguniang Barangay (barangay council), and the Sangguniang Kabataan for the youth sector."
        ],
        [
            "The seat of government is vested upon the governor and other elected officers who hold office at the Provincial Capitol building.",
            "The Sangguniang Panlalawigan is the center of legislation."
        ],
        [
            "The Provincial government is composed of a Governor as the Local Chief Executive of the Province, Vice-Governor and Members of the Sangguniang Panlalawigan.",
            "The governor is Dennis \"Delta\" G. Pineda (NPC) and the vice governor is Lilia Pineda (Kambilan)."
        ],
        [
            "Members of the Sangguniang Panlalawigan"
        ],
        [
            "District"
        ],
        [
            "Board member"
        ],
        [
            "Party"
        ],
        [
            "1st"
        ],
        [
            "Krizzanel Garbo"
        ],
        [
            "NPC"
        ],
        [
            "1st"
        ],
        [
            "Benjamin Jocson"
        ],
        [
            "NPC"
        ],
        [
            "2nd"
        ],
        [
            "Mylyn Pineda-Cayabyab"
        ],
        [
            "NPC"
        ],
        [
            "2nd"
        ],
        [
            "Fritzie Dizon"
        ],
        [
            "NPC"
        ],
        [
            "2nd"
        ],
        [
            "Sajid Khan Eusoof"
        ],
        [
            "Kambilan"
        ],
        [
            "3rd"
        ],
        [
            "Alyssa Michaela Gonzales"
        ],
        [
            "Kambilan"
        ],
        [
            "3rd"
        ],
        [
            "Lucky Dinan Labung"
        ],
        [
            "Kambilan"
        ],
        [
            "3rd"
        ],
        [
            "Ananias Canlas Jr."
        ],
        [
            "Aksyon Demokratiko"
        ],
        [
            "4th"
        ],
        [
            "Rolando Balingit"
        ],
        [
            "Nacionalista"
        ],
        [
            "4th"
        ],
        [
            "Nelson Calara"
        ],
        [
            "Kambilan"
        ],
        [
            "League"
        ],
        [
            "Board member"
        ],
        [
            "Party"
        ],
        [
            "ABC"
        ],
        [
            "Renato Mutuc"
        ],
        [
            "Nonpartisan"
        ],
        [
            "PCL"
        ],
        [
            "Cherry Manalo"
        ],
        [
            "NPC"
        ],
        [
            "SK"
        ],
        [
            "Gabriel Moshe Lacson"
        ],
        [
            "Nonpartisan"
        ],
        [
            "Court system"
        ],
        [
            "Façade of Halls of Justice (view from the rear of the Capitolio)"
        ],
        [
            "The Supreme Court of the Philippines recognizes Pampanga regional trial courts and metropolitan or municipal trial courts within the province and towns, that have an overall jurisdiction in the populace of the province and towns, respectively."
        ],
        [
            "Batas Pambansa Blg.",
            "129, \"The Judiciary Reorganization Act of 1980\", as amended, created Regional, Metropolitan, Municipal Trial and Circuit Courts.",
            "The Third Judicial Region includes RTCs in Bulacan, Nueva Ecija, Pampanga, Palayan and San Jose, inter alia:"
        ],
        [
            "xxx.",
            "There shall be – (c) Seventy-five Regional Trial judges shall be commissioned for the Third Judicial Region: Twenty-two branches (Branches XLI to LXII) for the province of Pampanga and the city of Angeles, Branches XLI to XLVIII with seats at San Fernando, Branches XLIX to LIII at Guagua, Branches LIV and LV at Macabebe, and Branches LVI to LXII at Angeles;"
        ],
        [
            "The law also created Metropolitan Trial Court in each metropolitan area established by law, a Municipal Trial Court in each of the other cities or municipalities, and a Municipal Circuit Trial Court in each circuit comprising such cities and/or municipalities as are grouped together pursuant to law: three branches for Cabanatuan; in every city which does not form part of a metropolitan area, there shall be a Municipal Trial Court with one branch, except as hereunder provided: Three branches for Angeles;"
        ],
        [
            "In each of the municipalities that are not comprised within a metropolitan area and a municipal circuit there shall be a Municipal Trial Court which shall have one branch, except as hereunder provided: Four branches for San Fernando and two branches for Guagua, both of Pampanga."
        ],
        [
            "Mayors"
        ],
        [
            "City/Municipality"
        ],
        [
            "Mayor"
        ],
        [
            "Party"
        ],
        [
            "City of San Fernando"
        ],
        [
            "Vilma Caluag"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Mabalacat City"
        ],
        [
            "Crisostomo Garbo"
        ],
        [
            "NPC"
        ],
        [
            "Apalit"
        ],
        [
            "Jun Tetangco"
        ],
        [
            "NPC"
        ],
        [
            "Arayat"
        ],
        [
            "Madeth Alejandrino"
        ],
        [
            "Kambilan"
        ],
        [
            "Bacolor"
        ],
        [
            "Diman Datu"
        ],
        [
            "Kambilan"
        ],
        [
            "Candaba"
        ],
        [
            "Rene Maglanque"
        ],
        [
            "Kambilan"
        ],
        [
            "Floridablanca"
        ],
        [
            "Darwin Manalansan"
        ],
        [
            "LAKAS"
        ],
        [
            "Guagua"
        ],
        [
            "Anthony Joseph Torres"
        ],
        [
            "Kambilan"
        ],
        [
            "Lubao"
        ],
        [
            "Esmeralda Pineda"
        ],
        [
            "Kambilan"
        ],
        [
            "Macabebe"
        ],
        [
            "Leonardo Flores"
        ],
        [
            "Nacionalista"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Lourdes Lacson"
        ],
        [
            "Kambilan"
        ],
        [
            "Masantol"
        ],
        [
            "Jose Antonio Bustos"
        ],
        [
            "PDP–Laban"
        ],
        [
            "Mexico"
        ],
        [
            "Rodencio Gonzales"
        ],
        [
            "Aksyon Demokratiko"
        ],
        [
            "Minalin"
        ],
        [
            "Philip Naguit"
        ],
        [
            "Aksyon Demokratiko"
        ],
        [
            "Porac"
        ],
        [
            "Jing Capil"
        ],
        [
            "Kambilan"
        ],
        [
            "San Luis"
        ],
        [
            "Dr. Jayson Sagum"
        ],
        [
            "Nacionalista"
        ],
        [
            "San Simon"
        ],
        [
            "Abundio Punsalan Jr."
        ],
        [
            "Nacionalista"
        ],
        [
            "Santa Ana"
        ],
        [
            "Ross Gamboa"
        ],
        [
            "Kambilan"
        ],
        [
            "Sta.",
            "Rita"
        ],
        [
            "Art Salalila"
        ],
        [
            "Kambilan"
        ],
        [
            "Sto.",
            "Tomas"
        ],
        [
            "John Sambo"
        ],
        [
            "Nacionalista"
        ],
        [
            "Sasmuan"
        ],
        [
            "Lina Cabrera"
        ],
        [
            "LAKAS"
        ],
        [
            "*Angeles City"
        ],
        [
            "Carmelo Lazatin Jr."
        ],
        [
            "Kambilan"
        ],
        [
            "Notable people"
        ],
        [
            "It has been suggested that this section be split out  into another article titled List of people from Pampanga.",
            "(Discuss) (May 2023)"
        ],
        [
            "National heroes and historical personalities"
        ],
        [
            "José Alejandrino - born in Arayat, Philippine Revolutionary General and former senator."
        ],
        [
            "Mamerto Natividad - born in Bacolor, Philippine Revolutionary General."
        ],
        [
            "Servillano Aquino - Philippine Revolutionary General and member of Malolos Congress for Samar"
        ],
        [
            "Nicolasa Dayrit Panlilio - Filipina non-combatant in the Philippine–American War known for  helping to minister the sick and wounded Filipino combatants."
        ],
        [
            "Práxedes Fajardo – Filipina revolutionary and head of the Pampangan section of the Philippine Red Cross during the anticolonial armed struggles against Spain and the United States."
        ],
        [
            "José Abad Santos – born in San Fernando, Pampanga, the 5th chief justice of the Supreme Court of the Philippines."
        ],
        [
            "Pedro Abad Santos – a former assemblyman and founder of the Aguman ding Talapagobra ning Pilipinas."
        ],
        [
            "Luis Taruc – leader of the Hukbalahap group (from Hukbong Bayan Laban sa Hapon) between 1942 and 1950.: 73"
        ],
        [
            "Casto Alejandrino – peasant leader and commander of the Hukbalahap."
        ],
        [
            "Vivencio Cuyugan – former  mayor of San Fernando, and one of the founders of the guerrilla group Hukbalahap"
        ],
        [
            "Politics and Government"
        ],
        [
            "Diosdado Pangan Macapagal – 9th president of the Republic of the Philippines and a native of Lubao, Pampanga."
        ],
        [
            "Gloria Macapagal Arroyo – 14th president of the Republic of the Philippines.",
            "She is the daughter of the 9th president of the Republic Diosdado Macapagal."
        ],
        [
            "Rogelio dela Rosa – former Philippine senator and actor, native of Lubao, Pampanga."
        ],
        [
            "Pablo Ángeles y David – former Philippine senator and former Governor of Pampanga"
        ],
        [
            "Sotero Baluyut – former Philippine senator and former Governor of Pampanga"
        ],
        [
            "Antonio Villa-Real – 25th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Vicente Abad Santos – 96th Associate Justice of the Supreme Court of the Philippines, 39th Secretary of the Department of Justice"
        ],
        [
            "Amando Tetangco Jr. – born in Apalit, Pampanga is a Filipino banker, who served as the third Governor of the Bangko Sentral ng Pilipinas (BSP).",
            "He was the first BSP governor to serve two terms."
        ],
        [
            "Jose B. Lingad – former Governor of Pampanga and  15th Secretary of the Department of the Labor and Employment, native of Lubao, Pampanga."
        ],
        [
            "Francisco Tongio Liongson - medical doctor and politician."
        ],
        [
            "Pedro Tongio Liongson – lawyer, judge, and politician; born on January 31, 1865, in Villa de Bacolor, Pampanga."
        ],
        [
            "Eddie Panlilio – born in Minalin, Pampanga, was the first Filipino priest to be elected governor in Philippine history."
        ],
        [
            "Satur Ocampo - politician, activist, journalist, and writer.",
            "Former  Member of the Philippine House of Representatives for Bayan Muna Partylist"
        ],
        [
            "Oscar Albayalde – A police officer, former chief of the Philippine National Police and former director of the National Capital Police Office, born in San Fernando."
        ],
        [
            "Mercedes Arrastia-Tuason – Philippine diplomat and former ambassador to the Holy See"
        ],
        [
            "Oscar Samson Rodriguez - politician and lawyer.",
            "He served as the mayor of San Fernando, Pampanga in the Philippines from 2004 until his third term in 2013."
        ],
        [
            "Rey Aquino - politician and surgeon who is the last municipal Mayor of San Fernando and its first Mayor when it became a city."
        ],
        [
            "Edwin Santiago - politician and professional mechanical engineer who served as the mayor of City of San Fernando, Pampanga from 2013 until 2022."
        ],
        [
            "Yeng Guiao - basketball head coach, politician, commentator and sports commissioner.",
            "He was also the Vice Governor of the Province of Pampanga from 2004 to 2013 and congressman, representing the 1st District of Pampanga from 2013 to 2016."
        ],
        [
            "Culinary Arts"
        ],
        [
            "Lucia Cunanan – restaurateur best known for having invented or at least re-invented sisig, a popular Kapampangan dish in the Philippines and Filipino diasporas worldwide."
        ],
        [
            "Larry Cruz – restaurateur who founded the LJC Restaurant Group, which operates several restaurants in the Philippines."
        ],
        [
            "Journalism and Media"
        ],
        [
            "Amando G. Dayrit – pre-war columnist and journalist"
        ],
        [
            "Orly Punzalan – a veteran radio-TV broadcaster and former president of Intercontinental Broadcasting Corporation (IBC-13), born and raised in Apalit."
        ],
        [
            "Kristine Johnson – Filipino-American co-anchor at WCBS-TV, born in Clark Air Base."
        ],
        [
            "Ivan Mayrina – broadcaster, journalist, reporter and news anchor."
        ],
        [
            "Jay Sonza - blogger and a former newscaster and talk show host."
        ],
        [
            "Kara David - journalist, host, professor, and educational administrator."
        ],
        [
            "Randy David – sociologist, public intellectual, and  board of directors of the Philippine media conglomerate ABS-CBN Corporation."
        ],
        [
            "Literature and arts"
        ],
        [
            "Aurelio Tolentino – original member of the Katipunan and nationalist playwright, born in Guagua."
        ],
        [
            "Julian Manansala – film studio founder and director.",
            "Called the \"Father of Philippine Nationalist Films\"."
        ],
        [
            "Vicente Manansala – National Artist of the Philippines for Visual Arts – Painting, native of Macabebe."
        ],
        [
            "Angela Manalang-Gloria - pioneer Filipina poet who wrote in English, born in Guagua."
        ],
        [
            "Zoilo Galang - credited as one of the pioneering Filipino writers who worked with the English language.",
            "He is the author of the first Philippine novel written in the English language, A Child of Sorrow, published in 1921."
        ],
        [
            "Zoilo Hilario - poet, playwright, lawyer, politician and linguist."
        ],
        [
            "Galo Ocampo – modernist painter"
        ],
        [
            "Francisco Alonso Liongson – playwright.",
            "Born on July 1, 1896, in Villa de Bacolor, Pampanga."
        ],
        [
            "Norma Belleza – painter"
        ],
        [
            "Danton Remoto – writer"
        ],
        [
            "Fernando Ocampo - architect and civil engineer"
        ],
        [
            "Sciences"
        ],
        [
            "Alfredo C. Santos – National Scientist of the Philippines for Physical Chemistry, from Santo Tomas, Pampanga"
        ],
        [
            "Religious leaders"
        ],
        [
            "Francisco Baluyot – born in Guagua, Pampanga broke barriers by becoming the 1st known indio priest, who, upon ordination in 1698, was assigned to the archdiocese of Cebu."
        ],
        [
            "Rufino Jiao Santos – born in Guagua, Pampanga, Archbishop of Manila from 1953 to 1973.",
            "The first Filipino Cardinal."
        ],
        [
            "Pedro Paulo Santos – born in Porac, Pampanga, First Parish Priest of Calulut, assigned as Parish Priest of Angeles City, appointed as bishop of Nueva Caceres in 1938 then as its first archbishop on 1951."
        ],
        [
            "Eliseo Soriano – televangelist of Ang Dating Daan and the Over-all Servant of Members Church of God International which its main headquarters is located in Apalit, Pampanga."
        ],
        [
            "Florentino Lavarias – born in Mabalacat, Pampanga, Archbishop of Roman Catholic Archdiocese of San Fernando and  formerly the fourth Bishop of the Diocese of Iba, Zambales"
        ],
        [
            "Honesto Ongtioco – born in San Fernando, Pampanga, second bishop of Balanga from April 8, 1998 to August 28, 2003, and Cubao since August 28, 2003."
        ],
        [
            "Paciano Aniceto – born in Santa Ana, Pampanga, Archbishop Emeritus Roman Catholic Archdiocese of San Fernando and former second Bishop of the Diocese of Iba, Zambales"
        ],
        [
            "Roberto Mallari – born in Macabebe, Pampanga, Bishop of Roman Catholic Diocese of San Jose in Nueva Ecija"
        ],
        [
            "Pablo Virgilio David – born in Betis, Guagua, Pampanga, Bishop of Roman Catholic Diocese of Kalookan"
        ],
        [
            "Victor Ocampo – born in Angeles, Pampanga, Bishop of Roman Catholic Diocese of Gumaca"
        ],
        [
            "Crisostomo Yalung – born in Angeles, Pampanga, Bishop Emeritus of Roman Catholic Diocese of Antipolo, Retired in 2002"
        ],
        [
            "Apollo C. Quiboloy – born in Davao City to Kapampangan parents from Lubao, Pampanga.",
            "Founder of a Christian religious group called Kingdom of Jesus Christ in 1985.",
            "Proclaiming himself as the \"Appointed Son of God\", he spent his early childhood in his parents' home province before returning to Davao."
        ],
        [
            "Entertainment"
        ],
        [
            "Aljon Mendoza – actor"
        ],
        [
            "Jaime dela Rosa – a matinee idol in the 1950s of Lubao, Pampanga."
        ],
        [
            "Brillante Mendoza – Filipino film director from San Fernando, Pampanga."
        ],
        [
            "Carlo J. Caparas – Filipino film director"
        ],
        [
            "Jason Paul Laxamana – Filipino film director and writer"
        ],
        [
            "Petersen Vargas – Filipino film director and writer"
        ],
        [
            "Lea Salonga – singer and actress, spent the first six years of her childhood in Angeles before moving to Manila."
        ],
        [
            "Pepe Smith – singer and member of Juan de la Cruz Band"
        ],
        [
            "Sheena Halili – model and actress from San Fernando."
        ],
        [
            "Vanessa Minnillo – American television personality born in Clark Air Base, Angeles, and raised in the US."
        ],
        [
            "Allan Pineda Lindo, also known as apl.de.ap – founding member of The Black Eyed Peas, born in Sapang Bato, Angeles."
        ],
        [
            "Donita Rose – Filipino-American actress, lived in Angeles City for a few years."
        ],
        [
            "Kelsey Merritt – Filipino-American model best known for being the first woman of Filipino descent to walk in the Victoria's Secret Fashion Show and to appear in the pages of the Sports Illustrated Swimsuit Issue."
        ],
        [
            "Ritz Azul - dramatic actress."
        ],
        [
            "Baron Geisler - actor."
        ],
        [
            "Hermes Bautista - actor."
        ],
        [
            "Joey Marquez - ex politician, comedy actor."
        ],
        [
            "Pageantry"
        ],
        [
            "Melanie Marquez – crowned Miss International 1979."
        ],
        [
            "Abbygale Arenas - crowned Binibining Pilipinas - Universe 1997."
        ],
        [
            "Carla Balingit - crowned Binibining Pilipinas - Universe 2003."
        ],
        [
            "Laura Marie Dunlap - crowned Miss Philippines Earth 2003."
        ],
        [
            "Angela Fernando - crowned Miss Eco Tourism Philippines 2010"
        ],
        [
            "Ann Colis – crowned Miss Globe 2015."
        ],
        [
            "Nichole Marie Manalo - crowned Binibining Pilipinas - Globe 2016."
        ],
        [
            "Emma Tiglao – crowned Binibining Pilipinas - Intercontinental 2019."
        ],
        [
            "Michelle Dee – crowned Miss World Philippines 2019."
        ],
        [
            "Cyrille Payumo – crowned Miss Tourism International 2019."
        ],
        [
            "Francesca Taruc - crowned Miss Tourism World Intercontinental 2019"
        ],
        [
            "Sports"
        ],
        [
            "Efren \"Bata\" Reyes – billiards player from Angeles."
        ],
        [
            "Ato Agustin – Filipino professional basketball player and coach, from Lubao, Pampanga."
        ],
        [
            "Jayson Castro – Filipino professional basketball player from Guagua, Pampanga."
        ],
        [
            "Japeth Aguilar – Filipino professional basketball player from Sasmuan, Pampanga."
        ],
        [
            "Arwind Santos – Filipino professional basketball player from Lubao, Pampanga."
        ],
        [
            "Calvin Abueva – Filipino professional basketball player from Angeles."
        ],
        [
            "Justine Baltazar – Filipino professional basketball player from Mabalacat, Pampanga."
        ],
        [
            "Ian Sangalang - Filipino professional basketball player from Lubao, Pampanga"
        ],
        [
            "Michael Miranda - Filipino professional basketball player from Santa, Ana, Pampanga."
        ],
        [
            "Russel Escoto - Filipino professional basketball player from Angeles."
        ],
        [
            "Norman Gonzales - Filipino professional basketball player from Magalang."
        ],
        [
            "JC Intal - Filipino professional basketball player from Minalin, Pampanga."
        ],
        [
            "Mark Macapagal - Filipino professional basketball player from Macabebe, Pampanga."
        ],
        [
            "Victonara Galang – Filipino volleyball athlete from Angeles."
        ],
        [
            "Diana Mae Carlos – Filipino volleyball athlete from Lubao, Pampanga."
        ],
        [
            "Jimmy Manansala  –  Filipino professional basketball player from Macabebe, Pampanga."
        ],
        [
            "Mary Remy Joy Palma – Filipino volleyball athlete from Apalit, Pampanga"
        ],
        [
            "Michael Sudaria – Filipino volleyball athlete."
        ],
        [
            "Donald Geisler - taekwondo athlete"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 17, 2013.",
            "Retrieved September 16, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ a b c Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ \"PSA- Active Stats - PSGC Interactive - Region: REGION III (Central Luzon)\".",
            "Archived from the original on November 14, 2012.",
            "Retrieved September 7, 2016."
        ],
        [
            "^ a b \"Tantingco: The Kapampangan in Us\".",
            "Archived from the original on January 23, 2024.",
            "Retrieved January 23, 2024."
        ],
        [
            "^ \"The Philippine Islands, 1493–1803, Volume III, (1569–1576) Page 137\".",
            "Archived from the original on November 3, 2023.",
            "Retrieved October 23, 2023."
        ],
        [
            "^ Müller, Kal (January 1, 1997).",
            "East of Bali: From Lombok to Timor.",
            "Tuttle Publishing.",
            "ISBN 9789625931784.",
            "Archived from the original on May 6, 2016.",
            "Retrieved September 7, 2016 – via Google Books."
        ],
        [
            "^ \"Opera Istana Citerep - KOMPAS.com\".",
            "Archived from the original on October 6, 2011.",
            "Retrieved July 6, 2011."
        ],
        [
            "^ a b \"ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)\" (PDF).",
            "Archived (PDF) from the original on March 9, 2016.",
            "Retrieved February 23, 2024."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ \"Agreement between the United States of America and the Republic of the Philippines Concerning Military Bases\" (PDF).",
            "United States Library of Congress.",
            "March 14, 1947.",
            "Archived (PDF) from the original on February 12, 2017.",
            "Retrieved December 16, 2017."
        ],
        [
            "^ \"Philippines : The Early Republic\".",
            "britannica.com.",
            "Archived from the original on December 16, 2017.",
            "Retrieved December 16, 2017."
        ],
        [
            "^ a b c \"PHILIPPINE SENATE VOTES TO REJECT U.S. BASE RENEWAL\".",
            "The New York Times.",
            "September 16, 1991.",
            "Archived from the original on March 19, 2018.",
            "Retrieved January 29, 2018."
        ],
        [
            "^ Rodriguez, Dylan (2010).",
            "Suspended Apocalypse: White Supremacy, Genocide, and the Filipino Condition.",
            "U of Minnesota Press.",
            "p. 892.",
            "ISBN 978-0-8166-5349-2.",
            "Archived from the original on April 19, 2020.",
            "Retrieved December 17, 2017."
        ],
        [
            "^ Drogin, Bob (November 27, 1991).",
            "\"After 89 Years, U.S. Lowers Flag at Clark Air Base\".",
            "Los Angeles Times.",
            "Archived from the original on December 25, 2011.",
            "Retrieved March 12, 2011."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on March 29, 2024.",
            "Retrieved March 29, 2024.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ a b Magno, Alexander R., ed.",
            "(1998).",
            "\"A Web of Corruption\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ \"First Quarter Storm Timeline\" (PDF).",
            "UPDate.",
            "University of the Philippines.",
            "October 2021.",
            "Archived (PDF) from the original on March 29, 2024.",
            "Retrieved March 29, 2024."
        ],
        [
            "^ Bonner, R. (1987) Waltzing With A Dictator.",
            "ISBN 9780333457641"
        ],
        [
            "^ a b c \"Report of an Amnesty International Mission to the Republic of the Philippines: 22 November–5 December 1975\" (PDF).",
            "Amnesty International.",
            "London, England: Amnesty International Publications.",
            "1976.",
            "Archived from the original (PDF) on October 7, 2021."
        ],
        [
            "^ \"Imprisoned Priest Begins Hunger Strike in Philippines\".",
            "New York Times.",
            "December 27, 1974.",
            "Archived from the original on December 19, 2023.",
            "Retrieved March 29, 2024."
        ],
        [
            "^ Dela Peña, Kurt (September 20, 2022).",
            "\"Remembering martial law: Hope, then despair\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on December 19, 2023.",
            "Retrieved December 19, 2023."
        ],
        [
            "^ \"Lessons from 50 years ago\".",
            "Archived from the original on December 19, 2023.",
            "Retrieved December 19, 2023."
        ],
        [
            "^ Castañeda, Dabet (December 7–13, 2003).",
            "\"Marie Hilao-Enriquez: An Icon of Human Rights Activism in the Philippines\".",
            "Archived from the original on December 19, 2023.",
            "Retrieved December 19, 2023."
        ],
        [
            "^ Empeño, Henry (October 3, 2021).",
            "\"'Wind of change'\".",
            "Business Mirror.",
            "Archived from the original on December 19, 2023.",
            "Retrieved December 19, 2023."
        ],
        [
            "^ \"Joanna Cariño, an Ibaloi activist\".",
            "Northern Dispatch."
        ],
        [
            "^ Cariño, Joanna K. (April 22–27, 1980).",
            "\"The Chico River Basin Development Project: A Case Study of National Development Policy\".",
            "Paper Presented at the Third Annual Conference of the Anthropological Association of the Philippines.",
            "Manila.",
            "Archived from the original on April 14, 2018."
        ],
        [
            "^ \"Archived copy\".",
            "Archived from the original on March 29, 2024.",
            "Retrieved March 29, 2024.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ Malay, Carolina S.; Rodriguez, Ma Cristina V. (2016).",
            "Ang mamatay nang dahil sa 'yo: Heroes and martyrs of the Filipino people in the struggle against dictatorship, 1972-1986. volume 2.",
            "Ermita, Manila, Philippines: National Historical Commission of the Philippines.",
            "ISBN 978-971-538-304-2."
        ],
        [
            "^ \"Republic Act 7227: Bases Conversion and Development Act of 1992\".",
            "Congress of the Philippines.",
            "March 13, 1992.",
            "Retrieved May 24, 2018."
        ],
        [
            "^ a b \"Proclamation No.",
            "1035, s. 2006\".",
            "Official Gazette of the Republic of the Philippines.",
            "March 10, 2006.",
            "Archived from the original on April 19, 2023.",
            "Retrieved May 24, 2018."
        ],
        [
            "^ \"Republic Act 9400\".",
            "Congress of the Philippines.",
            "March 20, 2007.",
            "Archived from the original on April 15, 2023.",
            "Retrieved May 24, 2018."
        ],
        [
            "^ \"Why was Pampanga worse hit by quake than Zambales epicenter?\".",
            "ABS-CBN News.",
            "Archived from the original on April 23, 2019.",
            "Retrieved April 23, 2019."
        ],
        [
            "^ \"LOOK: Quake damages church, other structures in Pampanga\".",
            "ABS-CBN News.",
            "April 22, 2019.",
            "Archived from the original on April 22, 2019.",
            "Retrieved April 24, 2019."
        ],
        [
            "^ a b c d e \"Province: Pampanga\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ \"Weather forecast for Pampanga, Philippines\".",
            "Storm247.com.",
            "Bergen, NO: StormGeo AS.",
            "Archived from the original on October 28, 2018.",
            "Retrieved April 21, 2016."
        ],
        [
            "^ a b Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"clarkisitv2\".",
            "Archived from the original on March 11, 2016.",
            "Retrieved September 7, 2016."
        ],
        [
            "^ Castro, Jasper (July 12, 2019).",
            "\"The Gatekeeper To Kapampangan Cuisine Shares Her Secrets\".",
            "Yummy,ph.",
            "Retrieved July 10, 2024."
        ],
        [
            "^ a b \"These Buttery Cookies Are The Most Delicious Medicine on Earth\".",
            "The Daily Meal.",
            "Archived from the original on June 6, 2017.",
            "Retrieved June 26, 2017."
        ],
        [
            "^ Amata, Dennis John (March 10, 2010).",
            "\"Candaba's Migratory Birds\".",
            "People’s Journal Tonight."
        ],
        [
            "^ a b c \"Province of Pampanga, A Profile of Region III\" (PDF).",
            "Pia.gov.ph.",
            "September 2001.",
            "Archived from the original (PDF) on August 21, 2006.",
            "Retrieved September 10, 2016."
        ],
        [
            "^ \"Provincial Government of Pampanga\".",
            "Pampanga.gov.ph.",
            "Archived from the original on September 24, 2015.",
            "Retrieved September 10, 2016."
        ],
        [
            "^ \"CELTECH COLLEGE\".",
            "Archived from the original on August 26, 2016.",
            "Retrieved September 7, 2016."
        ],
        [
            "^ Times, Tiebreaker (March 31, 2023).",
            "\"Justine Baltazar tows Pampanga G to top of PSL\".",
            "Tiebreaker Times.",
            "Archived from the original on August 15, 2023.",
            "Retrieved November 19, 2023."
        ],
        [
            "^ \"Pampanga sweeps Bacoor to win MPBL title on the road\".",
            "Philippine Star.",
            "December 2, 2023.",
            "Archived from the original on December 2, 2023.",
            "Retrieved December 2, 2023."
        ],
        [
            "^ \"Archived copy\" (PDF).",
            "Archived from the original (PDF) on March 26, 2009.",
            "Retrieved April 4, 2015.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ Firm, Joselito Guianan Chan, Managing Partner, Chan Robles and Associates Law.",
            "\"PHILIPPINE LAWS, STATUTES AND CODES - CHAN ROBLES VIRTUAL LAW LIBRARY\".",
            "Archived from the original on September 9, 2016.",
            "Retrieved September 7, 2016.",
            "{{cite web}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ Firm, Joselito Guianan Chan, Managing Partner, Chan Robles and Associates Law.",
            "\"THE JUDICIARY REORGANIZATION ACT OF 1980 (B. P. BLG.",
            "129) - CHAN ROBLES VIRTUAL LAW LIBRARY\".",
            "Archived from the original on October 12, 2016.",
            "Retrieved September 7, 2016.",
            "{{cite web}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ Taruc, L., 1967, He Who Rides the Tiger, London: Geoffrey Chapman Ltd."
        ],
        [
            "^ \"'Sisig Queen' murdered\".",
            "GMA News.",
            "Sun.Star Pampanga.",
            "April 17, 2008.",
            "Archived from the original on March 31, 2018.",
            "Retrieved March 31, 2018."
        ],
        [
            "^ Tonette Orejas (April 16, 2008).",
            "\"Woman who created native dish slain in Pampanga home\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on August 31, 2013.",
            "Retrieved April 16, 2008."
        ],
        [
            "^ \"RP's sisig queen found dead in Pampanga home\".",
            "GMANews.TV.",
            "April 16, 2008.",
            "Archived from the original on August 23, 2011.",
            "Retrieved April 16, 2008."
        ],
        [
            "^ \"'Sisig Queen' murdered\".",
            "Sun Star Pampanga.",
            "April 17, 2008.",
            "Archived from the original on April 21, 2008.",
            "Retrieved April 18, 2008."
        ],
        [
            "^ \"The Manila Times Internet Edition | OPINION > A harmful distraction\".",
            "The Manila Times.",
            "March 12, 2008.",
            "Archived from the original on March 12, 2008.",
            "Retrieved October 31, 2021."
        ],
        [
            "^ Larry Cruz (May 13, 2007).",
            "\"My Mother Fely J\".",
            "Manila Times.",
            "Archived from the original on October 5, 2008.",
            "Retrieved April 16, 2008."
        ],
        [
            "^ \"Hoy!",
            "Pinoy Ako!\".",
            "Carouselpinoy.com.",
            "Archived from the original on June 29, 2009.",
            "Retrieved September 10, 2016."
        ],
        [
            "^ \"WCBSTV.com - Kristine Johnson\".",
            "Archived from the original on June 15, 2008.",
            "Retrieved July 14, 2009."
        ],
        [
            "^ \"Galang, Zoilo\".",
            "Panitikan Philippine Literature Portal (in Filipino).",
            "UP Institute of Creative Writing.",
            "June 6, 2014.",
            "Archived from the original on April 20, 2019.",
            "Retrieved April 20, 2019."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Pampanga travel guide from Wikivoyage"
        ],
        [
            " Media related to Pampanga at Wikimedia Commons"
        ],
        [
            " Geographic data related to Pampanga at OpenStreetMap"
        ],
        [
            "Local Governance Performance Management System"
        ],
        [
            "Places adjacent to Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Zambales"
        ],
        [
            "Pampanga"
        ],
        [
            "Bulacan"
        ],
        [
            "Bataan"
        ],
        [
            "Manila Bay"
        ],
        [
            "vte Province of PampangaSan Fernando (capital)  Angeles City (largest city)Municipalities"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Candaba"
        ],
        [
            "Floridablanca"
        ],
        [
            "Guagua"
        ],
        [
            "Lubao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Masantol"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Porac"
        ],
        [
            "San Luis"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Component cities"
        ],
        [
            "Mabalacat"
        ],
        [
            "San Fernando"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Angeles (Administratively independent from the province but grouped under Pampanga by the Philippine Statistics Authority.)"
        ],
        [
            "Articles related to Pampanga"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "FAST"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Spain"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Pampanga&oldid=1233683380\""
        ],
        [
            "Categories: PampangaProvinces of the PhilippinesProvinces of Central LuzonStates and territories established in 15711571 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: archived copy as titleCS1 maint: multiple names: authors listCS1 foreign language sources (ISO 639-2)Articles with short descriptionShort description is different from WikidataArticles needing additional references from September 2016All articles needing additional referencesUse Philippine English from February 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from February 2023Pages using infobox settlement with possible nickname listCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Tagalog-language textPages with Tagalog IPAArticles needing additional references from April 2019All articles with unsourced statementsArticles with unsourced statements from March 2024Articles with unsourced statements from January 2013Articles to be expanded from June 2021All articles to be expandedArticles using small message boxesWikipedia articles with style issues from September 2018All articles with style issuesArticles to be split from May 2023All articles to be splitLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with FAST identifiersArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with BNE identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}