{
    "name": "Quezon",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Quezon"
        ],
        [
            "41 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 13°56′N 121°37′E﻿ / ﻿13.93°N 121.62°E﻿ / 13.93; 121.62"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Calabarzon, Philippines"
        ],
        [
            "This article is about the province.",
            "For the person whom it is named after, see Manuel L. Quezon.",
            "For other uses, see Quezon (disambiguation)."
        ],
        [
            "Province in Calabarzon, PhilippinesQuezonProvince(from top: left to right) Mt.",
            "Banahaw de Lucban, Tayabas Capitol, Quezon boundary arch in Tiaong, Alibijaban Island, Cagbalete Island and Malagonlong Bridge"
        ],
        [
            "FlagSealNicknames: Land of Thousand Colors (Kalupaan ng Libong Kulay)"
        ],
        [
            "Cocolandia (Kaniyugan / Lupain ng Niyog)  Pilipinas, Quezon Naman!",
            "Healing QuezonAnthem: Lalawigan ng Quezon (Quezon Hymn)"
        ],
        [
            "Location in the PhilippinesOpenStreetMapCoordinates: 13°56′N 121°37′E﻿ / ﻿13.93°N 121.62°E﻿ / 13.93; 121.62CountryPhilippinesRegionCalabarzonFounded1591 (as Kalilayan)Secession from Laguna1754 (as Tayabas)Re-establishedMarch 12, 1901 (as Tayabas)Named forManuel L. QuezonCapitaland largest cityLucenaGovernment • GovernorAngelina D.L.",
            "Tan (NPC) • Vice GovernorAnacleto A. Alcala III (NPC) • LegislatureQuezon Provincial BoardArea • Total1,950,459 • Rank13th out of 81 • Density220/km2 (560/sq mi)  • Rank45th out of 81 (excludes Lucena)Demonym(s)Quezonian (English) Taga-Quezon, Quezonin (Tagalog)Divisions • Independent cities"
        ],
        [
            "1"
        ],
        [
            " Lucena"
        ],
        [
            " • Component cities"
        ],
        [
            "1"
        ],
        [
            " Tayabas"
        ],
        [
            " • Municipalities"
        ],
        [
            "39"
        ],
        [
            " Agdangan"
        ],
        [
            " Alabat"
        ],
        [
            " Atimonan"
        ],
        [
            " Buenavista"
        ],
        [
            " Burdeos"
        ],
        [
            " Calauag"
        ],
        [
            " Candelaria"
        ],
        [
            " Catanauan"
        ],
        [
            " Dolores"
        ],
        [
            " General Luna"
        ],
        [
            " General Nakar"
        ],
        [
            " Guinayangan"
        ],
        [
            " Gumaca"
        ],
        [
            " Infanta"
        ],
        [
            " Jomalig"
        ],
        [
            " Lopez"
        ],
        [
            " Lucban"
        ],
        [
            " Macalelon"
        ],
        [
            " Mauban"
        ],
        [
            " Mulanay"
        ],
        [
            " Padre Burgos"
        ],
        [
            " Pagbilao"
        ],
        [
            " Panukulan"
        ],
        [
            " Patnanungan"
        ],
        [
            " Perez"
        ],
        [
            " Pitogo"
        ],
        [
            " Plaridel"
        ],
        [
            " Polillo"
        ],
        [
            " Quezon"
        ],
        [
            " Real"
        ],
        [
            " Sampaloc"
        ],
        [
            " San Andres"
        ],
        [
            " San Antonio"
        ],
        [
            " San Francisco"
        ],
        [
            " San Narciso"
        ],
        [
            " Sariaya"
        ],
        [
            " Tagkawayan"
        ],
        [
            " Tiaong"
        ],
        [
            " Unisan"
        ],
        [
            " • Barangays1,209including independent cities: 1,242 • DistrictsLegislative districts of Quezon (shared with Lucena)Demographics • Ethnic groupsTagalog (90%)Bisaya/Cebuano (4.8%)Bicolano (3.6%)Ilokano (0.2%)Others (1.4%)Time zoneUTC+8 (PHT)ZIP code4300–4342IDD : area code +63 (0)42ISO 3166 codePH-QUESpoken languagesTagalog (Tayabas dialect)EnglishWebsitewww.quezon.gov.ph"
        ],
        [
            "Quezon, Lucena, the provincial capital, the seat of the provincial government, and the most populous city of the province, is governed independently from the province as a highly urbanized city.",
            "To distinguish the province from Quezon City, it is sometimes called Quezon Province, a variation of the province's official name."
        ],
        [
            "Quezon is southeast of Metro Manila and is bordered by the provinces of Aurora to the north, Bulacan, Rizal, Laguna and Batangas to the west and the provinces of Camarines Norte and Camarines Sur to the east.",
            "Part of Quezon lies on an isthmus connecting the Bicol Peninsula to the main part of Luzon.",
            "The province also includes the Polillo Islands in the Philippine Sea.",
            "Some marine parts of the Verde Island Passage, the center of the center of world's marine biodiversity, are also in the province."
        ],
        [
            "A major tourism draw to the province is Mount Banahaw.",
            "The mountain is surrounded by spiritual mysticism with many Anitist adherents, Christian cults, and Christian organizations staying on the mountain.",
            "The mountain was also one of the most sacred sites for pre-colonial Tagalog people before the arrival of the Spanish.",
            "Numerous pilgrims visit the mountain especially during Holy Week."
        ],
        [
            "History"
        ],
        [
            "Early history"
        ],
        [
            "Archaeological excavations in the province attest to its rich precolonial past.",
            "Archaeological materials including burial jars, human bones, shell midden and pot shreds have been discovered at different sites in Bondoc Peninsula including the towns of San Narciso, San Andres, Mulanay and Catanauan.",
            "The most recent excavations were conducted in Catanauan by the Catanauan Archeological and Heritage Project."
        ],
        [
            "According to the preliminary report released by the Catanauan Archaeological and Heritage Project, several excavations were conducted in the 1930s.",
            "One of the excavations was conducted in San Narciso where archaeologists found burial jars.",
            "The site, inspected by Ricardo Galang, resulted in the discovery of burial jars near the coast.",
            "Galang also went to San Andres where excavations yielded 14th and 15th century ceramics as well as shell bracelets and beads.",
            "According to the journal as well, at a site named Tala, archaeologists discovered a glazed Chinese jar containing bone fragments from the early Ming dynasty.",
            "Looking at other archaeological sites located in adjacent areas like Marinduque and Masbate, it can be inferred that these excavations date back to the metal period of the archipelago."
        ],
        [
            "In 2012, at Mt.",
            "Kamhantik in the town of Mulanay, 15 limestone coffins were discovered.",
            "Carbon dating on a human tooth found it to be at least 1,000 years old.",
            "According to the archaeologists, the village is proof that the ancient inhabitants of the area practiced a more sophisticated way of life.",
            "Metal tools are believed to have been used to carve the coffins, and this is the first of its kind discovered in the archipelago.",
            "The remains are said to date back to the 10th to 14th century."
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Territorial evolution of Quezon."
        ],
        [
            "Originally, what now forms Quezon was divided among the provinces of Batangas, Laguna, and Nueva Ecija.",
            "However, at different points in time, the boundaries of Quezon changed and included parts of Aurora, Marinduque, and Camarines Norte.",
            "At the early period of Spanish colonization, the province of Aurora was called El Principe, Infanta was called Binangonan de Lampon, and southern Quezon was called Kalilayan.",
            "The first European to explore the area was Juan de Salcedo in 1571–1572, during his expedition from Laguna to Camarines provinces."
        ],
        [
            "In 1574, Father Diego de Oropesa founded the town of Bumaka, now known as the municipality of Gumaca."
        ],
        [
            "In 1591, through Governor General Gómez Pérez Dasmariñas, the province was created and was called Kaliraya or Kalilayan, after the capital town which later became Unisan."
        ],
        [
            "In 1595, the Diocese of Cáceres was established by Pope Clement VIII as a suffragan of Manila.",
            "The diocese covered the entire Bicolandia region plus the towns in Kalilayan, and the Contracosta towns.",
            "At that time, the towns on the eastern seaboard were pertained to as the Contracosta and included towns from Mauban, Binangonan de Lampon, to El Principe."
        ],
        [
            "The destruction of Kalilayan in 1604 by a big fleet of Moro pirates caused the inhabitants to transfer to Palsabangon (Pagbilao).",
            "Depredation and plunder by the Moros from Jolo and Brunei were rampant during the 1600s.",
            "Slavery is one reason for the proliferation of these raids.",
            "A padron for Calilaya was ordered after Tayabas suffered severely from Moro raids.",
            "It is said that 187 people were either captured or killed while 400 people fled.",
            "Fear from these raids are the primary reason as to the permanent movement of settlements along the coast further inland as well as a general decline in population.",
            "Frequent invasions by the moros disrupted the food production in the province, affecting the nutrition of its inhabitants.",
            "Maternal malnutrition was even cited as one of the primary causes of infant mortality at that time.",
            "By 1701, the previously densely settled coastal areas of the province, was described as consisting of rancherias whose inhabitants depended on wild products."
        ],
        [
            "In 1705, the Military Comandancia of Nueva Ecija was created and was governed by Governor General Fausto Cruzat y Góngora.",
            "It included huge swathes of Central Luzon, the Contracosta towns as well as the Kalilayan area and Polillo Islands."
        ],
        [
            "In 1749, the capital was transferred to the town of Tayabas, from which the province got its new name."
        ],
        [
            "In a report by a Spanish priest named Fr.",
            "Bartolome Galan in 1823, he describes the economy of the province.",
            "According to his report, Tayabas had poor soil and the terrain is hilly which meant that conditions were not that suitable for agriculture compared to other places.",
            "The people grew upland rice, wheat, beans and vegetables.",
            "Surplus rice was sold in San Pablo and Majayjay on Mondays, the market day of those towns.",
            "Cattle breeding was rampant in towns like Tayabas, Pagbilao, Tiaong, and Sariaya.",
            "Also, unlike other provinces, haciendas were not so many in Tayabas.",
            "Instead, residents owned most of their own land."
        ],
        [
            "The people of Tayabas, as in other areas, are actively trading with Manila.",
            "Santa Cruz, Laguna, was the entrepot for all goods going to the capital.",
            "The people from Lucban made products of buri and pandan leaves like hats, sleeping mata and the like which they traded.",
            "They, along with the people of Mauban also went to Polillo, at that time part of Nueva Ecija, to buy sea slugs, shells and beeswax.",
            "Being a rich agricultural area, the town of Tayabas traded rice, coconuts, and panocha with nearby towns of Majayjay, Lucban, Sariaya, Pagbilao, Mauban, Gumaca, and Atimonan.",
            "In turn, they traded fish from Pagbilao, rice from Sariaya, and high quality abaca products from Mauban and Atimonan.",
            "Lucban, as well as Tayabas, benefitted greatly from the high commercial activity of Chinese and Chinese mestizos in the pueblos."
        ],
        [
            "Gumaca, being a town with little arable land depended heavily on the sea.",
            "They collected sea slugs, and tortoise shell from Alabat and traded with the mountain people there for beeswax in exchange for clothing.",
            "They even sometimes ventured to Burias Island in Ragay Gulf in search for these goods.",
            "These products were then sent to Tayabas for shipment to Manila.",
            "Gumaca also traded items from nearby pueblos like vinegar and clothing for gold and abaca from Naga in the Bicol region."
        ],
        [
            "In 1818, Nueva Ecija annexed the towns of Palanan from Isabela, as well as Baler, Casiguran, Infanta (formerly called Binangonan de Lampon) and Polillo Islands from Tayabas, and Cagayan, Nueva Vizcaya, Quirino, and part of Rizal."
        ],
        [
            "In 1853, the new military district of Tayabas was carved from Nueva Ecija and included present-day Southern Quezon as well as present-day Aurora.",
            "In 1858, Binangonan de Lampon and the Polillo Islands were separated from Nueva Ecija to form part of Infanta."
        ],
        [
            "Between 1855 and 1885, El Principe was established as its own Military Comandancia with its capital in Baler."
        ],
        [
            "Tayabas Uprising"
        ],
        [
            "It was also around this time that the Confradia de San Jose was active in the province, caused by the growing inequality between the poor and the upper classes.",
            "This organization was directed mostly on the poor and neither admitted Spaniards nor mestizos."
        ],
        [
            "After years under the Spanish regime, the colonized people grew discontented with the Spaniards over the centuries.",
            "The most important event in the history of the province was the Confradia Revolt in 1841, which was led by the famous Lucbanin, Apolinario de la Cruz, popularly known as Hermano Pule."
        ],
        [
            "Tayabas Regiment Revolt"
        ],
        [
            "Years after the Cofradia Revolt, on January 20, 1843, the Tayabas Regiment, led by Sergeant Irineo Samaniego, rose in revolt against Spain, conquering Fort Santiago and other areas of Intramuros.",
            "This is the only native force in Philippine history to successfully capture Fort Santiago and Manila.",
            "For the first time, the word \"Independence\" was shouted by the Tayabas Regiment, encouraging their countrymen to revolt against Spain.",
            "The next day, however, the gates of Fort Santiago were opened by loyalist soldiers.",
            "After a bloody battle, the mutineers were defeated by loyalist troops, resulting in the execution of Samaniego and 81 of his followers the same day."
        ],
        [
            "The province, under General Miguel Malvar, was also among the earliest to join the Philippine Revolution.",
            "The Revolutionary Government took control over the province on August 15, 1898."
        ],
        [
            "American invasion era"
        ],
        [
            "Tayabas province in 1918Northern portionSouthern portion"
        ],
        [
            "The Americans then came and annexed the Philippines.",
            "A civil government was established in the province on March 12, 1901, and Lucena was made the provincial capital."
        ],
        [
            "During the pacification of the archipelago by the Americans, insurrections were a commonplace in what was then Tayabas.",
            "Insurgents from neighboring provinces of Laguna and Batangas often use Tayabas as their base of operations as well as their source of supplies.",
            "An insurgent government, with connections to Gen. Malvar and Pedro Caballes was even said to be based in Infanta.",
            "This has led the American in charge, Brigadier-General J.F.",
            "Bell to decide to return to Tayabas with a larger contingent.",
            "Bell acknowledged the importance of the ports of Tayabas as sources of supplies to the insurrection such that he believed that closing all the ports in the province might convince the leaders of the resistance to surrender."
        ],
        [
            "In 1902, the district of El Principe was transferred from the jurisdiction of Nueva Ecija to Tayabas.",
            "The present areas of north Aurora which is part of the modern Dilasag and area of modern Casiguran were transferred from the authority of Nueva Vizcaya to Tayabas in 1905.",
            "In 1918, the area of modern Aurora north of Baler was transferred to the authority of Nueva Vizcaya, but returned to Tayabas in 1946."
        ],
        [
            "Because of the distance between Tayabas and Bicol and the growing population, Tayabas came under the jurisdiction of the Diocese of Lipa in 1910."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "Japanese occupation of the province during World War II began on December 23, 1941, when the Japanese Imperial Army landed in Atimonan.",
            "The General Headquarters of the Philippine Commonwealth Army and Philippine Constabulary was stationed in Tayabas from January 3, 1942, to June 30, 1946, are military operates against the Japanese Occupation."
        ],
        [
            "Philippine independence"
        ],
        [
            "Name change from Tayabas to Quezon"
        ],
        [
            "After the war, on September 7, 1946, Republic Act No.",
            "14 changed the name Tayabas to Quezon, in honor of Manuel L. Quezon, the Commonwealth president who hailed from Baler, which was one of the province's towns; he was elected governor of Tayabas in 1906 and congressman of 1st district of Tayabas in 1907."
        ],
        [
            "Rise of the coconut industry"
        ],
        [
            "Even before the Philippines gained its independence, the province has already depended heavily on coconuts.",
            "This history can clearly be seen through the opulent houses built in the town of Sariaya during this period.",
            "Coconuts served as the main source of income for the landed class of Sariaya and this allowed them to build the ancestral houses that we see today."
        ],
        [
            "Establishment of the Province of Aurora"
        ],
        [
            "In June 1951, the northern part of Quezon (specifically, the towns of Baler, Casiguran, Dilasag, Dingalan, Dinalongan, Dipaculao, Maria Aurora and San Luis) was made into the sub-province of Aurora."
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main article: Dictatorship of Ferdinand Marcos"
        ],
        [
            "Quezon Province was not spared the social and economic turmoil during the Dictatorship of Ferdinand Marcos, including his 1971 suspension of the writ of habeas corpus, his 1972 declaration of martial law, and his continued hold on power from the lifting of martial law in 1981 until his ouster under the People Power Revolution of 1986.",
            "One major event that took place during this period was the Guinayangan massacre of February 1, 1981, in which Military elements opened fire on a group of about coconut farmers who were marching towards the Guinayangan plaza air to protest the coco levy fund scam.",
            "Two people were killed and 27 were wounded."
        ],
        [
            "Among the Quezon citizens who were victims of forced disappearances during the Marcos dictatorship were human rights worker Albert Enriquez of Lucena, who documented military abuses as a volunteer for Task Force Detainees of the Philippines; and activist Ramon Jasul who founded the Bagong Kabataan ng Lukban (New Youth of Lucban) in his hometown.",
            "Enriquez was abducted by armed men on Aug. 29, 1985,"
        ],
        [
            "Contemporary"
        ],
        [
            "Quezon–Camarines Norte boundary dispute"
        ],
        [
            "In 1989, the province of Quezon, represented by Governor Hjalmar Quintana, was involved in a boundary dispute with the province of Camarines Norte, represented by Roy Padilla, over 9 barangays of over 8,000 hectares (20,000 acres) at their border.",
            "These barangays are Kagtalaba, Plaridel, Kabuluan, Don Tomas, Guitol, Tabugon, Maualawin, Patag Ibaba and Patag Iraya.",
            "The boundary dispute originated from Act 2711 or the Revised Administrative Code which was enacted in 1917.",
            "Section 42 of Act 2711 defines the Tayabas-Camarines Norte boundary as:"
        ],
        [
            "Camarines Norte and Tayabas boundary.",
            "– The boundary separating the Province of Camarines Norte from the Province of Tayabas begins at a point on the eastern shore of Basiad Bay and extends to a peak known as Mount Cadig in such manner as to bring the territory of the barrio of Basiad entirely within the municipality of Capalonga, in Camarines Norte, and to exclude the same from the territory of Calauag, in Tayabas.",
            "From Mount Cadig it extends along the crest of a mountain range, a distance of 50 kilometers, more or less, to a peak known as Mount Labo; thence in a southwesterly direction, a distance of 25 kilometers, more or less, to a prominent stone monument at the source or headwaters of the Pasay River, thence along the meandering course of said river in a southerly direction, a distance of 1½ kilometers, more or less, to the Gulf of Ragay."
        ],
        [
            "In 1922, the then Chief of the Executive Bureau, acted upon the authority of the Secretary of the Interior.",
            "This ruling by the then chief was never implemented even with repeated efforts of the provincial government of Camarines Norte and the Secretary of Interior.",
            "The Chief delineated the border as follows:"
        ],
        [
            "Starting from the peak of Mt.",
            "Labo as a common corner between the provinces of Tayabas, Camarines Sur and Camarines Norte thence a straight line is drawn to the peak of Mt.",
            "Cadig; thence a straight line is drawn to the point of intersection of the inter-provincial road between Camarines Norte and Tayabas with the Tabugon River; thence, following the course of the river to its mouth at Basiad Bay."
        ],
        [
            "In the legal dispute, Quezon raised two points of contention.",
            "First is that Act 2711 already delineated the boundaries of the province.",
            "Second is that the Chief of the Executive Bureau had no power nor authority to change the boundaries of the province.",
            "Regarding the first issue, the court stated that it is true that Act 2711 delineated the boundary but it did not delineate the entirety of the boundary.",
            "The point on the eastern shore of Basiad Bay was never specifically located, thus, needing further delineation.",
            "On the second issue, the court stated that the Chief did not alter the borders in any way.",
            "The Chief worked with the requirement that the point be on the eastern shore of Basiad Bay.",
            "He was also acting on the consideration of Act 2809, the Act establishing Camarines Norte, which states that Camarines Norte be established with the borders it had before merging with Camarines Sur.",
            "The court then ruled in favor of Camarines Norte and ordered the provincial government of Quezon to transfer all its authority and jurisdiction to the former."
        ],
        [
            "By 2001, the Provincial Government of Quezon, this time represented by Governor Eduardo Rodriguez, the Provincial Government of Camarines Norte, as represented by Governor Roy Padilla, went back to court.",
            "Even with the judgment on the 1989 case was executory by 1990, the provincial government of Quezon did not abide by the court's ruling.",
            "In 1991, a Department of Environment and Natural Resources (DENR) technical team conducted a survey of the area and erected a monument marker to delineate the boundary of the area.",
            "However, by October 1991, Quezon Governor Eduardo Rodriguez and Calauag Mayor Julio Lim caused the removal of the marker.",
            "Throughout the proceedings, several government agencies including the Department of Budget and Management, Comelec, as well as the Philippine Statistics Authority recognized the jurisdiction of the town of Santa Elena, Camarines Norte over the 9 barangays.",
            "In 2000, Judge Regino held Governor Rodriguez and Mayor Lim guilty of contempt, with a maximum imprisonment of 6 months as well as a fine of ₱1,000 for the erection of a new boundary marker."
        ],
        [
            "Failed proposal to divide Quezon"
        ],
        [
            "Main article: 2008 Quezon del Sur creation plebiscite"
        ],
        [
            "In 2007, Republic Act No.",
            "9495 proposed to further divide Quezon into Quezon del Norte and Quezon del Sur.",
            "Quezon del Norte was to be composed of the first and second congressional districts of the province (Burdeos, General Nakar, Infanta, Jomalig, Lucban, Mauban, Pagbilao, Panukulan, Patnanungan, Polilio, Real, Sampaloc, Tayabas, Candelaria, Dolores, San Antonio, Sariaya, Tiaong and Lucena), with Lucena as its capital.",
            "Quezon del Sur, with its capital at Gumaca, would have been composed of the third and fourth congressional districts (Agdangan, Buenavista, Catanauan, General Luna, Macalelon, Mulanay, Padre Burgos, Pitogo, San Andres, San Francisco, San Narciso, Unisan, Alabat, Atimonan, Calauag, Guinayangan, Gumaca, Lopez, Perez, Plaridel, Quezon and Tagkawayan).",
            "The act lapsed into law without the signature of President Gloria Macapagal Arroyo on September 7, 2007."
        ],
        [
            "As required by law, the COMELEC held a plebiscite on December 13, 2008, 60 days after law took effect.",
            "The majority of the votes cast overwhelmingly rejected the division, therefore the split did not push through."
        ],
        [
            "Tayabas cityhood"
        ],
        [
            "The municipality of Tayabas became a component city by virtue of Republic Act No.",
            "9398 which sought to convert the municipality into a city.",
            "The law was ratified on July 14, 2007.",
            "However, the cityhood status was lost twice in the years 2008 and 2010 after the LCP questioned the validity of the cityhood law.",
            "The cityhood status was reaffirmed after the court finalized its ruling on February 15, 2011 which declared the cityhood law constitutional."
        ],
        [
            "Geography"
        ],
        [
            "Mount Banahaw seen from the Atimonan-Pagbilao border"
        ],
        [
            "Physical characteristics"
        ],
        [
            "Quezon, east of Metro Manila, is the 8th largest province in the Philippines having an area of 8,989.39 square kilometers (3,470.82 sq mi).",
            "The northern part of the province is sandwiched between the Sierra Madre mountain range and the Philippine Sea.",
            "The southern part consists of the Tayabas Isthmus, which separates the Bicol Peninsula from the main part of Luzon Island, and the Bondoc Peninsula which lies between Tayabas Bay and Ragay Gulf.",
            "Because of this, majority of towns in the province have access to the sea.",
            "The province is bounded by the provinces of Aurora, Bulacan, Rizal, Laguna, Batangas, Camarines Sur and Camarines Norte.",
            "It is bounded to the east by the Pacific Ocean and to the south by Tayabas Bay.",
            "The province is said to be characterized by a rugged terrain with patches of plains, valleys and swamps."
        ],
        [
            "The major islands of Quezon are Alabat Island and Polillo Islands.",
            "Mount Banahaw, an active volcano, is the highest peak at 2,169 meters (7,116 ft)."
        ],
        [
            "The province has a total of 1,066.36 km (662.61 mi) of coastline However, due to rampant illegal logging as well as kaingin, these forests are constantly threatened."
        ],
        [
            "Climate"
        ],
        [
            "Because of the sheer size of Quezon, different areas have different climate patterns.",
            "Most of the province falls under Type IV Climate which means that rains are evenly distributed throughout the year.",
            "Polillo, Infanta, and parts of Calauag fall under Type II climate which means that there are no dry seasons but there is a pronounced wet season from November to April.",
            "Parts of the western towns of Tiaong, San Antonio, Dolores, and Candelaria as well as the tip of Bondoc Peninsula including parts of Mulanay, San Francisco, San Narciso and San Andres fall under Type III climate.",
            "This means that there is a relatively dry season from November to April.",
            "Although these are the patterns observed, it is important to note that with climate change, these patterns have become more erratic.",
            "Typhoons have become stronger through the years, causing problems such as power outages, road blockages, landslides, flashfloods and crop damages."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Quezon comprises 39 municipalities and one component city (Tayabas), which are organized into four legislative districts and further subdivided into 1,209 barangays."
        ],
        [
            "The capital, Lucena, is independent of the administrative and fiscal supervision of the province but is eligible to vote for provincial officials."
        ],
        [
            "Political Map of Quezon"
        ],
        [
            " †  Provincial capital and highly urbanized city ∗  Component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Category"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Agdangan"
        ],
        [
            "3rd"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.7%"
        ],
        [
            "12,764"
        ],
        [
            "12,851"
        ],
        [
            "−0.13%"
        ],
        [
            "31.54"
        ],
        [
            "12.18"
        ],
        [
            "400"
        ],
        [
            "1,000"
        ],
        [
            "12"
        ],
        [
            "13°52′30″N 121°54′48″E﻿ / ﻿13.8749°N 121.9134°E﻿ / 13.8749; 121.9134﻿ (Agdangan)"
        ],
        [
            "Alabat"
        ],
        [
            "4th"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.8%"
        ],
        [
            "15,936"
        ],
        [
            "15,630"
        ],
        [
            "0.37%"
        ],
        [
            "57.61"
        ],
        [
            "22.24"
        ],
        [
            "280"
        ],
        [
            "730"
        ],
        [
            "19"
        ],
        [
            "14°06′04″N 122°00′44″E﻿ / ﻿14.1012°N 122.0121°E﻿ / 14.1012; 122.0121﻿ (Alabat)"
        ],
        [
            "Atimonan"
        ],
        [
            "4th"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.3%"
        ],
        [
            "64,260"
        ],
        [
            "63,432"
        ],
        [
            "0.25%"
        ],
        [
            "239.66"
        ],
        [
            "92.53"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "42"
        ],
        [
            "14°00′02″N 121°55′17″E﻿ / ﻿14.0006°N 121.9215°E﻿ / 14.0006; 121.9215﻿ (Atimonan)"
        ],
        [
            "Buenavista"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.6%"
        ],
        [
            "31,160"
        ],
        [
            "30,047"
        ],
        [
            "0.69%"
        ],
        [
            "161.35"
        ],
        [
            "62.30"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "37"
        ],
        [
            "13°44′15″N 122°28′02″E﻿ / ﻿13.7376°N 122.4673°E﻿ / 13.7376; 122.4673﻿ (Buenavista)"
        ],
        [
            "Burdeos"
        ],
        [
            "1st"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.3%"
        ],
        [
            "24,644"
        ],
        [
            "26,760"
        ],
        [
            "−1.56%"
        ],
        [
            "199.82"
        ],
        [
            "77.15"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "14"
        ],
        [
            "14°50′24″N 121°58′12″E﻿ / ﻿14.8399°N 121.9700°E﻿ / 14.8399; 121.9700﻿ (Burdeos)"
        ],
        [
            "Calauag"
        ],
        [
            "4th"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.7%"
        ],
        [
            "71,809"
        ],
        [
            "73,139"
        ],
        [
            "−0.35%"
        ],
        [
            "324.71"
        ],
        [
            "125.37"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "81"
        ],
        [
            "13°57′30″N 122°17′14″E﻿ / ﻿13.9582°N 122.2873°E﻿ / 13.9582; 122.2873﻿ (Calauag)"
        ],
        [
            "Candelaria"
        ],
        [
            "2nd"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "7.1%"
        ],
        [
            "137,881"
        ],
        [
            "117,434"
        ],
        [
            "3.10%"
        ],
        [
            "129.10"
        ],
        [
            "49.85"
        ],
        [
            "1,100"
        ],
        [
            "2,800"
        ],
        [
            "25"
        ],
        [
            "13°56′00″N 121°25′21″E﻿ / ﻿13.9334°N 121.4224°E﻿ / 13.9334; 121.4224﻿ (Candelaria)"
        ],
        [
            "Catanauan"
        ],
        [
            "3rd"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.7%"
        ],
        [
            "72,752"
        ],
        [
            "71,073"
        ],
        [
            "0.45%"
        ],
        [
            "253.07"
        ],
        [
            "97.71"
        ],
        [
            "290"
        ],
        [
            "750"
        ],
        [
            "46"
        ],
        [
            "13°35′34″N 122°19′20″E﻿ / ﻿13.5929°N 122.3223°E﻿ / 13.5929; 122.3223﻿ (Catanauan)"
        ],
        [
            "Dolores"
        ],
        [
            "2nd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.7%"
        ],
        [
            "32,514"
        ],
        [
            "28,891"
        ],
        [
            "0.83%"
        ],
        [
            "62.60"
        ],
        [
            "24.17"
        ],
        [
            "520"
        ],
        [
            "1,300"
        ],
        [
            "16"
        ],
        [
            "14°00′57″N 121°24′04″E﻿ / ﻿14.0157°N 121.4011°E﻿ / 14.0157; 121.4011﻿ (Dolores)"
        ],
        [
            "General Luna"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.3%"
        ],
        [
            "24,804"
        ],
        [
            "26,494"
        ],
        [
            "−1.25%"
        ],
        [
            "101.02"
        ],
        [
            "39.00"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "27"
        ],
        [
            "13°41′17″N 122°10′16″E﻿ / ﻿13.6881°N 122.1710°E﻿ / 13.6881; 122.1710﻿ (General Luna)"
        ],
        [
            "General Nakar"
        ],
        [
            "1st"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "1.8%"
        ],
        [
            "34,225"
        ],
        [
            "29,705"
        ],
        [
            "2.73%"
        ],
        [
            "1,343.75"
        ],
        [
            "518.82"
        ],
        [
            "25"
        ],
        [
            "65"
        ],
        [
            "19"
        ],
        [
            "14°45′48″N 121°38′07″E﻿ / ﻿14.7634°N 121.6353°E﻿ / 14.7634; 121.6353﻿ (General Nakar)"
        ],
        [
            "Guinayangan"
        ],
        [
            "4th"
        ],
        [
            "3rd Class Municipality"
        ],
        [
            "2.3%"
        ],
        [
            "44,045"
        ],
        [
            "45,155"
        ],
        [
            "−0.47%"
        ],
        [
            "214.12"
        ],
        [
            "82.67"
        ],
        [
            "210"
        ],
        [
            "540"
        ],
        [
            "54"
        ],
        [
            "13°53′51″N 122°27′14″E﻿ / ﻿13.8974°N 122.4539°E﻿ / 13.8974; 122.4539﻿ (Guinayangan)"
        ],
        [
            "Gumaca"
        ],
        [
            "4th"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.7%"
        ],
        [
            "71,942"
        ],
        [
            "73,877"
        ],
        [
            "−0.50%"
        ],
        [
            "189.65"
        ],
        [
            "73.22"
        ],
        [
            "380"
        ],
        [
            "980"
        ],
        [
            "59"
        ],
        [
            "13°55′17″N 122°06′05″E﻿ / ﻿13.9215°N 122.1015°E﻿ / 13.9215; 122.1015﻿ (Gumaca)"
        ],
        [
            "Infanta"
        ],
        [
            "1st"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.9%"
        ],
        [
            "76,186"
        ],
        [
            "69,079"
        ],
        [
            "1.88%"
        ],
        [
            "342.76"
        ],
        [
            "132.34"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "36"
        ],
        [
            "14°44′45″N 121°38′50″E﻿ / ﻿14.7458°N 121.6472°E﻿ / 14.7458; 121.6472﻿ (Infanta)"
        ],
        [
            "Jomalig"
        ],
        [
            "1st"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.4%"
        ],
        [
            "7,667"
        ],
        [
            "7,417"
        ],
        [
            "0.63%"
        ],
        [
            "53.93"
        ],
        [
            "20.82"
        ],
        [
            "140"
        ],
        [
            "360"
        ],
        [
            "5"
        ],
        [
            "14°41′49″N 122°19′47″E﻿ / ﻿14.6970°N 122.3297°E﻿ / 14.6970; 122.3297﻿ (Jomalig)"
        ],
        [
            "Lopez"
        ],
        [
            "4th"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "4.9%"
        ],
        [
            "94,657"
        ],
        [
            "95,167"
        ],
        [
            "−0.10%"
        ],
        [
            "355.38"
        ],
        [
            "137.21"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "95"
        ],
        [
            "13°52′57″N 122°15′40″E﻿ / ﻿13.8825°N 122.2611°E﻿ / 13.8825; 122.2611﻿ (Lopez)"
        ],
        [
            "Lucban"
        ],
        [
            "1st"
        ],
        [
            "2nd Class Municipality"
        ],
        [
            "2.7%"
        ],
        [
            "53,091"
        ],
        [
            "51,475"
        ],
        [
            "0.59%"
        ],
        [
            "130.46"
        ],
        [
            "50.37"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "32"
        ],
        [
            "14°06′52″N 121°33′17″E﻿ / ﻿14.1144°N 121.5548°E﻿ / 14.1144; 121.5548﻿ (Lucban)"
        ],
        [
            "Lucena"
        ],
        [
            "†"
        ],
        [
            "Lone"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "—"
        ],
        [
            "278,924"
        ],
        [
            "266,248"
        ],
        [
            "0.89%"
        ],
        [
            "80.21"
        ],
        [
            "30.97"
        ],
        [
            "3,500"
        ],
        [
            "9,100"
        ],
        [
            "33"
        ],
        [
            "13°56′06″N 121°36′45″E﻿ / ﻿13.9350°N 121.6124°E﻿ / 13.9350; 121.6124﻿ (Lucena)"
        ],
        [
            "Macalelon"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.4%"
        ],
        [
            "27,312"
        ],
        [
            "28,188"
        ],
        [
            "−0.60%"
        ],
        [
            "124.05"
        ],
        [
            "47.90"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "30"
        ],
        [
            "13°44′46″N 122°08′13″E﻿ / ﻿13.7462°N 122.1369°E﻿ / 13.7462; 122.1369﻿ (Macalelon)"
        ],
        [
            "Mauban"
        ],
        [
            "1st"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "3.6%"
        ],
        [
            "71,081"
        ],
        [
            "63,819"
        ],
        [
            "2.07%"
        ],
        [
            "415.98"
        ],
        [
            "160.61"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "40"
        ],
        [
            "14°11′20″N 121°43′52″E﻿ / ﻿14.1889°N 121.7310°E﻿ / 14.1889; 121.7310﻿ (Mauban)"
        ],
        [
            "Mulanay"
        ],
        [
            "3rd"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "2.8%"
        ],
        [
            "55,576"
        ],
        [
            "53,123"
        ],
        [
            "0.86%"
        ],
        [
            "420.00"
        ],
        [
            "162.16"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "28"
        ],
        [
            "13°31′23″N 122°24′15″E﻿ / ﻿13.5231°N 122.4043°E﻿ / 13.5231; 122.4043﻿ (Mulanay)"
        ],
        [
            "Padre Burgos"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.2%"
        ],
        [
            "23,488"
        ],
        [
            "22,460"
        ],
        [
            "0.86%"
        ],
        [
            "69.10"
        ],
        [
            "26.68"
        ],
        [
            "340"
        ],
        [
            "880"
        ],
        [
            "22"
        ],
        [
            "13°55′00″N 121°48′58″E﻿ / ﻿13.9166°N 121.8162°E﻿ / 13.9166; 121.8162﻿ (Padre Burgos)"
        ],
        [
            "Pagbilao"
        ],
        [
            "1st"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "4.0%"
        ],
        [
            "78,700"
        ],
        [
            "75,023"
        ],
        [
            "0.92%"
        ],
        [
            "170.96"
        ],
        [
            "66.01"
        ],
        [
            "460"
        ],
        [
            "1,200"
        ],
        [
            "27"
        ],
        [
            "13°58′28″N 121°41′07″E﻿ / ﻿13.9745°N 121.6854°E﻿ / 13.9745; 121.6854﻿ (Pagbilao)"
        ],
        [
            "Panukulan"
        ],
        [
            "1st"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "0.8%"
        ],
        [
            "16,376"
        ],
        [
            "13,546"
        ],
        [
            "3.68%"
        ],
        [
            "226.61"
        ],
        [
            "87.49"
        ],
        [
            "72"
        ],
        [
            "190"
        ],
        [
            "12"
        ],
        [
            "14°55′59″N 121°48′58″E﻿ / ﻿14.9331°N 121.8160°E﻿ / 14.9331; 121.8160﻿ (Panukulan)"
        ],
        [
            "Patnanungan"
        ],
        [
            "1st"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.8%"
        ],
        [
            "15,052"
        ],
        [
            "14,606"
        ],
        [
            "0.57%"
        ],
        [
            "139.20"
        ],
        [
            "53.75"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "6"
        ],
        [
            "14°45′19″N 122°13′01″E﻿ / ﻿14.7552°N 122.2169°E﻿ / 14.7552; 122.2169﻿ (Patnanungan)"
        ],
        [
            "Perez"
        ],
        [
            "4th"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.7%"
        ],
        [
            "12,767"
        ],
        [
            "12,173"
        ],
        [
            "0.91%"
        ],
        [
            "57.46"
        ],
        [
            "22.19"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "14"
        ],
        [
            "14°11′38″N 121°55′33″E﻿ / ﻿14.1938°N 121.9257°E﻿ / 14.1938; 121.9257﻿ (Perez)"
        ],
        [
            "Pitogo"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.2%"
        ],
        [
            "22,798"
        ],
        [
            "23,019"
        ],
        [
            "−0.18%"
        ],
        [
            "73.39"
        ],
        [
            "28.34"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "39"
        ],
        [
            "13°46′59″N 122°05′19″E﻿ / ﻿13.7830°N 122.0886°E﻿ / 13.7830; 122.0886﻿ (Pitogo)"
        ],
        [
            "Plaridel"
        ],
        [
            "4th"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.5%"
        ],
        [
            "10,129"
        ],
        [
            "10,935"
        ],
        [
            "−1.45%"
        ],
        [
            "18.19"
        ],
        [
            "7.02"
        ],
        [
            "560"
        ],
        [
            "1,500"
        ],
        [
            "9"
        ],
        [
            "13°57′24″N 122°01′01″E﻿ / ﻿13.9568°N 122.0170°E﻿ / 13.9568; 122.0170﻿ (Plaridel)"
        ],
        [
            "Polillo"
        ],
        [
            "1st"
        ],
        [
            "3rd Class Municipality"
        ],
        [
            "1.6%"
        ],
        [
            "31,908"
        ],
        [
            "30,582"
        ],
        [
            "0.81%"
        ],
        [
            "253.00"
        ],
        [
            "97.68"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "20"
        ],
        [
            "14°43′03″N 121°56′15″E﻿ / ﻿14.7176°N 121.9375°E﻿ / 14.7176; 121.9375﻿ (Polillo)"
        ],
        [
            "Quezon"
        ],
        [
            "4th"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.8%"
        ],
        [
            "15,886"
        ],
        [
            "15,228"
        ],
        [
            "0.81%"
        ],
        [
            "71.22"
        ],
        [
            "27.50"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "24"
        ],
        [
            "14°00′22″N 122°11′03″E﻿ / ﻿14.0060°N 122.1841°E﻿ / 14.0060; 122.1841﻿ (Quezon)"
        ],
        [
            "Real"
        ],
        [
            "1st"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "2.0%"
        ],
        [
            "38,678"
        ],
        [
            "35,979"
        ],
        [
            "1.39%"
        ],
        [
            "337.92"
        ],
        [
            "130.47"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "17"
        ],
        [
            "14°39′56″N 121°36′13″E﻿ / ﻿14.6655°N 121.6036°E﻿ / 14.6655; 121.6036﻿ (Real)"
        ],
        [
            "Sampaloc"
        ],
        [
            "1st"
        ],
        [
            "5th Class Municipality"
        ],
        [
            "0.7%"
        ],
        [
            "13,629"
        ],
        [
            "13,907"
        ],
        [
            "−0.38%"
        ],
        [
            "104.78"
        ],
        [
            "40.46"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "14"
        ],
        [
            "14°09′40″N 121°38′18″E﻿ / ﻿14.1610°N 121.6382°E﻿ / 14.1610; 121.6382﻿ (Sampaloc)"
        ],
        [
            "San Andres"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.9%"
        ],
        [
            "37,454"
        ],
        [
            "35,780"
        ],
        [
            "0.87%"
        ],
        [
            "172.93"
        ],
        [
            "66.77"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "7"
        ],
        [
            "13°19′25″N 122°40′39″E﻿ / ﻿13.3235°N 122.6774°E﻿ / 13.3235; 122.6774﻿ (San Andres)"
        ],
        [
            "San Antonio"
        ],
        [
            "2nd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.8%"
        ],
        [
            "35,891"
        ],
        [
            "33,467"
        ],
        [
            "1.34%"
        ],
        [
            "60.99"
        ],
        [
            "23.55"
        ],
        [
            "590"
        ],
        [
            "1,500"
        ],
        [
            "20"
        ],
        [
            "13°53′45″N 121°17′36″E﻿ / ﻿13.8957°N 121.2932°E﻿ / 13.8957; 121.2932﻿ (San Antonio)"
        ],
        [
            "San Francisco"
        ],
        [
            "3rd"
        ],
        [
            "2nd Class Municipality"
        ],
        [
            "3.2%"
        ],
        [
            "62,097"
        ],
        [
            "61,473"
        ],
        [
            "0.19%"
        ],
        [
            "303.96"
        ],
        [
            "117.36"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "16"
        ],
        [
            "13°20′49″N 122°31′12″E﻿ / ﻿13.3469°N 122.5200°E﻿ / 13.3469; 122.5200﻿ (San Francisco)"
        ],
        [
            "San Narciso"
        ],
        [
            "3rd"
        ],
        [
            "3rd Class Municipality"
        ],
        [
            "2.6%"
        ],
        [
            "51,058"
        ],
        [
            "48,461"
        ],
        [
            "1.00%"
        ],
        [
            "263.58"
        ],
        [
            "101.77"
        ],
        [
            "190"
        ],
        [
            "490"
        ],
        [
            "24"
        ],
        [
            "13°33′56″N 122°33′59″E﻿ / ﻿13.5656°N 122.5665°E﻿ / 13.5656; 122.5665﻿ (San Narciso)"
        ],
        [
            "Sariaya"
        ],
        [
            "2nd"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "8.3%"
        ],
        [
            "161,868"
        ],
        [
            "148,980"
        ],
        [
            "1.59%"
        ],
        [
            "212.16"
        ],
        [
            "81.92"
        ],
        [
            "760"
        ],
        [
            "2,000"
        ],
        [
            "43"
        ],
        [
            "13°57′46″N 121°31′27″E﻿ / ﻿13.9629°N 121.5243°E﻿ / 13.9629; 121.5243﻿ (Sariaya)"
        ],
        [
            "Tagkawayan"
        ],
        [
            "4th"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "2.8%"
        ],
        [
            "54,003"
        ],
        [
            "51,832"
        ],
        [
            "0.78%"
        ],
        [
            "534.35"
        ],
        [
            "206.31"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "45"
        ],
        [
            "13°57′57″N 122°32′21″E﻿ / ﻿13.9657°N 122.5393°E﻿ / 13.9657; 122.5393﻿ (Tagkawayan)"
        ],
        [
            "Tayabas"
        ],
        [
            "∗"
        ],
        [
            "1st"
        ],
        [
            "Component city"
        ],
        [
            "5.8%"
        ],
        [
            "112,658"
        ],
        [
            "99,779"
        ],
        [
            "2.34%"
        ],
        [
            "230.95"
        ],
        [
            "89.17"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "66"
        ],
        [
            "14°01′35″N 121°35′30″E﻿ / ﻿14.0263°N 121.5918°E﻿ / 14.0263; 121.5918﻿ (Tayabas)"
        ],
        [
            "Tiaong"
        ],
        [
            "2nd"
        ],
        [
            "1st Class Municipality"
        ],
        [
            "5.4%"
        ],
        [
            "106,265"
        ],
        [
            "99,712"
        ],
        [
            "1.22%"
        ],
        [
            "168.38"
        ],
        [
            "65.01"
        ],
        [
            "630"
        ],
        [
            "1,600"
        ],
        [
            "31"
        ],
        [
            "13°57′33″N 121°19′22″E﻿ / ﻿13.9593°N 121.3228°E﻿ / 13.9593; 121.3228﻿ (Tiaong)"
        ],
        [
            "Unisan"
        ],
        [
            "3rd"
        ],
        [
            "4th Class Municipality"
        ],
        [
            "1.3%"
        ],
        [
            "25,448"
        ],
        [
            "26,884"
        ],
        [
            "−1.04%"
        ],
        [
            "124.15"
        ],
        [
            "47.93"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "36"
        ],
        [
            "13°50′21″N 121°58′35″E﻿ / ﻿13.8393°N 121.9763°E﻿ / 13.8393; 121.9763﻿ (Unisan)"
        ],
        [
            "Total"
        ],
        [
            "1,950,459"
        ],
        [
            "1,856,582"
        ],
        [
            "0.94%"
        ],
        [
            "8,743.84"
        ],
        [
            "3,376.02"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "1,209"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the town center, and are sortable by latitude.^ Total figures exclude the highly urbanized city of Lucena."
        ],
        [
            "In the 1800s when Jean Mallat de Bassilan conducted a survey of the province, it only had 17 towns."
        ],
        [
            "Administrative divisions and population of Tayabas in 1800s"
        ],
        [
            "Town"
        ],
        [
            "Tributes"
        ],
        [
            "Inhabitants"
        ],
        [
            "Tayabas"
        ],
        [
            "4,283.5"
        ],
        [
            "21,418"
        ],
        [
            "Lucban"
        ],
        [
            "2,829.5"
        ],
        [
            "14,147"
        ],
        [
            "Saryaya"
        ],
        [
            "1,722.5"
        ],
        [
            "8,614"
        ],
        [
            "Tiaon"
        ],
        [
            "692"
        ],
        [
            "3,460"
        ],
        [
            "Dolores"
        ],
        [
            "450"
        ],
        [
            "2,250"
        ],
        [
            "Mauban"
        ],
        [
            "1,323"
        ],
        [
            "6,615"
        ],
        [
            "Atimonan"
        ],
        [
            "1,176"
        ],
        [
            "5,880"
        ],
        [
            "Gumaca"
        ],
        [
            "1,848"
        ],
        [
            "9,240"
        ],
        [
            "Pagbilao"
        ],
        [
            "496"
        ],
        [
            "2,480"
        ],
        [
            "Pitogo"
        ],
        [
            "276"
        ],
        [
            "1,380"
        ],
        [
            "Macalelon"
        ],
        [
            "155"
        ],
        [
            "775"
        ],
        [
            "Catanauan"
        ],
        [
            "450"
        ],
        [
            "2,250"
        ],
        [
            "Mulanay"
        ],
        [
            "305"
        ],
        [
            "1,525"
        ],
        [
            "Obuyon"
        ],
        [
            "265"
        ],
        [
            "1,325"
        ],
        [
            "Calauag"
        ],
        [
            "63"
        ],
        [
            "315"
        ],
        [
            "Apad"
        ],
        [
            "63"
        ],
        [
            "315"
        ],
        [
            "Guinyangan"
        ],
        [
            "212"
        ],
        [
            "1,060"
        ],
        [
            "Total"
        ],
        [
            "83,049"
        ],
        [
            "In 1902, during the American period, Tayabas was divided as follows:"
        ],
        [
            "Administrative divisions and population of Tayabas in 1902"
        ],
        [
            "Town"
        ],
        [
            "Population"
        ],
        [
            "Alabat"
        ],
        [
            "4,516"
        ],
        [
            "Atimonan"
        ],
        [
            "11,203"
        ],
        [
            "Baler"
        ],
        [
            "2,417"
        ],
        [
            "Bondoc"
        ],
        [
            "1,330"
        ],
        [
            "Calauag"
        ],
        [
            "3,185"
        ],
        [
            "Casiguran"
        ],
        [
            "2,067"
        ],
        [
            "Catanauan"
        ],
        [
            "4,108"
        ],
        [
            "Guinayangan"
        ],
        [
            "3,870"
        ],
        [
            "Gumaca"
        ],
        [
            "5,234"
        ],
        [
            "Infanta"
        ],
        [
            "10,283"
        ],
        [
            "Lopez"
        ],
        [
            "8,549"
        ],
        [
            "Lucban"
        ],
        [
            "10,227"
        ],
        [
            "Lucena"
        ],
        [
            "9,375"
        ],
        [
            "Macalelon"
        ],
        [
            "4,759"
        ],
        [
            "Mauban"
        ],
        [
            "12,021"
        ],
        [
            "Mulanay"
        ],
        [
            "2,149"
        ],
        [
            "Pagbilao"
        ],
        [
            "6,085"
        ],
        [
            "Pitogo"
        ],
        [
            "3,454"
        ],
        [
            "Polillo"
        ],
        [
            "2,164"
        ],
        [
            "Sampaloc"
        ],
        [
            "1,263"
        ],
        [
            "San Narciso"
        ],
        [
            "2,501"
        ],
        [
            "Sariaya"
        ],
        [
            "12,453"
        ],
        [
            "Tayabas"
        ],
        [
            "14,740"
        ],
        [
            "Tiaong"
        ],
        [
            "9,527"
        ],
        [
            "Unisan"
        ],
        [
            "2,692"
        ],
        [
            "Total"
        ],
        [
            "150,262"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of QuezonYearPop.±% p.a.1903 148,581—    1918 206,037+2.20%1939 340,273+2.42%1948 393,894+1.64%1960 610,599+3.72%YearPop.±% p.a.1970 825,859+3.06%1975 933,566+2.49%1980 1,021,397+1.81%1990 1,221,831+1.81%1995 1,359,992+2.03%YearPop.±% p.a.2000 1,482,955+1.87%2007 1,646,510+1.45%2010 1,740,638+2.04%2015 1,856,582+1.24%2020 1,950,459+0.97%(excluding Lucena)Source: Philippine Statistics Authority"
        ],
        [
            "When the Census of the Philippine Islands was conducted in 1902 during the American era, Tayabas, excluding the subprovince of Marinduque, had a total population of 153,065.",
            "2,803 were considered as wild, or part of the non-Christian tribes such as the Aetas while 150,262 people were considered as civilized."
        ],
        [
            "Based on 2010 census of the household population in Quezon, 90.0 percent reported Tagalog as their ethnicity.",
            "The other 10.0 percent were reported as belonging to these ethnic groups: Bisaya/Binisaya (4.2 percent), Bikol/Bicol (3.6 percent), Cebuano (0.6 percent), Ilocano (0.2 percent), and others."
        ],
        [
            "The population of Quezon in the 2020 census was 1,950,459 people, with a density of 220 inhabitants per square kilometre or 570 inhabitants per square mile.",
            "When Lucena City is included for geographical purposes, the province's population is 2,229,383 people, with a density of 234/km2 (606/sq mi)."
        ],
        [
            "The inhabitants are mostly Tagalogs.",
            "The population is concentrated in the flat south-central portion which includes Lucena City, Sariaya, and Candelaria.",
            "After World War II, Infanta and surrounding towns received migrants from Manila, Laguna, Rizal and Batangas.",
            "People from Marinduque and Romblon moved to the southern part of the Tayabas Isthmus and northern parts of the Bondoc Peninsula.",
            "Visayans from Panay, Negros, Cebu, Bohol, Siquijor, Eastern Visayas and Masbate moved to the southernmost towns of Bondoc Peninsula, particularly in San Francisco and San Andres.",
            "Ilocanos from Ilocos Region, Cagayan Valley, Central Luzon and Cordillera Administrative Region migrated to the northernmost towns of General Nakar, Infanta and Real, and even to Tagkawayan."
        ],
        [
            "Filipino Chinese also have a long history in Tayabas (modern Quezon, Aurora and Marinduque provinces).",
            "In 1939, the province ranked 5th among all provinces including Manila in terms of the concentration of Filipino Chinese.",
            "This ethnic group has a long history of being active in business and commerce as shown by the business chambers existent before.",
            "However, as the Chinese intermarried with locals, these groups have dwindled in number."
        ],
        [
            "Population of Filipino Chinese"
        ],
        [
            "Province"
        ],
        [
            "1903"
        ],
        [
            "1918"
        ],
        [
            "1939"
        ],
        [
            "Tayabas"
        ],
        [
            "479"
        ],
        [
            "1,274"
        ],
        [
            "4,069"
        ],
        [
            "The province used to be home to various Aeta tribes.",
            "Other terms used to call them include \"Umag\", \"Ata\", \"Atid\", and \"Itim\".",
            "The Aeta used to clear coconut plantations and other odd jobs in exchange for food or clothing.",
            "These people, though seem as uncivilized by some, have a very rich culture.",
            "Some forms of their art include body scarification.",
            "The Aeta cause wound on their skin in various parts of their body including back, arms, legs, hands, calves and abdomen.",
            "They then irritate them during healing using fire, lime and other materials to form scars.",
            "They also bore holes on their septum and then proceed to decorate it with a sliver of bamboo.",
            "The Aeta also have various musical instruments like the nose flute and the gurimbaw, a stringed instrument made of coconuts, fibers from lukmong vines and bamboo."
        ],
        [
            "Languages"
        ],
        [
            "There are six Indigenous languages in Quezon Province: the dominant Tagalog language, the Hatang Kayi language in the north, the Manide language in the east and a small portion in the north, the Umiray Dumaget language in the north and a small area in the center, the already-extinct Katabangan language, which used to be in the south, and the Inagta Alabat language on Alabat Island, which is classified as Critically Endangered, meaning the youngest speakers are grandparents and older and they speak the language partially and infrequently and hardly pass it on to their children and grandchildren anymore."
        ],
        [
            "The province primarily speaks a Tagalog dialect called Tayabas Tagalog or Tayabasin.",
            "The dialect is also known for distinctive expressions like hane, kawasa, ngani baya, mandin, and yano.",
            "Other major languages spoken in Quezon are Ilocano, Visayan languages, and Bikol languages spoken by descendants of migrants mentioned above."
        ],
        [
            "Religion"
        ],
        [
            "Majority of Quezon's inhabitants primarily practice Roman Catholicism, being major bloc and other Christian denominations like Iglesia Filipina Independiente shares a smaller size of the percentage.The increasing members of the Iglesia Ni Cristo  has 6 Ecclesiastical Districts in the province for being the fastest growth .",
            "Most non-Christians practice Islam, Indigenous Philippine folk religions, animism, or atheism."
        ],
        [
            "Government"
        ],
        [
            "GovernorAngelina TanVice GovernorAnacleto A. Alcala III"
        ],
        [
            "The Quezon Provincial Board or the Sangguniang Panlalawigan is the provincial legislature."
        ],
        [
            "Incumbent Provincial Government officials"
        ],
        [
            "Governor: Angelina Tan"
        ],
        [
            "Vice Governor: Anacleto A. Alcala III"
        ],
        [
            "Provincial Administrator: Manuel M. Butardo"
        ],
        [
            "Provincial Accountant: Mary Grace Gordula"
        ],
        [
            "Provincial Agriculturist: Ana Clarissa S. Mariano, DVSM"
        ],
        [
            "Provincial Assessor: Melojean M. Puache, J.D."
        ],
        [
            "Provincial Budget Officer: Diego M. Salas"
        ],
        [
            "Provincial Disaster Risk Reduction Officer: Dr. Melchor P. Avenilla Jr."
        ],
        [
            "Provincial Engineer: Marichelle D. Ferrer"
        ],
        [
            "Provincial Environment Officer: John Francis Luzano"
        ],
        [
            "Provincial Gender and Development Officer: Sonia S. Leyson"
        ],
        [
            "Provincial General Services Officer: Manuel M. Butardo"
        ],
        [
            "Provincial Human Resource Management Officer: Rowell A. Napeñas"
        ],
        [
            "Provincial Health Officer: Kristin Mae-Jean M. Villaseñor, RMT, MD, MPM"
        ],
        [
            "Provincial Internal Auditor: Alberto S. Bay, Jr."
        ],
        [
            "Provincial Legal Officer: Julienne Therese V. Salvacion, J.D."
        ],
        [
            "Provincial Librarian: Ria Marelle A. Timbal"
        ],
        [
            "Provincial Planning Coordinator: Engr.",
            "Russell C. Narte"
        ],
        [
            "Provincial Social Welfare Officer: Sonia S. Leyson"
        ],
        [
            "Provincial Tourism Officer: Nesler Louies C. Almagro"
        ],
        [
            "Provincial Treasurer: Rosario Marilou M. Uy"
        ],
        [
            "Provincial Veterinarian: Flomella Cacguicla"
        ],
        [
            "Provincial Information Officer: Jun Lubid"
        ],
        [
            "Provincial Information and Communications Technology Officer: Leney C. Laygo"
        ],
        [
            "Provincial Mining Regulatory Officer: Engr.",
            "Rommel P. Sarmiento"
        ],
        [
            "Provincial Public Employment Service Officer: Melojean M. Puache, J.D."
        ],
        [
            "Provincial Sports Development Officer: Aris A. Mercene"
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Quezon"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "2006  33.48"
        ],
        [
            "2009  29.83"
        ],
        [
            "2012  27.54"
        ],
        [
            "2015  24.39"
        ],
        [
            "2018  13.49"
        ],
        [
            "2021  16.30"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Farming and fishing are the main sources of livelihood in the province.",
            "Commercial, industrial, and banking activities are mostly concentrated in the south-central part of the province."
        ],
        [
            "Agro-industry"
        ],
        [
            "Coconut plantation at Villa Escudero, Tiaong"
        ],
        [
            "Quezon province is called “Cocolandia”, with the Philippine Statistics Authority (PSA) confirming the province is the top coconut producer in Calabarzon and in the whole country.",
            "This stems from the fact that agricultural activities drive its economy.",
            "People mainly engage in farming and fishing operations."
        ],
        [
            "Quezon has a total agricultural area of 4,167.6421 square meters (44,860.126 sq ft) representing 46.36% of the total provincial land area.",
            "The total area planted with coconuts covers 379,137.60 hectares (936,869.4 acres), making Quezon the province with the largest coconut production area in the Philippines.",
            "Also, Quezon is the top coconut producing province in terms of total coconut production in the country with 1,493,066.64 metric tons (1,469,485.93 long tons; 1,645,824.25 short tons) in the year 2020."
        ],
        [
            "Quezon is the country's leading producer of coconut products such as desiccated coconut, virgin coconut oil, coconut juice, coconut oil Because of the coconut industry, copra traders from provinces like Marinduque, Romblon, and Masbate regularly visit the province."
        ],
        [
            "However, the coconut industry is faced with several threats from cocolisap to the coconut lumber trade."
        ],
        [
            "Aside from coconuts, Quezon is also the most important agricultural province among the provinces in Calabarzon in terms of producing staple food items such as rice and corn.",
            "The province supplies 200,000 metric tons (200,000 long tons; 220,000 short tons) of rice and corn annually or around 42% of the total rice and corn requirement of the region.",
            "Other major crops are rice, corn, banana, and coffee."
        ],
        [
            "Predominant livestock in Quezon are cattle, carabao and swine due to the suitability of the land for grazing animals.",
            "Carabao is the most used draft animal in land preparation, as well as for hauling farm products and material inputs for farmers, although power tillers are available in the market.",
            "Horses are also utilized for hauling purposes.",
            "Cattle are primarily raised for meat production, while there is an emerging industry on dairy production.",
            "Swine and poultry production are also emerging industries, including egg production.",
            "Backyard raising of livestock and poultry is likewise dominant in many rural areas in the province, both for home consumption and as additional sources of household income."
        ],
        [
            "Fishing"
        ],
        [
            "Calauag fish port"
        ],
        [
            "Because of its long coastline and the presence of numerous marshes and bays, fishing is also a large part of the province's economy.",
            "Quezon accounts for 33% or around 132,239 metric tons (130,150 long tons; 145,769 short tons) of fish produced in the region.",
            "Several fish port complexes exist in the province, including ports in Atimonan, Lucena, Infanta, and Guinayangan.",
            "These ports serve as hubs for the trade of fish and other aquatic resources like round scad, anchovies, tuna, and groupers.",
            "The province has three fishing districts.",
            "The first is found in the northeast encompassing Lamon Bay.",
            "The southeast portion includes Ragay Gulf while the south central portion covers Tayabas Bay.",
            "Aside from fishing, aquaculture is also important in the coastal municipalities of the province.",
            "Bangus and prawns are among the most cultured species."
        ],
        [
            "Forestry"
        ],
        [
            "Forest at Mount Tabag, General Nakar"
        ],
        [
            "Due to its proximity to the southern fringes of the Sierra Mountain range.",
            "Northern Quezon has been a hotspot for illegal logging.",
            "Frequent raids in towns like Mauban often yield hardwood timber like Narra and Kamagong."
        ],
        [
            "Commerce and banking"
        ],
        [
            "SM City Lucena"
        ],
        [
            "The capital city of Lucena is considered to be the economic center of the province.",
            "There are currently three malls in the province.",
            "Two of them are located in Lucena, namely: SM City Lucena and Pacific Mall Lucena.",
            "Citymall, located in Tiaong, is the third mall in the province.",
            "Major banks like BDO, Metrobank, Land Bank, BPI, PNB, RCBC, UnionBank, among other Manila-based banks are present in the western part of the province.",
            "BDO however made a move to establish a regional head office at Lucena due to the growing demand and economic importance of the province itself.",
            "On the other hand, namely QCRB, Rural Bank of Atimonan and Card Bank rural banks serve most if not all municipalities of the province."
        ],
        [
            "Several rural banks were also established in Quezon namely Rural Bank of Dolores, United Rural Bank of Lopez, Rural Bank of Lucban, Rural Bank of General Luna, and Rural Bank of Sampaloc."
        ],
        [
            "Agri-tourism"
        ],
        [
            "Another aspect pursued and promoted by the Provincial Government of Quezon is the development of agri-tourism sites and agricultural enterprises within its borders.",
            "These serve as additional source of income for local farmers wanting to further increase their profits as well as provide livelihood to rural women, youth, and other interested agricultural workers.",
            "The rural ambience in the province, its hospitable people, and its proximity to the urbanized areas in the region and to Metro Manila provide a ripe opportunity to further develop the province's agri-tourism potentials.",
            "Already popping up all throughout the province are tourism attractions showcasing rural settings such as farm restaurants, organic farms, agricultural learning sites, pick-and-pay harvesting activities, among many others.",
            "Agri-tourism is seen to allow the local communities to share and invite people to come, see and experience the agricultural landscape and natural beauty of the province."
        ],
        [
            "Education"
        ],
        [
            "There are 1032 public schools in Quezon.",
            "818 schools are primary, while 214 are secondary schools.",
            "These are under monitoring and supervision of Schools Division Offices of Quezon, Lucena, and Tayabas City, respectively."
        ],
        [
            "The province is also the home for some educational institutions and universities.",
            "Southern Luzon State University, Polytechnic University of the Philippines Lopez, Dalubhasaan ng Lungsod ng Lucena, and Quezon National Agriculture School are the state university and institution in Quezon.",
            "Also in the province are the private institutions like Manuel S. Enverga University Foundation, AMA Computer College-Lucena, Maryhill College, Sacred Heart College, STI College Lucena, Tayabas Western Academy, St. Anne College, Calayan Education Foundation, ABE International College of Business and Economic, Holy Rosary Catholic School."
        ],
        [
            "Infrastructure"
        ],
        [
            "Transportation"
        ],
        [
            "Portion of Marikina–Infanta Highway (also known as Marcos Highway or Marilaque Highway) in Infanta."
        ],
        [
            "Roads"
        ],
        [
            "Portion of Famy-Real-Infanta Road (N601), in Real."
        ],
        [
            "Lucena Diversion Road, a part of Pan-Philippine Highway (N1/AH26), in Lucena"
        ],
        [
            "Quezon has a total of 931 kilometers (578 mi) of national roads, mostly paved with concrete.",
            "Pan-Philippine Highway (N1/AH26), which comprises most of Manila South Road, and Quirino Highway (N68), the Quezon leg of Andaya Highway form the highway backbone network, and the secondary and tertiary roads interconnect most cities and municipalities, except for Infanta, Real, and General Nakar, whose highways used to access those municipalities interconnect with the national highway network in Laguna and Rizal or Manila East Road and Marilaque Highway.",
            "The provincial government maintains provincial roads which supplements the national roads."
        ],
        [
            "In order to spur development in the province, several proposals have been made to expand the expressway network to Quezon.",
            "The South Luzon Expressway, which terminates at Santo Tomas, Batangas, will be extended to Barangay Mayao, Lucena with the construction of Toll Road 4 (SLEX TR-4)"
        ],
        [
            "Public transportation"
        ],
        [
            "Quezon Province's public transportation mainly include jeepneys and tricycles.",
            "Transportation between town is usually served by jeepney, UV Express and buses."
        ],
        [
            "Buses serves as the main mode of transportation to and from Metro Manila as well as nearby provinces.",
            "Bus companies like JAC Liner, JAM Liner, DLTBCo, N. Dela Rosa Liner, AB Liner, P&O liner, Supreme, AH, and Superlines have terminals in the province."
        ],
        [
            "Railroads"
        ],
        [
            "The South Line of Philippine National Railway's north–south railway passes through the different towns of Quezon from Tutuban to Bicol.",
            "This includes stops in Candelaria, Lucena, Pagbilao (Malicboy), Agdangan, Plaridel, Gumaca, Lopez (Hondagua), Guinayangan (Aloneros), and Tagkawayan."
        ],
        [
            "Seaports"
        ],
        [
            "The Dalahican Port and Cotta Port in Lucena provide direct access to the neighboring island provinces of Marinduque, and Romblon.",
            "The Port of Real provides access to the islands of Polillo while the Atimonan and Gumaca ports provide access to the island of Alabat.",
            "The port in San Andres provides access to Masbate and Burias islands."
        ],
        [
            "Airports"
        ],
        [
            "There are several airports that exist in Quezon.",
            "This includes the Lucena Airport, Pagbilao Grande Airport, Alabat Airport (Alabat Island) Jomalig Airport (Jomalig Island), and the Balesin (Tordesillas) Airport (Balesin Island).",
            "Only Balesin Airport is being used as of present for Manila-Balesin flights."
        ],
        [
            "Energy"
        ],
        [
            "Quezon is home to several power plants that supply energy to the Luzon grid.",
            "The Pagbilao Power Station is the first power plant in the province.",
            "Located at Isla Grande in Pagbilao, the 735 MW coal fueled power plant started operations as early as 1993.",
            "This power plant is currently being managed by Team Energy Corp. and is undergoing a 420 MW expansion.",
            "Renewable energy is also present in the province, with the operation of Labayat Upper Cascade Mini Hydroelectric Power Plant in Real, and Tibag Mini Hydroelectric Power Plant in Mauban which provides 2 and 5.6 Megawatts capacity.",
            "Together, these provide a strong 2259.8 MW contribution to the Luzon Grid as well as local jobs to the people as Quezon as well as addressing the energy needs of the province and the greater Luzon area."
        ],
        [
            "For Transmission, the province serves as a crucial backbone nerve of Philippines' National Grid which passes through the province, particularly Tayabas Isthmus which is a very crucial geographical feature that separates Bicol Region, Visayas, and Mindanao from Luzon with substations in Tayabas, Pagbilao, and Lopez.",
            "All of the substations, especially Tayabas, are crucial to integrating the Luzon to the Visayas and Mindanao Grid.",
            "Polillo Islands, meanwhile are the only part of the province not connected to the National Grid but are part of the Small Power Utilities Group of NAPOCOR."
        ],
        [
            "There are three power distributors in the province, namely Meralco, Quezon I Electric Cooperative (QUEZELCO-I), and Quezon II Electric Cooperative (QUEZELCO-II).",
            "Meralco provides electricity to the province's second district as well as the adjacent towns of Pagbilao, Lucban, Sampaloc, Mauban and Tayabas City.",
            "QUEZELCO-I distributes power to the towns of the province's 3rd and 4th districts, as well as Santa Elena, Camarines Norte, and Del Gallego, Camarines Sur.",
            "QUEZELCO-II distributes power to the towns of the province's first district, except for the towns served by Meralco."
        ],
        [
            "Water security"
        ],
        [
            "The Quezon Metropolitan Water District (QMWD), formerly known as the Lucena Pagbilao Tayabas Water District or LUPATA, serves the Metro Lucena area including Lucena City, Tayabas City, and Pagbilao.",
            "In 2020, Prime Water took over the administration and operation of QMWD."
        ],
        [
            "Due to the pressures of a growing population, Quezon is one of the provinces from which the government plans to source part of the demand for water of Metro Manila.",
            "In General Nakar, construction is ongoing as of 2016 on a tunnel to divert water from the Sumag River to Angat Dam."
        ],
        [
            "Culture"
        ],
        [
            "Festivals"
        ],
        [
            "Pahiyas 2012"
        ],
        [
            "Among the festivals of Quezon, the three most prominent and famous are the Pahiyas Festival of Lucban, the Niyugyugan Festival of Quezon Province and Katang Festival of Calauag."
        ],
        [
            "The Pahiyas Festival is the thanksgiving celebration of the people in Lucban for the Feast of St. Isidore Labrador, the patron saint of farmers.",
            "Held every May 15, during the Pahiyas Festival people of Lucban decorates their houses in the most creative manner.",
            "They uses their harvest vegetables and grains like rice, chayotes, radishes, tomato, sweet potato, squash and the colorful kiping.",
            "Kiping is an ornament made of grounded rice flour shaped into leaves and dyed in different colors.",
            "These materials are used to make the houses colorful during the event which Pahiyas is famous for."
        ],
        [
            "The Niyogyugan Festival is a relatively new festival that started in 2012 celebrating the province's main product, the coconut.",
            "The festival celebrates the diversity of every town in the province through an expo.",
            "During this expo, the different towns build their own booths showcasing the best qualities of their town and then presents the products that their respective towns produce.",
            "During this event, towns also join the Float Parade and Street Dancing Competition."
        ],
        [
            "According to journalist and multi-awarded international boxing judge Rey Danseco, Calauag, one of the rich coastal municipalities of the province, celebrates Katang Festival (Crab Festival).",
            "The annual colorful and exciting festivities take place several days until May 25, the town's founding anniversary.",
            "Tourists from neighboring towns, provinces, and other countries join the fun and witness Calaugeneans’ unique fiesta celebration and presentations of Indigenous products, delicacies, and different ways of cooking Katang.",
            "The Karera ng Katang (Crab Race) and Pabilisan at Paramihan ng Maitataling Katang (Crab Tying Race) are some of the highlights of the festivities."
        ],
        [
            "The Philippines’ Department of Tourism promotes the Katang Festival as \"A festival highlighting the Higanteng Alimango as their icon.",
            "The feast celebrates the abundance of mud crab in the province.“"
        ],
        [
            "Katang Festival has foremost aims of promoting Agro-Tourism and solidifying Calauag's distinction as source of best variety and most delicious crab and other marine products such as shrimp (hipon or swahe) and giant Asian tiger prawn  (sugpo) in the Philippines."
        ],
        [
            "Other festivals are Mayohan sa Tayabas (Tayabas City), Agawan Festival (Sariaya), Araña't Baluarte (Gumaca), Pasayahan sa Lucena (Lucena City), Candle Festival (Candelaria), Boling Boling Festival (Catanauan), Maubanog Festival (Mauban), Kaway Festival (Tagkawayan), Laguimanoc Festival (Padre Burgos), Tariktik Festival (Polillo), Centurion Festival (Mulanay, San Narciso, General Luna), Buhusan Festival (Lucban), Kubol ng Macalelon (Macalelon), Hambujan Festival (Dolores), Pamaypayan Festival (Lopez), Coconut Festival (Alabat), Kayakas Festival (Perez), Mais Festival (Tiaong), Gayang Festival (Guinayangan), Tagultol Fishing Festival (Atimonan), Palay Iskad Festival (Buenavista), Maisan Festival (San Andres) and Papag at Bilao Festival (Pagbilao)"
        ],
        [
            "Cuisine"
        ],
        [
            "As one of the consistent top producers of coconut, Quezon Province is also dubbed as the \"Coconut Capital of the Philippines\".",
            "Since Quezon has long coastline, food with seafood as main ingredient is common in the province.",
            "As the province borders Batangas, Laguna, and Bicol, some dishes like lomi, buko pie, and laing are relatively common in the area."
        ],
        [
            "Local specialty dishes include pansit habhab, pansit chami, Lucban longganisa, hardinera, sinantomas (local braised meat dish), bumbay (batsoy tagalog), dinayukan, alang-ang and other dishes made of native fern called pako.",
            "Quezon is also known for popular pastries and delicacies such as budin, Yema cake, puto bao, letse puto, minukmok, tikoy, kalamay, kalabasang pilipit, pinagong and pitsi pitsi."
        ],
        [
            "Architectural heritage"
        ],
        [
            "Villa Sariaya"
        ],
        [
            "Quezon is home to heritage houses from the early 20th century built in the American architecture of the time such as the Enriquez-Gala Mansion, Gala-Rodriguez House and Villa Sariaya.",
            "Not only do these houses tell stories of the opulence afforded by coconut landlords but also gives us a glimpse of the uncertainty during wartime."
        ],
        [
            "The country life of the Philippines is what the Villa Escudero in Tiaong offers to its guests.",
            "Featuring its waterfall restaurant, the plantation resort actually has deep historical roots tracing its origins back to the coconut growing industry of Quezon.",
            "Other Spanish-era structures also exist outside Sariaya such as the Casa de Comunidad de Tayabas, Malagonlong bridge."
        ],
        [
            "Diocese of San Diego De Alcala in Gumaca, Minor Basilica de San Miguel in Tayabas and St. Louis Bishop Parish in Lucban are other testament of Spanish History in the province."
        ],
        [
            "Aside from old churches, the Kamay ni Hesus Healing Grotto located in Lucban is a popular pilgrimage site."
        ],
        [
            "Other attractions that tourist may visit Perez Park, Quezon Natural Park (Zigzag Road, Atimonan)."
        ],
        [
            "Quezon also has large venue for concert and sporting events.",
            "Quezon Convention Center and Alcala Sports Complex."
        ],
        [
            "Tourism"
        ],
        [
            "\"Parini Na!\""
        ],
        [
            "A sample of \"Parini Na!\"",
            "by Clark Aranilla.",
            "The song refers to Quezon's life, culture, and traditions."
        ],
        [
            "Problems playing this file?",
            "See media help."
        ],
        [
            "Quezon Province has a huge potential for optimum utilization of and considerable revenue generation from the tourism sector.",
            "There are 180 nature tourism attractions, 104 history and culture tourism attractions, and 42 customs and traditions.",
            "Also, there are 41 industrial tourism attractions and 41 sites for sports and recreational activities.",
            "Meanwhile, there are also several venues for shopping activities, health and wellness, and special events."
        ],
        [
            "There are 37 DOT-accredited tourism establishments with total of 1,533 rooms in the province in 2021.",
            "There are also numerous locally registered tourism establishments in Quezon Province such as beach resorts, private pools, tourist inns, etc., which cater to throngs of tourists from both within and outside the province."
        ],
        [
            "In 2021, a total of 2,034,485 tourist arrivals were recorded in the province, of which, 2,033,779 tourists were domestic and 706 tourists were foreign."
        ],
        [
            "Beaches and springs"
        ],
        [
            "Sunrise in Real, Quezon"
        ],
        [
            "To the north, the island of Balesin (part of Polillo) has become playground to the rich and famous."
        ],
        [
            "In the central portion of the province, the beaches of Guisguis in Sariaya have long been considered a local destination.",
            "Several resorts including Villa del Prado Resort, Dalampasigan Beach Resort and the Montevista Beach Resort are some of the resorts in the area."
        ],
        [
            "In the south, the Bondoc Peninsula towns offer an array of resorts with good beaches such as the Municipalities of Agdangan, Unisan and Catanauan.",
            "The islands of Padre Burgos also showcase the “ Borawan Island “ with pure sand like Boracay and a scenic view like Palawan hence its name Borawan.",
            "While on the Lamon Bay Area of Quezon, the Island of Alabat (municipalities: Perez, Alabat, Quezon) offers countless beach resorts."
        ],
        [
            "Mountains"
        ],
        [
            "Rugged terrains characterize the province's topography with few plains, valleys, and swamps.",
            "The Sierra Madre Mountain Range runs along the entire length of the area, with Mount Banahaw (an active volcano) rising at 2,169 meters above sea level.",
            "Only narrow strips of land along the coast and river valleys are available for growing crops.",
            "The undulating lowlands along the coast are well-drained.",
            "The province is narrow, averaging about thirty (30) kilometers by width."
        ],
        [
            "Mount Banahaw is a pilgrimage site for some locals who believe the mountain to be holy.",
            "Although considered an active volcano, hiking has been popular with both religious pilgrims as well as hikers.",
            "There are two trails to the mountain, both originating from Barangay Kinabuhayan in the town of Dolores.",
            "The most frequently used trails are the Cristalino and Tatlong Tangke, taking an average of 9 and 5 hours, respectively but both converges at the volcano's summit.",
            "At the peak are viewpoints, labeled as Durungawan I, II, and III, which are the usual destination for pilgrims and hikers.",
            "However, due to pollution and trash left by these visitors, Mt.",
            "Banahaw was closed to the public until further notice."
        ],
        [
            "Notable people"
        ],
        [
            "President Manuel L. Quezon with Calauag Mayor Tomas B. Morato -- Photo courtesy of the Morato Family"
        ],
        [
            "Tommy Abuel,  actor – Lucban"
        ],
        [
            "Vitaliano Aguirre, 58th Secretary of the Department of Justice – Mulanay"
        ],
        [
            "Danilo Suarez – ex-politician Lucena City"
        ],
        [
            "Proceso Alcala,  43rd Secretary of the Department of Agriculture – Lucena City"
        ],
        [
            "Leo Austria, former PBA player, current SMB coach in the PBA – Sariaya, Quezon"
        ],
        [
            "Mac Baracael, professional Filipino basketball player – Pagbilao, Quezon"
        ],
        [
            "Ana Capri, actress – Infanta"
        ],
        [
            "Mel Chionglo, film director and production designer - Lucena"
        ],
        [
            "Fides Cuyugan-Asensio, National Artist of the Philippines for Music - Lucena"
        ],
        [
            "Rey Danseco, WBC Award winner-International Boxing Judge and sports editor – Calauag, Lopez, and Gumaca"
        ],
        [
            "Horacio de la Costa, Jesuit, historian, the first Filipino Provincial Superior of the Society of Jesus in the Philippines - Maúban"
        ],
        [
            "Agnes Devanadera, former Solicitor-General and former Acting Secretary of the Department of Justice – Sampaloc"
        ],
        [
            "Alice Dixson, actress – Philippine Cinema – Buenavista"
        ],
        [
            "Guillermo Eleazar, PNP Chief who has previously served as chief of the Quezon City Police District, Director of the PNP Calabarzon and the National Capital Region Police Office – Tagkawayan, Quezon"
        ],
        [
            "Arturo Enrile, 24th Chief of Staff of the Armed Forces of the Philippines - Lucena"
        ],
        [
            "Josefina Guerrero, spy and war heroine - Lucban"
        ],
        [
            "Angel Lagdameo, Archbishop of the Archdiocese of Jaro and former President of the Catholic Bishops' Conference of the Philippines – Lucban"
        ],
        [
            "Rio Locsin, actress – Candelaria, Quezon"
        ],
        [
            "Mark Magsumbol, first Filipino player in 31-team American Basketball Association (ABA) – Calauag"
        ],
        [
            "Ahtisa Manalo, Binibining Pilipinas International 2018 and Miss International 2018 1st Runner-Up – Candelaria"
        ],
        [
            "Raimund Marasigan, musician (Eraserheads, Sandwich, Pedicab, Cambio) – Candelaria"
        ],
        [
            "Mau Marcelo, winner, Philippine Idol (ABC) – Lucena"
        ],
        [
            "Paz Márquez-Benítez, author of Dead Stars (1925), short-story writer, educator and editor - Lucena"
        ],
        [
            "Emilio Z. Marquez,  former bishop of the Roman Catholic Diocese of Lucena, first Bishop of Gumaca - Lopez, Quezon"
        ],
        [
            "Pauline Mendoza, actress/model – Lucban, Quezon"
        ],
        [
            "Lily Monteverde, movie producer – Sariaya"
        ],
        [
            "Manoling Morato, former Chairman of the Philippine Charity Sweepstakes Office – Calauag"
        ],
        [
            "Tomas Morato, last municipal President and first Mayor of Calauag and Quezon City, First Representative of the 2nd District of Tayabas, Manuel L. Quezon's best friend – Calauag"
        ],
        [
            "Edgar Mortiz, actor/director – Infanta"
        ],
        [
            "Orlando Nadres, writer/screenwriter/director – Tayabas"
        ],
        [
            "Jose Francisco Oliveros, A bishop who served as the second Bishop of the Diocese of Boac, Marinduque and fourth Bishop of the Diocese of Malolos – Quezon, Quezon"
        ],
        [
            "Leo Oracion, first Filipino mountaineer to successfully reach the Mt.",
            "Everest summit – Lucban, Quezon"
        ],
        [
            "Paraluman, actress  – Tayabas"
        ],
        [
            "Marcelito Pomoy, Filipino Singer, Pilipinas Got Talent season 2 champion, America's Got Talent 3rd Runner-up – Calauag"
        ],
        [
            "Gil M. Portes,  a Filipino film director, film producer and screenwriter – Pagbilao"
        ],
        [
            "Hermano Pule, religious leader who founded and led the Cofradía de San José.",
            "– Lucban"
        ],
        [
            "Raymundo Punongbayan, former director, PHIVOLCS – Calauag"
        ],
        [
            "Manuel L. Quezon, the second President of the Philippines – Baler (now a part of Aurora)"
        ],
        [
            "Claro M. Recto, former Senator, former Associate Justice of the Philippine Supreme Court – Tiaong"
        ],
        [
            "Kris Psyche Resus, Miss Philippines Earth 2010 – Infanta"
        ],
        [
            "Rene Saguisag, former senator, human rights lawyer - Maúban"
        ],
        [
            "Ice Seguerra, Filipino actress and singer – Calauag"
        ],
        [
            "Lorenzo Tañada III, Congressman, Liberal Party Spokesman – Gumaca"
        ],
        [
            "Wigberto Tañada, former Liberal Party President and former senator – Gumaca"
        ],
        [
            "Lorenzo Tañada, former Senator – Gumaca"
        ],
        [
            "Chris Tsuper, radio DJ of Love Radio – Lucban"
        ],
        [
            "Romeo Vasquez, actor – Tayabas"
        ],
        [
            "Joanna Deapera Eden, beauty queen Binibining Pilipinas Supranational 2016 – Lucban"
        ],
        [
            "Marie Sherry Ann Quintana Tormes, beauty queen Miss Global 2022 and Miss Philippines Fire 2020 – Atimonan"
        ],
        [
            "Explanatory notes"
        ],
        [
            "^ UK: /ˈkeɪzɒn/, US: /ˈkeɪsɒn, -sɔːn, -soʊn/ ⓘ"
        ],
        [
            "References"
        ],
        [
            "^ \"Philippine Coconut Statistic 2018\" (PDF).",
            "Philippine Coconut Authority.",
            "Archived from the original (PDF) on February 13, 2023.",
            "Retrieved June 25, 2022."
        ],
        [
            "^ \"Quezon Province has been known as Cocolandia for being the top coconut producer in the Philippines\".",
            "FILIPIKNOW®.",
            "July 15, 2021."
        ],
        [
            "^ \"Building climate-resilient communities\"."
        ],
        [
            "^ Pena, Romeo Palustre.",
            "\"Walang Tamad Sa Quezon: Kaalamang Bayan sa Niyog Mula Sa Bugtong at Salawikain Bilang Patunay na Hindi Tamad Ang Mga Pilipino\".",
            "ATAGAN - Alternatibong Tahanan ng mga Akda at GAwang Nasaliksik.",
            ".",
            "2020-11-28"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Archived from the original on January 17, 2013.",
            "Retrieved November 22, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"Quezon City\".",
            "The American Heritage Dictionary of the English Language (5th ed.).",
            "HarperCollins.",
            "Retrieved April 18, 2019."
        ],
        [
            "^ \"Quezon City\".",
            "Collins English Dictionary.",
            "HarperCollins.",
            "Retrieved April 18, 2019."
        ],
        [
            "^ \"Quezon City\" (US) and \"Quezon City\".",
            "Lexico UK English Dictionary.",
            "Oxford University Press.",
            "Archived from the original on August 6, 2020."
        ],
        [
            "^ \"Quezon City\".",
            "Merriam-Webster.com Dictionary.",
            "Retrieved April 18, 2019."
        ],
        [
            "^ \"Quezon Province- History and Culture\".",
            "quezon.gov.ph.",
            "Retrieved April 6, 2023."
        ],
        [
            "^ a b Republic Act No.",
            "14 (September 7, 1946), An Act to Change the Name of the Province of Tayabas to Quezon, retrieved May 1, 2023"
        ],
        [
            "^ Paz, Victor.",
            "Ragragio, Andrea.",
            "Medrana, Jack.",
            "\"Preliminary Archaeological Survey of the Municipality of Catanauan, Bondoc Peninsula, Quezon Province\".",
            "Catanauan Site Reports.",
            "Archived from the original on May 2, 2018.",
            "{{cite journal}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ \"1,000-year-old village found in Philippines\".",
            "Telegraph.co.uk.",
            "Archived from the original on May 1, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ a b c d \"History of Quezon Province\".",
            "Provincial Government of Quezon.",
            "Archived from the original on October 1, 2016.",
            "Retrieved April 4, 2016."
        ],
        [
            "^ a b Ramos, Lily O.",
            "(July 18, 2012).",
            "\"Quezon province's impressive historical and cultural heritage\".",
            "Balita.ph.",
            "Retrieved April 4, 2016."
        ],
        [
            "^ a b c d e f g \"Aurora, Philippines – History\".",
            "www.aurora.ph.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ \"The Archdiocese | Archdiocese of Caceres\".",
            "caceres-naga.org.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Newson, Linda (2009).",
            "Conquest and Pestilence in the Early Spanish Philippines.",
            "Hawaii: University of Hawaii Press.",
            "p. 147.",
            "ISBN 9780824832728."
        ],
        [
            "^ a b Jose, Diocese of San.",
            "\"Diocese of San Jose, Nueva Ecija – History\".",
            "www.dioceseofsanjose.org.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ a b c Shiraishi, Takashi (2018).",
            "Reading Southeast Asia.",
            "New York: Cornell University.",
            "pp.",
            "128–130."
        ],
        [
            "^ Who We Are: Nueva Ecija"
        ],
        [
            "^ a b \"Diocese of Lucena\".",
            "www.cbcponline.net.",
            "Archived from the original on October 4, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Shiraishi, Takashi (2018).",
            "Reading Southeast Asia.",
            "New York: Cornell University.",
            "pp.",
            "128–130."
        ],
        [
            "^ \"Tayabas Regiment Revolt - The Philippines Today\".",
            "January 20, 2023.",
            "Retrieved February 14, 2023."
        ],
        [
            "^ \"Revolt of the Tayabas regiment\".",
            "Manila Bulletin.",
            "January 24, 2019.",
            "Retrieved February 14, 2023."
        ],
        [
            "^ Ramsey, Robert (2007).",
            "A Masterpiece of Counterguerrilla Warfare: BG J. Franklin Bell in the Philippines, 1901–1902.",
            "Combat Studies Institute Press.",
            "pp.",
            "12–13."
        ],
        [
            "^ National Historical Commission of the Philippines.",
            "\"History of Baler\".",
            "National Historical Commission of the Philippines.",
            "Retrieved March 9, 2012.",
            "When military district of El Príncipe was created in 1856, Baler became its capital...On June 12, 1902 a civil government was established, moving the district of El Príncipe away from the administrative jurisdiction of Nueva Ecija...and placing it under the jurisdiction of Tayabas Province."
        ],
        [
            "^ \"Full text of \"Acts of the Philippine commission, no.1-1800\"\".",
            "archive.org.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ a b \"The stunning, endangered heritage buildings of Sariaya\".",
            "GMA News Online.",
            "Archived from the original on February 5, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Peter Paul Official Website – The Premier Manufacturer of Quality Coconut Products\".",
            "www.peterpaul.com.ph.",
            "Archived from the original on February 3, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ Republic Act No.",
            "648 (June 14, 1951), \"An Act Creating the Subprovince of Aurora, Which Shall Comprise the Municipalities of Baler, Casiguran, Dipaculao and Maria Aurora, Province of Quezon\", Chan Robles Virtual Law Library, archived from the original on April 24, 2016, retrieved April 4, 2016"
        ],
        [
            "^ Batas Pambansa Blg.",
            "7 (November 21, 1978), \"An Act Separating the Sub-Province of Aurora from the Province of Quezon and Establishing It as an Independent Province\", Chan Robles Virtual Law Library, archived from the original on March 3, 2016, retrieved April 4, 2016"
        ],
        [
            "^ Executive Order No.",
            "103, s. 2002 (May 17, 2002), Dividing Region IV into Region IV-A and Region IV-B, transferring the Province of Aurora to Region III and for other purposes, retrieved May 1, 2023"
        ],
        [
            "^ Tantingco: The Kapampangan in Us"
        ],
        [
            "^ Doyo, Ma.",
            "Ceres P. \"Martial law massacres\".",
            "Retrieved June 19, 2018."
        ],
        [
            "^ Gavilan, Jodesz (October 23, 2018).",
            "\"Massacres, incidents of violence against farmers\".",
            "RAPPLER.",
            "Retrieved December 6, 2022."
        ],
        [
            "^ Inquirer, Philippine Daily (September 22, 2018).",
            "\"Tish, Jessica, Hermon and other missing martial law activists\".",
            "INQUIRER.net.",
            "Retrieved December 6, 2022."
        ],
        [
            "^ \"The Cruelty of Enforced Disappearances: An Abhorrent Crime Against Humanity - Bulatlat\".",
            "Bulatlat.",
            "September 20, 2008.",
            "Retrieved April 2, 2018."
        ],
        [
            "^ \"ENRIQUEZ, Albert R.\" Bantayog ng mga Bayani website.",
            "Retrieved December 6, 2022."
        ],
        [
            "^ a b c d G.R.",
            "No.",
            "80796 (November 8, 1989), \"PROVINCE OF CAMARINES NORTE, Represented by HONORABLE ROY PADILLA, as Acting Provincial Governor, petitioner, vs.PROVINCE OF QUEZON, Represented by HONORABLE HJALMAR QUINTANA, as Acting Provincial Governor, respondent.",
            "\", www.lawphil.net, archived from the original on February 8, 2017, retrieved February 7, 2017"
        ],
        [
            "^ \"An Act Amending the Administrative Code\".",
            "Retrieved February 7, 2017."
        ],
        [
            "^ \"Province of Camarines Norte vs Province of Quezon : 80796 : October 11, 2001 : J. Sandoval-Gutierrez : En Banc\".",
            "sc.judiciary.gov.ph.",
            "Archived from the original on October 12, 2016.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Republic Act No.",
            "9495 (September 7, 2007), An Act Creating the Province of Quezon del Sur, The LAWPHiL Project, archived from the original on February 25, 2014, retrieved November 22, 2013"
        ],
        [
            "^ a b c \"Province: Quezon\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c \"Provincial Government of Quezon\".",
            "www.quezon.gov.ph.",
            "Archived from the original on February 14, 2017.",
            "Retrieved February 13, 2017."
        ],
        [
            "^ \"Active Volcanoes\".",
            "Philippine Institute of Volcanology and Seismology.",
            "July 30, 2008.",
            "Archived from the original on March 4, 2016.",
            "Retrieved January 6, 2016."
        ],
        [
            "^ \"Makiling-Banahaw\".",
            "National Geothermal Association of the Philippines, Inc. (NGAP).",
            "Archived from the original on June 5, 2016.",
            "Retrieved June 26, 2016."
        ],
        [
            "^ a b \"State of Region's ENR\".",
            "calabarzon.denr.gov.ph.",
            "Archived from the original on December 5, 2016.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Forest Cover within CALABARZON\".",
            "calabarzon.denr.gov.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ a b Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ A. Bertrand (1846).",
            "Les Philippines: histoire, géographie, moeurs, Volume 1.",
            "Paris.",
            "p. 266."
        ],
        [
            "^ United States.",
            "Philippine Commission, 1900–1916 (1905).",
            "Census of the Philippine Islands: Taken Under the Direction of the Philippine Commission in the Year 1903 Vol 3.",
            "U.S. Government Printing Office.",
            "p. 86.",
            "{{cite book}}:  CS1 maint: numeric names: authors list (link)"
        ],
        [
            "^ Census of Population and Housing (2010).",
            "Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities (PDF).",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Region IV-A (Calabarzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ United States.",
            "Philippine Commission (1905).",
            "Census of the Philippine Islands: Taken Under the Direction of the Philippine Commission in the Year 1903 Vol 3.",
            "U.S. Government Printing Office.",
            "p. 16."
        ],
        [
            "^ United States.",
            "Philippine Commission (1905).",
            "Census of the Philippine Islands: Taken Under the Direction of the Philippine Commission in the Year 1903 Vol.",
            "2.",
            "U.S. Government Printing Office.",
            "p. 210."
        ],
        [
            "^ PSA 2010 Census of Population and Housing 2B Quezon"
        ],
        [
            "^ 2010 Census of Population Rpt No.",
            "2A Quezon"
        ],
        [
            "^ History of Tagkawayan"
        ],
        [
            "^ Wernstedt, Frederick; Spencer, Joseph (1967).",
            "The Philippine Island World: A Physical, Cultural, and Regional Geography.",
            "University of California Press.",
            "p. 425."
        ],
        [
            "^ Wong, Kwok-Chu (1999).",
            "The Chinese in the Philippine Economy, 1898-1941.",
            "Ateneo University Press.",
            "ISBN 978-971-550-323-5."
        ],
        [
            "^ \"Untitled\" (PDF)."
        ],
        [
            "^ \"UNESCO Atlas of the World's Languages in danger\".",
            "www.unesco.org.",
            "Archived from the original on December 18, 2016.",
            "Retrieved May 2, 2018."
        ],
        [
            "^ Manuel, E. Arsenio (1971).",
            "A Lexicographic Study of Tayabas Tagalog of Quezon Province.",
            "Diliman Review."
        ],
        [
            "^ \"Tayabas Tagalog\".",
            "OpinYon News.",
            "January 12, 2023.",
            "Retrieved February 11, 2023."
        ],
        [
            "^ Cornelio, Jayeel.",
            "\"Religious Rituals in Tayabas, Quezon, Philippines\".",
            "{{cite journal}}: Cite journal requires |journal= (help)"
        ],
        [
            "^ Tormo, Leandro (1971).",
            "Lucban: A Town the Franciscans Built.",
            "Historical Conservation Society."
        ],
        [
            "^ Ollivier-Beauregard, G. M. (1889).",
            "En Orient: études ethnologiques et linguistiques a travers les ages et les peuples (in French).",
            "Jean Maisonneuve."
        ],
        [
            "^ \"SAMOT SARI\" Salitang Amot at mga Salitang Tayabasin.",
            "ATAGAN - Alternatibong Tahanan ng mga Akda at GAwang Nasaliksik.",
            ".",
            "2021-08-21"
        ],
        [
            "^ Gesumariajose (June 28, 2013).",
            "\"Gem of the Philippines: LOPEZ LINGO: intersection with, and peculiarities from TAYABAS TAGALOG\".",
            "Gem of the Philippines.",
            "Retrieved April 2, 2023."
        ],
        [
            "^ \"Quezon Province\"."
        ],
        [
            "^ In concurrent capacity as Provincial Social Welfare Officer"
        ],
        [
            "^ In concurrent capacity as Provincial Administrator"
        ],
        [
            "^ In her concurrent capacity as Provincial Assessor"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "^ \"Quo vadis, Quezon?\".",
            "BusinessMirror.",
            "August 6, 2017."
        ],
        [
            "^ \"The Natural Beauty of Cocolandia – Quezon, Philippines\".",
            "August 13, 2021."
        ],
        [
            "^ a b c d e \"Quezon Province- Socio Economic Profile\".",
            "quezon.gov.ph.",
            "Retrieved April 6, 2023."
        ],
        [
            "^ Mallari, Delfin T. Jr. (February 2017).",
            "\"Almost P200K worth of illegally cut coconut lumber seized in Quezon\".",
            "newsinfo.inquirer.net.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ Mallari, Delfin T. Jr. (June 23, 2014).",
            "\"War against coconut pest starts in Quezon province\".",
            "newsinfo.inquirer.net.",
            "Archived from the original on November 1, 2016.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ a b \"Provincial Commodity Investment Plan\" (PDF).",
            "Archived (PDF) from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ Locsin, Joel (May 2015).",
            "\"Cops Seize P4.5M worth of illegally cut logs in Quezon Province\".",
            "GMA News.",
            "Retrieved September 20, 2018."
        ],
        [
            "^ \"BSP – Banks in Quezon\".",
            "www.bsp.gov.ph.",
            "Retrieved February 27, 2020."
        ],
        [
            "^ Kilometer count tabulated from data for the 4 district engineering offices in Quezon in the 2015 Road Data Archived April 7, 2017, at the Wayback Machine by the Department of Public Works and Highways"
        ],
        [
            "^ \"SOUTH LUZON EXPRESSWAY (SLEX) TOLL ROAD 4 (TR-4) | Department of Public Works and Highways\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 6, 2017."
        ],
        [
            "^ \"Manila-Quezon Expressway | Department of Public Works and Highways\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 6, 2017."
        ],
        [
            "^ \"QUEZON–BICOL EXPRESSWAY | Department of Public Works and Highways\".",
            "www.dpwh.gov.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 6, 2017."
        ],
        [
            "^ \"TRB Declares South Luzon Expressway (SLEX) Toll Road 5 And Pasig River Expressway Projects As Toll Road Projects\".",
            "DOTr.",
            "August 5, 2020.",
            "Archived from the original on June 18, 2021.",
            "Retrieved August 21, 2020."
        ],
        [
            "^ \"Route Map\".",
            "www.pnr.gov.ph.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ \"BusinessWorld | Pagbilao expansion seen operational in late 2017\".",
            "www.bworldonline.com.",
            "Archived from the original on January 30, 2018.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Quezon Power (Philippines), Limited Co\".",
            "www.qpl.com.ph.",
            "Archived from the original on February 4, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Our Business | MGen\".",
            "www.meralcopowergen.com.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"news_quezon\".",
            "www.lwua.gov.ph.",
            "Archived from the original on February 18, 2017.",
            "Retrieved February 17, 2017."
        ],
        [
            "^ Asian Development Bank (2010).",
            "\"Water District Management Sector Project\" (PDF).",
            "Subproject Appraisal Report: Quezon Metro Water District.",
            "4.",
            "Archived (PDF) from the original on February 18, 2017."
        ],
        [
            "^ a b Mallari, Delfin T. Jr. (August 15, 2016).",
            "\"1 dead, 5 missing as flood hits MWSS tunnel in Quezon\".",
            "newsinfo.inquirer.net.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ a b c Bello, John (May 16, 2015).",
            "\"Local govts, residents reject construction of dam for power generation, Metro Manila water supply | BusinessMirror\".",
            "www.businessmirror.com.ph.",
            "Archived from the original on March 31, 2016.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ Mayuga, Jonathan L. (December 1, 2020).",
            "\"Ulysses revives opposition to P12-billion Kaliwa Dam project | Jonathan L. Mayuga\".",
            "BusinessMirror.",
            "Retrieved January 21, 2021."
        ],
        [
            "^ \"The Pahiyas Festival – Lucban San Isidro Pahiyas Festival\".",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Provincial Government of Quezon\".",
            "www.quezon.gov.ph.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ \"Katang Festival – Calauag Annual Foundation Celebration\".",
            "Archived from the original on December 4, 2016.",
            "Retrieved May 25, 2017."
        ],
        [
            "^ \"Katang Festival – Calauag Foundation Celebration\".",
            "Archived from the original on June 14, 2017.",
            "Retrieved May 25, 2017."
        ],
        [
            "^ \"Coconut Statistics 2018 - Philippine Coconut Authority\" (PDF).",
            "Philippine Statistics Authority.",
            "Archived from the original (PDF) on February 13, 2023.",
            "Retrieved June 25, 2022."
        ],
        [
            "^ a b \"The flavors of Quezon province\".",
            "GMA News Online.",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ \"Quezon delicacies\".",
            "Archived from the original on February 8, 2017.",
            "Retrieved February 7, 2017."
        ],
        [
            "^ \"Open secrets of Lucban's food treasures\".",
            "July 31, 2013."
        ],
        [
            "^ \"Must-experience South Tagalog food tour: From Patis' 'adobo' with 'buko' meat to Ugu Bigyan's 'pako' salad\".",
            "March 7, 2012."
        ],
        [
            "^ glossaryoffilipinofood.blogspot.com"
        ],
        [
            "^ \"Flavors of the Philippines: Flavorful Heritage of Quezon Culinary\"."
        ],
        [
            "^ \"Heritage group protests DPWH road-widening project in Sariaya, Quezon\".",
            "GMA News Online.",
            "Archived from the original on February 6, 2017.",
            "Retrieved February 5, 2017."
        ],
        [
            "^ Mallari, Delfin Jr. (March 31, 2018).",
            "\"3 million devotees, pilgrims visit Kamay ni Hesus Shrine in Lucban\".",
            "Inquirer.net.",
            "Inquirer Interactive Inc. Archived from the original on June 24, 2023.",
            "Retrieved June 25, 2023.",
            "An estimated three million devotees and pilgrims visited \"Kamay ni Hesus\" shrine in Lucban town in Quezon province, the most popular Holy Week pilgrimage site in the Philippines."
        ],
        [
            "^ corporation, alphaland.",
            "\"Balesin Island: Overview\".",
            "www.balesin.com.",
            "Archived from the original on December 28, 2016.",
            "Retrieved February 5, 2017."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            "Wikimedia Commons has media related to Quezon (province)."
        ],
        [
            "Official website of Quezon province"
        ],
        [
            "Local Governance Performance Management System Archived March 4, 2016, at the Wayback Machine"
        ],
        [
            "Places adjacent to Quezon"
        ],
        [
            "Bulacan"
        ],
        [
            "Aurora"
        ],
        [
            "Lamon Bay, Philippine Sea"
        ],
        [
            "RizalLagunaBatangas"
        ],
        [
            "Quezon"
        ],
        [
            "Camarines NorteCamarines Sur"
        ],
        [
            "Tayabas BayMarinduque"
        ],
        [
            "Sibuyan Sea, Ragay GulfMasbate"
        ],
        [
            "vte Province of QuezonLucena (capital and largest city)Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Alabat"
        ],
        [
            "Atimonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Calauag"
        ],
        [
            "Candelaria"
        ],
        [
            "Catanauan"
        ],
        [
            "Dolores"
        ],
        [
            "General Luna"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Infanta"
        ],
        [
            "Jomalig"
        ],
        [
            "Lopez"
        ],
        [
            "Lucban"
        ],
        [
            "Macalelon"
        ],
        [
            "Mauban"
        ],
        [
            "Mulanay"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Pagbilao"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Narciso"
        ],
        [
            "Sariaya"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Tiaong"
        ],
        [
            "Unisan"
        ],
        [
            "Component city"
        ],
        [
            "Tayabas"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Lucena (Administratively independent from the province but grouped under Quezon by the Philippine Statistics Authority.",
            "However, qualified voters of this city are still allowed to participate in the election of provincial officials as part of Quezon’s 2nd Sangguniang Panlalawigan district.)"
        ],
        [
            "Articles related to Quezon"
        ],
        [
            "vteCalabarzon (Region IV-A)CAvite, LAguna, BAtangas, Rizal, QueZONRegional center"
        ],
        [
            "Calamba"
        ],
        [
            "Provinces"
        ],
        [
            "Batangas"
        ],
        [
            "Cavite"
        ],
        [
            "Laguna"
        ],
        [
            "Quezon"
        ],
        [
            "Rizal"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Lucena"
        ],
        [
            "Component cities"
        ],
        [
            "Antipolo"
        ],
        [
            "Bacoor"
        ],
        [
            "Batangas City"
        ],
        [
            "Biñan"
        ],
        [
            "Cabuyao"
        ],
        [
            "Calamba"
        ],
        [
            "Calaca"
        ],
        [
            "Carmona"
        ],
        [
            "Cavite City"
        ],
        [
            "Dasmariñas"
        ],
        [
            "General Trias"
        ],
        [
            "Imus"
        ],
        [
            "Lipa"
        ],
        [
            "San Pablo"
        ],
        [
            "San Pedro"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Tagaytay"
        ],
        [
            "Tanauan"
        ],
        [
            "Tayabas"
        ],
        [
            "Trece Martires"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Antipolo"
        ],
        [
            "Batangas City"
        ],
        [
            "Imus (de jure)"
        ],
        [
            "Lucena"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Trece Martires (de facto)"
        ],
        [
            "Municipalities"
        ],
        [
            "Agdangan"
        ],
        [
            "Agoncillo"
        ],
        [
            "Alabat"
        ],
        [
            "Alaminos"
        ],
        [
            "Alfonso"
        ],
        [
            "Alitagtag"
        ],
        [
            "Amadeo"
        ],
        [
            "Angono"
        ],
        [
            "Atimonan"
        ],
        [
            "Balayan"
        ],
        [
            "Balete"
        ],
        [
            "Baras"
        ],
        [
            "Bauan"
        ],
        [
            "Bay"
        ],
        [
            "Binangonan"
        ],
        [
            "Buenavista"
        ],
        [
            "Burdeos"
        ],
        [
            "Cainta"
        ],
        [
            "Calatagan"
        ],
        [
            "Calauag"
        ],
        [
            "Calauan"
        ],
        [
            "Candelaria"
        ],
        [
            "Cardona"
        ],
        [
            "Catanauan"
        ],
        [
            "Cavinti"
        ],
        [
            "Cuenca"
        ],
        [
            "Dolores"
        ],
        [
            "Famy"
        ],
        [
            "General Emilio Aguinaldo"
        ],
        [
            "General Luna"
        ],
        [
            "General Mariano Alvarez"
        ],
        [
            "General Nakar"
        ],
        [
            "Guinayangan"
        ],
        [
            "Gumaca"
        ],
        [
            "Ibaan"
        ],
        [
            "Indang"
        ],
        [
            "Infanta"
        ],
        [
            "Jalajala"
        ],
        [
            "Jomalig"
        ],
        [
            "Kalayaan"
        ],
        [
            "Kawit"
        ],
        [
            "Laurel"
        ],
        [
            "Lemery"
        ],
        [
            "Lian"
        ],
        [
            "Liliw"
        ],
        [
            "Lobo"
        ],
        [
            "Lopez"
        ],
        [
            "Los Baños"
        ],
        [
            "Lucban"
        ],
        [
            "Luisiana"
        ],
        [
            "Lumban"
        ],
        [
            "Mabini"
        ],
        [
            "Mabitac"
        ],
        [
            "Macalelon"
        ],
        [
            "Magallanes"
        ],
        [
            "Magdalena"
        ],
        [
            "Majayjay"
        ],
        [
            "Malvar"
        ],
        [
            "Maragondon"
        ],
        [
            "Mataasnakahoy"
        ],
        [
            "Mauban"
        ],
        [
            "Mendez"
        ],
        [
            "Morong"
        ],
        [
            "Mulanay"
        ],
        [
            "Nagcarlan"
        ],
        [
            "Naic"
        ],
        [
            "Nasugbu"
        ],
        [
            "Noveleta"
        ],
        [
            "Padre Burgos"
        ],
        [
            "Padre Garcia"
        ],
        [
            "Paete"
        ],
        [
            "Pagbilao"
        ],
        [
            "Pagsanjan"
        ],
        [
            "Pakil"
        ],
        [
            "Pangil"
        ],
        [
            "Panukulan"
        ],
        [
            "Patnanungan"
        ],
        [
            "Perez"
        ],
        [
            "Pila"
        ],
        [
            "Pililla"
        ],
        [
            "Pitogo"
        ],
        [
            "Plaridel"
        ],
        [
            "Polillo"
        ],
        [
            "Quezon"
        ],
        [
            "Real"
        ],
        [
            "Rizal"
        ],
        [
            "Rodriguez"
        ],
        [
            "Rosario (Batangas)"
        ],
        [
            "Rosario (Cavite)"
        ],
        [
            "Sampaloc"
        ],
        [
            "San Andres"
        ],
        [
            "San Antonio"
        ],
        [
            "San Francisco"
        ],
        [
            "San Jose"
        ],
        [
            "San Juan"
        ],
        [
            "San Luis"
        ],
        [
            "San Mateo"
        ],
        [
            "San Narciso"
        ],
        [
            "San Nicolas"
        ],
        [
            "San Pascual"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Teresita"
        ],
        [
            "Sariaya"
        ],
        [
            "Silang"
        ],
        [
            "Siniloan"
        ],
        [
            "Taal"
        ],
        [
            "Tagkawayan"
        ],
        [
            "Talisay"
        ],
        [
            "Tanay"
        ],
        [
            "Tanza"
        ],
        [
            "Taysan"
        ],
        [
            "Taytay"
        ],
        [
            "Teresa"
        ],
        [
            "Ternate"
        ],
        [
            "Tiaong"
        ],
        [
            "Tingloy"
        ],
        [
            "Tuy"
        ],
        [
            "Unisan"
        ],
        [
            "Victoria"
        ],
        [
            "Barangays"
        ],
        [
            "Batangas (List)"
        ],
        [
            "Cavite (List)"
        ],
        [
            "Laguna (List)"
        ],
        [
            "Quezon (List)"
        ],
        [
            "Rizal (List)"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Germany"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "2"
        ],
        [
            "Sweden"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Quezon&oldid=1232933040\""
        ],
        [
            "Categories: Quezon1591 establishments in the PhilippinesProvinces of the PhilippinesProvinces of CalabarzonStates and territories established in 1591Hidden categories: Pages using gadget WikiMiniAtlasPages using the Phonos extensionPages with non-numeric formatnum argumentsPages with Tagalog IPAPages including recorded pronunciationsAll articles with dead external linksArticles with dead external links from September 2022CS1 maint: multiple names: authors listCS1 maint: numeric names: authors listCS1 errors: missing periodicalCS1 French-language sources (fr)Webarchive template wayback linksArticles with short descriptionShort description is different from WikidataUse Philippine English from June 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2021Pages using infobox settlement with possible motto listCoordinates on WikidataPages using infobox settlement with possible demonym listPages using infobox settlement with unknown parametersArticles containing Filipino-language textAll articles with unsourced statementsArticles with unsourced statements from January 2021Articles with unsourced statements from February 2017All Wikipedia articles that are incomprehensibleWikipedia articles that are incomprehensible from April 2016Wikipedia articles needing clarification from April 2016Pages using multiple image with auto scaled imagesArticles with unsourced statements from July 2019Articles with hAudio microformatsWikipedia articles with style issues from July 2019All articles with style issuesLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with GND identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with Libris identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}