{
    "name": "Surigao del Norte",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "39 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia Commons"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 10°N 126°E﻿ / ﻿10°N 126°E﻿ / 10; 126"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Caraga, PhilippinesSurigao del NorteProvinceProvince of Surigao del Norte(from top: left to right) Siargao Island, Lake Mainit, Magpupungko Beach in Siargao, Sugba Lagoon in Kawhagan Island, Surigao del Norte provincial capitol and San Isidro coast."
        ],
        [
            "FlagSealLocation in the PhilippinesOpenStreetMapCoordinates: 10°N 126°E﻿ / ﻿10°N 126°E﻿ / 10; 126CountryPhilippinesRegionCaragaFoundedJune 19, 1960Capitaland largest citySurigao CityGovernment • TypeSangguniang Panlalawigan • GovernorRobert Lyndon S. Barbers (NP) • Vice GovernorEddie D. Gokiangkee, Jr. (PDP-Laban) • LegislatureSurigao del Norte Provincial BoardArea • Total534,636 • Rank57th out of 81 • Density270/km2 (700/sq mi)  • Rank38th out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " Surigao City"
        ],
        [
            " • Municipalities"
        ],
        [
            "20"
        ],
        [
            " Alegria"
        ],
        [
            " Bacuag"
        ],
        [
            " Burgos"
        ],
        [
            " Claver"
        ],
        [
            " Dapa"
        ],
        [
            " Del Carmen"
        ],
        [
            " General Luna"
        ],
        [
            " Gigaquit"
        ],
        [
            " Mainit"
        ],
        [
            " Malimono"
        ],
        [
            " Pilar"
        ],
        [
            " Placer"
        ],
        [
            " San Benito"
        ],
        [
            " San Francisco"
        ],
        [
            " San Isidro"
        ],
        [
            " Santa Monica"
        ],
        [
            " Sison"
        ],
        [
            " Socorro"
        ],
        [
            " Tagana-an"
        ],
        [
            " Tubod"
        ],
        [
            " • Barangays335 • DistrictsLegislative districts of Surigao del NorteTime zoneUTC+8 (PST)ZIP code8400–8425IDD : area code +63 (0)86ISO 3166 codePH-SUNSpoken languagesSurigaononCebuanoAgusanMamanwaTagalogEnglishIncome classification2nd classWebsitesurigaodelnorte.gov.ph"
        ],
        [
            "Surigao del Norte (Surigaonon: Probinsya nan Surigao del Norte; Cebuano: Amihanang Surigao; Tagalog: Hilagang Surigao), officially the Province of Surigao del Norte, is a province in the Philippines located in the Caraga region of Mindanao.",
            "The province was formerly under the jurisdiction of Region 10 (Northern Mindanao) until 1995.",
            "Its capital is Surigao City.",
            "The province comprises two major islands—Siargao and Bucas Grande—in the Philippine Sea, plus a small area at the northeastern tip of mainland Mindanao and other surrounding minor islands and islets.",
            "This mainland portion borders Agusan del Norte – between the Municipality of Alegria in Surigao del Norte and the Municipality of Kitcharao in Agusan del Norte; and the province of Surigao del Sur, to the south."
        ],
        [
            "Surigao del Norte is the second northernmost of the Mindanao provinces and is an important commerce and transportation hub between Visayas and Mindanao.",
            "Numerous ferries cross the Surigao Strait between Surigao and the island of Leyte transporting vehicles, cargoes, and passengers between Liloan in Southern Leyte and Surigao City."
        ],
        [
            "Etymology"
        ],
        [
            "See also: List of Philippine provincial name etymologies"
        ],
        [
            "There are two presumptions on the original meaning of \"Surigao\" among linguists, depending on the original root word.",
            "If the root word was taken to be sulig (\"sprout\" or \"spring up\"), then Surigao may have derived from suligao (\"spring water\"), likely referring to the Surigao River (known as \"Suligaw\" in Mandaya) that empties at the northern tip of the island of Mindanao."
        ],
        [
            "Another possibility is that it is derived from Visayan \"surogao\" or \"suyogao,\" meaning \"water current\".",
            "From suyog (also sulog or surog), \"current\".",
            "Other Visayan words derived from the same root include Sinulog, Sulu, and Tausug (Suluk)."
        ],
        [
            "History"
        ],
        [
            "Further information: Surigao (province)"
        ],
        [
            "Map of the historical province of Surigao in 1918"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Rajah Siawi and Rajah Kulambo, members of the nobility of the Surigaonon and Butuanon people, respectively, were encountered by the Magellan expedition in 1521 on the island of Limasawa (which was a hunting ground for the rulers).",
            "Antonio Pigafetta describes them as being tattooed and covered in gold ornaments.",
            "Pigafetta also records the name of the Surigao region as \"Calagan\".",
            ": 141–142"
        ],
        [
            "The explorer Ruy López de Villalobos headed an expedition to Surigao in 1543, an attempt at subjugation which failed because of the resistance of the natives.",
            "At that time the island of Mindanao was given the name Caesarea Caroli, in honor of Carlos V of Spain.",
            "Jesuit missionaries visited Butuan in 1597 but did not make much progress in Christianizing the people.",
            "It was not until 1609, when a full-dress expedition was launched, that Spanish authority was imposed to Tandag.",
            "In 1622, the arrival of the Recollect missionaries in Tandag commenced the establishment of a permanent mission in Surigao."
        ],
        [
            "The area of Surigao del Norte was once part of an ancient district referred to as \"Caraga\" during the Spanish colonial period named after its chief inhabitants, the Caraga tribe or Caragans who were largely concentrated in a settlement called Caraga.",
            "The ancient district of Caraga, which was established in 1609 comprised all of the present day provinces of Surigao del Norte, Dinagat Islands, Surigao del Sur, the northern part of Davao Oriental and eastern Misamis Oriental.",
            "The seat of government was at Tandag until it was transferred to the town of Surigao in 1848.",
            "Six Spanish military districts were established in Mindanao in 1860 and the areas of present-day Surigao del Norte, Surigao del Sur, Dinagat Islands, Agusan del Norte and Agusan del Sur (collectively called Agusan back then), including the territory lying between present day Butuan and Caraga bays, formed the third district called the \"East District\" which was changed in 1870 to \"Distrito de Surigao\".",
            "By the end of the Spanish rule in 1897, Agusan had been organized as a single politico-military comandancia named \"Butuan\", within the administrative jurisdiction of Distrito de Surigao."
        ],
        [
            "Surigao during the Philippine Revolution"
        ],
        [
            "On December 23, 1898, the last Spanish Governor of Surigao turned his authority over to a provisional Filipino \"Junta Provincial\" Peacefully.",
            "The Spanish Government along with the Spanish community soon left Surigao by the next day on December 24 leaving behind Spanish missionaries.",
            "They were sent off with the sound of music and goodwill by the locals.",
            "The Junta Provincial elected Jantoy Gonzalez to serve as the Provisional head while waiting for the arrival of the new authority from Luzon that was sent by Aguinaldo."
        ],
        [
            "First and Official Flag Raising in Mindanao.",
            "Father Alberto Masoliver, S.J., during his stint as the parish priest of Surigao in 1898, kept a compilation of his diaries, entitled Diario de la Casa de Surigao.",
            "His diaries are currently stored in the Jesuit archives at Centro Borja, Sant Cugat del Valles, Spain.",
            "He thus wrote on December 26, 1898, \"Before 10:00 AM, the tri-color was hoisted from Casa Real seat of provincial government) and the Tribunal … without any formalities … without anybody's attention being drawn…..these people have no idea of what it is all about, and if they have… how peaceful and without malice they are.\".",
            "Surigao then was the cabecera and the seat of government of the province of Caraga which had jurisdiction over Surigao, Butuan and Cagayan de Misamis (Cagayan de Oro).",
            "Alejandro (Jantoy) Gonzalez was the president of the Junta Provincial of Surigao during the time of the first flag hoisting."
        ],
        [
            "The New Authority under Aguinaldo's Supreme Revolutionary Government arrived in Surigao by January 12, 1899, they were the brothers Simon and Wenceslao Gonzales, children of Jantoy Gonzales."
        ],
        [
            "Confiscation of Church Estate"
        ],
        [
            "Immediately after the arrival of the Gonzalez Brothers, they carried the orders of the Malolos Leadership which included the imprisonment of Spanish Missionaries, Confiscation of Church funds and other church properties."
        ],
        [
            "American Occupation"
        ],
        [
            "Garcia Coup"
        ],
        [
            "by March 24, 1899, a new military and political figure appeared in Surigao.",
            "Don Prudencio Garcia staged a coup which resulted in the imprisonment of the Gonzalezes (Jantoy, Simon, and Wencaslao), and were killed shortly after in Cortez (now Surigao Del Sur).Finally, on April 2, 1899, at 12 midnight they were put in a boat, well handcuffed, and shipped out to the Pacific, and upon arriving at Cortes they shot them down.",
            "They had been guarded by soldiers and officials who were all personal enemies of the Gonzalezes.",
            "In Cortes they were put under the custody of a mestizo, Hilarion Marinez, whom the Gonzalezes had maltreated by words and deeds.",
            "He avenged himself by having them fusilated.",
            "That was the Tragic end of our enemies (\"Apuntes...\" p. 116)The news of what led to the deaths of the Gonzalezes did not reach Aguinaldo as they were given false information to their deaths.",
            "Aguinaldo was given a message from an \"unknown correspondent\" which stated\"General Simon Gonzales and his brother Wencaslao, the Governor of Surigao has been assassinated for collecting excessive contribution in money for the war, and their successors have also been assassinated by the Moros who form a greater part of the population and who have revolted against Filipino rule\" (Philippine Insurgent Record 1039.5 in Taylor)the letter stated that the Gonzales were assassinated, and that the Moros were blamed for the deaths of the predecessors despite having barely any Moros in Surigao by that time."
        ],
        [
            "Narciso v. Garcia"
        ],
        [
            "After the execution of the Gonzalezes, Hermenegildo Narciso (A former ally of Garcia) grabbed the position of Governor.",
            "By around July 1899, around 400 men armed against Garcia took position outside the Provincial Capital (Surigao City) with 80 men in the trenches near the exit of the town.",
            "On July 8, 1899, Garcia returned to Surigao from Banganga with all the honors befitting as a General.",
            "Governor Narciso (who was still in Manila) was expected to return to Surigao to take full control of the Provincial Junta."
        ],
        [
            "July 6, 1899, Soldiers (Garcia) began defending the Government house and Military Quarters in Provincial Capital, and at 6 o'clock Garcia's Soldiers and Narciso's soldiers had a shooting exchange.",
            "By 7 o'clock Garcia prepared to leave Surigao via sea.",
            "The soldiers of Narciso began their offensive when the boat started loading equipment.",
            "They took position behind the Acacia trees, and once they were discovered both sides exchanged fire.",
            "Garcia's soldiers retreated to the port and those who were not able to ride the boat with General Garcia were forced to hide and surrender.",
            "The area of the conflict is at the present day Surigao Luneta Park and alongside the street of Borromeo.",
            "The Province of Surigao would then be engulfed in Military rivalry between Governor Narciso and General Garcia, with Surigao and Butuan held by Narciso while Placer, Cantilan, and Tandag being held by Garcia.",
            "This Military Rivalry would be put to a close by the American Occupation of the Province."
        ],
        [
            "Division of Surigao"
        ],
        [
            "Distrito de Surigao became a chartered province on May 15, 1901 (Philippine Commission Act 127).",
            "The territorial expanse of the Surigao province was further reduced in 1907 when the politico-military commandancia of Butuan, then a sub-province of Surigao, was created into a separate province and officially named it Agusan with present-day Butuan as its capital."
        ],
        [
            "Philippine independence"
        ],
        [
            "On September 18, 1960, through Republic Act 2786 dated June 19, 1960, the province of Surigao was divided into the present-day provinces of Surigao del Norte and Surigao del Sur.",
            "Agusan province was later dissolved and divided into the present-day provinces of Agusan del Norte (retains present day Butuan as capital) and Agusan del Sur in 1967 by Republic Act No.",
            "4979."
        ],
        [
            "Contemporary"
        ],
        [
            "Dinagat Islands had been a part of the First District of Surigao del Norte until becoming a province on its own on December 2, 2006, with the approval of Republic Act No.",
            "9355, the Charter of the Province of Dinagat Islands, in a plebiscite.",
            "Between February 2010 and March 2011, the islands were part again of Surigao del Norte after declaring RA 9355 unconstitutional by the Supreme Court, then were reinstated as a separate province."
        ],
        [
            "Geography"
        ],
        [
            "Mainland Surigao del Norte agricultural landscape"
        ],
        [
            "Surigao del Norte is an archipelago province situated at the rim of the Asian continental shelf.",
            "It is located at the northeastern tip of Mindanao and faces the Philippine Trench.",
            "The province is bounded by the Dinagat Islands on the north, east by the Philippine Sea, south by the provinces of Agusan del Norte and Surigao del Sur, and on the west by the Surigao Strait."
        ],
        [
            "The province, with an area of 1,972.93 square kilometres (761.75 sq mi),"
        ],
        [
            "The province has many caves and tunnels in its islands.",
            "Some are half-submerged in water most of the time and could be accessed only during low tides like the Sohoton Cove at Bucas Grande Island."
        ],
        [
            "Its biggest islands are usually mountainous and rich in minerals.",
            "Nonoc Island has one of the world's largest deposits of nickel.",
            "The smaller ones either rest on sand and gravel or have a limestone base bonded by boulders, reefs and sandbars.",
            "Some islets which include those in Del Carmen in Siargao Island are a cluster of rock formations jutting out from the sea covered with shrubs and coconut trees."
        ],
        [
            "Climate"
        ],
        [
            "Surigao del Norte has no pronounced dry season, receiving maximum rainfall from November to January."
        ],
        [
            "Climate data for Surigao del Norte"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "29.2(84.6)"
        ],
        [
            "29.8(85.6)"
        ],
        [
            "30.8(87.4)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.6(90.7)"
        ],
        [
            "32.3(90.1)"
        ],
        [
            "32.5(90.5)"
        ],
        [
            "32.5(90.5)"
        ],
        [
            "31.9(89.4)"
        ],
        [
            "30.6(87.1)"
        ],
        [
            "29.9(85.8)"
        ],
        [
            "31.4(88.5)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "23.4(74.1)"
        ],
        [
            "23.6(74.5)"
        ],
        [
            "24.0(75.2)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "25.2(77.4)"
        ],
        [
            "25.0(77.0)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.9(76.8)"
        ],
        [
            "24.8(76.6)"
        ],
        [
            "24.7(76.5)"
        ],
        [
            "24.3(75.7)"
        ],
        [
            "23.9(75.0)"
        ],
        [
            "24.5(76.0)"
        ],
        [
            "Average rainy days"
        ],
        [
            "24"
        ],
        [
            "18"
        ],
        [
            "17"
        ],
        [
            "13"
        ],
        [
            "9"
        ],
        [
            "12"
        ],
        [
            "11"
        ],
        [
            "10"
        ],
        [
            "12"
        ],
        [
            "15"
        ],
        [
            "19"
        ],
        [
            "21"
        ],
        [
            "181"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Political divisions"
        ],
        [
            "Surigao del Norte comprises 20 municipalities and 1 component city, organized into two legislative districts and further subdivided into 335 barangays.",
            "The 1st legislative district comprises nine municipalities on the islands of Siargao and Bucas Grande (plus smaller islands); the 2nd legislative district comprises Surigao City and eleven other municipalities on the mainland of Mindanao.",
            "Surigao City has the most number of Barangays with 54, while the Municipalities of Burgos and San Benito has the least number of Barangays each with six."
        ],
        [
            " †  Provincial capital and component city  Municipality"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Alegria"
        ],
        [
            "2nd"
        ],
        [
            "3.0%"
        ],
        [
            "16,184"
        ],
        [
            "16,011"
        ],
        [
            "+0.20%"
        ],
        [
            "65.28"
        ],
        [
            "25.20"
        ],
        [
            "250"
        ],
        [
            "650"
        ],
        [
            "12"
        ],
        [
            "9°28′06″N 125°34′36″E﻿ / ﻿9.4684°N 125.5768°E﻿ / 9.4684; 125.5768﻿ (Alegria)"
        ],
        [
            "Bacuag"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "14,881"
        ],
        [
            "14,486"
        ],
        [
            "+0.51%"
        ],
        [
            "95.85"
        ],
        [
            "37.01"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "9"
        ],
        [
            "9°36′30″N 125°38′18″E﻿ / ﻿9.6084°N 125.6382°E﻿ / 9.6084; 125.6382﻿ (Bacuag)"
        ],
        [
            "Burgos"
        ],
        [
            "1st"
        ],
        [
            "0.8%"
        ],
        [
            "4,185"
        ],
        [
            "4,034"
        ],
        [
            "+0.70%"
        ],
        [
            "19.27"
        ],
        [
            "7.44"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "6"
        ],
        [
            "10°01′05″N 126°04′27″E﻿ / ﻿10.0181°N 126.0742°E﻿ / 10.0181; 126.0742﻿ (Burgos)"
        ],
        [
            "Claver"
        ],
        [
            "2nd"
        ],
        [
            "6.7%"
        ],
        [
            "36,033"
        ],
        [
            "32,773"
        ],
        [
            "+1.82%"
        ],
        [
            "322.60"
        ],
        [
            "124.56"
        ],
        [
            "110"
        ],
        [
            "280"
        ],
        [
            "14"
        ],
        [
            "9°34′23″N 125°43′57″E﻿ / ﻿9.5730°N 125.7326°E﻿ / 9.5730; 125.7326﻿ (Claver)"
        ],
        [
            "Dapa"
        ],
        [
            "1st"
        ],
        [
            "5.4%"
        ],
        [
            "29,006"
        ],
        [
            "23,787"
        ],
        [
            "+3.85%"
        ],
        [
            "91.90"
        ],
        [
            "35.48"
        ],
        [
            "320"
        ],
        [
            "830"
        ],
        [
            "29"
        ],
        [
            "9°45′25″N 126°03′05″E﻿ / ﻿9.7569°N 126.0515°E﻿ / 9.7569; 126.0515﻿ (Dapa)"
        ],
        [
            "Del Carmen"
        ],
        [
            "1st"
        ],
        [
            "3.8%"
        ],
        [
            "20,127"
        ],
        [
            "18,392"
        ],
        [
            "+1.73%"
        ],
        [
            "151.68"
        ],
        [
            "58.56"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "20"
        ],
        [
            "9°52′07″N 125°58′14″E﻿ / ﻿9.8687°N 125.9705°E﻿ / 9.8687; 125.9705﻿ (Del Carmen)"
        ],
        [
            "General Luna"
        ],
        [
            "1st"
        ],
        [
            "4.3%"
        ],
        [
            "22,853"
        ],
        [
            "16,771"
        ],
        [
            "+6.07%"
        ],
        [
            "41.30"
        ],
        [
            "15.95"
        ],
        [
            "550"
        ],
        [
            "1,400"
        ],
        [
            "19"
        ],
        [
            "9°47′00″N 126°09′23″E﻿ / ﻿9.7834°N 126.1563°E﻿ / 9.7834; 126.1563﻿ (General Luna)"
        ],
        [
            "Gigaquit"
        ],
        [
            "2nd"
        ],
        [
            "4.1%"
        ],
        [
            "21,849"
        ],
        [
            "20,864"
        ],
        [
            "+0.88%"
        ],
        [
            "138.11"
        ],
        [
            "53.32"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "13"
        ],
        [
            "9°35′38″N 125°41′51″E﻿ / ﻿9.5938°N 125.6976°E﻿ / 9.5938; 125.6976﻿ (Gigaquit)"
        ],
        [
            "Mainit"
        ],
        [
            "2nd"
        ],
        [
            "5.2%"
        ],
        [
            "28,019"
        ],
        [
            "26,741"
        ],
        [
            "+0.89%"
        ],
        [
            "107.76"
        ],
        [
            "41.61"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "21"
        ],
        [
            "9°32′16″N 125°31′21″E﻿ / ﻿9.5378°N 125.5225°E﻿ / 9.5378; 125.5225﻿ (Mainit)"
        ],
        [
            "Malimono"
        ],
        [
            "2nd"
        ],
        [
            "3.5%"
        ],
        [
            "18,852"
        ],
        [
            "18,054"
        ],
        [
            "+0.83%"
        ],
        [
            "80.13"
        ],
        [
            "30.94"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "14"
        ],
        [
            "9°37′06″N 125°24′06″E﻿ / ﻿9.6184°N 125.4018°E﻿ / 9.6184; 125.4018﻿ (Malimono)"
        ],
        [
            "Pilar"
        ],
        [
            "1st"
        ],
        [
            "1.9%"
        ],
        [
            "10,374"
        ],
        [
            "9,752"
        ],
        [
            "+1.18%"
        ],
        [
            "77.11"
        ],
        [
            "29.77"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "15"
        ],
        [
            "9°51′50″N 126°06′01″E﻿ / ﻿9.8638°N 126.1002°E﻿ / 9.8638; 126.1002﻿ (Pilar)"
        ],
        [
            "Placer"
        ],
        [
            "2nd"
        ],
        [
            "5.5%"
        ],
        [
            "29,616"
        ],
        [
            "27,094"
        ],
        [
            "+1.71%"
        ],
        [
            "61.29"
        ],
        [
            "23.66"
        ],
        [
            "480"
        ],
        [
            "1,200"
        ],
        [
            "20"
        ],
        [
            "9°39′26″N 125°36′05″E﻿ / ﻿9.6573°N 125.6015°E﻿ / 9.6573; 125.6015﻿ (Placer)"
        ],
        [
            "San Benito"
        ],
        [
            "1st"
        ],
        [
            "1.1%"
        ],
        [
            "5,663"
        ],
        [
            "5,404"
        ],
        [
            "+0.90%"
        ],
        [
            "45.63"
        ],
        [
            "17.62"
        ],
        [
            "120"
        ],
        [
            "310"
        ],
        [
            "6"
        ],
        [
            "9°57′28″N 126°00′24″E﻿ / ﻿9.9578°N 126.0067°E﻿ / 9.9578; 126.0067﻿ (San Benito)"
        ],
        [
            "San Francisco (Anao-Aon)"
        ],
        [
            "2nd"
        ],
        [
            "2.9%"
        ],
        [
            "15,347"
        ],
        [
            "14,552"
        ],
        [
            "+1.02%"
        ],
        [
            "56.72"
        ],
        [
            "21.90"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "11"
        ],
        [
            "9°46′40″N 125°25′26″E﻿ / ﻿9.7779°N 125.4239°E﻿ / 9.7779; 125.4239﻿ (San Francisco)"
        ],
        [
            "San Isidro"
        ],
        [
            "1st"
        ],
        [
            "1.6%"
        ],
        [
            "8,519"
        ],
        [
            "7,325"
        ],
        [
            "+2.92%"
        ],
        [
            "42.03"
        ],
        [
            "16.23"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "12"
        ],
        [
            "9°56′11″N 126°05′13″E﻿ / ﻿9.9365°N 126.0869°E﻿ / 9.9365; 126.0869﻿ (San Isidro)"
        ],
        [
            "Santa Monica (Sapao)"
        ],
        [
            "1st"
        ],
        [
            "1.8%"
        ],
        [
            "9,423"
        ],
        [
            "8,808"
        ],
        [
            "+1.29%"
        ],
        [
            "39.19"
        ],
        [
            "15.13"
        ],
        [
            "240"
        ],
        [
            "620"
        ],
        [
            "11"
        ],
        [
            "10°01′08″N 126°02′11″E﻿ / ﻿10.0188°N 126.0364°E﻿ / 10.0188; 126.0364﻿ (Santa Monica)"
        ],
        [
            "Sison"
        ],
        [
            "2nd"
        ],
        [
            "2.7%"
        ],
        [
            "14,290"
        ],
        [
            "13,155"
        ],
        [
            "+1.59%"
        ],
        [
            "54.70"
        ],
        [
            "21.12"
        ],
        [
            "260"
        ],
        [
            "670"
        ],
        [
            "12"
        ],
        [
            "9°39′32″N 125°31′43″E﻿ / ﻿9.6588°N 125.5286°E﻿ / 9.6588; 125.5286﻿ (Sison)"
        ],
        [
            "Socorro"
        ],
        [
            "1st"
        ],
        [
            "4.9%"
        ],
        [
            "25,942"
        ],
        [
            "22,314"
        ],
        [
            "+2.91%"
        ],
        [
            "114.45"
        ],
        [
            "44.19"
        ],
        [
            "230"
        ],
        [
            "600"
        ],
        [
            "14"
        ],
        [
            "9°37′06″N 125°57′54″E﻿ / ﻿9.6183°N 125.9650°E﻿ / 9.6183; 125.9650﻿ (Socorro)"
        ],
        [
            "Surigao City"
        ],
        [
            "†"
        ],
        [
            "2nd"
        ],
        [
            "32.0%"
        ],
        [
            "171,107"
        ],
        [
            "154,137"
        ],
        [
            "+2.01%"
        ],
        [
            "245.30"
        ],
        [
            "94.71"
        ],
        [
            "700"
        ],
        [
            "1,800"
        ],
        [
            "54"
        ],
        [
            "9°47′16″N 125°29′30″E﻿ / ﻿9.7878°N 125.4916°E﻿ / 9.7878; 125.4916﻿ (Surigao City)"
        ],
        [
            "Tagana-an"
        ],
        [
            "2nd"
        ],
        [
            "3.2%"
        ],
        [
            "17,323"
        ],
        [
            "16,428"
        ],
        [
            "+1.02%"
        ],
        [
            "77.29"
        ],
        [
            "29.84"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "14"
        ],
        [
            "9°41′50″N 125°34′57″E﻿ / ﻿9.6973°N 125.5826°E﻿ / 9.6973; 125.5826﻿ (Tagana-an)"
        ],
        [
            "Tubod"
        ],
        [
            "2nd"
        ],
        [
            "2.8%"
        ],
        [
            "15,043"
        ],
        [
            "14,206"
        ],
        [
            "+1.10%"
        ],
        [
            "45.34"
        ],
        [
            "17.51"
        ],
        [
            "330"
        ],
        [
            "850"
        ],
        [
            "9"
        ],
        [
            "9°33′20″N 125°34′08″E﻿ / ﻿9.5556°N 125.5688°E﻿ / 9.5556; 125.5688﻿ (Tubod)"
        ],
        [
            "Total"
        ],
        [
            "534,636"
        ],
        [
            "485,088"
        ],
        [
            "+1.87%"
        ],
        [
            "1,972.93"
        ],
        [
            "761.75"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "335"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Former names are italicized.^ Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of Surigao del NorteYearPop.±% p.a.1903 37,694—    1918 58,361+2.96%1939 109,758+3.05%1948 137,686+2.55%1960 172,220+1.88%1970 206,487+1.83%1975 244,637+3.46%1980 284,072+3.03%YearPop.±% p.a.1990 327,113+1.42%1995 341,666+0.82%2000 374,465+1.98%2007 409,468+1.24%2010 442,588+2.87%2015 485,088+1.76%2020 534,636+1.93%Data excludes Dinagat Islands that were part of Surigao del Norte until 2006.Source: Philippine Statistics Authority"
        ],
        [
            "The population of Surigao del Norte in the 2020 census was 534,636 people, with a density of 270 inhabitants per square kilometre or 700 inhabitants per square mile."
        ],
        [
            "The inhabitants of the province is mostly of pure/mixed Austronesian stock, with some people of Chinese and Arab heritage.",
            "Spanish and American ancestries are also evident, albeit a minor percentage."
        ],
        [
            "Some 95.80% of the people speak Surigaonon as a parent language.",
            "Cebuano and its dialect Boholano are also present.",
            "Waray is spoken by a small percentage.",
            "A majority are able to speak Tagalog and English as second languages.",
            "A small minority of the population are also speakers of Kamayo and Manobo languages, as well as Ilocano, Hiligaynon, Kapampangan, Maranao, Maguindanaon and Tausug languages."
        ],
        [
            "Religion"
        ],
        [
            "The Roman Catholic Cathedral of San Nicolas de Tolentino at San Nicolas Street, Brgy.",
            "Washington in Surigao City.",
            "The dominant religion is Roman Catholicism with 60 percent adherence.",
            "Other religions include Iglesia Filipina Independiente with 30 and 10 for Protestant Churches."
        ],
        [
            "Flora and fauna"
        ],
        [
            "Coconut trees in the hills west of Tubod"
        ],
        [
            "Mangroves are the major vegetation in the coastal areas of the province, which form interminable marine forests covering 175 square kilometres (68 sq mi) along the coasts of the mainland and the islands of Siargao and Bucas Grande.",
            "The province is host to a variety of marine ecosystems like the lush seagrass beds and coral reefs which are relatively healthy and intact, supporting a rich diversity of marine flora and fauna."
        ],
        [
            "Over 23 different species are caught the whole year round.",
            "Marlin, tuna, lapu-lapu, mollusks, crabs, even squids, stingrays and octopuses can be bought from fish vendors and fishermen."
        ],
        [
            "The unique \"magcono\" (ironwood) forests of Surigao del Norte are one of the watersheds most productive resources.",
            "By its nature, it is slow growing and adapted to a mineralized soil."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Surigao del Norte"
        ],
        [
            "10"
        ],
        [
            "20"
        ],
        [
            "30"
        ],
        [
            "40"
        ],
        [
            "50"
        ],
        [
            "60"
        ],
        [
            "2006  52.70"
        ],
        [
            "2009  57.93"
        ],
        [
            "2012  41.84"
        ],
        [
            "2015  37.17"
        ],
        [
            "2018  34.37"
        ],
        [
            "2021  21.20"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Education"
        ],
        [
            "Alegria National High School"
        ],
        [
            "Culture"
        ],
        [
            "Surigao is home to the Mamanwa ethnic tribe.",
            "Their dances are showcased in a local festival called \"Bonok-Bonok\", held at the feast of San Nicolas de Tolentino which is held annually on September 10.",
            "The Bonok-Bonok depicts the native folks' merry-making to show gratitude to God for bountiful harvest and good health."
        ],
        [
            "A collection of ancient archaeological diggings like burial coffins, jars and Chinese ceramics unearthed in Panhutungan, Placer, is on public display at the Surigaonon Heritage Mini-Museum located at the Boulevard in Surigao City."
        ],
        [
            "Tourist attractions"
        ],
        [
            "Surigao City, the provincial capital, is dubbed as the \"Gateway to Mindanao\".",
            "The ferry landing terminal in Lipata links Mindanao to Luzon through Eastern Visayas.",
            "It annually showcases its distinct cultural heritage through the Bonok-Bonok Maradjao Karadjao Festival."
        ],
        [
            "On the northern side of the province are Siargao and Bucas Grande Islands, known for their long stretch of sugar-fine beaches, vast mangrove forest, and deep waters teeming with marine life."
        ],
        [
            "The Panhutongan and Amoslog archeological excavations in Placer would give a glimpse of the origins of the province and its people."
        ],
        [
            "Surigao City Airport"
        ],
        [
            "Songkoy Spring in the province's mainland"
        ],
        [
            "Cloud 9 Boardwalk in Siargao island"
        ],
        [
            "Notable people"
        ],
        [
            "Erlinda Lavandia – considered as one of the greatest javelin throwers in the history of the Southeast Asian Games.",
            "In 1977, Kuala Lumpur SEA Games, she won the gold medal on a record throw of 45.22 meters.",
            "In 1979 in Jakarta, she improved the SEA Games record at 45.78 meters and broke the record two years later at 46.20 meters in Manila Sea Games."
        ],
        [
            "Martin Andanar – former Secretary for Presidential Communications Operations Office under President Rodrigo Duterte"
        ],
        [
            "Robert Barbers – former Secretary for the Department of Interior and Local Government, served as Philippine Senator in 1998 and was the first police officer to be elected senator"
        ],
        [
            "Jose Sering – former head of the Philippine Olympic Committee POC under President Ferdinand E. Marcos and multi-elected Governor of Surigao del Norte."
        ],
        [
            "Rhee Timbang – former Obispo Maximo (Supreme Bishop) of the Iglesia Filipina Independiente from 2017 to 2023."
        ],
        [
            "References"
        ],
        [
            "^ a b c d \"Province: Surigao del Norte\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b c Census of Population (2020).",
            "Table B - Population and Annual Growth Rates by Province, City, and Municipality - By Region.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ \"philippinecountry.com-This website is for sale!-philippinecountry Resources and Information\".",
            "ww11.philippinecountry.com.",
            "Retrieved January 12, 2022.",
            "{{cite web}}: Cite uses generic title (help)"
        ],
        [
            "^ Philippine Institute of Traditional and Alternative Health Care, Department of Health; University of the Philippines Manila; University of the Philippines Mindanao (2000).",
            "\"Ethnomedical documentation of and community health education for selected Philippine ethnolinguistic groups: the Mandaya people of Davao Oriental, Philippines\" (PDF).",
            "Retrieved April 22, 2015."
        ],
        [
            "^ Benito Francia y Ponce de Leon; Julián González Parrado (1898).",
            "La Islas Filipinas.",
            "Mindanao, Volume 1.",
            "Subinspección de Infantería.",
            "p. 197."
        ],
        [
            "^ Pio A.",
            "De Pazos y Vela-Hidalgo, ed.",
            "(1879).",
            "Jolo, Relato Historico-Militar: Desde Su Descubrimiento Por Los Espanoles en 1578 A Nuestros Dias (1879).",
            "Imprenta y Estereotipia de Polo."
        ],
        [
            "^ Paredes, Francis Tom; Paredes, Sheila (2017).",
            "The Monosyllabic root -ao in Mindanao Languages.",
            "8th Annual In-house Review of the Research Office of Agusan del Sur State College of Agriculture and Technology.",
            "Agusan del Sur State College of Agriculture and Technology."
        ],
        [
            "^ Nowell, C. E. (1962).",
            "\"Antonio Pigafetta's account\".",
            "Magellan's Voyage Around the World.",
            "Evanston: Northwestern University Press.",
            "hdl:2027/mdp.39015008001532.",
            "OCLC 347382."
        ],
        [
            "^ Schreurs, Peter (1983).",
            "\"Surigao, from General Aguinaldo to General Bates (1898-1900)\".",
            "Philippine Quarterly of Culture and Society.",
            "11 (1): 57–68.",
            "ISSN 0115-0243.",
            "JSTOR 29791781."
        ],
        [
            "^ Schreurs, Peter (1983).",
            "\"Surigao, from General Aguinaldo to General Bates (1898-1900)\".",
            "Philippine Quarterly of Culture and Society.",
            "11 (1): 57–68.",
            "ISSN 0115-0243.",
            "JSTOR 29791781."
        ],
        [
            "^ Schreurs, Peter (1983).",
            "\"Surigao, from General Aguinaldo to General Bates (1898-1900)\".",
            "Philippine Quarterly of Culture and Society.",
            "11 (1): 57–68.",
            "ISSN 0115-0243.",
            "JSTOR 29791781."
        ],
        [
            "^ a b c Lancion, Conrado M. Jr. (1995).",
            "\"The Provinces; Surigao del Norte\".",
            "Fast Facts about Philippine Provinces.",
            "cartography by de Guzman, Rey (The 2000 Millenium ed.).",
            "Makati, Metro Manila, Philippines: Tahanan Books.",
            "p. 154.",
            "ISBN 971-630-037-9.",
            "Retrieved April 29, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "2786 - An Act to Create the Provinces of Surigao del Norte and Surigao del Sur\".",
            "Chan Robles Virtual Law Library.",
            "June 19, 1960.",
            "Retrieved January 11, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "6134 - An Act Creating the City of Surigao\".",
            "Chan Robles Virtual Law Library.",
            "August 31, 1970.",
            "Retrieved January 11, 2016."
        ],
        [
            "^ \"Republic Act No.",
            "9355; An Act Creating the Province of Dinagat Islands\" (PDF).",
            "Senate of the Philippines.",
            "Retrieved January 11, 2016."
        ],
        [
            "^ \"About Caraga\".",
            "National Economic and Development Authority Caraga.",
            "Retrieved May 13, 2022."
        ],
        [
            "^ \"Weather forecast for Surigao del Norte, Philippines\".",
            "Storm247.com.",
            "Bergen, NO: StormGeo AS.",
            "Retrieved April 29, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "Highlights of the Philippine Population 2015 Census of Population.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "Population and Annual Growth Rates for The Philippines and Its Regions, Provinces, and Highly Urbanized Cities (PDF).",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ Census of Population and Housing (2010).",
            "\"Caraga\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Surigao del Norte at Wikimedia Commons"
        ],
        [
            " Geographic data related to Surigao del Norte at OpenStreetMap"
        ],
        [
            "Philippine Standard Geographic Code"
        ],
        [
            "Local Governance Performance Management System Archived March 4, 2016, at the Wayback Machine"
        ],
        [
            "Surigao del Norte provincial profile at Philippine Provincial Profiles"
        ],
        [
            "Places adjacent to Surigao del Norte"
        ],
        [
            "Dinagat IslandsHiniyuan Passage"
        ],
        [
            "Bohol Sea"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Philippine Sea"
        ],
        [
            "Agusan del Norte / Surigao del Sur"
        ],
        [
            "vte Province of Surigao del NorteSurigao City (capital)Municipalities"
        ],
        [
            "Alegria"
        ],
        [
            "Bacuag"
        ],
        [
            "Burgos"
        ],
        [
            "Claver"
        ],
        [
            "Dapa"
        ],
        [
            "Del Carmen"
        ],
        [
            "General Luna"
        ],
        [
            "Gigaquit"
        ],
        [
            "Mainit"
        ],
        [
            "Malimono"
        ],
        [
            "Pilar"
        ],
        [
            "Placer"
        ],
        [
            "San Benito"
        ],
        [
            "San Francisco"
        ],
        [
            "San Isidro"
        ],
        [
            "Santa Monica"
        ],
        [
            "Sison"
        ],
        [
            "Socorro"
        ],
        [
            "Tagana-an"
        ],
        [
            "Tubod"
        ],
        [
            "Component city"
        ],
        [
            "Surigao City"
        ],
        [
            "Articles related to Surigao del Norte"
        ],
        [
            "vteCaraga Administrative Region (Region XIII)Regional center"
        ],
        [
            "Butuan"
        ],
        [
            "Provinces"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Butuan"
        ],
        [
            "Component cities"
        ],
        [
            "Bayugan"
        ],
        [
            "Bislig"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Cabadbaran"
        ],
        [
            "Prosperidad"
        ],
        [
            "San Jose"
        ],
        [
            "Surigao City"
        ],
        [
            "Tandag"
        ],
        [
            "Municipalities"
        ],
        [
            "Alegria"
        ],
        [
            "Bacuag"
        ],
        [
            "Barobo"
        ],
        [
            "Basilisa"
        ],
        [
            "Bayabas"
        ],
        [
            "Buenavista"
        ],
        [
            "Bunawan"
        ],
        [
            "Burgos"
        ],
        [
            "Cagdianao"
        ],
        [
            "Cagwait"
        ],
        [
            "Cantilan"
        ],
        [
            "Carmen (Agusan del Norte)"
        ],
        [
            "Carmen (Surigao del Sur)"
        ],
        [
            "Carrascal"
        ],
        [
            "Claver"
        ],
        [
            "Cortes"
        ],
        [
            "Dapa"
        ],
        [
            "Del Carmen"
        ],
        [
            "Dinagat"
        ],
        [
            "Esperanza"
        ],
        [
            "General Luna"
        ],
        [
            "Gigaquit"
        ],
        [
            "Hinatuan"
        ],
        [
            "Jabonga"
        ],
        [
            "Kitcharao"
        ],
        [
            "La Paz"
        ],
        [
            "Lanuza"
        ],
        [
            "Las Nieves"
        ],
        [
            "Lianga"
        ],
        [
            "Libjo"
        ],
        [
            "Lingig"
        ],
        [
            "Loreto (Agusan del Sur)"
        ],
        [
            "Loreto (Dinagat Islands)"
        ],
        [
            "Madrid"
        ],
        [
            "Magallanes"
        ],
        [
            "Mainit"
        ],
        [
            "Malimono"
        ],
        [
            "Marihatag"
        ],
        [
            "Nasipit"
        ],
        [
            "Pilar"
        ],
        [
            "Placer"
        ],
        [
            "Prosperidad"
        ],
        [
            "Remedios T. Romualdez"
        ],
        [
            "Rosario"
        ],
        [
            "San Agustin"
        ],
        [
            "San Benito"
        ],
        [
            "San Francisco (Agusan del Sur)"
        ],
        [
            "San Francisco (Surigao del Norte)"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose"
        ],
        [
            "San Luis"
        ],
        [
            "San Miguel"
        ],
        [
            "Santa Josefa"
        ],
        [
            "Santa Monica"
        ],
        [
            "Santiago"
        ],
        [
            "Sibagat"
        ],
        [
            "Sison"
        ],
        [
            "Socorro"
        ],
        [
            "Tagana-an"
        ],
        [
            "Tagbina"
        ],
        [
            "Tago"
        ],
        [
            "Talacogon"
        ],
        [
            "Trento"
        ],
        [
            "Tubajon"
        ],
        [
            "Tubay"
        ],
        [
            "Tubod"
        ],
        [
            "Veruela"
        ],
        [
            "Mindanao, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Surigao_del_Norte&oldid=1216088839\""
        ],
        [
            "Categories: Surigao del NorteProvinces of the PhilippinesProvinces of CaragaStates and territories established in 19601960 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 errors: generic titleAll articles with dead external linksArticles with dead external links from December 2017Articles with permanently dead external linksUse Philippine English from January 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from January 2023Articles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Cebuano-language textAll articles with unsourced statementsArticles with unsourced statements from June 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersPages using the Kartographer extension"
        ]
    ]
}