{
    "name": "Tarlac",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Tarlac"
        ],
        [
            "44 languages"
        ],
        [
            "Acèhالعربيةتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어Հայերենहिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray吴语中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°30′N 120°30′E﻿ / ﻿15.5°N 120.5°E﻿ / 15.5; 120.5"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Central Luzon, Philippines"
        ],
        [
            "This article is about the province.",
            "For its capital city, see Tarlac City.",
            "For other uses, see Tarlac (disambiguation)."
        ],
        [
            "Province in Central Luzon, PhilippinesTarlacProvinceProvince of Tarlac(from top: left to right) Capas National Shrine, Tarlac Provincial Capitol, Old Camiling site, Tarlac Cathedral, and Tarlac City."
        ],
        [
            "FlagSealNickname: Melting Pot of Central LuzonAnthem: Awit ng TarlacLocation within the PhilippinesOpenStreetMapCoordinates: 15°30′N 120°30′E﻿ / ﻿15.5°N 120.5°E﻿ / 15.5; 120.5CountryPhilippinesRegionCentral LuzonFounded28 May 1873Capitaland largest cityTarlac CityGovernment • TypeSangguniang Panlalawigan • GovernorSusan Y. Sulit (NPC) • Vice GovernorCarlito S. David (NPC) • LegislatureTarlac Provincial BoardArea • Total1,503,456 • Rank18th out of 81 • Density490/km2 (1,300/sq mi)  • Rank13th out of 81Divisions • Independent cities0 • Component cities"
        ],
        [
            "1"
        ],
        [
            " Tarlac City"
        ],
        [
            " • Municipalities"
        ],
        [
            "17"
        ],
        [
            " Anao"
        ],
        [
            " Bamban"
        ],
        [
            " Camiling"
        ],
        [
            " Capas"
        ],
        [
            " Concepcion"
        ],
        [
            " Gerona"
        ],
        [
            " La Paz"
        ],
        [
            " Mayantoc"
        ],
        [
            " Moncada"
        ],
        [
            " Paniqui"
        ],
        [
            " Pura"
        ],
        [
            " Ramos"
        ],
        [
            " San Clemente"
        ],
        [
            " San Jose"
        ],
        [
            " San Manuel"
        ],
        [
            " Santa Ignacia"
        ],
        [
            " Victoria"
        ],
        [
            " • Barangays511 • DistrictsLegislative districts of TarlacDemographics (2000) • Ethnic groupsKapampanganIlocanoPangasinanTagalog • LanguagesKapampanganIlocanoPangasinanTagalogEnglishTime zoneUTC+8 (PST)IDD : area code +63 (0)45ISO 3166 codePH-TARWebsitevisit-tarlac.com"
        ],
        [
            "Tarlac, officially the Province of Tarlac (Kapampangan: Lalawigan ning Tarlac; Pangasinan: Luyag/Probinsia na Tarlac; Ilocano: Probinsia ti Tarlac; Tagalog: Lalawigan ng Tarlac; ), is a landlocked province in the Philippines located in the Central Luzon region.",
            "Its capital is the city of Tarlac.",
            "It is bounded on the north by the province of Pangasinan, Nueva Ecija on the east, Zambales on the west, and Pampanga in the south.",
            "The province comprises three congressional districts and is subdivided into 17 municipalities and one city, Tarlac City, which is the provincial capital."
        ],
        [
            "The province is situated in the heartland of Luzon, in what is known as the Central Plain also spanning the neighbouring provinces of Pampanga, Pangasinan, Nueva Ecija, and Zambales.",
            "Tarlac covers a total land area of 3,053.45 km2 (305,345 ha)."
        ],
        [
            "Early in history, what came to be known as Valenzuela Ranch today was once a thickly-forested area, peopled by roving tribes of nomadic Aetas who are said to be the aboriginal settlers of the Philippines, and for a lengthy period, it was the remaining hinterland of Luzon's Central Plains.",
            "Today, Tarlac is one of the most multi-cultural provinces in the region for having a mixture of four distinct ethnic groups: the Kapampangans, the Pangasinans, the Ilocanos, and the Tagalogs.",
            "It is also known for its fine food and vast sugar and rice plantations in Central Luzon."
        ],
        [
            "History"
        ],
        [
            "This section needs additional citations for verification.",
            "Please help improve this article by adding citations to reliable sources in this section.",
            "Unsourced material may be challenged and removed.Find sources: \"Tarlac\" – news · newspapers · books · scholar · JSTOR (July 2022) (Learn how and when to remove this message)"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "Tarlac's name is a Hispanized derivation from a talahib weed called Malatarlak, a Pangasinan term.",
            "Tarlac was originally divided into two parts: the southern division belonging to Pampanga and the northern division belonging to Pangasinan.",
            "It was the last province in Central Luzon to be organized under the Spanish colonial administration in 1874.",
            "Its nucleus were the towns of Concepcion, Capas, Bamban, Mabalacat, Magalang, Porac, Floridablanca, Victoria, and Tarlac which constituted a military comandancia.",
            "Some of these municipalities were returned to Pampanga but the rest were incorporated into the new province of Tarlac."
        ],
        [
            "Unlike other provinces in Central Luzon, Tarlac was relatively free from revolts during the Spanish regime before the late 1800s rose.",
            "Only the rebellion started by Juan de la Cruz Palaris in Pangasinan spread to the northern portion of Tarlac."
        ],
        [
            "Philippine revolution"
        ],
        [
            "During the Philippine Revolution of 1896, Tarlac was among the first eight provinces to rise against Spain, alongside neighbouring Pampanga.",
            "It became the new seat of the first Philippine Republic in March 1899 when General Emilio Aguinaldo abandoned the former capital, Malolos, Bulacan.",
            "This lasted only for a month before the seat was moved to Nueva Ecija in Aguinaldo's attempt to elude the pursuing Americans."
        ],
        [
            "American invasion era"
        ],
        [
            "On October 23, 1899, Gregorio Aglipay, military vicar general of the revolutionary forces, called the Filipino clergy to a conference in Paniqui.",
            "There, they drafted the constitution of the Philippine Independent Church.",
            "They called for the Filipinization of the clergy, which eventually led to a separation from the Roman Catholic Church in the Philippines."
        ],
        [
            "Tarlac was captured by American forces in November 1899.",
            "A civil government was established in the province in 1901."
        ],
        [
            "Japanese occupation era"
        ],
        [
            "During World War II, Camp O'Donnell in Capas became the terminal point of the infamous Bataan Death March of Filipino and American soldiers who surrendered at Bataan on April 9, 1942.",
            "Many prisoners died of hunger, disease and/or execution.",
            "The general headquarters of the Philippine Commonwealth Army was established from January 3, 1942, to June 30, 1946, and the 3rd Constabulary Regiment of the Philippine Constabulary was founding again from October 28, 1944, to June 30, 1946, and military stationed in the province of Tarlac and some parts in Central Luzon due to Japanese Occupation."
        ],
        [
            "In early 1945, combined American and Filipino military forces with the recognized Aringay Command guerrillas liberated Camp O'Donnell.",
            "The raid in Capas resulted in the rescue of American, Filipino and other allied Prisoners of War."
        ],
        [
            "From January 20, 1945, to August 15, 1945, Tarlac was recaptured by combined Filipino and American troops together with the recognized guerrilla fighters against the Japanese Imperial forces during the liberation and beginning for the Battle of Tarlac under the Luzon Campaign."
        ],
        [
            "Postwar era"
        ],
        [
            "After the social and economic upheavals of the war and with government institutions still in their nascent form after the recognition of Philippine Independence by the international community, the first few decades after the end of the war were marked by dissatisfaction and social tension."
        ],
        [
            "The Filipino communist Hukbalahap guerrilla movement formed by the farmers of Central Luzon to fight the Japanese occupation, had found themselves sidelined by the new post-independence Philippine government which had taken up the fear of communist influence which marked the beginning of the cold war in the west.",
            "So they decided to extended their fight into a rebellion against the new government, only to be put down through a series of reforms and military victories by Defense Secretary, and later President, Ramon Magsaysay."
        ],
        [
            "Ultimately more effective than those who took up arms were the numerous political and labor movements who kept working towards agricultural land reform and stronger labor rights, with laborers' and farmers' protests gathering enough steam that several Philippine presidents were forced to meet with them and then concede to their demands.",
            "Among the most successful of these  were the Land Justice March of the political group known as the Filipino Agrarian Reform Movement (FARM), which intended to march from Tarlac to Malacañang in 1969, although President Marcos was forced to give in to their demands early, meeting them while they were still at Camp Servillano Aquino in Tarlac City itself."
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "The beginning months of the 1970s marked a period of turmoil and change in the Philippines, as well as in Tarlac."
        ],
        [
            "With only a year left in his last constitutionally allowed term as president Ferdinand Marcos placed the Philippines under Martial Law in September 1972 and thus retained the position for fourteen more years."
        ],
        [
            "Martial Law had immediate political impacts in Tarlac, since political leaders who were critical of Marcos were immediately jailed.",
            "This included Senator and Concepcion native Ninoy Aquino, and Bamban Mayor Pedro D. Mendiola  who was imprisoned in Camp Crame.",
            "Other Tarlaqueño Marcos critics who had roles in government, such as Development Academy of the Philippines (DAP) executive vice president Horacio Morales, tried to stay so they could pursue change from within, but eventually could not reconcile themselves with the idea of working within the dictatorship.",
            "were killed in various encounters with Marcos' forces."
        ],
        [
            "Ninoy Aquino was eventually assassinated in August 1983, igniting protests throughout the Philippines which would eventually force Marcos to announce a snap election in February 1986.",
            "Even then, those who resisted Marcos were targetted for death, such as in the case of oppositionist campaign organizer Jeremias De Jesus political organizer, who was assassinated shortly before elections"
        ],
        [
            "Contemporary"
        ],
        [
            "United States and Philippine troops during a military exercise in Crow Valley, Tarlac"
        ],
        [
            "Military testing ground"
        ],
        [
            "The Philippine Army has used Crow Valley in the borders of Barangay Patling and Santa Lucia in Capas, Tarlac as a testing ground for both Philippine forces and allies.",
            "Many of the Philippine military testings were done on March 17, 2006 most likely as a part of Operation Enduring Freedom - Philippines."
        ],
        [
            "Exercise Balikatan"
        ],
        [
            "Tarlac plays a big role in the annual joint Balikatan Exercise as it is a main exercise ground of the USA and Philippine Army."
        ],
        [
            "The exercise in Tarlac conducts Combat exercise including Aviation, Artillery and Small Arms training.",
            "It is conducted in Crow Valley in Capas, Tarlac.",
            "Since 2022 with more than 10,000+ Military Personnel and increasing."
        ],
        [
            "Geography"
        ],
        [
            "Landscape along Tarlac City"
        ],
        [
            "The landlocked province is situated at the center of the central plains of Luzon, landlocked by four provinces: Pampanga on the south, Nueva Ecija on the east, Pangasinan on the north, and Zambales on the west.",
            "The province covers a total area of 3,053.60 square kilometres (1,179.00 sq mi).",
            "Approximately 75% of the province is plains while the rest is hilly to slightly mountainous."
        ],
        [
            "Eastern Tarlac is a plain, while Western Tarlac is hilly to slightly mountainous.",
            "Because of this, the province includes a large portion of mountains like Mt.",
            "Telakawa (Straw Hat Mountain), located at Capas, Tarlac.",
            "Mt.",
            "Bueno, Mt.",
            "Mor-Asia and Mt.",
            "Canouman are also located in Capas as well as Mt.",
            "Dalin.",
            "The other mountains are Mt.",
            "Dueg and Mt.",
            "Maasin, found in the municipality of San Clemente.",
            "Also noted are Mt.",
            "Damas of Camiling.",
            "A portion of Mount Pinatubo (whose summit crater rests in neighbouring Zambales) also rests in Bamban and Capas.",
            "The whole of Mayantoc and San Jose are mountainous so it is suitable for the highest natural resources and forest products in the province such as coal, iron, copper, temperate-climate fruits and vegetables, fire logs, sand, rocks and forest animals such as wild boar and deer.",
            "The main water sources for agriculture include the Tarlac River at Tarlac City, the Lucong and Parua rivers in Concepcion, Sacobia-Bamban River in Bamban and the Rio Chico in La Paz."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Tarlac is subdivided into 17 municipalities and 1 component city, all encompassed by three congressional districts.",
            "There are a total of 511 barangays comprising the province."
        ],
        [
            "Political map of Tarlac"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Anao"
        ],
        [
            "1st"
        ],
        [
            "0.8%"
        ],
        [
            "12,208"
        ],
        [
            "11,528"
        ],
        [
            "+1.10%"
        ],
        [
            "23.87"
        ],
        [
            "9.22"
        ],
        [
            "510"
        ],
        [
            "1,300"
        ],
        [
            "18"
        ],
        [
            "15°43′45″N 120°37′41″E﻿ / ﻿15.7293°N 120.6281°E﻿ / 15.7293; 120.6281﻿ (Anao)"
        ],
        [
            "Bamban"
        ],
        [
            "3rd"
        ],
        [
            "5.2%"
        ],
        [
            "78,260"
        ],
        [
            "69,466"
        ],
        [
            "+2.30%"
        ],
        [
            "251.98"
        ],
        [
            "97.29"
        ],
        [
            "310"
        ],
        [
            "800"
        ],
        [
            "15"
        ],
        [
            "15°16′24″N 120°34′00″E﻿ / ﻿15.2732°N 120.5668°E﻿ / 15.2732; 120.5668﻿ (Bamban)"
        ],
        [
            "Camiling"
        ],
        [
            "1st"
        ],
        [
            "5.8%"
        ],
        [
            "87,319"
        ],
        [
            "83,248"
        ],
        [
            "+0.91%"
        ],
        [
            "140.53"
        ],
        [
            "54.26"
        ],
        [
            "620"
        ],
        [
            "1,600"
        ],
        [
            "61"
        ],
        [
            "15°41′19″N 120°24′50″E﻿ / ﻿15.6887°N 120.4140°E﻿ / 15.6887; 120.4140﻿ (Camiling)"
        ],
        [
            "Capas"
        ],
        [
            "3rd"
        ],
        [
            "10.4%"
        ],
        [
            "156,056"
        ],
        [
            "140,202"
        ],
        [
            "+2.06%"
        ],
        [
            "377.60"
        ],
        [
            "145.79"
        ],
        [
            "410"
        ],
        [
            "1,100"
        ],
        [
            "20"
        ],
        [
            "15°20′10″N 120°35′24″E﻿ / ﻿15.3361°N 120.5899°E﻿ / 15.3361; 120.5899﻿ (Capas)"
        ],
        [
            "Concepcion"
        ],
        [
            "3rd"
        ],
        [
            "11.3%"
        ],
        [
            "169,953"
        ],
        [
            "154,188"
        ],
        [
            "+1.87%"
        ],
        [
            "234.67"
        ],
        [
            "90.61"
        ],
        [
            "720"
        ],
        [
            "1,900"
        ],
        [
            "45"
        ],
        [
            "15°19′27″N 120°39′19″E﻿ / ﻿15.3243°N 120.6554°E﻿ / 15.3243; 120.6554﻿ (Concepcion)"
        ],
        [
            "Gerona"
        ],
        [
            "2nd"
        ],
        [
            "6.3%"
        ],
        [
            "94,485"
        ],
        [
            "87,531"
        ],
        [
            "+1.47%"
        ],
        [
            "128.89"
        ],
        [
            "49.76"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "44"
        ],
        [
            "15°36′25″N 120°35′55″E﻿ / ﻿15.6069°N 120.5985°E﻿ / 15.6069; 120.5985﻿ (Gerona)"
        ],
        [
            "La Paz"
        ],
        [
            "3rd"
        ],
        [
            "4.6%"
        ],
        [
            "68,952"
        ],
        [
            "64,017"
        ],
        [
            "+1.42%"
        ],
        [
            "114.33"
        ],
        [
            "44.14"
        ],
        [
            "600"
        ],
        [
            "1,600"
        ],
        [
            "21"
        ],
        [
            "15°26′28″N 120°43′44″E﻿ / ﻿15.4411°N 120.7288°E﻿ / 15.4411; 120.7288﻿ (La Paz)"
        ],
        [
            "Mayantoc"
        ],
        [
            "1st"
        ],
        [
            "2.2%"
        ],
        [
            "32,597"
        ],
        [
            "32,232"
        ],
        [
            "+0.21%"
        ],
        [
            "311.42"
        ],
        [
            "120.24"
        ],
        [
            "100"
        ],
        [
            "260"
        ],
        [
            "24"
        ],
        [
            "15°37′09″N 120°22′47″E﻿ / ﻿15.6193°N 120.3798°E﻿ / 15.6193; 120.3798﻿ (Mayantoc)"
        ],
        [
            "Moncada"
        ],
        [
            "1st"
        ],
        [
            "4.2%"
        ],
        [
            "62,819"
        ],
        [
            "57,787"
        ],
        [
            "+1.60%"
        ],
        [
            "85.75"
        ],
        [
            "33.11"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "37"
        ],
        [
            "15°44′01″N 120°34′21″E﻿ / ﻿15.7336°N 120.5726°E﻿ / 15.7336; 120.5726﻿ (Moncada)"
        ],
        [
            "Paniqui"
        ],
        [
            "1st"
        ],
        [
            "6.9%"
        ],
        [
            "103,003"
        ],
        [
            "92,606"
        ],
        [
            "+2.05%"
        ],
        [
            "105.16"
        ],
        [
            "40.60"
        ],
        [
            "980"
        ],
        [
            "2,500"
        ],
        [
            "35"
        ],
        [
            "15°40′07″N 120°35′09″E﻿ / ﻿15.6686°N 120.5858°E﻿ / 15.6686; 120.5858﻿ (Paniqui)"
        ],
        [
            "Pura"
        ],
        [
            "1st"
        ],
        [
            "1.7%"
        ],
        [
            "25,781"
        ],
        [
            "23,712"
        ],
        [
            "+1.61%"
        ],
        [
            "31.01"
        ],
        [
            "11.97"
        ],
        [
            "830"
        ],
        [
            "2,100"
        ],
        [
            "16"
        ],
        [
            "15°37′25″N 120°38′49″E﻿ / ﻿15.6236°N 120.6469°E﻿ / 15.6236; 120.6469﻿ (Pura)"
        ],
        [
            "Ramos"
        ],
        [
            "1st"
        ],
        [
            "1.5%"
        ],
        [
            "22,879"
        ],
        [
            "21,350"
        ],
        [
            "+1.33%"
        ],
        [
            "24.40"
        ],
        [
            "9.42"
        ],
        [
            "940"
        ],
        [
            "2,400"
        ],
        [
            "9"
        ],
        [
            "15°39′57″N 120°38′23″E﻿ / ﻿15.6658°N 120.6397°E﻿ / 15.6658; 120.6397﻿ (Ramos)"
        ],
        [
            "San Clemente"
        ],
        [
            "1st"
        ],
        [
            "0.9%"
        ],
        [
            "13,181"
        ],
        [
            "12,657"
        ],
        [
            "+0.78%"
        ],
        [
            "49.73"
        ],
        [
            "19.20"
        ],
        [
            "270"
        ],
        [
            "700"
        ],
        [
            "12"
        ],
        [
            "15°42′41″N 120°21′39″E﻿ / ﻿15.7114°N 120.3608°E﻿ / 15.7114; 120.3608﻿ (San Clemente)"
        ],
        [
            "San Jose"
        ],
        [
            "2nd"
        ],
        [
            "2.7%"
        ],
        [
            "41,182"
        ],
        [
            "36,253"
        ],
        [
            "+2.46%"
        ],
        [
            "592.81"
        ],
        [
            "228.89"
        ],
        [
            "69"
        ],
        [
            "180"
        ],
        [
            "13"
        ],
        [
            "15°27′28″N 120°28′06″E﻿ / ﻿15.4578°N 120.4683°E﻿ / 15.4578; 120.4683﻿ (San Jose)"
        ],
        [
            "San Manuel"
        ],
        [
            "1st"
        ],
        [
            "1.9%"
        ],
        [
            "28,387"
        ],
        [
            "25,504"
        ],
        [
            "+2.06%"
        ],
        [
            "42.10"
        ],
        [
            "16.25"
        ],
        [
            "670"
        ],
        [
            "1,700"
        ],
        [
            "15"
        ],
        [
            "15°47′56″N 120°36′24″E﻿ / ﻿15.7989°N 120.6068°E﻿ / 15.7989; 120.6068﻿ (San Manuel)"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "1st"
        ],
        [
            "3.4%"
        ],
        [
            "51,626"
        ],
        [
            "47,538"
        ],
        [
            "+1.58%"
        ],
        [
            "146.07"
        ],
        [
            "56.40"
        ],
        [
            "350"
        ],
        [
            "910"
        ],
        [
            "24"
        ],
        [
            "15°36′54″N 120°26′11″E﻿ / ﻿15.6149°N 120.4364°E﻿ / 15.6149; 120.4364﻿ (Santa Ignacia)"
        ],
        [
            "Tarlac City"
        ],
        [
            "†"
        ],
        [
            "Lone"
        ],
        [
            "25.6%"
        ],
        [
            "385,398"
        ],
        [
            "342,493"
        ],
        [
            "+2.27%"
        ],
        [
            "274.66"
        ],
        [
            "106.05"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "76"
        ],
        [
            "15°29′09″N 120°35′22″E﻿ / ﻿15.4859°N 120.5895°E﻿ / 15.4859; 120.5895﻿ (Tarlac City)"
        ],
        [
            "Victoria"
        ],
        [
            "2nd"
        ],
        [
            "4.6%"
        ],
        [
            "69,370"
        ],
        [
            "63,715"
        ],
        [
            "+1.63%"
        ],
        [
            "111.51"
        ],
        [
            "43.05"
        ],
        [
            "620"
        ],
        [
            "1,600"
        ],
        [
            "26"
        ],
        [
            "15°34′37″N 120°40′52″E﻿ / ﻿15.5770°N 120.6812°E﻿ / 15.5770; 120.6812﻿ (Victoria)"
        ],
        [
            "Total"
        ],
        [
            "1,503,456"
        ],
        [
            "1,366,027"
        ],
        [
            "+1.84%"
        ],
        [
            "3,046.49"
        ],
        [
            "1,176.26"
        ],
        [
            "490"
        ],
        [
            "1,300"
        ],
        [
            "511"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            " †  Provincial capital and component city     Municipality"
        ],
        [
            "A.",
            "^  Coordinates mark the city/town center, and are sortable by latitude."
        ],
        [
            "Barangays"
        ],
        [
            "The 17 municipalities and 1 city of the province comprise a total of 511 barangays, with Cristo Rey in Capas as the most populous in 2010, and Malonzo in Bamban as the least."
        ],
        [
            "Further information: List of barangays in Tarlac"
        ],
        [
            "Climate"
        ],
        [
            "Like the rest of Central Luzon, the province has three distinct seasons: summer from March to June, monsoon rain from July to early October, and monsoon winter from late October to February.",
            "Summer months, especially during May bring severe thunderstorms with high winds, lightnings, and hails.",
            "It is the coldest province in the region, with a yearly average of 23 °C (73 °F).",
            "Cold spell is not common, which gradually receives unusual average temperature of 17 °C (63 °F), while the maximum daytime peaks at 27 °C (81 °F).",
            "It is also the windiest province in the region during February and March due to its widely lowland altitude and extreme climate transition.",
            "The lowest temperature ever recorded is 11.2 °C (52.2 °F) and the highest temperature is at 38.8 °C (101.8 °F).",
            "Aside air temperature, heat index is the most common calculated temperature during extreme weather observances especially dry season.",
            "The province usually experiences a maximum heat index ranging from 40 °C (104 °F) to 50 °C (122 °F) based on the forecasts reported by Philippine Atmospheric Geophysical and Astronomical Services Administration."
        ],
        [
            "Climate data for Tarlac"
        ],
        [
            "Month"
        ],
        [
            "Jan"
        ],
        [
            "Feb"
        ],
        [
            "Mar"
        ],
        [
            "Apr"
        ],
        [
            "May"
        ],
        [
            "Jun"
        ],
        [
            "Jul"
        ],
        [
            "Aug"
        ],
        [
            "Sep"
        ],
        [
            "Oct"
        ],
        [
            "Nov"
        ],
        [
            "Dec"
        ],
        [
            "Year"
        ],
        [
            "Mean daily maximum °C (°F)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "34.4(93.9)"
        ],
        [
            "36.2(97.2)"
        ],
        [
            "35.3(95.5)"
        ],
        [
            "34.0(93.2)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "32.1(89.8)"
        ],
        [
            "32.4(90.3)"
        ],
        [
            "32.8(91.0)"
        ],
        [
            "32.7(90.9)"
        ],
        [
            "32.0(89.6)"
        ],
        [
            "33.3(91.9)"
        ],
        [
            "Mean daily minimum °C (°F)"
        ],
        [
            "21.1(70.0)"
        ],
        [
            "21.6(70.9)"
        ],
        [
            "22.7(72.9)"
        ],
        [
            "23.8(74.8)"
        ],
        [
            "24.6(76.3)"
        ],
        [
            "24.5(76.1)"
        ],
        [
            "24.2(75.6)"
        ],
        [
            "24.4(75.9)"
        ],
        [
            "24.1(75.4)"
        ],
        [
            "23.7(74.7)"
        ],
        [
            "22.9(73.2)"
        ],
        [
            "21.9(71.4)"
        ],
        [
            "23.3(73.9)"
        ],
        [
            "Average rainy days"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "13"
        ],
        [
            "16"
        ],
        [
            "22"
        ],
        [
            "21"
        ],
        [
            "20"
        ],
        [
            "10"
        ],
        [
            "8"
        ],
        [
            "4"
        ],
        [
            "122"
        ],
        [
            "Source: Storm247"
        ],
        [
            "Demographics"
        ],
        [
            "Population census of TarlacYearPop.±% p.a.1903 135,107—    1918 171,876+1.62%1939 264,379+2.07%1948 327,018+2.39%1960 426,647+2.24%YearPop.±% p.a.1970 559,708+2.75%1975 640,899+2.75%1980 688,457+1.44%1990 859,708+2.25%1995 945,810+1.80%YearPop.±% p.a.2000 1,068,783+2.65%2007 1,243,449+2.11%2010 1,273,240+0.87%2015 1,366,027+1.35%2020 1,503,456+1.90%Source: Philippine Statistics Authority"
        ],
        [
            "The population of Tarlac in the 2020 census was 1,503,456 people, with a density of 490 inhabitants per square kilometre or 1,300 inhabitants per square mile."
        ],
        [
            "There are two predominant ethnic groups in the province: the Kapampangans that mainly predominate the province's southern portion and the Ilocanos that mainly predominate the province's northern portion.",
            "Both ethno-linguistic groups intermingle together in the provincial capital.",
            "The Tagalogs and Pangasinans constitute the rest of the provincial populace; Tagalogs arrived from Nueva Ecija and Bulacan, others from Zambales, Bataan, and Aurora, most of them live at the boundary with Nueva Ecija."
        ],
        [
            "Language"
        ],
        [
            "Kapampangan and Ilocano are mainly used throughout the entire province, as well as Pangasinan and Tagalog.",
            "Ilocanos and Tagalogs however, speak their respective languages with a Kapampangan/Pangasinan accent, as descendants of Ilocanos and Tagalogs from the first generations who lived in the province learned Kapampangan and/or Pangasinan.",
            "Ethnic groups who grew up within environment of other ethnic group also speak other native languages as second languages, like Kapampangans who grew up within an Ilocano or Pangasinan population speak Ilocano or Pangasinan.",
            "As Tarlac is part of Central Luzon, Tagalog/Filipino is spoken as lingua franca between different languages.",
            "English is widely spoken and understood as well, especially in professional and educational establishments."
        ],
        [
            "Languages Spoken in Tarlac"
        ],
        [
            "Language"
        ],
        [
            "Percentage of Native Speakers"
        ],
        [
            "Kapampangan"
        ],
        [
            "43.1%"
        ],
        [
            "Ilocano"
        ],
        [
            "39.8%"
        ],
        [
            "Tagalog"
        ],
        [
            "12.1%"
        ],
        [
            "Pangasinan"
        ],
        [
            "0.01%"
        ],
        [
            "Others"
        ],
        [
            "2.1%"
        ],
        [
            "Religion"
        ],
        [
            "The Old St. Michael the Archangel Parish Church was burned in 1997"
        ],
        [
            "Spanish influence is very visible in the province as shown by religious adherence.",
            "Roman Catholicism is professed by 80%-83% of the population.",
            "The St. Michael Archangel Parish Church in Camiling was the oldest religious structure in the entire province until it burned down in 1997."
        ],
        [
            "According to 2010 Census, other prominent Christian groups include the Iglesia ni Cristo (7.43%), Aglipayan Church  (2.24%), Evangelicals (1.97%), Jehovah's Witnesses (0.64%) and others.",
            "Muslims, Anitists, animists, and atheists are also present in the province."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Tarlac"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "2006  18.15"
        ],
        [
            "2009  17.50"
        ],
        [
            "2012  16.56"
        ],
        [
            "2015  16.78"
        ],
        [
            "2018  10.46"
        ],
        [
            "2021  8.10"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Rice plantations in Gerona"
        ],
        [
            "The economy of Tarlac is predominantly agricultural.",
            "It is among the biggest producers of rice and sugarcane (the principal crops) in Central Luzon.",
            "Other major crops are corn and coconuts, fruits (bananas, calamansi and mangoes) and vegetables (eggplants, garlic and onions)."
        ],
        [
            "Because the province is landlocked, its fish production is limited to fishpens, but it has vast river systems and irrigation.",
            "On the Zambales boundary to its west, forest land provides timber for the logging industry.",
            "Mineral reserves such as manganese and iron can also be found along the western section."
        ],
        [
            "Tarlac has its own rice and corn mills, sawmills and logging outfits.",
            "It has three sugar-refining centrals and hosts many sugar products in Central Luzon, especially the Muscovado sugar of the municipality of Victoria.",
            "Other firms service agricultural needs such as fertilizers.",
            "Among its cottage industries, ceramics has become available because of the abundant supply of clay.",
            "Some of the major industries here involve making chicharon (pork skin chips) and iniruban in the municipality of Camiling and Ilang-Ilang products of Anao.",
            "Tilapia production is also improving in Tarlac, with an aim to make the province the second \"Tilapia Capital of Central Luzon\" after its mother province, Pampanga."
        ],
        [
            "Culture"
        ],
        [
            "Belenismo sa Tarlac"
        ],
        [
            "Belenismo sa Tarlac was launched by Isabel Cojuangco-Suntay, sister of former Ambassador Eduardo Cojuangco Jr., to transform the province into the Belén Capital of the Philippines.",
            "The Belen Festival began in September 2007, with the first Belen-making workshop conducted on December 16, 2007.",
            "Organizers have intended the festival to become an annual event in the province.",
            "Senator Loren Legarda led the awarding of the first Belen-making competition where Tarlac PNP Office Belen, built by at least 24 policemen, won the first prize."
        ],
        [
            "Belenismo in Spanish means the art of making Belén, a representation of the Nativity scene in which the Holy Family (Joseph, Mary and the infant Jesus) is visited by the three wise men who came to the manger through the guidance of a star."
        ],
        [
            "Chicharon Iniruban Festival"
        ],
        [
            "It is a festivity that is yearly celebrated in the town of Camiling during the last week of October.",
            "It is intended as a preparation for All Saints' Day and a Thanksgiving Celebration for the good harvest and for the good quality of meat products especially the chicharon or Bagnet.",
            "It also features the exotic and delicious rice cake Iniruban, as called by Ilocanos.",
            "The festival's highlights are the street dancing competition, Miss Iniruban beauty pageant, and the municipality's agri-trade.",
            "It is the oldest cultural celebration in the province introduced in 2000."
        ],
        [
            "Provincial capital"
        ],
        [
            "The highest seat of political power of the province is located on a hill in Barangay San Vicente, Tarlac City.",
            "The present structure was finished in 1909.",
            "During the Japanese occupation, the provincial capitol was vacated and used as the provincial headquarters of the Imperial Army.",
            "The capitol suffered great damages during the Second World War, but afterwards, in 1946, the United States of America helped rebuild and improve its structure.",
            "Because of its historical background, the picture of the capitol façade appeared in the previous version of the 500 peso bill."
        ],
        [
            "Notable people"
        ],
        [
            "National heroes and patriots"
        ],
        [
            "Francisco Makabulos – Filipino Revolutionary General, and former Governor of Tarlac"
        ],
        [
            "Servillano Aquino – Filipino Revolutionary General"
        ],
        [
            "Benigno Aquino Jr. – former Philippine senator and opposition leader during Martial Law dictatorship of dictator Ferdinand Marcos"
        ],
        [
            "Politics and government"
        ],
        [
            "Corazon Aquino – 11th President of the Philippines"
        ],
        [
            "Benigno Aquino III – 15th President of the Philippines"
        ],
        [
            "Carlos P. Romulo – 4th President of the United Nations General Assembly, 14th Secretary of the Department of the Foreign Affairs, 11th President of the University of the Philippines, and National Artist of the Philippines for Literature"
        ],
        [
            "Onofre Corpuz – 23rd Secretary of the Department of Education, 13th President of the University of the Philippines, and National Scientist of the Philippines for Political Economics and Government"
        ],
        [
            "Horacio Morales – 8th Secretary of the Department of Agrarian Reform"
        ],
        [
            "Alberto Romulo –  23rd Secretary of the Department of the Foreign Affairs, 34th Executive Secretary of the Philippines"
        ],
        [
            "Jesli Lapus – 31st Secretary of the Department of Trade and Industry, and 34th Secretary of the Department of Education"
        ],
        [
            "Gilbert Teodoro – 25th Secretary of the Department of National Defense"
        ],
        [
            "Voltaire Gazmin – 26th Secretary of the Department of National Defense"
        ],
        [
            "Benigno Aquino Sr. – 6th Speaker of the House of Representatives of the Philippines, and 10th Secretary of the Department of Agriculture and former Philippine senator"
        ],
        [
            "Macario Peralta Jr. – former Philippine senator, and 13th Secretary of the Department of National Defense"
        ],
        [
            "Jose Roy – former Philippine senator"
        ],
        [
            "Eva Estrada Kalaw – former Philippine senator"
        ],
        [
            "Tessie Aquino-Oreta – former Philippine senator"
        ],
        [
            "César Bengzon – 9th Chief Justice of the Supreme Court of the Philippines, and first Filipino Justice of the International Court of Justice"
        ],
        [
            "Jesus Barrera – 67th Associate Justice of the Supreme Court of the Philippines"
        ],
        [
            "Paulino Santos – 2nd Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Ricardo David – 41st Chief of Staff of the Armed Forces of the Philippines"
        ],
        [
            "Nicanor Bartolome - 16th Chief of the Philippine National Police"
        ],
        [
            "Historical Personalities"
        ],
        [
            "Leonor Rivera – José Rizal's second cousin and love interest well known as Maria Clara."
        ],
        [
            "Bernabe Buscayno – founder of the New People's Army, the military wing of the Communist Party of the Philippines."
        ],
        [
            "Arts and Sciences"
        ],
        [
            "Gregorio C. Brillantes - A multi-awarded fiction writer."
        ],
        [
            "Alex Niño - Filipino comics artist best known for his work for the American publishers DC Comics, Marvel Comics, and Warren Publishing, and in Heavy Metal magazine."
        ],
        [
            "Xiao Chua - public historian"
        ],
        [
            "Religion"
        ],
        [
            "Alberto Ramento - ninth Supreme Bishop and Chairperson of the Supreme Council of Bishops of the Iglesia Filipina Independiente (IFI)."
        ],
        [
            "Business"
        ],
        [
            "Danding Cojuangco - chairman and CEO of San Miguel Corporation, the largest food and beverage corporation in the Philippines and Southeast Asia.",
            "He  was widely considered a crony during the Marcos regime."
        ],
        [
            "Entertainer"
        ],
        [
            "Ion Perez – tv host personality."
        ],
        [
            "Lorna Tolentino – veteran actress."
        ],
        [
            "See also"
        ],
        [
            "Roman Catholic Diocese of Tarlac"
        ],
        [
            "Super regions of the Philippines"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "References"
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati City, Philippines: National Statistical Coordination Board.",
            "Retrieved 21 August 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 8 July 2021."
        ],
        [
            "^ \"Tarlac: Population Reached a Million Mark (Results from the 2000 Census of Population and Housing, NSO)\".",
            "Philippine Statistics Authority.",
            "August 13, 2002.",
            "Retrieved 15 December 2015."
        ],
        [
            "^ \"History of Tarlac\".",
            "Tarlac Province Official Portal.",
            "Archived from the original on 22 January 2016.",
            "Retrieved 30 August 2015."
        ],
        [
            "^ Magno, Alexander R., ed.",
            "(1998).",
            "\"Bandits, outlaws, and Robin Hoods\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ a b c https://www.officialgazette.gov.ph/edsa/the-ph-protest/"
        ],
        [
            "^ Jeff Goodwin, No Other Way Out, Cambridge University Press, 2001, p.119, ISBN 0-521-62948-9, ISBN 978-0-521-62948-5"
        ],
        [
            "^ Robles, Raissa (2016).",
            "Marcos Martial Law: Never Again.",
            "Filipinos for a Better Philippines, Inc."
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Cororaton, Cesar B.",
            "\"Exchange Rate Movements in the Philippines\".",
            "DPIDS Discussion Paper Series 97-05: 3, 19."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Magno, Alexander R., ed.",
            "(1998).",
            "\"Democracy at the Crossroads\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ \"Alfred McCoy, Dark Legacy: Human rights under the Marcos regime\".",
            "Ateneo de Manila University.",
            "September 20, 1999."
        ],
        [
            "^ Abinales, P.N.",
            "; Amoroso, Donna J.",
            "(2005).",
            "State and society in the Philippines.",
            "Lanham, MD: Rowman & Littlefield Publishers.",
            "ISBN 978-0742510234.",
            "OCLC 57452454."
        ],
        [
            "^ \"Gone too soon: 7 youth leaders killed under Martial Law\".",
            "Rappler.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ Rocamora, Rick (2023).",
            "Dark Memories of Torture, Incarceration, Disappeareance, and Death under Ferdinand E. Marcos Sr.'s Martial Law.",
            "Quezon City.",
            "ISBN 979-8-218-96751-2.",
            "{{cite book}}:  CS1 maint: location missing publisher (link)"
        ],
        [
            "^ Panaglagip: The North Remembers – Martial Law Stories of Struggle and Survival Edited by Joanna K. Cariño and Luchie B. Maranan."
        ],
        [
            "^ de Villa, Kathleen (September 22, 2018).",
            "\"Remnants of a dark era\".",
            "Retrieved October 19, 2022."
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/horacio-boy-morales/"
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/teresito-sison/"
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/eduardo-aquino/"
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/merardo-arce/"
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/benedicto-pasetes/"
        ],
        [
            "^ https://bantayogngmgabayani.org/bayani/jeremias-de-jesus/"
        ],
        [
            "^ \"Tarlac Military Testing Ground\".",
            "Retrieved 30 August 2015."
        ],
        [
            "^ a b c \"Province: Tarlac\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved 8 January 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved 20 June 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved 29 June 2016."
        ],
        [
            "^ \"Weather forecast for Tarlac, Philippines\".",
            "Storm247.com.",
            "Bergen, NO: StormGeo AS.",
            "Retrieved 22 April 2016."
        ],
        [
            "^"
        ],
        [
            "^ https://www.psa.gov.ph/system/files/main-publication/TARLAC_FINAL%20PDF.pdf"
        ],
        [
            "^ Visit Central Luzon: Tarlac"
        ],
        [
            "^ \"MAP: Catholicism in the Philippines\".",
            "18 January 2015."
        ],
        [
            "^ \"Archived copy\" (PDF).",
            "Archived from the original (PDF) on 2014-01-14.",
            "Retrieved 2017-10-09.",
            "{{cite web}}:  CS1 maint: archived copy as title (link)"
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "29 November 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "8 February 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "27 August 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "4 June 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "15 August 2022.",
            "Retrieved 28 April 2024."
        ],
        [
            "^ \"Belenismo sa Tarlac\".",
            "Philippine Daily Inquirer.",
            "Archived from the original on 30 July 2013.",
            "Retrieved 30 August 2015.",
            "Tarlac aims to become 'Belen' capital of RP"
        ],
        [
            "^ \"Tarlac Provincial Capitol\".",
            "Retrieved 30 August 2015."
        ],
        [
            "^ Conde, Carlos H. (June 18, 2005).",
            "\"Spotlight: The Philippines' power broker\".",
            "The New York Times.",
            "Retrieved November 3, 2011."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Tarlac at Wikimedia Commons"
        ],
        [
            " Geographic data related to Tarlac at OpenStreetMap"
        ],
        [
            "Official Portal of the Province of Tarlac"
        ],
        [
            "Places adjacent to Tarlac"
        ],
        [
            "Pangasinan"
        ],
        [
            "Zambales"
        ],
        [
            "Tarlac"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "vte Province of TarlacTarlac City (capital and largest city)Municipalities"
        ],
        [
            "Anao"
        ],
        [
            "Bamban"
        ],
        [
            "Camiling"
        ],
        [
            "Capas"
        ],
        [
            "Concepcion"
        ],
        [
            "Gerona"
        ],
        [
            "La Paz"
        ],
        [
            "Mayantoc"
        ],
        [
            "Moncada"
        ],
        [
            "Paniqui"
        ],
        [
            "Pura"
        ],
        [
            "Ramos"
        ],
        [
            "San Clemente"
        ],
        [
            "San Jose"
        ],
        [
            "San Manuel"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Victoria"
        ],
        [
            "Component city"
        ],
        [
            "Tarlac City"
        ],
        [
            "BarangaysSee: List of barangays in Tarlac"
        ],
        [
            "Articles related to Tarlac"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "vteEducational institutions in TarlacTertiary education"
        ],
        [
            "Tarlac State University"
        ],
        [
            "Tarlac Agricultural University"
        ],
        [
            "College of the Holy Spirit of Tarlac"
        ],
        [
            "Officer Candidate School"
        ],
        [
            "Secondary education"
        ],
        [
            "Tarlac National High School"
        ],
        [
            "Tarlac State University – Laboratory School"
        ],
        [
            "Don Bosco Technical Institute"
        ],
        [
            "Tarlac Montessori School"
        ],
        [
            "Dapdap High School"
        ],
        [
            "Buenavista High School"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tarlac&oldid=1234303781\""
        ],
        [
            "Categories: TarlacProvinces of the PhilippinesProvinces of Central LuzonStates and territories established in 18731873 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasCS1 maint: location missing publisherAll articles with dead external linksArticles with dead external links from February 2022Articles with permanently dead external linksCS1 maint: archived copy as titleArticles with short descriptionShort description is different from WikidataCoordinates on WikidataArticles containing Kapampangan-language textArticles containing Pangasinan-language textArticles containing Ilocano-language textArticles containing Tagalog-language textPages with Tagalog IPAArticles needing additional references from July 2022All articles needing additional referencesWikipedia articles needing clarification from April 2016All Wikipedia articles that are incomprehensibleWikipedia articles that are incomprehensible from April 2016All articles with unsourced statementsArticles with unsourced statements from April 2016Lists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}