{
    "name": "Zambales",
    "data": [
        [
            "Toggle the table of contents"
        ],
        [
            "Zambales"
        ],
        [
            "44 languages"
        ],
        [
            "AcèhالعربيةAzərbaycancaتۆرکجه閩南語 / Bân-lâm-gúBikol CentralCebuanoChavacano de ZamboangaDeutschEspañolEsperantoفارسیFrançais한국어हिन्दीIlokanoBahasa IndonesiaItalianoKapampanganქართულიLatinaLatviešuМакедонскиBahasa MelayuNederlands日本語Norsk bokmålPangasinanPolskiPortuguêsРусскийSimple EnglishSuomiSvenskaTagalogதமிழ்ไทยTürkçeУкраїнськаاردوTiếng ViệtWinaray吴语中文"
        ],
        [
            "Edit links"
        ],
        [
            "ArticleTalk"
        ],
        [
            "English"
        ],
        [
            "ReadEditView history"
        ],
        [
            "Tools"
        ],
        [
            "Tools"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "\t\tActions"
        ],
        [
            "ReadEditView history"
        ],
        [
            "\t\tGeneral"
        ],
        [
            "What links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageGet shortened URLDownload QR codeWikidata item"
        ],
        [
            "\t\tPrint/export"
        ],
        [
            "Download as PDFPrintable version"
        ],
        [
            "\t\tIn other projects"
        ],
        [
            "Wikimedia CommonsWikivoyage"
        ],
        [
            "Appearance"
        ],
        [
            "move to sidebar"
        ],
        [
            "hide"
        ],
        [
            "Coordinates: 15°20′N 120°10′E﻿ / ﻿15.33°N 120.17°E﻿ / 15.33; 120.17"
        ],
        [
            "From Wikipedia, the free encyclopedia"
        ],
        [
            "Province in Central Luzon, Philippines"
        ],
        [
            "This article is about the Philippine province.",
            "For other uses, see Zambales (disambiguation)."
        ],
        [
            "Province in Central Luzon, PhilippinesZambalesProvinceProvince of Zambales(from top: left to right) Zambales coastline, Zambales Provincial Capitol, Subic Bay, Zambales Mountains, and Subic Bay Economic Zone"
        ],
        [
            "FlagSealNickname: Chromite Capital of the Philippines • Total649,615 (excluding Olongapo City) 909,932 (including Olongapo City) • Rank46th out of 81  • Rank54th out of 81 (excluding Olongapo)Divisions • Independent cities"
        ],
        [
            "1"
        ],
        [
            " Olongapo  (Highly urbanized city)"
        ],
        [
            " • Component cities0 • Municipalities"
        ],
        [
            "13"
        ],
        [
            " Botolan"
        ],
        [
            " Cabangan"
        ],
        [
            " Candelaria"
        ],
        [
            " Castillejos"
        ],
        [
            " Iba"
        ],
        [
            " Masinloc"
        ],
        [
            " Palauig"
        ],
        [
            " San Antonio"
        ],
        [
            " San Felipe"
        ],
        [
            " San Marcelino"
        ],
        [
            " San Narciso"
        ],
        [
            " Santa Cruz"
        ],
        [
            " Subic"
        ],
        [
            " • Barangays230including independent cities: 247 • DistrictsLegislative districts of Zambales (shared with Olongapo City)Demographics • Ethnic groupsTagalog (42%)Ilocano (28%)Sambal (27%)Others (3%) • LanguagesTagalogIlocanoSambalBotolanAmbalaEnglish • Major religions"
        ],
        [
            "Roman Catholicism"
        ],
        [
            "Aglipayan Church"
        ],
        [
            "Protestantism"
        ],
        [
            "Islam"
        ],
        [
            " • Ecclesiastical diocesesDiocese of Iba (Roman Catholic)Diocese of Zambales (Aglipayan Church) • Patron saintOur Lady of Poon Bato • Feast dayJanuary 24Time zoneUTC+8 (PST)IDD : area code +63 (0)47ISO 3166 codePH-ZMBWebsitewww.zambales.gov.ph"
        ],
        [
            "Zambales, officially the Province of Zambales (Sambal: Probinsya nin Zambales; Ilocano: Probinsia ti Zambales; Pangasinan: Luyag/Probinsia na Zambales; Filipino: Lalawigan ng Zambales), is a province in the Philippines located in the Central Luzon region.",
            "Its capital is Iba, which is located in the middle of the province.",
            "Olongapo is the largest city of the province wherein it is geographically located but politically independent."
        ],
        [
            "Zambales borders Pangasinan to the north and northeast, Tarlac to the east, Pampanga to the southeast, Bataan to the south and the South China Sea to the west.",
            "With a total land area of 3,830.83 square kilometres (1,479.09 sq mi) (including the independent city of Olongapo), Zambales is the second largest among the seven provinces of Central Luzon after Nueva Ecija.",
            "The province is noted for its mangoes, which are abundant from January to April."
        ],
        [
            "Zambales does not have a functional airport; the closest functional airport is Clark International Airport in Angeles City in the neighbouring province of Pampanga.",
            "Subic Bay International Airport, which is located in Cubi Point (geographically located inside Morong, Bataan) in the Subic Bay Freeport Zone is no longer functional for domestic and international flights."
        ],
        [
            "The Freeport Zone (SBFZ) is host to many tourist attractions which include casinos, parks, malls, beach-side huts, cottages and resorts, as well as historical sites."
        ],
        [
            "Etymology"
        ],
        [
            "The name of the province is derived from \"Zambales\", the Hispanized name of the Sambal people.",
            "The Sambal were the original dominant ethnic group of the region."
        ],
        [
            "History"
        ],
        [
            "Zambales map in 1918"
        ],
        [
            "Spanish colonial era"
        ],
        [
            "The Spanish first explored the area in 1572, led by Juan de Salcedo.",
            "Zambales was originally derived from 2 parts: the southern area from Pampanga and the northern area from Pangasinan."
        ],
        [
            "During the Spanish period, a 1774 map was made, which clearly named Scarborough Shoals as Panacot Shoal, a feature under complete sovereignty of Spanish Philippines, specifically of Zambales.",
            "The shoal's current name was chosen by Captain Philip D'Auvergne, whose East India Company East Indiaman Scarborough briefly grounded on one of the rocks on September 12, 1784, before sailing on to China.",
            "When the Philippines was granted independence in the 19th century and 20th century, Scarborough Shoal was passed by the colonial governments to the sovereign Republic of the Philippines.",
            ": 31, 54, 113"
        ],
        [
            "American invasion era"
        ],
        [
            "Masinloc became the province's first capital.",
            "However, the capital was moved among the last three towns above during its history before finally settling in Iba, due to its strategic location.",
            "Seven of the province's original northern towns, which included Bolinao, Infanta, San Isidro, now Burgos, Anda, Bani, Agno and Alaminos were later transferred under the jurisdiction of Pangasinan because of their distance from the capital.",
            "The first civil governor of Zambales during the colonial American era was Potenciano Lesaca from 1901 to 1903."
        ],
        [
            "Postwar Era"
        ],
        [
            "Under a 1947 Military Bases Agreement,"
        ],
        [
            "During the Marcos dictatorship"
        ],
        [
            "Main articles: Martial law under Ferdinand Marcos and Human rights abuses of the Marcos dictatorship"
        ],
        [
            "The beginning months of the 1970s marked a period of turmoil and change in the Philippines, as well as in Zambales."
        ],
        [
            "With only a year left in his last constitutionally allowed term as president Ferdinand Marcos placed the Philippines under Martial Law in September 1972 and thus retained the position for fourteen more years."
        ],
        [
            "In Olongapo, the continuation of the Vietnam war through this period meant the arrival of a constantly growing number of U.S.",
            "Sailors to Subic Naval Base, and along with it, the rapid growth of prostitution."
        ],
        [
            "In 1986, the province was one of the main supporters of the People Power Revolution in Manila, which topped the 21-year dictatorship and installed Corazon Aquino as president, bringing back democracy to the country."
        ],
        [
            "Later 20th Century"
        ],
        [
            "The province was heavily affected by the 1991 eruption of Mount Pinatubo.",
            "Due to this, the economy of the province weakened for some time, but regained vitality a few years after the government ordered the revitalization of the province and established growth in its southern towns, which later became a significant economic zone in the country by 1995."
        ],
        [
            "Contemporary"
        ],
        [
            "The 2012 Scarborough Shoal standoff led to a situation where access to the shoal was restricted by the People's Republic of China."
        ],
        [
            "In 2018, it was revealed that for every 3,000 peso worth of fish catch by Sambal fisherfolks, China siphoned them in exchange for 'two bottles of mineral water' worth 20 pesos."
        ],
        [
            "Geography"
        ],
        [
            "Western coastline of the province featuring several coves"
        ],
        [
            "The Zambales Mountains seen from San Antonio"
        ],
        [
            "Zambales lies on the western shores of Luzon island along the South China Sea.",
            "Its shoreline is rugged and features many coves and inlets.",
            "The Zambales Mountains in the eastern length of the province occupies about 60% of the total land area of Zambales.",
            "Subic Bay, at the southern end of the province, provides a natural harbor, and was the location of the U.S.",
            "Naval Base Subic Bay until its closure in 1992."
        ],
        [
            "The summit and crater lake of Mount Pinatubo lies within Botolan municipality in Zambales, near the tripoint of Zambales, Pampanga and Tarlac provinces.",
            "after being buried by more than 20 feet (6.1 m) of lahar."
        ],
        [
            "Climate"
        ],
        [
            "Zambales has two pronounced seasons: dry from October to June, and wet from July to September."
        ],
        [
            "Administrative divisions"
        ],
        [
            "Zambales comprises 13 municipalities and 1 highly urbanized city, which are divided into two legislative districts.",
            "Olongapo City is a highly urbanized city and administers itself autonomously from the province.",
            "Panatag Shoal (Scarborough Shoal) a Philippine-claimed territory, is a designated part of the province."
        ],
        [
            "The northern half of the province typically comprises the municipalities of Santa Cruz, Candelaria, Masinloc, and Palauig.",
            "The central half of the province consists of the municipalities of Iba (the capital), Botolan, Cabangan, and San Felipe.",
            "The southern half of the province is composed of the municipalities of San Narciso, San Marcelino, San Antonio, Castillejos, Subic, and the highly urbanized city of Olongapo."
        ],
        [
            "Political map"
        ],
        [
            "1"
        ],
        [
            "2"
        ],
        [
            "3"
        ],
        [
            "4"
        ],
        [
            "5"
        ],
        [
            "6"
        ],
        [
            "7"
        ],
        [
            "8"
        ],
        [
            "9"
        ],
        [
            "10"
        ],
        [
            "11"
        ],
        [
            "12"
        ],
        [
            "13"
        ],
        [
            "14"
        ],
        [
            "3"
        ],
        [
            "Luzon Is."
        ],
        [
            "Disputed territory  — Scarborough shoal, locally known as Panatag Shoal or Bajo Masinloc, is designated under Masinloc municipality.",
            "Internationally disputed.",
            "Claimed by the People's Republic of China, Philippines, and Republic of China (Taiwan).",
            "De facto controlled by the People's Republic of China since 2012."
        ],
        [
            "6"
        ],
        [
            "Botolan"
        ],
        [
            "7"
        ],
        [
            "Cabangan"
        ],
        [
            "2"
        ],
        [
            "Candelaria"
        ],
        [
            "12"
        ],
        [
            "Castillejos"
        ],
        [
            "5"
        ],
        [
            "Iba"
        ],
        [
            "3"
        ],
        [
            "Masinloc"
        ],
        [
            "14"
        ],
        [
            "Olongapo"
        ],
        [
            "4"
        ],
        [
            "Palauig"
        ],
        [
            "11"
        ],
        [
            "San Antonio"
        ],
        [
            "8"
        ],
        [
            "San Felipe"
        ],
        [
            "10"
        ],
        [
            "San Marcelino"
        ],
        [
            "9"
        ],
        [
            "San Narciso"
        ],
        [
            "1"
        ],
        [
            "Santa Cruz"
        ],
        [
            "13"
        ],
        [
            "Subic"
        ],
        [
            " †  Provincial capital  Municipality ‡  Highly urbanized city (geographically within but independent from the province)"
        ],
        [
            "City or municipality"
        ],
        [
            "District"
        ],
        [
            "Population"
        ],
        [
            "±% p.a."
        ],
        [
            "Area"
        ],
        [
            "Density"
        ],
        [
            "Barangay"
        ],
        [
            "Coordinates"
        ],
        [
            "(2020)"
        ],
        [
            "(2015)"
        ],
        [
            "km2"
        ],
        [
            "sq mi"
        ],
        [
            "/km2"
        ],
        [
            "/sq mi"
        ],
        [
            "Botolan"
        ],
        [
            "2nd"
        ],
        [
            "10.3%"
        ],
        [
            "66,739"
        ],
        [
            "57,707"
        ],
        [
            "+2.81%"
        ],
        [
            "735.28"
        ],
        [
            "283.89"
        ],
        [
            "91"
        ],
        [
            "240"
        ],
        [
            "31"
        ],
        [
            "15°17′20″N 120°01′29″E﻿ / ﻿15.2889°N 120.0247°E﻿ / 15.2889; 120.0247﻿ (Botolan)"
        ],
        [
            "Cabangan"
        ],
        [
            "2nd"
        ],
        [
            "4.3%"
        ],
        [
            "28,118"
        ],
        [
            "25,163"
        ],
        [
            "+2.14%"
        ],
        [
            "175.29"
        ],
        [
            "67.68"
        ],
        [
            "160"
        ],
        [
            "410"
        ],
        [
            "22"
        ],
        [
            "15°09′32″N 120°03′20″E﻿ / ﻿15.1589°N 120.0555°E﻿ / 15.1589; 120.0555﻿ (Cabangan)"
        ],
        [
            "Candelaria"
        ],
        [
            "2nd"
        ],
        [
            "4.7%"
        ],
        [
            "30,263"
        ],
        [
            "27,174"
        ],
        [
            "+2.07%"
        ],
        [
            "333.59"
        ],
        [
            "128.80"
        ],
        [
            "91"
        ],
        [
            "240"
        ],
        [
            "16"
        ],
        [
            "15°37′38″N 119°55′45″E﻿ / ﻿15.6271°N 119.9291°E﻿ / 15.6271; 119.9291﻿ (Candelaria)"
        ],
        [
            "Castillejos"
        ],
        [
            "1st"
        ],
        [
            "10.5%"
        ],
        [
            "67,889"
        ],
        [
            "64,841"
        ],
        [
            "+0.88%"
        ],
        [
            "92.99"
        ],
        [
            "35.90"
        ],
        [
            "730"
        ],
        [
            "1,900"
        ],
        [
            "14"
        ],
        [
            "14°55′48″N 120°12′18″E﻿ / ﻿14.9301°N 120.2051°E﻿ / 14.9301; 120.2051﻿ (Castillejos)"
        ],
        [
            "Iba"
        ],
        [
            "†"
        ],
        [
            "2nd"
        ],
        [
            "8.6%"
        ],
        [
            "55,581"
        ],
        [
            "50,506"
        ],
        [
            "+1.84%"
        ],
        [
            "153.38"
        ],
        [
            "59.22"
        ],
        [
            "360"
        ],
        [
            "930"
        ],
        [
            "14"
        ],
        [
            "15°19′35″N 119°58′43″E﻿ / ﻿15.3264°N 119.9786°E﻿ / 15.3264; 119.9786﻿ (Iba)"
        ],
        [
            "Masinloc"
        ],
        [
            "2nd"
        ],
        [
            "8.4%"
        ],
        [
            "54,529"
        ],
        [
            "47,719"
        ],
        [
            "+2.57%"
        ],
        [
            "316.02"
        ],
        [
            "122.02"
        ],
        [
            "170"
        ],
        [
            "440"
        ],
        [
            "13"
        ],
        [
            "15°32′16″N 119°57′06″E﻿ / ﻿15.5379°N 119.9516°E﻿ / 15.5379; 119.9516﻿ (Masinloc)"
        ],
        [
            "Olongapo"
        ],
        [
            "‡"
        ],
        [
            "1st"
        ],
        [
            "—"
        ],
        [
            "260,317"
        ],
        [
            "233,040"
        ],
        [
            "+2.13%"
        ],
        [
            "185.00"
        ],
        [
            "71.43"
        ],
        [
            "1,400"
        ],
        [
            "3,600"
        ],
        [
            "17"
        ],
        [
            "14°49′53″N 120°17′01″E﻿ / ﻿14.8314°N 120.2835°E﻿ / 14.8314; 120.2835﻿ (Olongapo)"
        ],
        [
            "Palauig"
        ],
        [
            "2nd"
        ],
        [
            "6.1%"
        ],
        [
            "39,784"
        ],
        [
            "34,947"
        ],
        [
            "+2.50%"
        ],
        [
            "310.00"
        ],
        [
            "119.69"
        ],
        [
            "130"
        ],
        [
            "340"
        ],
        [
            "19"
        ],
        [
            "15°26′03″N 119°54′30″E﻿ / ﻿15.4343°N 119.9084°E﻿ / 15.4343; 119.9084﻿ (Palauig)"
        ],
        [
            "San Antonio"
        ],
        [
            "2nd"
        ],
        [
            "5.8%"
        ],
        [
            "37,450"
        ],
        [
            "34,661"
        ],
        [
            "+1.48%"
        ],
        [
            "188.12"
        ],
        [
            "72.63"
        ],
        [
            "200"
        ],
        [
            "520"
        ],
        [
            "14"
        ],
        [
            "14°56′56″N 120°05′20″E﻿ / ﻿14.9488°N 120.0889°E﻿ / 14.9488; 120.0889﻿ (San Antonio)"
        ],
        [
            "San Felipe"
        ],
        [
            "2nd"
        ],
        [
            "3.9%"
        ],
        [
            "25,033"
        ],
        [
            "23,183"
        ],
        [
            "+1.47%"
        ],
        [
            "111.60"
        ],
        [
            "43.09"
        ],
        [
            "220"
        ],
        [
            "570"
        ],
        [
            "11"
        ],
        [
            "15°03′40″N 120°04′13″E﻿ / ﻿15.0610°N 120.0702°E﻿ / 15.0610; 120.0702﻿ (San Felipe)"
        ],
        [
            "San Marcelino"
        ],
        [
            "1st"
        ],
        [
            "5.8%"
        ],
        [
            "37,719"
        ],
        [
            "33,665"
        ],
        [
            "+2.19%"
        ],
        [
            "416.86"
        ],
        [
            "160.95"
        ],
        [
            "90"
        ],
        [
            "230"
        ],
        [
            "18"
        ],
        [
            "14°58′31″N 120°09′24″E﻿ / ﻿14.9754°N 120.1566°E﻿ / 14.9754; 120.1566﻿ (San Marcelino)"
        ],
        [
            "San Narciso"
        ],
        [
            "2nd"
        ],
        [
            "4.7%"
        ],
        [
            "30,759"
        ],
        [
            "28,360"
        ],
        [
            "+1.56%"
        ],
        [
            "71.60"
        ],
        [
            "27.64"
        ],
        [
            "430"
        ],
        [
            "1,100"
        ],
        [
            "17"
        ],
        [
            "15°00′54″N 120°04′44″E﻿ / ﻿15.0149°N 120.0789°E﻿ / 15.0149; 120.0789﻿ (San Narciso)"
        ],
        [
            "Santa Cruz"
        ],
        [
            "2nd"
        ],
        [
            "9.8%"
        ],
        [
            "63,839"
        ],
        [
            "58,151"
        ],
        [
            "+1.79%"
        ],
        [
            "438.46"
        ],
        [
            "169.29"
        ],
        [
            "150"
        ],
        [
            "390"
        ],
        [
            "25"
        ],
        [
            "15°45′45″N 119°54′36″E﻿ / ﻿15.7626°N 119.9100°E﻿ / 15.7626; 119.9100﻿ (Santa Cruz)"
        ],
        [
            "Subic"
        ],
        [
            "1st"
        ],
        [
            "17.2%"
        ],
        [
            "111,912"
        ],
        [
            "104,771"
        ],
        [
            "+1.26%"
        ],
        [
            "287.16"
        ],
        [
            "110.87"
        ],
        [
            "390"
        ],
        [
            "1,000"
        ],
        [
            "16"
        ],
        [
            "14°52′39″N 120°14′04″E﻿ / ﻿14.8774°N 120.2344°E﻿ / 14.8774; 120.2344﻿ (Subic)"
        ],
        [
            "Total"
        ],
        [
            "649,615"
        ],
        [
            "590,848"
        ],
        [
            "+1.82%"
        ],
        [
            "3,645.83"
        ],
        [
            "1,407.66"
        ],
        [
            "180"
        ],
        [
            "470"
        ],
        [
            "230"
        ],
        [
            "(see GeoGroup box)"
        ],
        [
            "^ Coordinates mark the city/town center, and are sortable by latitude.^ Total figures exclude the highly urbanized city of Olongapo."
        ],
        [
            "Barangays"
        ],
        [
            "Further information: List of barangays in Zambales"
        ],
        [
            "The 13 municipalities and 1 city of the province comprise 247 barangays, with Santa Rita in Olongapo City as the most populous in 2010, and Owaog-Nibloc in Botolan as the least.",
            "If cities are excluded, Calapacuan in Subic has the highest population as of 2010."
        ],
        [
            "Demographics"
        ],
        [
            "Population census of ZambalesYearPop.±% p.a.1903 59,930—    1918 83,750+2.26%1939 106,945+1.17%1948 138,536+2.92%1960 213,442+3.67%YearPop.±% p.a.1970 235,249+0.98%1975 269,171+2.74%1980 287,607+1.33%1990 369,665+2.54%1995 389,512+0.98%YearPop.±% p.a.2000 433,542+2.32%2007 493,085+1.79%2010 534,443+2.97%2015 590,848+1.93%2020 649,615+1.88%(excluding Olongapo City)Source: Philippine Statistics Authority"
        ],
        [
            "The population of Zambales in the 2020 census was 649,615 people, with a density of 180 inhabitants per square kilometre or 470 inhabitants per square mile.",
            "When Olongapo City is included for geographical purposes, the province's population is 909,932 people, with a density of 215/km2 (557/sq mi)."
        ],
        [
            "Inhabitants"
        ],
        [
            "See also: Aeta, Sambal people, Tagalog people, Ilocano people, Kapampangan people, and Pangasinan people"
        ],
        [
            "The Aetas of Mount Pinatubo were the earliest inhabitants of what is now the province of Zambales.",
            "by the Sambal, an Austronesian people after whom the province is named.",
            "Many Sambal still believe in superstitions and mysteries that have been handed down through the generations."
        ],
        [
            "The Tagalogs, the Ilocanos, the Sambal, the Kapampangans, and the Pangasinans today constitute the five largest ethnic groups in Zambales; these identities may and do, however, overlap with one another due to intermarriage Most of the people of southern Zambales are migrants from different parts of the country, owing the influx of job opportunities brought on by the U.S Subic Naval Base (San Antonio and Subic) during the American regime of the country.",
            "Many people found jobs and permanently settled there.",
            "The presence of the Americans greatly influenced the culture and way of life of the inhabitants."
        ],
        [
            "Religion"
        ],
        [
            "Our Lady of Poon Bato Patroness of the Province of Zambales."
        ],
        [
            "The people of Zambales are predominantly Roman Catholic (78.22%) under the jurisdiction of the Diocese of Iba.",
            "A sizeable portion of the population also belongs to the Aglipayan Church (6.12%) under the jurisdiction of the Diocese of Zambales and Iglesia ni Cristo (4.89%).",
            "The remaining are divided with other Christian groups such as Born-again Christians, United Methodist Church, The Church of Jesus Christ of Latter-day Saints, Jehovah's Witnesses, Seventh-day Adventist, United Church of Christ in the Philippines as well as Non Christians which is usually represented by Muslims."
        ],
        [
            "Town fiestas honoring patron saints are practiced in each parish."
        ],
        [
            "Further information: Roman Catholic Diocese of Iba"
        ],
        [
            "Languages"
        ],
        [
            "Languages Spoken (2000)"
        ],
        [
            "Language"
        ],
        [
            "Number of speakers"
        ],
        [
            "Tagalog"
        ],
        [
            "164,000"
        ],
        [
            "Ilocano"
        ],
        [
            "119,000"
        ],
        [
            "Sambal"
        ],
        [
            "117,000"
        ],
        [
            "Main articles: Sambalic languages, Tagalog language, Ilocano language, Kapampangan language, and Pangasinan language"
        ],
        [
            "Sambal, Tagalog, and Ilocano are the three main languages of Zambales.",
            "Other Sambalic languages spoken in Zambales are Botolan, Ambala, and Mag-antsi.",
            "About 75 percent of the population speaks and understands English to varying degrees of fluency, and road signs are mostly written in that language."
        ],
        [
            "Economy"
        ],
        [
            "Poverty incidence of Zambales"
        ],
        [
            "5"
        ],
        [
            "10"
        ],
        [
            "15"
        ],
        [
            "20"
        ],
        [
            "25"
        ],
        [
            "30"
        ],
        [
            "2006  23.64"
        ],
        [
            "2009  17.28"
        ],
        [
            "2012  16.00"
        ],
        [
            "2015  16.82"
        ],
        [
            "2018  15.21"
        ],
        [
            "2021  17.70"
        ],
        [
            "Source: Philippine Statistics Authority"
        ],
        [
            "Tourism plays a large role in the economy of Zambales.",
            "Local and foreign tourist flock its many beaches creating many job opportunities and contributing to the economy.",
            "Most of the province is still agricultural but there are considerable industrial zones that provide jobs not just for residents of Zambales but also for neighboring provinces.",
            "Mining has recently been booming in Zambales where there is an abundant deposit of Nickel and other minerals."
        ],
        [
            "Mangoes from Zambales"
        ],
        [
            "Zambales is basically an agricultural province.",
            "The chief products are rice, mangoes, corn, vegetables, and root crops.",
            "Major industries include farming, fishing, and mining."
        ],
        [
            "Festivals and events"
        ],
        [
            "This section reads like a directory.",
            "Wikipedia policy generally considers directories in articles to be unencyclopedic and potential spam.",
            "Please improve this article to conform to a higher standard of quality, and to make it neutral in tone.",
            "If it cannot be properly modified, the article is likely to be merged, redirected, or deleted.",
            "(September 2018) (Learn how and when to remove this message)"
        ],
        [
            "Feast Day of Ina Poon Bato (Botolan) — January 24.",
            "The Ina Poón Bató is a purportedly miraculous, syncretised image of the Blessed Virgin Mary.",
            "Legend has it that before the arrival of the Spanish in the area sometime in the 17th century, local Aeta peoples had discovered a carved wooden statue on a large rock that they called Apo Apang (\"Little Queen\") and began worshipping the image.",
            "On the arrival of Recollect missionaries in 1607, the natives associated the statue with the Roman Catholic depictions of the Virgin Mary, and the image was subsequently Christianised as Ina Poón Bato (\"Mother of the Lord Rock\")."
        ],
        [
            "Singkamas Festival and Town Fiesta (San Marcelino) — 3rd Week of February"
        ],
        [
            "Town Fiesta (San Narciso) — February 19–25"
        ],
        [
            "Pundakit Festival of the Arts (San Antonio) — February‑July"
        ],
        [
            "Zambales Multi Sports Festival Senakulo — 3rd Week of March"
        ],
        [
            "Panagkakadua-an Festival (San Felipe) - 1st Week of April"
        ],
        [
            "Good Friday (Castillejos) — April"
        ],
        [
            "Foundation Day Celebration (Palauig) — April 10"
        ],
        [
            "Grand Fiesta (Cabangan) — April 21–25"
        ],
        [
            "The Dinamulag Festival \"Zambales Mango Festival\" (Iba) — 3rd Tuesday of April The Dinamulag Festival also known as the Zambales Mango Festival is an annual festival held in the province of Zambales in the Philippines to celebrate or encourage bountiful harvest of the province's mangoes.",
            "The festival was first held in 1999."
        ],
        [
            "Paynawen Festival (Iba) — 3rd Week of April Paynauen ‘Duyan’ Festival is held every April 25 – May 1 in Iba, Zambales.",
            "It commemorates the provincial capital's founding anniversary (founded in 1611) traces its origin from a Zambal word which means rest or pahingahan – the ancient name of Iba before the Spanish conquistadores founded the village on the shore of the Bancal River in 1611.",
            "The festival features photo competition and exhibit, sand sculpture competition, skate boarding, 2-cock derby, carabao race, beauty pageant, kite flying, banca race, boxing tournament, street dancing / Duyan Parade, among other activities."
        ],
        [
            "Marunggay Festival and Town Fiesta (San Antonio) — Last Week of April"
        ],
        [
            "Domorokdok Festival (Botolan) — May 4"
        ],
        [
            "Laruk Laruk Festival (Candelaria) — Last Week of October"
        ],
        [
            "Binabayani Festival and Town Fiesta (Masinloc) — November 30 The Binabayani Festival occurs every November in the city of Masinloc in Zambales.",
            ".",
            "A dance/play depicting the clash between the Spanish and the Natives of Masinloc or the triumph of Christianity over Paganism.",
            "The war dance starts with a procession in the afternoon of November 29 and opens in a mass on November 30.",
            "This annual religious festival is celebrated with day long activities in honor of San Andres, the patron saint of Masinloc.",
            "Binabayani is a war dance that portrays the battle between the Christian and the Aetas in the town of Masinloc.",
            "It is a word that means “bravery”.",
            "It is usually featured at the town plaza on the 30th day of November for the public to witness."
        ],
        [
            "Kaligawan Ha Mayanan (Candelaria) — December 29–30"
        ],
        [
            "Olongapo Mardigras (Olongapo) — Last Week of October"
        ],
        [
            "Education"
        ],
        [
            "There are a number of higher educational institutions in the province.",
            "The President Ramon Magsaysay State University (PRMSU), the first state university in the province can be found in Iba.",
            "It has also satellite campuses in the municipalities of Santa Cruz, Candelaria, Masinloc, Botolan, San Marcelino, and Castillejos.",
            "St. Joseph College-Olongapo, a college run by the Roman Catholic Church can be found in Olongapo City.",
            "The Columban College, run by the Catholic Church can be found also in Olongapo.",
            "The Magsaysay Memorial College is also run by the Roman Catholic Church and can be found in San Narciso."
        ],
        [
            "Colleges and universities"
        ],
        [
            "This section reads like a directory.",
            "Wikipedia policy generally considers directories in articles to be unencyclopedic and potential spam.",
            "Please improve this article to conform to a higher standard of quality, and to make it neutral in tone.",
            "If it cannot be properly modified, the article is likely to be merged, redirected, or deleted.",
            "(September 2018) (Learn how and when to remove this message)"
        ],
        [
            "AIE College International (Olongapo City)"
        ],
        [
            "AMA Computer College (Olongapo City)"
        ],
        [
            "AMA Computer Learning Center (Olongapo City)"
        ],
        [
            "Asian Institute of Computer Studies (Olongapo City)"
        ],
        [
            "Best Freeport Colleges Inc. (Subic Bay Freeport Zone)"
        ],
        [
            "Polytechnic College of Botolan (Botolan)"
        ],
        [
            "Capstone Institute of Business and Arts (Olongapo City)"
        ],
        [
            "Central Luzon College of Science and Technology (Olongapo City)"
        ],
        [
            "College of Subic Montessori Subic Bay (Subic Bay Freeport Zone)"
        ],
        [
            "Collegio de Castillejos (Castillejos)"
        ],
        [
            "Columban College - Barreto Campus (Olongapo City)"
        ],
        [
            "Columban College - Santa Cruz Campus (Santa Cruz)"
        ],
        [
            "Columban College - Main Campus (Olongapo City)"
        ],
        [
            "Comteq Computer and Business College (Subic Bay Freeport Zone)"
        ],
        [
            "Don Bosco College of Zambales (Castillejos)"
        ],
        [
            "Don Luis Orin Junior College of Criminology, Inc. (Iba)"
        ],
        [
            "First EDT Learning Center, Inc. (Subic Bay Freeport Zone)"
        ],
        [
            "Freeport SBLC Inc. (Subic Bay Freeport Zone)"
        ],
        [
            "GIS Institute of Technology Phils Inc. (San Marcelino)"
        ],
        [
            "Global City Innovative College Subic (Olongapo City)"
        ],
        [
            "Gordon College (Olongapo City)"
        ],
        [
            "Holy Infant Jesus College(Olongapo City)"
        ],
        [
            "Hopeful Beginnings Institute (Iba)"
        ],
        [
            "Keystone Subic International Language Center (Subic Bay Freeport Zone)"
        ],
        [
            "Kolehiyo ng Subic (Subic)"
        ],
        [
            "Lorraine Technical School (Olongapo City)"
        ],
        [
            "Lyceum of Subic Bay (Subic Bay Freeport Zone)"
        ],
        [
            "Magsaysay Memorial College (San Narciso)"
        ],
        [
            "Metro Subic Colleges (Olongapo City)"
        ],
        [
            "Micro Asia College of Science and Technology (Santa Cruz)"
        ],
        [
            "Micro Asia College of Science and Technology (Iba)"
        ],
        [
            "Mondrian Aura College (Subic Bay Freeport Zone)"
        ],
        [
            "Network Computer and Business Colleges (Olongapo City)"
        ],
        [
            "Northern Zambales College (Masinloc)"
        ],
        [
            "Philippine Merchants Marine Academy (San Narciso)"
        ],
        [
            "President Ramon Magsaysay State University - Candelaria (Candelaria)"
        ],
        [
            "President Ramon Magsaysay State University - Castillejos (Castillejos)"
        ],
        [
            "President Ramon Magsaysay State University - Main Campus (Iba)"
        ],
        [
            "President Ramon Magsaysay State University - Masinloc (Masinloc)"
        ],
        [
            "President Ramon Magsaysay State University - Western Luzon Agricultural College (San Marcelino)"
        ],
        [
            "San Antonio Institute of Commerce and Technology (San Antonio)"
        ],
        [
            "Sand Valley Institute of Arts and Trades (Iba)"
        ],
        [
            "St. Benilde Center for Global Competence (Olongapo City)"
        ],
        [
            "St. Joseph College (Olongapo City)"
        ],
        [
            "St. Nicolas Systeq College (Palauig)"
        ],
        [
            "St. Theresa's College - (San Marcelino)"
        ],
        [
            "STI College (Olongapo City)"
        ],
        [
            "Subic Bay Foreign Language Center (Subic Bay Freeport Zone)"
        ],
        [
            "Subic Bay Metropolitan Authority Law Enforcement Academy (Subic Bay Freeport Zone)"
        ],
        [
            "Subic Bay Colleges Inc. - (Olongapo City)"
        ],
        [
            "Subic Institute of International Studies (Subic Bay Freeport Zone)"
        ],
        [
            "Technological College of San Felipe (San Felipe)"
        ],
        [
            "The Thomasites Center for International Studies (Subic Bay Freeport Zone)"
        ],
        [
            "University of the Philippines - Extension Program in Olongapo (Subic Bay Freeport Zone)"
        ],
        [
            "Virgen de los Remedios College (Olongapo City)"
        ],
        [
            "Virgin de los Remedios College of Criminology (Iba)"
        ],
        [
            "Zambales Academy  (San Narciso)"
        ],
        [
            "Zambales Lifesaving Inc. PCG Accredited Lifeguard training organization (Botolan)"
        ],
        [
            "President Ramon Magsaysay State University (PRMSU)"
        ],
        [
            "The President Ramon Magsaysay State University, commonly referred to as PRMSU, is a state university/government-funded higher education institution in  Iba, established in 1910.",
            "The university is named after former President Ramon Magsaysay, a native of the province.",
            "Its main campus is situated in the capital town of Iba, while satellite campuses are located in Santa Cruz, Candelaria, Masinloc, Botolan, San Marcelino, and Castillejos.",
            "The university also offers nursing courses at the Mondriaan Aura College in Subic Bay Freeport Zone, Business Administration at the Wesleyan College of Manila under a consortium program."
        ],
        [
            "Columban College, Olongapo"
        ],
        [
            "The Columban College, is a private-catholic educational institution in Zambales that was established in 1961. the college was founded by the missionaries from Ireland under the Missionary Society of St. Columban until they turn over the institution to the Diocese of Iba.",
            "the institution's main campus is situated at the heart of Olongapo City, other campuses situated at Bo.",
            "Barretto, Olongapo which focuses on the southern part of Zambales, and Santa Cruz, Zambales which focuses on the northern part of Zambales.",
            "they value Christian Character like any other Catholic Schools as a Christ-centered but competing institution.",
            "they offer academic programs within their reach."
        ],
        [
            "Notable people"
        ],
        [
            "Gerald Anderson"
        ],
        [
            "Republic Brass Band"
        ],
        [
            "Norman Balbuena a.k.a.",
            "Boobay"
        ],
        [
            "Megan Young"
        ],
        [
            "Elmer Borlongan"
        ],
        [
            "Eric Clay"
        ],
        [
            "Rafael Corpus"
        ],
        [
            "Hermogenes Ebdane"
        ],
        [
            "Loi Ejercito"
        ],
        [
            "Richard J. Gordon"
        ],
        [
            "Luz Magsaysay"
        ],
        [
            "Mitos Magsaysay"
        ],
        [
            "Ramon Magsaysay"
        ],
        [
            "Ramon Magsaysay Jr."
        ],
        [
            "Lou Diamond Phillips"
        ],
        [
            "Isabel Rivas"
        ],
        [
            "Dennis Roldan"
        ],
        [
            "Ruben Torres"
        ],
        [
            "Teodoro R. Yangco"
        ],
        [
            "Sarah Elago"
        ],
        [
            "Freddie Aguilar"
        ],
        [
            "K Brosas"
        ],
        [
            "Gladys Guevarra"
        ],
        [
            "Wowie de Guzman"
        ],
        [
            "Kristofer Martin"
        ],
        [
            "Blakdyak"
        ],
        [
            "Willie Miller"
        ],
        [
            "Samuel Morrison"
        ],
        [
            "Topex Robinson"
        ],
        [
            "Arnel Pineda"
        ],
        [
            "Angelee delos Reyes"
        ],
        [
            "Lauren Young"
        ],
        [
            "Tom Rodriguez"
        ],
        [
            "Angelu de Leon"
        ],
        [
            "Raikko Mateo"
        ],
        [
            "Ruby Rodriguez"
        ],
        [
            "Jay Washington"
        ],
        [
            "Rico Barrera"
        ],
        [
            "Bea Alonzo"
        ],
        [
            "References"
        ],
        [
            "^ \"Mining Firms Seek to Export Black Sand Thru Subic Port\".",
            "Dean Alegado Reality.",
            "PIA Press Release.",
            "March 14, 2011.",
            "Retrieved March 23, 2016.",
            "The miners told Salonga that Zambales was known before as the chromite capital of the Philippines, but with big developments in China today, magnetite iron ore has become more important than chromite."
        ],
        [
            "^ \"List of Provinces\".",
            "PSGC Interactive.",
            "Makati, Philippines: National Statistical Coordination Board.",
            "Retrieved February 13, 2013."
        ],
        [
            "^ a b c Census of Population (2020).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved July 8, 2021."
        ],
        [
            "^ Orejas, Tonnette (March 7, 2012).",
            "\"It's more fun than an airport in Subic\".",
            "Inquirer.",
            "Retrieved May 15, 2014."
        ],
        [
            "^ a b Reed, William Allan (1904).",
            "Negritos of Zambales.",
            "Bureau of Public Printing, U.S. Government Printing Office.",
            "pp.",
            "24–29."
        ],
        [
            "^ a b c d e f g h Lancion, Conrado M. Jr.; de Guzman, Rey (cartography) (1995).",
            "\"The Provinces\".",
            "Fast Facts about Philippine Provinces (The 2000 Millenium ed.).",
            "Makati, Metro Manila: Tahanan Books.",
            "pp. 162–163.",
            "ISBN 971-630-037-9.",
            "Retrieved February 7, 2015."
        ],
        [
            "^ \"Municipalities\".",
            "Zambales Now, Official Website of Zambales.",
            "Retrieved on 2012-05.24.",
            "** The year of 1542 in the founding of Subic is a misprint and should be the year 1572 like in Botolan as Salcedo was born in 1549."
        ],
        [
            "^ W. Gilbert (1804) A New Nautical Directory for the East-India and China Navigation .., pp.480=482."
        ],
        [
            "^ Joseph Huddart (1801).",
            "The Oriental Navigator, Or, New Directions for Sailing to and from the East Indies: Also for the Use of Ships Trading in the Indian and China Seas to New Holland, &c. &c. James Humphreys.",
            "p. 454."
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO PRIMERO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ ESTADISMO DE LAS ISLAS FILIPINAS TOMO SEGUNDO By Joaquín Martínez de Zúñiga (Original Spanish)"
        ],
        [
            "^ \"Agreement between the United States of America and the Republic of the Philippines Concerning Military Bases\" (PDF).",
            "United States Library of Congress.",
            "March 14, 1947.",
            "Archived (PDF) from the original on February 12, 2017.",
            "Retrieved December 16, 2017."
        ],
        [
            "^ \"Philippines : The Early Republic\".",
            "britannica.com.",
            "Archived from the original on December 16, 2017.",
            "Retrieved December 16, 2017."
        ],
        [
            "^ a b \"PHILIPPINE SENATE VOTES TO REJECT U.S. BASE RENEWAL\".",
            "The New York Times.",
            "September 16, 1991.",
            "Archived from the original on March 19, 2018.",
            "Retrieved January 29, 2018."
        ],
        [
            "^ Rodriguez, Dylan (2010).",
            "Suspended Apocalypse: White Supremacy, Genocide, and the Filipino Condition.",
            "U of Minnesota Press.",
            "p. 892.",
            "ISBN 978-0-8166-5349-2.",
            "Archived from the original on April 19, 2020.",
            "Retrieved December 17, 2017."
        ],
        [
            "^ Drogin, Bob (November 27, 1991).",
            "\"After 89 Years, U.S. Lowers Flag at Clark Air Base\".",
            "Los Angeles Times.",
            "Archived from the original on December 25, 2011.",
            "Retrieved March 12, 2011."
        ],
        [
            "^ Robles, Raissa (2016).",
            "Marcos Martial Law: Never Again.",
            "Filipinos for a Better Philippines, Inc."
        ],
        [
            "^ https://www.officialgazette.gov.ph/edsa/the-ph-protest/"
        ],
        [
            "^ Balbosa, Joven Zamoras (1992).",
            "\"IMF Stabilization Program and Economic Growth: The Case of the Philippines\" (PDF).",
            "Journal of Philippine Development.",
            "XIX (35).",
            "Archived from the original (PDF) on September 21, 2021.",
            "Retrieved November 6, 2022."
        ],
        [
            "^ Balisacan, A. M.; Hill, Hal (2003).",
            "The Philippine Economy: Development, Policies, and Challenges.",
            "Oxford University Press.",
            "ISBN 9780195158984."
        ],
        [
            "^ Cororaton, Cesar B.",
            "\"Exchange Rate Movements in the Philippines\".",
            "DPIDS Discussion Paper Series 97-05: 3, 19."
        ],
        [
            "^ Kessler, Richard J.",
            "(1989).",
            "Rebellion and repression in the Philippines.",
            "New Haven: Yale University Press.",
            "ISBN 0300044062.",
            "OCLC 19266663."
        ],
        [
            "^ Celoza, Albert F. (1997).",
            "Ferdinand Marcos and the Philippines: The Political Economy of Authoritarianism.",
            "Greenwood Publishing Group.",
            "ISBN 9780275941376."
        ],
        [
            "^ Schirmer, Daniel B.",
            "(1987).",
            "The Philippines reader : a history of colonialism, neocolonialism, dictatorship, and resistance (1st ed.).",
            "Boston: South End Press.",
            "ISBN 0896082768.",
            "OCLC 14214735."
        ],
        [
            "^ Magno, Alexander R., ed.",
            "(1998).",
            "\"Democracy at the Crossroads\".",
            "Kasaysayan, The Story of the Filipino People Volume 9:A Nation Reborn.",
            "Hong Kong: Asia Publishing Company Limited."
        ],
        [
            "^ \"Alfred McCoy, Dark Legacy: Human rights under the Marcos regime\".",
            "Ateneo de Manila University.",
            "September 20, 1999."
        ],
        [
            "^ Abinales, P.N.",
            "; Amoroso, Donna J.",
            "(2005).",
            "State and society in the Philippines.",
            "Lanham, MD: Rowman & Littlefield Publishers.",
            "ISBN 978-0742510234.",
            "OCLC 57452454."
        ],
        [
            "^ \"Gone too soon: 7 youth leaders killed under Martial Law\".",
            "Rappler.",
            "Retrieved June 15, 2018."
        ],
        [
            "^ Nonato, Dexter Cabalza, DJ Yap, Gabriel Cardinoza, Jeannette I. Andrade, Julie M. Aurelio, Matthew Reysio-Cruz, Philip C. Tubeza, Vince F. (September 22, 2017).",
            "\"'Never again to martial law'\".",
            "{{cite web}}:  CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ \"Life During Martial Law\".",
            "www.clarkhumanities.org."
        ],
        [
            "^ Paz, J. C. Pipe Dream for the Ladies: Constructs of Rights of Prostituted Women among Social Actors in the Sex Industry of Olongapo City, Zambales"
        ],
        [
            "^ a b Thanh-Dam Truong, Sex, Money, and Morality: Prostitution and Tourism in South-east Asia (London: Zed Books, 1990)"
        ],
        [
            "^ a b Santos, P. (2015).",
            "Sexuality, Gender, and US Imperialism after Philippine Independence: An Examination of Gender and Sexual Stereotypes of Pilipina Entertainment Workers and US Servicemen."
        ],
        [
            "^ Pimentel, Benjamin (September 18, 2012).",
            "\"Defying Marcos, Filipino Americans emerged as a force against tyranny\"."
        ],
        [
            "^ \"Learn About the 1991 Mount Pinatubo Volcanic Eruption\"."
        ],
        [
            "^ \"The Cataclysmic 1991 Eruption of Mount Pinatubo, Philippines, Fact Sheet 113-97\".",
            "pubs.usgs.gov."
        ],
        [
            "^ Tordesillas, Ellen (January 21, 2013).",
            "\"Chinese 'occupation' of Bajo de Masinloc could reduce PH territorial waters by 38 percent\".",
            "VERA Files.",
            "ABS-CBN News and Current Affairs.",
            "Retrieved February 15, 2014."
        ],
        [
            "^ Krishnamoorthy, Nandini (February 9, 2017).",
            "\"South China Sea: Philippines sees Chinese attempt to build on reef near its coast\".",
            "IBT International Business Times.",
            "Retrieved February 9, 2017."
        ],
        [
            "^ \"'2 bottles of water for P3,000 worth of fish in Panatag Shoal'\".",
            "June 14, 2018."
        ],
        [
            "^ News, Dharel Placido, ABS-CBN.",
            "\"Palace: PH not conceding Scarborough Shoal rights to China\".",
            "{{cite web}}: |last= has generic name (help)CS1 maint: multiple names: authors list (link)"
        ],
        [
            "^ \"'UNACCEPTABLE': Bayan condemns China Coast Guard harassment of Pinoy fishermen in Scarborough Shoal\"."
        ],
        [
            "^ Torres-Tupas, Tetch (June 8, 2018).",
            "\"Carpio: Duterte admin should stand by Filipinos harassed at Scarborough Shoal\"."
        ],
        [
            "^ \"Destruction of Scarborough Shoal seen on Google Earth\".",
            "Philstar.com.",
            "June 15, 2018.",
            "Retrieved October 22, 2018."
        ],
        [
            "^ U.S. Army Corps of Engineers (1955).",
            "\"Tarlac map\".",
            "University of Texas in Austin Library.",
            "Retrieved on May 24, 2012."
        ],
        [
            "^ a b c \"Province: Zambales\".",
            "PSGC Interactive.",
            "Quezon City, Philippines: Philippine Statistics Authority.",
            "Retrieved January 8, 2016."
        ],
        [
            "^ a b Census of Population (2015).",
            "\"Region III (Central Luzon)\".",
            "Total Population by Province, City, Municipality and Barangay.",
            "Philippine Statistics Authority.",
            "Retrieved June 20, 2016."
        ],
        [
            "^ a b c Census of Population and Housing (2010).",
            "\"Region III (Central Luzon)\" (PDF).",
            "Total Population by Province, City, Municipality and Barangay.",
            "National Statistics Office.",
            "Retrieved June 29, 2016."
        ],
        [
            "^ \"Iba travel guide\".",
            "Archived from the original on December 3, 2008.",
            "Retrieved December 4, 2008."
        ],
        [
            "^ a b The Historical Indúng Kapampángan: Evidence from History and Place Names"
        ],
        [
            "^ Zambales Province, Home Province of Subic Bay and Mt.",
            "Pinatubo"
        ],
        [
            "^ History of Iba"
        ],
        [
            "^ Who We Are: Zambales"
        ],
        [
            "^ \"Zambales: Dependency Ratio Down by Five Persons (Results from the 200…\".",
            "June 19, 2013.",
            "Archived from the original on June 19, 2013."
        ],
        [
            "^ a b \"Zambales\".",
            "Archived from the original on September 12, 2007.",
            "Retrieved August 13, 2007."
        ],
        [
            "^ \"Poverty incidence (PI):\".",
            "Philippine Statistics Authority.",
            "Retrieved December 28, 2020."
        ],
        [
            "^ \"Estimation of Local Poverty in the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "November 29, 2005."
        ],
        [
            "^ \"2009 Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "February 8, 2011."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population, by Region and Province: 1991, 2006, 2009, 2012 and 2015\".",
            "Philippine Statistics Authority.",
            "August 27, 2016."
        ],
        [
            "^ \"Updated Annual Per Capita Poverty Threshold, Poverty Incidence and Magnitude of Poor Population with Measures of Precision, by Region and Province: 2015 and 2018\".",
            "Philippine Statistics Authority.",
            "June 4, 2020."
        ],
        [
            "^ \"2021 Full Year Official Poverty Statistics of the Philippines\" (PDF).",
            "Philippine Statistics Authority.",
            "August 15, 2022.",
            "Retrieved April 28, 2024."
        ],
        [
            "External links"
        ],
        [
            "Map all coordinates using OpenStreetMap"
        ],
        [
            "Download coordinates as:"
        ],
        [
            "KML"
        ],
        [
            "GPX (all coordinates)"
        ],
        [
            "GPX (primary coordinates)"
        ],
        [
            "GPX (secondary coordinates)"
        ],
        [
            " Media related to Zambales at Wikimedia Commons"
        ],
        [
            " Geographic data related to Zambales at OpenStreetMap"
        ],
        [
            "Baluate Ng Sambal Archived November 30, 2020, at the Wayback Machine"
        ],
        [
            "Places adjacent to Zambales"
        ],
        [
            "Pangasinan"
        ],
        [
            "South China Sea"
        ],
        [
            "Zambales"
        ],
        [
            "TarlacPampanga"
        ],
        [
            "Bataan"
        ],
        [
            "vte Province of ZambalesIba (capital)  Olongapo (largest city)Municipalities"
        ],
        [
            "Botolan"
        ],
        [
            "Cabangan"
        ],
        [
            "Candelaria"
        ],
        [
            "Castillejos"
        ],
        [
            "Iba"
        ],
        [
            "Masinloc"
        ],
        [
            "Palauig"
        ],
        [
            "San Antonio"
        ],
        [
            "San Felipe"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Narciso"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Subic"
        ],
        [
            "Highly urbanized city"
        ],
        [
            "Olongapo (Administratively independent from the province but grouped under Zambales by the Philippine Statistics Authority.)"
        ],
        [
            "BarangaysSee: List of barangays in Zambales"
        ],
        [
            "Articles related to Zambales"
        ],
        [
            "vteCentral Luzon (Region III)Regional center"
        ],
        [
            "San Fernando"
        ],
        [
            "Provinces"
        ],
        [
            "Aurora"
        ],
        [
            "Bataan"
        ],
        [
            "Bulacan"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Pampanga"
        ],
        [
            "Tarlac"
        ],
        [
            "Zambales"
        ],
        [
            "Highly urbanized cities"
        ],
        [
            "Angeles"
        ],
        [
            "Olongapo"
        ],
        [
            "Component cities"
        ],
        [
            "Balanga"
        ],
        [
            "Baliwag"
        ],
        [
            "Cabanatuan"
        ],
        [
            "Gapan"
        ],
        [
            "Mabalacat"
        ],
        [
            "Malolos"
        ],
        [
            "Meycauayan"
        ],
        [
            "Muñoz"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "San Jose"
        ],
        [
            "San Jose del Monte"
        ],
        [
            "Tarlac City"
        ],
        [
            "Provincial capitals"
        ],
        [
            "Balanga"
        ],
        [
            "Baler"
        ],
        [
            "Iba"
        ],
        [
            "Malolos"
        ],
        [
            "Palayan"
        ],
        [
            "San Fernando"
        ],
        [
            "Tarlac City"
        ],
        [
            "Municipalities"
        ],
        [
            "Abucay"
        ],
        [
            "Aliaga"
        ],
        [
            "Anao"
        ],
        [
            "Angat"
        ],
        [
            "Apalit"
        ],
        [
            "Arayat"
        ],
        [
            "Bacolor"
        ],
        [
            "Bagac"
        ],
        [
            "Balagtas"
        ],
        [
            "Baler"
        ],
        [
            "Bamban"
        ],
        [
            "Bocaue"
        ],
        [
            "Bongabon"
        ],
        [
            "Botolan"
        ],
        [
            "Bulacan"
        ],
        [
            "Bustos"
        ],
        [
            "Cabangan"
        ],
        [
            "Cabiao"
        ],
        [
            "Calumpit"
        ],
        [
            "Camiling"
        ],
        [
            "Candaba"
        ],
        [
            "Candelaria"
        ],
        [
            "Capas"
        ],
        [
            "Carranglan"
        ],
        [
            "Casiguran"
        ],
        [
            "Castillejos"
        ],
        [
            "Concepcion"
        ],
        [
            "Cuyapo"
        ],
        [
            "Dilasag"
        ],
        [
            "Dinalungan"
        ],
        [
            "Dinalupihan"
        ],
        [
            "Dingalan"
        ],
        [
            "Dipaculao"
        ],
        [
            "Doña Remedios Trinidad"
        ],
        [
            "Floridablanca"
        ],
        [
            "Gabaldon"
        ],
        [
            "General Mamerto Natividad"
        ],
        [
            "General Tinio"
        ],
        [
            "Gerona"
        ],
        [
            "Guagua"
        ],
        [
            "Guiguinto"
        ],
        [
            "Guimba"
        ],
        [
            "Hagonoy"
        ],
        [
            "Hermosa"
        ],
        [
            "Iba"
        ],
        [
            "Jaen"
        ],
        [
            "La Paz"
        ],
        [
            "Laur"
        ],
        [
            "Licab"
        ],
        [
            "Limay"
        ],
        [
            "Llanera"
        ],
        [
            "Lubao"
        ],
        [
            "Lupao"
        ],
        [
            "Macabebe"
        ],
        [
            "Magalang"
        ],
        [
            "Maria Aurora"
        ],
        [
            "Marilao"
        ],
        [
            "Mariveles"
        ],
        [
            "Masantol"
        ],
        [
            "Masinloc"
        ],
        [
            "Mayantoc"
        ],
        [
            "Mexico"
        ],
        [
            "Minalin"
        ],
        [
            "Moncada"
        ],
        [
            "Morong"
        ],
        [
            "Nampicuan"
        ],
        [
            "Norzagaray"
        ],
        [
            "Obando"
        ],
        [
            "Orani"
        ],
        [
            "Orion"
        ],
        [
            "Palauig"
        ],
        [
            "Pandi"
        ],
        [
            "Paniqui"
        ],
        [
            "Pantabangan"
        ],
        [
            "Paombong"
        ],
        [
            "Peñaranda"
        ],
        [
            "Pilar"
        ],
        [
            "Plaridel"
        ],
        [
            "Porac"
        ],
        [
            "Pulilan"
        ],
        [
            "Pura"
        ],
        [
            "Quezon"
        ],
        [
            "Ramos"
        ],
        [
            "Rizal"
        ],
        [
            "Samal"
        ],
        [
            "San Antonio (Nueva Ecija)"
        ],
        [
            "San Antonio (Zambales)"
        ],
        [
            "San Clemente"
        ],
        [
            "San Felipe"
        ],
        [
            "San Ildefonso"
        ],
        [
            "San Isidro"
        ],
        [
            "San Jose (Tarlac)"
        ],
        [
            "San Leonardo"
        ],
        [
            "San Luis (Aurora)"
        ],
        [
            "San Luis (Pampanga)"
        ],
        [
            "San Manuel"
        ],
        [
            "San Marcelino"
        ],
        [
            "San Miguel"
        ],
        [
            "San Narciso"
        ],
        [
            "San Rafael"
        ],
        [
            "San Simon"
        ],
        [
            "Santa Ana"
        ],
        [
            "Santa Cruz"
        ],
        [
            "Santa Ignacia"
        ],
        [
            "Santa Maria"
        ],
        [
            "Santa Rita"
        ],
        [
            "Santa Rosa"
        ],
        [
            "Santo Domingo"
        ],
        [
            "Santo Tomas"
        ],
        [
            "Sasmuan"
        ],
        [
            "Subic"
        ],
        [
            "Talavera"
        ],
        [
            "Talugtug"
        ],
        [
            "Victoria"
        ],
        [
            "Zaragoza"
        ],
        [
            "Luzon, Republic of the Philippines"
        ],
        [
            "vte Provinces of the Philippines"
        ],
        [
            "Abra"
        ],
        [
            "Agusan del Norte"
        ],
        [
            "Agusan del Sur"
        ],
        [
            "Aklan"
        ],
        [
            "Albay"
        ],
        [
            "Antique"
        ],
        [
            "Apayao"
        ],
        [
            "Aurora"
        ],
        [
            "Basilan"
        ],
        [
            "Bataan"
        ],
        [
            "Batanes"
        ],
        [
            "Batangas"
        ],
        [
            "Benguet"
        ],
        [
            "Biliran"
        ],
        [
            "Bohol"
        ],
        [
            "Bukidnon"
        ],
        [
            "Bulacan"
        ],
        [
            "Cagayan"
        ],
        [
            "Camarines Norte"
        ],
        [
            "Camarines Sur"
        ],
        [
            "Camiguin"
        ],
        [
            "Capiz"
        ],
        [
            "Catanduanes"
        ],
        [
            "Cavite"
        ],
        [
            "Cebu"
        ],
        [
            "Cotabato"
        ],
        [
            "Davao de Oro"
        ],
        [
            "Davao del Norte"
        ],
        [
            "Davao del Sur"
        ],
        [
            "Davao Occidental"
        ],
        [
            "Davao Oriental"
        ],
        [
            "Dinagat Islands"
        ],
        [
            "Eastern Samar"
        ],
        [
            "Guimaras"
        ],
        [
            "Ifugao"
        ],
        [
            "Ilocos Norte"
        ],
        [
            "Ilocos Sur"
        ],
        [
            "Iloilo"
        ],
        [
            "Isabela"
        ],
        [
            "Kalinga"
        ],
        [
            "La Union"
        ],
        [
            "Laguna"
        ],
        [
            "Lanao del Norte"
        ],
        [
            "Lanao del Sur"
        ],
        [
            "Leyte"
        ],
        [
            "Maguindanao del Norte"
        ],
        [
            "Maguindanao del Sur"
        ],
        [
            "Marinduque"
        ],
        [
            "Masbate"
        ],
        [
            "Misamis Occidental"
        ],
        [
            "Misamis Oriental"
        ],
        [
            "Mountain Province"
        ],
        [
            "Negros Occidental"
        ],
        [
            "Negros Oriental"
        ],
        [
            "Northern Samar"
        ],
        [
            "Nueva Ecija"
        ],
        [
            "Nueva Vizcaya"
        ],
        [
            "Occidental Mindoro"
        ],
        [
            "Oriental Mindoro"
        ],
        [
            "Palawan"
        ],
        [
            "Pampanga"
        ],
        [
            "Pangasinan"
        ],
        [
            "Quezon"
        ],
        [
            "Quirino"
        ],
        [
            "Rizal"
        ],
        [
            "Romblon"
        ],
        [
            "Samar"
        ],
        [
            "Sarangani"
        ],
        [
            "Siquijor"
        ],
        [
            "Sorsogon"
        ],
        [
            "South Cotabato"
        ],
        [
            "Southern Leyte"
        ],
        [
            "Sultan Kudarat"
        ],
        [
            "Sulu"
        ],
        [
            "Surigao del Norte"
        ],
        [
            "Surigao del Sur"
        ],
        [
            "Tarlac"
        ],
        [
            "Tawi-Tawi"
        ],
        [
            "Zambales"
        ],
        [
            "Zamboanga del Norte"
        ],
        [
            "Zamboanga del Sur"
        ],
        [
            "Zamboanga Sibugay"
        ],
        [
            "vtePhilippines articlesHistoryOverviews"
        ],
        [
            "Archaeology"
        ],
        [
            "Economy"
        ],
        [
            "Military"
        ],
        [
            "Political"
        ],
        [
            "Chronology"
        ],
        [
            "Prehistory"
        ],
        [
            "Pre-colonial era"
        ],
        [
            "Colonial era"
        ],
        [
            "Spanish period"
        ],
        [
            "American period"
        ],
        [
            "Japanese occupation"
        ],
        [
            "Postcolonial era"
        ],
        [
            "Third Republic"
        ],
        [
            "Marcos presidency"
        ],
        [
            "Fifth Republic"
        ],
        [
            "Geography"
        ],
        [
            "Bays"
        ],
        [
            "Biosphere reserves"
        ],
        [
            "Borders"
        ],
        [
            "Climate"
        ],
        [
            "Climate change"
        ],
        [
            "Typhoons"
        ],
        [
            "Earthquakes"
        ],
        [
            "Ecoregions"
        ],
        [
            "Extreme points"
        ],
        [
            "Island groups"
        ],
        [
            "islands"
        ],
        [
            "Lakes"
        ],
        [
            "Mountains"
        ],
        [
            "Protected areas"
        ],
        [
            "National parks"
        ],
        [
            "Ramsar sites"
        ],
        [
            "Rivers"
        ],
        [
            "Volcanoes"
        ],
        [
            "Wildlife"
        ],
        [
            "World Heritage Sites"
        ],
        [
            "Politics"
        ],
        [
            "Administrative divisions"
        ],
        [
            "Constitution"
        ],
        [
            "Elections"
        ],
        [
            "Foreign relations"
        ],
        [
            "Human rights"
        ],
        [
            "LGBT"
        ],
        [
            "Legal codes"
        ],
        [
            "Political families"
        ],
        [
            "Political parties"
        ],
        [
            "Government"
        ],
        [
            "Executive"
        ],
        [
            "Cabinet"
        ],
        [
            "lists"
        ],
        [
            "Executive departments"
        ],
        [
            "Executive office"
        ],
        [
            "Law enforcement"
        ],
        [
            "President"
        ],
        [
            "Legislative"
        ],
        [
            "Senate"
        ],
        [
            "House of Representatives"
        ],
        [
            "Judicial"
        ],
        [
            "Supreme Court"
        ],
        [
            "Court of Appeals"
        ],
        [
            "Regional Trial Court"
        ],
        [
            "Armed Forces"
        ],
        [
            "Air Force"
        ],
        [
            "Army"
        ],
        [
            "Navy"
        ],
        [
            "Marine Corps"
        ],
        [
            "Coast Guard"
        ],
        [
            "Economy"
        ],
        [
            "Agriculture"
        ],
        [
            "Automotive"
        ],
        [
            "Business process outsourcing"
        ],
        [
            "Census"
        ],
        [
            "Central bank"
        ],
        [
            "Energy"
        ],
        [
            "Fiscal policy"
        ],
        [
            "National debt"
        ],
        [
            "Labor"
        ],
        [
            "Peso"
        ],
        [
            "Science and technology"
        ],
        [
            "Stock exchange"
        ],
        [
            "Taxation"
        ],
        [
            "Telecommunications"
        ],
        [
            "Telephone numbers"
        ],
        [
            "Tourism"
        ],
        [
            "Tourist attractions"
        ],
        [
            "Transportation"
        ],
        [
            "Water and sanitation"
        ],
        [
            "ZIP codes"
        ],
        [
            "Society"
        ],
        [
            "Abortion"
        ],
        [
            "Censorship"
        ],
        [
            "Corruption"
        ],
        [
            "Crime"
        ],
        [
            "Demographics"
        ],
        [
            "Divorce"
        ],
        [
            "Education"
        ],
        [
            "Higher education"
        ],
        [
            "Environmental issues"
        ],
        [
            "Climate change"
        ],
        [
            "Deforestation"
        ],
        [
            "Ethnic groups"
        ],
        [
            "Indigenous peoples"
        ],
        [
            "Genetics"
        ],
        [
            "Health"
        ],
        [
            "Human trafficking"
        ],
        [
            "Sex trafficking"
        ],
        [
            "Immigration"
        ],
        [
            "Income inequality"
        ],
        [
            "Kinship"
        ],
        [
            "Languages"
        ],
        [
            "Overseas workers"
        ],
        [
            "Poverty"
        ],
        [
            "Prostitution"
        ],
        [
            "Refugees"
        ],
        [
            "Religion"
        ],
        [
            "Sexuality"
        ],
        [
            "Squatting"
        ],
        [
            "Women"
        ],
        [
            "Pinoy"
        ],
        [
            "Culture"
        ],
        [
            "Architecture"
        ],
        [
            "Arts"
        ],
        [
            "Cinema"
        ],
        [
            "Cuisine"
        ],
        [
            "Cultural properties"
        ],
        [
            "Dance"
        ],
        [
            "Fashion and clothing"
        ],
        [
            "Historical markers"
        ],
        [
            "Inventions"
        ],
        [
            "Literature"
        ],
        [
            "Media"
        ],
        [
            "Music"
        ],
        [
            "Mythology"
        ],
        [
            "Name"
        ],
        [
            "Public holidays"
        ],
        [
            "Festivals"
        ],
        [
            "Psychology"
        ],
        [
            "Sports"
        ],
        [
            "Traditional games"
        ],
        [
            "Value system"
        ],
        [
            "Symbols"
        ],
        [
            "Anthem"
        ],
        [
            "Bird"
        ],
        [
            "Coat of arms"
        ],
        [
            "Flag"
        ],
        [
            "Flower"
        ],
        [
            "Gem"
        ],
        [
            "Great Seal"
        ],
        [
            "Language"
        ],
        [
            "Motto"
        ],
        [
            "Sign language"
        ],
        [
            "Sport and martial art"
        ],
        [
            "Tree"
        ],
        [
            "Outline"
        ],
        [
            "Bibliography"
        ],
        [
            " Philippines portal"
        ],
        [
            " Category"
        ],
        [
            "Authority control databases International"
        ],
        [
            "VIAF"
        ],
        [
            "WorldCat"
        ],
        [
            "National"
        ],
        [
            "Israel"
        ],
        [
            "United States"
        ],
        [
            "Geographic"
        ],
        [
            "MusicBrainz area"
        ],
        [
            "Retrieved from \"https://en.wikipedia.org/w/index.php?title=Zambales&oldid=1232158120\""
        ],
        [
            "Categories: ZambalesProvinces of the PhilippinesProvinces of Central LuzonStates and territories established in 15781578 establishments in the PhilippinesHidden categories: Pages using gadget WikiMiniAtlasPages with non-numeric formatnum argumentsCS1 maint: multiple names: authors listCS1 errors: generic nameArticles with short descriptionShort description is different from WikidataUse Philippine English from April 2023All Wikipedia articles written in Philippine EnglishUse mdy dates from April 2023Coordinates on WikidataArticles containing Sambal-language textArticles containing Ilocano-language textArticles containing Filipino-language textWikipedia articles with style issues from September 2018All articles with style issuesLists of coordinatesGeographic coordinate listsArticles with GeoCommons category link from WikidataWebarchive template wayback linksArticles with VIAF identifiersArticles with WorldCat Entities identifiersArticles with J9U identifiersArticles with LCCN identifiersArticles with MusicBrainz area identifiersPages using the Kartographer extension"
        ]
    ]
}